[
    {
        "context 0": "Medi, I have been experiencing headache and confusion. Could it be encephalitis?",
        "context 1": "Encephalitis is a possible cause of headache and confusion. I recommend consulting a healthcare professional for a proper diagnosis.",
        "context 2": "Are there any other symptoms I should look out for?",
        "context 3": "Other symptoms of encephalitis may include fever, stiff neck, vomiting, seizures, and problems with hearing or memory.",
        "context 4": "Thank you for the information, Medi.",
        "response": "You're welcome! Let me know if you have any more questions."
    },
    {
        "context 0": "Medi, can encephalitis be prevented?",
        "context 1": "Certain types of encephalitis can be prevented with vaccines. It is recommended to keep up to date with vaccinations.",
        "context 2": "What are the treatment options for encephalitis?",
        "context 3": "Treatment may include antiviral medications, anticonvulsants, and corticosteroids. It is usually done in a hospital setting.",
        "context 4": "Thank you for the clarification, Medi.",
        "response": "You're welcome! Let me know if you have any more questions."
    },
    {
        "context 0": "Hi, Medi.",
        "context 1": "Hello! How can I assist you today?",
        "context 2": "I've been experiencing fever, headache, and confusion. Could it be encephalitis?",
        "context 3": "Based on your symptoms, encephalitis is a possible cause. It is important to consult a healthcare professional for a proper diagnosis.",
        "context 4": "What are the risk factors for encephalitis?",
        "response": "Risk factors for encephalitis include having a weak immune system. It is best to discuss your concerns with a healthcare professional."
    },
    {
        "context 0": "Medi, what are the symptoms of encephalitis?",
        "context 1": "Symptoms of encephalitis can include headache, fever, confusion, stiff neck, vomiting, seizures, hallucinations, and problems with memory and hearing.",
        "context 2": "Are there any risk factors for encephalitis?",
        "context 3": "Having a weak immune system is a risk factor for encephalitis.",
        "context 4": "Thank you for the information, Medi.",
        "response": "You're welcome! Let me know if you have any more questions."
    },
    {
        "context 0": "Medi, how is encephalitis diagnosed?",
        "context 1": "Encephalitis is typically diagnosed based on symptoms, supported by blood tests, medical imaging, and analysis of cerebrospinal fluid.",
        "context 2": "Can encephalitis be prevented?",
        "context 3": "Certain types of encephalitis can be prevented with vaccines.",
        "context 4": "Thank you for the clarification, Medi.",
        "response": "You're welcome! Let me know if you have any more questions."
    },
    {
        "context 0": "Hi, Medi.",
        "context 1": "Hello. How can I assist you today?",
        "context 2": "I think I might have encephalitis. What should I do?",
        "context 3": "If you suspect you have encephalitis, I recommend seeking medical attention immediately for a proper diagnosis and treatment.",
        "context 4": "What are the treatment options for encephalitis?",
        "response": "Treatment for encephalitis may include antiviral medications, anticonvulsants, and corticosteroids. Some people may require hospitalization and artificial respiration."
    },
    {
        "context 0": "I have a severe headache and confusion. What could be the cause?",
        "context 1": "Based on your symptoms, you may be experiencing encephalitis, which is inflammation of the brain.",
        "context 2": "Is encephalitis a serious condition? How can it be treated?",
        "context 3": "Encephalitis can be a serious condition. Treatment may include antiviral medications, anticonvulsants, and corticosteroids.",
        "context 4": "Thank you for the information, Medi.",
        "response": "You're welcome. It's important to seek medical attention for a proper diagnosis and treatment."
    },
    {
        "context 0": "Medi, what are the symptoms of encephalitis?",
        "context 1": "Symptoms of encephalitis include reduced or altered consciousness, headache, fever, confusion, stiff neck, and vomiting.",
        "context 2": "Are there any complications associated with encephalitis?",
        "context 3": "Complications of encephalitis can include seizures, hallucinations, trouble speaking, memory problems, and hearing difficulties.",
        "context 4": "Thank you for the explanation, Medi.",
        "response": "You're welcome. Let me know if you have any more questions."
    },
    {
        "context 0": "Hi, Medi. Can you tell me about the causes of encephalitis?",
        "context 1": "Causes of encephalitis can include viruses such as herpes simplex and rabies, as well as bacteria, fungi, parasites, autoimmune diseases, and certain medications.",
        "context 2": "Is encephalitis preventable? What are the risk factors?",
        "context 3": "Certain types of encephalitis can be prevented with vaccines. Risk factors include having a weak immune system.",
        "context 4": "Thank you for the information, Medi.",
        "response": "You're welcome. Let me know if there's anything else I can help with."
    },
    {
        "context 0": "I have a headache, stiff neck, and fever. Could it be encephalitis?",
        "context 1": "Encephalitis can cause these symptoms. I recommend seeking medical attention for a proper diagnosis.",
        "context 2": "What treatments are available for encephalitis?",
        "context 3": "Treatment may include antiviral medications, anticonvulsants, and corticosteroids. Hospitalization may be necessary.",
        "context 4": "Thank you for the information, Medi.",
        "response": "You're welcome. I hope you feel better soon."
    },
    {
        "context 0": "Medi, what are the symptoms of encephalitis?",
        "context 1": "Symptoms of encephalitis can include headache, fever, confusion, stiff neck, vomiting, seizures, and memory problems.",
        "context 2": "How is encephalitis diagnosed?",
        "context 3": "Diagnosis is typically based on symptoms, supported by blood tests, medical imaging, and analysis of cerebrospinal fluid.",
        "context 4": "Thank you for explaining, Medi.",
        "response": "You're welcome. Let me know if you have any more questions."
    },
    {
        "context 0": "Hi, Medi.",
        "context 1": "Hello. How can I assist you today?",
        "context 2": "What are the causes of encephalitis?",
        "context 3": "Encephalitis can be caused by viruses such as herpes simplex and rabies, bacteria, fungi, parasites, autoimmune diseases, certain medications, or the cause may remain unknown.",
        "context 4": "Thank you for the information, Medi.",
        "response": "You're welcome. Let me know if you need any further assistance."
    },
    {
        "context 0": "Medi, I've been having a headache and fever. Could it be encephalitis?",
        "context 1": "Encephalitis is a possibility, but it's important to consult a doctor for a proper diagnosis.",
        "context 2": "What are the other symptoms of encephalitis?",
        "context 3": "Symptoms of encephalitis may include confusion, stiff neck, vomiting, and problems with hearing or speaking.",
        "context 4": "Thank you for the information, Medi.",
        "response": "You're welcome. Don't hesitate to seek medical attention for a proper diagnosis and treatment."
    },
    {
        "context 0": "Medi, what are the causes of encephalitis?",
        "context 1": "Encephalitis can be caused by viruses, bacteria, fungi, parasites, autoimmune diseases, or certain medications.",
        "context 2": "Are there any preventable causes of encephalitis?",
        "context 3": "Certain types of encephalitis can be prevented with vaccines.",
        "context 4": "Thank you for the explanation, Medi.",
        "response": "You're welcome. If you have any more questions, feel free to ask."
    },
    {
        "context 0": "Hi, Medi.",
        "context 1": "Hello. How can I assist you today?",
        "context 2": "I'm experiencing irritability, poor appetite, and fever. Could it be encephalitis?",
        "context 3": "Those symptoms could indicate encephalitis in younger children or infants. I recommend consulting a healthcare professional for a proper evaluation.",
        "context 4": "What are the risk factors for encephalitis?",
        "response": "Risk factors for encephalitis include a weak immune system. It's important to seek medical advice for proper diagnosis and treatment."
    },
    {
        "context 0": "I have a fever and a stiff neck. Could it be encephalitis?",
        "context 1": "Encephalitis can cause fever and a stiff neck. I recommend seeking medical attention for a proper diagnosis.",
        "context 2": "What are the other symptoms of encephalitis?",
        "context 3": "Other symptoms of encephalitis may include headache, confusion, vomiting, seizures, and problems with hearing or speaking.",
        "context 4": "Thank you for the information, Medi.",
        "response": "You're welcome! Let me know if you have any more questions."
    },
    {
        "context 0": "What causes encephalitis?",
        "context 1": "Encephalitis can be caused by viruses like herpes simplex virus and rabies virus, bacteria, fungi, parasites, autoimmune diseases, and certain medications.",
        "context 2": "Can encephalitis be prevented?",
        "context 3": "Certain types of encephalitis can be prevented with vaccines. It's important to stay up to date with immunizations.",
        "context 4": "Thank you, Medi.",
        "response": "You're welcome. Take care!"
    },
    {
        "context 0": "I have been diagnosed with encephalitis. What is the treatment?",
        "context 1": "Treatment for encephalitis may include antiviral medications, anticonvulsants, and corticosteroids. In severe cases, hospitalization and artificial respiration may be necessary.",
        "context 2": "Will I need rehabilitation after the treatment?",
        "context 3": "Once the immediate problem is under control, rehabilitation may be required to help with any lingering complications or issues.",
        "context 4": "I appreciate your help, Medi.",
        "response": "You're welcome. Wishing you a speedy recovery!"
    },
    {
        "context 0": "Hey Medi, I've been having a severe headache and fever. Do you know what might be causing it?",
        "context 1": "Based on your symptoms, it's possible that you have encephalitis. It's an inflammation of the brain that can cause these symptoms.",
        "context 2": "Is encephalitis a serious condition? What are the complications?",
        "context 3": "Encephalitis can be a serious condition. Some possible complications include seizures, memory problems, and trouble speaking.",
        "context 4": "What is the treatment for encephalitis?",
        "response": "Treatment for encephalitis may include antiviral medications, anticonvulsants, and corticosteroids. It's important to seek medical attention for a proper diagnosis and treatment."
    },
    {
        "context 0": "Hi Medi, I've heard about encephalitis. Can you explain it to me?",
        "context 1": "Encephalitis is inflammation of the brain. It can cause symptoms like headache, fever, confusion, stiff neck, and vomiting.",
        "context 2": "Are there any risk factors for encephalitis?",
        "context 3": "Having a weak immune system is a risk factor for encephalitis. It can also be caused by viruses, bacteria, fungi, parasites, autoimmune diseases, and certain medications.",
        "context 4": "Can encephalitis be prevented?",
        "response": "Certain types of encephalitis can be prevented with vaccines. It's important to seek medical advice and take necessary precautions."
    },
    {
        "context 0": "Hey Medi, I've been feeling confused and have been having seizures. What could be the cause?",
        "context 1": "Based on your symptoms, it's possible that you have encephalitis. It can cause confusion and seizures.",
        "context 2": "How is encephalitis diagnosed?",
        "context 3": "Encephalitis is typically diagnosed based on symptoms. Blood tests, medical imaging, and analysis of cerebrospinal fluid may be done to support the diagnosis.",
        "context 4": "What should I do if I suspect I have encephalitis?",
        "response": "If you suspect you have encephalitis, it's important to seek immediate medical attention for a proper diagnosis and appropriate treatment."
    },
    {
        "context 0": "Medi, my head hurts a lot and I have a stiff neck. What could be wrong?",
        "context 1": "Based on your symptoms, it's possible that you have encephalitis. I recommend seeking medical attention for a proper diagnosis.",
        "context 2": "Is encephalitis a serious condition? What are the possible complications?",
        "context 3": "Encephalitis can be a serious condition, and its complications may include seizures, memory problems, and problems with hearing.",
        "context 4": "Thank you for the information, Medi. I'll make sure to see a doctor.",
        "response": "You're welcome. It's important to get a proper diagnosis and treatment. Take care!"
    },
    {
        "context 0": "Medi, what are the common causes of encephalitis?",
        "context 1": "Encephalitis can be caused by viruses such as herpes simplex virus, rabies virus, as well as bacteria, fungi, or parasites. Autoimmune diseases and certain medications can also be causes.",
        "context 2": "Can encephalitis be prevented? Are there any vaccines available?",
        "context 3": "Certain types of encephalitis can be prevented with vaccines, such as tick-borne encephalitis and Japanese encephalitis. It's important to consult with a healthcare professional for appropriate vaccinations.",
        "context 4": "Thank you for the information, Medi. I'll consider discussing vaccinations with my doctor.",
        "response": "You're welcome. It's always best to take preventative measures when possible. Stay healthy!"
    },
    {
        "context 0": "Hi, Medi. I've been feeling confused and having trouble speaking. What could be causing these symptoms?",
        "context 1": "Based on your symptoms, it's possible that you have encephalitis. I recommend seeking medical attention for a proper diagnosis.",
        "context 2": "If it is encephalitis, what are the treatment options available?",
        "context 3": "Treatment for encephalitis may include antiviral medications, anticonvulsants, and corticosteroids. It's important to receive treatment in a hospital setting.",
        "context 4": "Thank you for the information, Medi. I'll make sure to see a doctor as soon as possible.",
        "response": "You're welcome. It's important to get the proper treatment to manage your symptoms. Take care!"
    },
    {
        "context 0": "I've been having a stiff neck and fever. Could it be encephalitis?",
        "context 1": "Encephalitis is a possibility, but diagnosis should be done by a healthcare professional.",
        "context 2": "What are the common causes of encephalitis?",
        "context 3": "Encephalitis can be caused by viruses like herpes simplex, bacteria, fungi, parasites, autoimmune diseases, or certain medications.",
        "context 4": "I see. Thank you for the information, Medi.",
        "response": "You're welcome. If you have any more concerns, feel free to ask."
    },
    {
        "context 0": "What are the symptoms of encephalitis?",
        "context 1": "Symptoms of encephalitis can include reduced consciousness, headache, fever, confusion, stiff neck, vomiting, seizures, hallucinations, memory problems, and hearing problems.",
        "context 2": "How is encephalitis diagnosed?",
        "context 3": "Encephalitis is typically diagnosed based on symptoms, blood tests, medical imaging, and analysis of cerebrospinal fluid.",
        "context 4": "Thank you for the clarification, Medi.",
        "response": "You're welcome. Let me know if you have any more questions."
    },
    {
        "context 0": "Is encephalitis treatable?",
        "context 1": "Yes, treatment for encephalitis may include antiviral medications, anticonvulsants, and corticosteroids. Treatment is usually carried out in a hospital setting.",
        "context 2": "Are there any preventive measures for encephalitis?",
        "context 3": "Certain types of encephalitis can be prevented with vaccines. It's important to stay up to date with vaccinations.",
        "context 4": "Thank you for the information, Medi.",
        "response": "You're welcome. If you have any more concerns, feel free to ask."
    },
    {
        "context 0": "Medi, I have a headache and stiff neck. Could it be encephalitis?",
        "context 1": "Headache and stiff neck can be symptoms of encephalitis. I recommend seeking medical attention for a proper diagnosis.",
        "context 2": "What are the other symptoms of encephalitis?",
        "context 3": "Other symptoms of encephalitis may include reduction in consciousness, confusion, fever, vomiting, seizures, hallucinations, and trouble speaking.",
        "context 4": "Thank you for the information, Medi.",
        "response": "You're welcome. If you have any more questions or concerns, feel free to ask."
    },
    {
        "context 0": "Hello, Medi. Can you explain what causes encephalitis?",
        "context 1": "Encephalitis can be caused by viruses such as herpes simplex virus and rabies virus, as well as bacteria, fungi, or parasites. Other causes include autoimmune diseases and certain medications.",
        "context 2": "Are there any risk factors for encephalitis?",
        "context 3": "Having a weak immune system is a risk factor for encephalitis. It's important to take necessary precautions to maintain a healthy immune system.",
        "context 4": "Thank you for the explanation, Medi.",
        "response": "You're welcome. If you have any more questions or need further assistance, feel free to ask."
    },
    {
        "context 0": "Medi, what are the treatment options for encephalitis?",
        "context 1": "Treatment for encephalitis may include antiviral medications, anticonvulsants, and corticosteroids. In severe cases, hospitalization and artificial respiration may be required. Rehabilitation may also be necessary after the immediate problem is under control.",
        "context 2": "Can encephalitis be prevented?",
        "context 3": "Certain types of encephalitis are preventable with vaccines. It's important to stay updated with recommended vaccinations and take necessary precautions to avoid infections.",
        "context 4": "Thank you for the information, Medi.",
        "response": "You're welcome. If you have any more questions or concerns, feel free to ask."
    },
    {
        "context 0": "Medi, I've been having a stiff neck and a headache. Could it be encephalitis?",
        "context 1": "Encephalitis can cause symptoms like a stiff neck and headache, but it's best to consult a doctor for a proper diagnosis.",
        "context 2": "What are the common causes of encephalitis?",
        "context 3": "Encephalitis can be caused by viruses like herpes simplex or bacteria, fungi, parasites, and even autoimmune diseases. Sometimes the cause remains unknown.",
        "context 4": "I see. Is encephalitis preventable?",
        "response": "Certain types of encephalitis can be prevented with vaccines. It's important to stay up to date with vaccinations and practice good hygiene."
    },
    {
        "context 0": "Hey Medi, what are the symptoms of encephalitis?",
        "context 1": "Symptoms of encephalitis can vary, but they may include headache, fever, confusion, vomiting, and even seizures and hallucinations in some cases.",
        "context 2": "How is encephalitis diagnosed?",
        "context 3": "Encephalitis is typically diagnosed based on symptoms and supported by blood tests, medical imaging, and analysis of cerebrospinal fluid.",
        "context 4": "Thank you for the information, Medi.",
        "response": "You're welcome! If you have any more questions, feel free to ask."
    },
    {
        "context 0": "Hi Medi, what treatments are available for encephalitis?",
        "context 1": "Treatment for encephalitis may include antiviral medications, anticonvulsants, and corticosteroids. In severe cases, hospitalization and artificial respiration may be required.",
        "context 2": "Is rehabilitation needed after encephalitis treatment?",
        "context 3": "Yes, once the immediate problem is under control, rehabilitation may be required to help the patient recover and regain their normal functions.",
        "context 4": "Thank you for the information, Medi.",
        "response": "You're welcome! Let me know if there's anything else I can help with."
    }
]