[
    {
        "dialog": [
            "Hello Medi, I'm feeling unwell and tired",
            "Hello, I'm here to help you. Can you tell me more about the symptoms?",
            "I have a fever, a cough, and a runny nose",
            "Based on your symptoms, it's likely that you have the flu",
            "What should I do to relieve my symptoms?",
            "You should rest, drink plenty of fluids, and take over-the-counter pain relievers",
            "Is there anything else I can do to prevent the flu?",
            "Yes, you should wash your hands frequently and avoid close contact with sick people",
            "Thank you, Medi. How long will it take for me to feel better?"
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "It may take a few days to a week for your symptoms to improve. However, you should contact your doctor if your symptoms get worse or if you have trouble breathing."
    },
    {
        "dialog": [
            "Hello Medi, can you explain to me what is influenza?",
            "Sure, influenza is a viral infection that affects the respiratory system",
            "What are the symptoms of influenza?",
            "The symptoms of influenza include fever, cough, sore throat, runny or stuffy nose, body aches, headache, chills, and fatigue",
            "How is influenza spread?",
            "Influenza is spread mainly by droplets made when people with flu cough, sneeze or talk. It can also be spread by touching a surface or object that has flu virus on it and then touching your mouth, eyes or nose.",
            "Can influenza be prevented?",
            "Yes, you can prevent influenza by getting vaccinated each year, washing your hands frequently, and avoiding close contact with people who are sick",
            "Thank you, Medi. What should I do if I get the flu?"
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "If you get the flu, you should rest, drink plenty of fluids, and take over-the-counter pain relievers. You should also avoid close contact with other people to prevent the spread of the virus."
    },
    {
        "dialog": [
            "Hello Medi, I just recovered from the flu. What can I do to prevent getting it again?",
            "Hello, I'm glad you're feeling better. The best way to prevent getting the flu again is to get a flu vaccine every year",
            "What else can I do to prevent getting the flu?",
            "You should also wash your hands frequently, avoid close contact with sick people, and avoid touching your face",
            "Are there any lifestyle changes that can help prevent the flu?",
            "Yes, maintaining a healthy lifestyle can boost your immune system and help prevent the flu. This includes eating a balanced diet, getting regular exercise, and getting enough sleep",
            "Thank you, Medi. How effective is the flu vaccine?",
            "The effectiveness of the flu vaccine varies each year, but it is the best way to prevent getting the flu",
            "Got it. When should I get the flu vaccine?"
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "The flu vaccine is usually available in the fall. You should get it before the flu season starts, which is usually in October."
    },
    {
        "dialog": [
            "Hello Medi, I have a fever since last night.",
            "Hello! Sorry to hear that. Can you give me more details about your fever?",
            "I have a fever of 101 degrees Fahrenheit, and I feel very weak and nauseous.",
            "I think you might have the flu. You should take some rest and drink plenty of fluids.",
            "Thanks for your advice. Should I take any medication for it?",
            "You can take over-the-counter medications like acetaminophen to reduce your fever and relieve any aches and pains.",
            "Ok, I will take care. How long does it take to recover from the flu?",
            "It usually takes about a week or two to fully recover from the flu. Make sure to get plenty of rest and take care of yourself.",
            "Thanks for your help, Medi!"
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion. These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose. Coughing is the most common symptom. Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children. The standard influenza symptoms typically last for 2 - 8 days. A 2021 study suggests influenza can cause long-lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "You're welcome! Take care of yourself and get some rest. The flu typically takes about a week or two to recover from."
    },
    {
        "dialog": [
            "Hi Medi, I recently heard about the flu pandemic in 1918. Can you tell me more about it?",
            "Sure, the 1918 flu pandemic, also known as the Spanish flu, was one of the deadliest pandemics in history.",
            "How many people were affected by it?",
            "It's estimated that up to one-third of the world's population was infected, and the death toll is estimated to be between 50 and 100 million people.",
            "Wow, that's a lot of people. What made it so deadly?",
            "The exact reason why the Spanish flu was so deadly is still unknown, but it's thought to be because of the virus's ability to cause an overreaction of the immune system, leading to severe lung damage and pneumonia.",
            "Did the world learn anything from the Spanish flu pandemic?",
            "Yes, the Spanish flu pandemic led to many changes in public health policy, such as the establishment of the World Health Organization and the development of influenza vaccines.",
            "That's interesting, thanks for the information, Medi!"
        ],
        "knowledge": "Influenza Influenza There are 3–5 million severe cases annually, with up to 650,000 respiratory-related deaths globally each year. Deaths most commonly occur in high-risk groups, including young children, the elderly, and people with chronic health conditions. In temperate regions of the world, the number of influenza cases peaks during winter, whereas in the tropics influenza can occur year-round. Since the late 1800s, large outbreaks of novel influenza strains that spread globally, called pandemics, have occurred every 10–50 years. Five flu pandemics have occurred since 1900: the Spanish flu in 1918–1920, which was the most severe flu pandemic, the Asian flu in 1957, the Hong Kong flu in 1968, the Russian flu in 1977, and the swine flu pandemic in 2009. The time between exposure to the virus and development of symptoms, called the incubation period, is 1–4 days, most commonly 1–2 days. Many infections, however, are asymptomatic Influenza Influenza",
        "response": "You're welcome! The Spanish flu was one of the deadliest pandemics in history and led to many changes in public health policy."
    },
    {
        "dialog": [
            "Hi Medi, I just recovered from the flu. What can I do to prevent getting sick again?",
            "I'm glad to hear you've recovered! There are several things you can do to help prevent getting sick again.",
            "Can you give me some examples?",
            "Sure! You should wash your hands frequently, avoid close contact with people who are sick, and avoid touching your face.",
            "Are there any other things I can do?",
            "Yes, you can also get an annual flu vaccine, maintain a healthy lifestyle, and get enough sleep.",
            "Great, thanks for the advice. How effective is the flu vaccine?",
            "The effectiveness of the flu vaccine varies from year to year, but it can reduce your risk of getting the flu by about 40-60%.",
            "That's good to know. Thanks for your help, Medi!"
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion. These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose. Coughing is the most common symptom. Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children. The standard influenza symptoms typically last for 2 - 8 days. A 2021 study suggests influenza can cause long-lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "You're welcome! Remember to take care of yourself by maintaining a healthy lifestyle, getting enough sleep, and getting an annual flu vaccine to reduce your risk of getting the flu again."
    },
    {
        "dialog": [
            "Hi Medi, I feel sick. I have a high fever and a cough.",
            "Hello, based on your symptoms, it could be Influenza. Do you have any other symptoms?",
            "Yes, I feel tired and my throat hurts. What should I do?",
            "You should rest, drink fluids, and take over-the-counter medications to reduce fever and relieve symptoms.",
            "Is there anything else I can do?",
            "You can also try gargling with warm saltwater to soothe your throat.",
            "Okay, thanks for the advice. Do you think I need to see a doctor?",
            "If your symptoms persist or worsen after a few days, you should see a doctor. ",
            "Okay, I'll keep that in mind. Thanks for your help!"
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "You're welcome. Rest and drink lots of fluids. If your symptoms persist or worsen after a few days, you should see a doctor."
    },
    {
        "dialog": [
            "Hi Medi, I want to know more about Influenza.",
            "Sure, I can help. What specifically do you want to know?",
            "What is Influenza, and how does it spread?",
            "Influenza, or the flu, is a contagious respiratory illness caused by influenza viruses. It spreads through respiratory droplets when people with the flu cough, sneeze or talk. It can also spread by touching a surface contaminated with the virus and then touching your mouth, nose or eyes. ",
            "What are the symptoms of Influenza?",
            "The symptoms of influenza include fever, cough, sore throat, runny or stuffy nose, body aches, headache, chills and fatigue. Some people may also experience vomiting and diarrhea, although this is more common in children than adults.",
            "How can Influenza be prevented?",
            "Influenza can be prevented by getting vaccinated every year, washing your hands frequently, avoiding close contact with sick people, and covering your mouth and nose when you cough or sneeze.",
            "Thanks for the information, Medi. That was helpful. "
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "You're welcome! Remember to get vaccinated every year, wash your hands frequently, avoid close contact with sick people, and cover your mouth and nose when you cough or sneeze to prevent getting the flu."
    },
    {
        "dialog": [
            "Hi Medi, I recently had Influenza. What should I do to avoid getting it again?",
            "Hello! After recovering from the flu, it's important to take care of yourself to avoid getting it again. What would you like to know?",
            "What can I eat to boost my immune system?",
            "You should eat a healthy, balanced diet that includes plenty of fruits, vegetables, whole grains, and lean protein. These foods contain essential vitamins and minerals that can help support your immune system.",
            "Are there any supplements that I can take?",
            "Yes, some supplements such as vitamin C, vitamin D, and zinc may help support your immune system. However, it's important to talk to your doctor before taking any supplements.",
            "What about exercise? Can that help?",
            "Yes, regular exercise can help support your immune system. Aim for 30 minutes of moderate exercise, like brisk walking, most days of the week.",
            "Thank you, Medi. Your advice was very helpful."
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "You're welcome! Eating a healthy diet, taking supplements (with your doctor's approval), and exercising regularly can all help support your immune system and reduce your risk of getting the flu again."
    },
    {
        "dialog": [
            "Hi Medi, I have a fever for two days.",
            "Hello, tell me more about your fever and other symptoms.",
            "I have a temperature of 38°C, headache, and muscle aches.",
            "Based on your symptoms, it may be flu. Rest and drink plenty of fluids.",
            "What should I take for my fever?",
            "You can take paracetamol or ibuprofen for fever and pain relief.",
            "Okay, thank you. How long will it take to recover?",
            "It can take up to a week or more to fully recover, but rest and hydration will help.",
            "Alright, thank you for your advice."
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "Based on your symptoms such as fever, headache, and muscle aches, you may have influenza. Rest and hydration are recommended for recovery."
    },
    {
        "dialog": [
            "Hi Medi, can you explain what is influenza?",
            "Sure. Influenza or flu is a viral infection that attacks the respiratory system.",
            "What are the symptoms of influenza?",
            "The symptoms of influenza are fever, headache, muscle aches, coughing, sore throat, runny or stuffy nose, fatigue, and sometimes vomiting or diarrhea.",
            "How is influenza different from a cold?",
            "Influenza is more severe than a cold and has more pronounced symptoms, such as fever and muscle aches.",
            "Is there a vaccine for influenza?",
            "Yes, there is a vaccine for influenza. It is recommended for high-risk groups such as the elderly and people with chronic health conditions.",
            "Okay, thank you for the explanation."
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "Influenza is a viral infection that attacks the respiratory system with symptoms such as fever, headache, muscle aches, coughing, sore throat, runny or stuffy nose, fatigue, and sometimes vomiting or diarrhea. Vaccines are available for high-risk groups."
    },
    {
        "dialog": [
            "Hi Medi, I just had a flu shot. What should I do now?",
            "Hello. After getting a flu shot, it is recommended to rest for at least 24 hours and avoid strenuous activities.",
            "Are there any side effects of the flu shot?",
            "Some people may experience mild side effects like soreness, redness, or swelling at the injection site, low-grade fever, and body aches.",
            "How long does the flu shot last?",
            "The flu shot typically lasts for one flu season, which may vary from year to year.",
            "What if I miss getting a flu shot?",
            "If you miss getting a flu shot, it is still recommended to get one as soon as possible. It is never too late to protect yourself from the flu.",
            "Okay, thank you for your advice."
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "After getting a flu shot, it is recommended to rest for at least 24 hours and avoid strenuous activities. Mild side effects like soreness, redness, or swelling at the injection site, low-grade fever, and body aches may occur. The flu shot typically lasts for one flu season, and it is never too late to get one."
    },
    {
        "dialog": [
            "Hi Medi, I have a fever and cough",
            "Hello! Sorry to hear that. How long have you had these symptoms?",
            "For the last two days",
            "Have you been in contact with someone who was sick recently?",
            "Yes, my colleague was sick last week",
            "Based on your symptoms and recent exposure, it is possible you have the flu.",
            "What should I do now?",
            "Rest and take plenty of fluids. If your symptoms worsen, seek medical attention.",
            "Thank you for your advice. How long does it usually take to recover from the flu?"
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "Symptoms usually last 2-8 days. However, it can take up to two weeks to fully recover."
    },
    {
        "dialog": [
            "Hello, Medi. What are the most common symptoms of the flu?",
            "Hi! Fever, cough, sore throat, runny or stuffy nose, body aches, headache, chills, and fatigue are some common symptoms of the flu.",
            "How is the flu different from the common cold?",
            "The flu and the common cold share some symptoms, but the flu tends to be more severe and has a more sudden onset. The flu can also lead to more serious health complications.",
            "What can I do to prevent catching the flu?",
            "Get a flu vaccine each year, wash your hands regularly, avoid close contact with people who are sick, cover your mouth and nose when coughing or sneezing, and avoid touching your face.",
            "What should I do if I think I have the flu?",
            "Stay home, rest, and drink plenty of fluids. You can take over-the-counter medications to relieve your symptoms. If your symptoms are severe, seek medical attention.",
            "Thank you for the information. How long is someone with the flu contagious?"
        ],
        "knowledge": "Influenza Influenza  People with the flu are contagious from the day before symptoms develop to 5-7 days after onset of symptoms in adults.  This period may be longer in young children or people with weakened immune systems.  Some people, especially young children and people with weakened immune systems, may be contagious for longer periods Influenza Influenza",
        "response": "People with the flu are contagious up to 5-7 days after symptom onset, but this period may be longer for young children or people with weakened immune systems."
    },
    {
        "dialog": [
            "Hi Medi, I recently had the flu. What can I do to prevent getting sick again?",
            "Hello! One way to lower your risk of getting the flu again is to get a flu vaccine each year.",
            "What if I don't want to get a vaccine?",
            "You can also take other steps such as washing your hands regularly, avoiding close contact with people who are sick, covering your mouth and nose when coughing or sneezing, and avoiding touching your face.",
            "What about my diet?",
            "A healthy diet can also help boost your immune system and lower your risk of getting sick.",
            "Can you give me some examples of foods that boost the immune system?",
            "Foods high in vitamin C, such as citrus fruits and broccoli, and foods high in vitamin D, such as fatty fish and fortified dairy products, are good for the immune system.",
            "Thank you for the advice. Is there anything else I should be doing?"
        ],
        "knowledge": "Influenza Influenza  People with the flu are contagious from the day before symptoms develop to 5-7 days after onset of symptoms in adults.  This period may be longer in young children or people with weakened immune systems.  Some people, especially young children and people with weakened immune systems, may be contagious for longer periods Influenza Influenza",
        "response": "Yes, getting enough sleep, managing stress, and staying physically active can also help boost your immune system and lower your risk of getting sick."
    },
    {
        "dialog": [
            "Hello Medi, I have a cough and a fever.",
            "Hello there. Do you have any other symptoms?",
            "Yes, I also have a headache and a sore throat.",
            "I see. Based on your symptoms, it is possible that you have the flu.",
            "What should I do next?",
            "You should rest and drink plenty of fluids. If your symptoms worsen, you should see a doctor.",
            "Okay, thank you. How long will it take for me to recover?",
            "It typically takes 5-7 days to recover from the flu, but it can take up to 2 weeks.",
            "Thank you for your help, Medi. "
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "You're welcome. If there's anything else I can help you with, feel free to ask."
    },
    {
        "dialog": [
            "Hello Medi, I want to know about the flu.",
            "Of course, what would you like to know?",
            "How does the flu spread?",
            "The flu spreads through respiratory droplets when an infected person coughs or sneezes. It can also spread by touching a surface contaminated with the virus and then touching your mouth, nose, or eyes.",
            "Who is most at risk for the flu?",
            "High risk groups include young children, the elderly, and people with chronic health conditions.",
            "How can I prevent getting the flu?",
            "The best way to prevent getting the flu is to get vaccinated each year, wash your hands frequently, and avoid close contact with people who are sick.",
            "Thank you for the information, Medi. "
        ],
        "knowledge": "Influenza Influenza  There are 3–5 million severe cases annually, with up to 650,000 respiratory-related deaths globally each year.  Deaths most commonly occur in high-risk groups, including young children, the elderly, and people with chronic health conditions.  In temperate regions of the world, the number of influenza cases peaks during winter, whereas in the tropics influenza can occur year-round.  Since the late 1800s, large outbreaks of novel influenza strains that spread globally, called pandemics, have occurred every 10–50 years.  Five flu pandemics have occurred since 1900: the Spanish flu in 1918–1920, which was the most severe flu pandemic, the Asian flu in 1957, the Hong Kong flu in 1968, the Russian flu in 1977, and the swine flu pandemic in 2009. The time between exposure to the virus and development of symptoms, called the incubation period, is 1–4 days, most commonly 1–2 days.  Many infections, however, are asymptomatic Influenza Influenza",
        "response": "You're welcome. If there's anything else I can help you with, feel free to ask."
    },
    {
        "dialog": [
            "Hello Medi, I recently had the flu and I want to know how to prevent getting it again.",
            "Hello. The best way to prevent getting the flu in the future is to get vaccinated each year.",
            "What if I don't want to get vaccinated?",
            "If you choose not to get vaccinated, you can still reduce your risk of getting the flu by washing your hands frequently, avoiding close contact with people who are sick, and avoiding touching your face.",
            "Are there any other ways to prevent the flu?",
            "There are some natural remedies that may help prevent the flu, such as taking vitamin C and zinc supplements, getting enough sleep, and eating a healthy diet.",
            "Thank you for the advice, Medi.",
            "You're welcome. Stay healthy!"
        ],
        "knowledge": "Influenza Influenza  There are 3–5 million severe cases annually, with up to 650,000 respiratory-related deaths globally each year.  Deaths most commonly occur in high-risk groups, including young children, the elderly, and people with chronic health conditions.  In temperate regions of the world, the number of influenza cases peaks during winter, whereas in the tropics influenza can occur year-round.  Since the late 1800s, large outbreaks of novel influenza strains that spread globally, called pandemics, have occurred every 10–50 years.  Five flu pandemics have occurred since 1900: the Spanish flu in 1918–1920, which was the most severe flu pandemic, the Asian flu in 1957, the Hong Kong flu in 1968, the Russian flu in 1977, and the swine flu pandemic in 2009. The time between exposure to the virus and development of symptoms, called the incubation period, is 1–4 days, most commonly 1–2 days.  Many infections, however, are asymptomatic Influenza Influenza",
        "response": "You're welcome. If there's anything else I can help you with, feel free to ask."
    },
    {
        "dialog": [
            "Hello Medi, I am not feeling well and I have a fever.",
            "Hello, I am here to help. How high is your fever?",
            "I think it's around 38.5 degrees Celsius.",
            "Okay. What other symptoms do you have?",
            "I feel tired and have a headache.",
            "Based on your symptoms, you might have Influenza. You should drink plenty of fluids and get rest.",
            "What else can I do to feel better?",
            "Take over-the-counter pain relievers, like acetaminophen or ibuprofen, to reduce fever and relieve pain.",
            "Thank you for your advice. How long should I rest?"
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "You should rest until your fever is gone and you feel better."
    },
    {
        "dialog": [
            "Hello Medi, I am worried about getting Influenza.",
            "Hello, I am here to help. What would you like to know?",
            "What are the chances of getting Influenza?",
            "Influenza is highly contagious and spreads easily from person to person. Anyone can get Influenza.",
            "How can I prevent getting Influenza?",
            "The best way to prevent Influenza is to get vaccinated every year and practice good hygiene, like washing your hands frequently.",
            "What if I do get Influenza?",
            "If you do get Influenza, it's important to rest and drink plenty of fluids. You can also take over-the-counter pain relievers, like acetaminophen or ibuprofen, to reduce fever and relieve pain.",
            "Thank you for your advice, Medi. How long does it take to recover from Influenza?"
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "Most people recover from Influenza within 1-2 weeks, but it can take longer for some people."
    },
    {
        "dialog": [
            "Hello Medi, I had Influenza last month. What should I do to prevent getting it again?",
            "Hello, I am here to help. The best way to prevent getting Influenza again is to get vaccinated every year.",
            "What if I can't get vaccinated?",
            "If you can't get vaccinated, you can still practice good hygiene, like washing your hands frequently and avoiding close contact with sick people.",
            "What if someone I know has Influenza?",
            "If someone you know has Influenza, it's important to avoid close contact with them and practice good hygiene, like washing your hands frequently.",
            "Thank you for your advice, Medi. How effective is the Influenza vaccine?",
            "The effectiveness of the Influenza vaccine varies from year to year, but it can reduce your risk of getting Influenza by up to 60%.",
            "Thank you for your help, Medi."
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "You're welcome. If you have any other questions, feel free to ask."
    },
    {
        "dialog": [
            "Hi Medi, I am experiencing cough and sore throat. What should I do?",
            "Hello! Based on your symptoms, you may have caught a cold. Get plenty of rest and drink fluids.",
            "Okay, that sounds easy enough. Should I take any medication?",
            "You can take over-the-counter cold medicine to help with your symptoms.",
            "What about any home remedies?",
            "Drinking hot tea with honey may help soothe your throat. Also, try gargling with salt water.",
            "Thanks for the advice, Medi. How long should I expect to feel this way?",
            "Typically, a cold will last for 7-10 days. If your symptoms persist or worsen, seek medical attention.",
            "Got it. Thank you, Medi!"
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "Based on your symptoms, you likely have caught a cold. Get plenty of rest and drink fluids. Over-the-counter medication can help with symptoms. Drinking hot tea with honey and gargling with salt water are also helpful home remedies."
    },
    {
        "dialog": [
            "Hey Medi, my child has a high fever and a cough. What should I do?",
            "Hello! It's important to monitor your child's fever and give them plenty of fluids to drink.",
            "What about medication to bring down the fever?",
            "You can give your child over-the-counter fever-reducing medication such as ibuprofen or acetaminophen.",
            "What if my child's symptoms don't improve?",
            "If your child's symptoms persist or worsen, it's important to seek medical attention. They may have a more serious illness.",
            "Okay, I'll keep an eye on them. How long should I expect the fever to last?",
            "A fever caused by a viral infection usually lasts 3-5 days. If the fever lasts longer than that, it could be a sign of a bacterial infection.",
            "Thank you for the advice, Medi!"
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "It's important to monitor your child's fever and give them plenty of fluids to drink. Over-the-counter fever-reducing medication such as ibuprofen or acetaminophen can help. If their symptoms persist or worsen, seek medical attention. A fever caused by a viral infection usually lasts 3-5 days."
    },
    {
        "dialog": [
            "Hi Medi, I just recovered from the flu. What should I do to prevent it in the future?",
            "Hello! The best way to prevent the flu is to get an annual flu shot.",
            "What if I don't want to get a flu shot?",
            "You can also practice good hygiene such as washing your hands frequently and avoiding touching your face.",
            "What about my diet?",
            "A healthy diet with plenty of fruits and vegetables can help boost your immune system.",
            "Got it. Any other tips?",
            "Getting enough sleep and reducing stress can also contribute to a healthy immune system.",
            "Thank you, Medi!"
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "The best way to prevent the flu is to get an annual flu shot. Practicing good hygiene, eating a healthy diet, getting enough sleep, and reducing stress can also contribute to a healthy immune system."
    }
]