[
    {
        "dialog": [
            "Hi Medi, I think I might have meningitis",
            "What are your symptoms?",
            "I have a really bad headache, my neck is stiff and I have a fever",
            "Based on your symptoms, it's important to seek immediate medical attention",
            "What are the main problems with meningitis?",
            "Deafness and cognitive impairment are the main problems",
            "Is meningitis curable?",
            "Yes, with proper medical care, meningitis can be treated",
            "Okay, I will go to the hospital right away"
        ],
        "knowledge": "Meningitis Meningitis  These occur in about 15% of survivors.  Some of the hearing loss may be reversible.  In adults, 66% of all cases emerge without disability.  The main problems are deafness  and cognitive impairment . Tuberculous meningitis in children continues to be associated with a significant risk of death even with treatment, and a significant proportion of the surviving children have ongoing neurological problems.  Just over a third of all cases survives with no problems. Although meningitis is a notifiable disease in many countries, the exact incidence rate is unknown Meningitis Meningitis",
        "response": "Yes, it is curable with proper medical care"
    },
    {
        "dialog": [
            "Hi Medi, can you explain what meningitis is?",
            "Meningitis is an inflammation of the membranes that surround the brain and spinal cord",
            "What are the common symptoms of meningitis?",
            "Common symptoms include fever, headache, stiff neck, and a rash",
            "How is meningitis transmitted?",
            "Meningitis is transmitted through contact with respiratory or throat secretions, such as saliva, mucus, or nose discharge",
            "Can meningitis be prevented?",
            "Yes, meningitis can be prevented through vaccination and good hygiene practices",
            "Thank you for the information!"
        ],
        "knowledge": "Meningitis Meningitis  These occur in about 15% of survivors.  Some of the hearing loss may be reversible.  In adults, 66% of all cases emerge without disability.  The main problems are deafness  and cognitive impairment . Tuberculous meningitis in children continues to be associated with a significant risk of death even with treatment, and a significant proportion of the surviving children have ongoing neurological problems.  Just over a third of all cases survives with no problems. Although meningitis is a notifiable disease in many countries, the exact incidence rate is unknown Meningitis Meningitis",
        "response": "You're welcome! Let me know if you have any other questions."
    },
    {
        "dialog": [
            "Hi Medi, I recently had meningitis. What can I do to take care of myself?",
            "It's important to rest and take it easy",
            "Is there anything I should avoid?",
            "Avoid alcohol and any activities that may be physically exerting",
            "What about my diet?",
            "Eat a healthy, balanced diet and drink plenty of fluids",
            "Is there any physical therapy or exercise I should do?",
            "Yes, physical therapy and certain exercises can help improve muscle strength and mobility",
            "Thanks, Medi!"
        ],
        "knowledge": "Meningitis Meningitis  These occur in about 15% of survivors.  Some of the hearing loss may be reversible.  In adults, 66% of all cases emerge without disability.  The main problems are deafness  and cognitive impairment . Tuberculous meningitis in children continues to be associated with a significant risk of death even with treatment, and a significant proportion of the surviving children have ongoing neurological problems.  Just over a third of all cases survives with no problems. Although meningitis is a notifiable disease in many countries, the exact incidence rate is unknown Meningitis Meningitis",
        "response": "You're welcome! I hope you recover quickly!"
    },
    {
        "dialog": [
            "Hello Medi, I think I might have meningitis",
            "What are your symptoms?",
            "I have been experiencing a headache, fever, and a stiff neck for a few days",
            "Ok, based on your symptoms, meningitis is a possibility",
            "What should I do next?",
            "You should seek medical attention immediately",
            "Is there anything else I should be aware of?",
            "In adults, 66% of all cases emerge without disability, but for children, it can be more severe",
            "What can I do to prevent this from happening again?"
        ],
        "knowledge": "Meningitis Meningitis  These occur in about 15% of survivors.  Some of the hearing loss may be reversible.  In adults, 66% of all cases emerge without disability.  The main problems are deafness  and cognitive impairment . Tuberculous meningitis in children continues to be associated with a significant risk of death even with treatment , and a significant proportion of the surviving children have ongoing neurological problems.  Just over a third of all cases survives with no problems. Although meningitis is a notifiable disease in many countries, the exact incidence rate is unknown Meningitis Meningitis",
        "response": "The best way to prevent meningitis is to practice good hygiene such as washing your hands regularly and avoiding close contact with infected individuals."
    },
    {
        "dialog": [
            "Hello Medi, I have a question about meningitis.",
            "Sure, what would you like to know?",
            "What are the main problems associated with meningitis?",
            "Some of the main problems associated with meningitis are deafness and cognitive impairment",
            "Is meningitis more severe in adults or children?",
            "In adults, 66% of all cases emerge without disability, but for children, it can be more severe",
            "What is the mortality rate for children with tuberculous meningitis?",
            "Tuberculous meningitis in children continues to be associated with a significant risk of death even with treatment , but the exact rate is unknown",
            "Thanks for the information. How can I prevent meningitis?"
        ],
        "knowledge": "Meningitis Meningitis  These occur in about 15% of survivors.  Some of the hearing loss may be reversible.  In adults, 66% of all cases emerge without disability.  The main problems are deafness  and cognitive impairment . Tuberculous meningitis in children continues to be associated with a significant risk of death even with treatment , and a significant proportion of the surviving children have ongoing neurological problems.  Just over a third of all cases survives with no problems. Although meningitis is a notifiable disease in many countries, the exact incidence rate is unknown Meningitis Meningitis",
        "response": "The best way to prevent meningitis is to practice good hygiene such as washing your hands regularly and avoiding close contact with infected individuals."
    },
    {
        "dialog": [
            "Hello Medi, I just underwent a medical procedure for meningitis",
            "That sounds intense, what is your concern?",
            "I'm not sure what kind of lifestyle changes I should make",
            "You should avoid alcohol and tobacco products and get plenty of rest",
            "What kind of physical activity should I do?",
            "You should engage in light exercises such as walking or yoga",
            "What kind of diet should I follow?",
            "You should eat a balanced diet with plenty of fruits and vegetables",
            "Thanks for the advice. When can I expect to make a full recovery?"
        ],
        "knowledge": "Meningitis Meningitis  These occur in about 15% of survivors.  Some of the hearing loss may be reversible.  In adults, 66% of all cases emerge without disability.  The main problems are deafness  and cognitive impairment . Tuberculous meningitis in children continues to be associated with a significant risk of death even with treatment , and a significant proportion of the surviving children have ongoing neurological problems.  Just over a third of all cases survives with no problems. Although meningitis is a notifiable disease in many countries, the exact incidence rate is unknown Meningitis Meningitis",
        "response": "It depends on the severity of the meningitis and the individual's health, but full recovery can take several weeks to several months."
    },
    {
        "dialog": [
            "Hello Medi, I have a terrible headache and feeling uncomfortable",
            "I'm sorry to hear that. Any other symptoms you have?",
            "Yes, I feel tired and can't taste anything. My nose is running and my throat is sore",
            "Based on your symptoms, you might have influenza. It's a viral infection that can cause respiratory and other symptoms",
            "What should I do, Medi?",
            "You can take over-the-counter medications to relieve your symptoms and rest to help your body recover. If your condition worsens, you should see a doctor for further evaluation",
            "Okay, I'll try that. Thanks, Medi",
            "You're welcome. Take care of yourself, and don't hesitate to contact me if you have any further questions",
            "How long does it usually take for influenza to go away?"
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms, such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days. A 2021 study suggests influenza can cause long-lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common. Influenza Influenza",
        "response": "Influenza symptoms usually last for 2-8 days, but it may take longer for some people to recover completely"
    },
    {
        "dialog": [
            "Hi Medi, I have questions about meningitis",
            "Of course, I'm here to help. What would you like to know?",
            "What are the symptoms of meningitis?",
            "Symptoms of meningitis can include fever, headache, stiff neck, sensitivity to light, and confusion. In severe cases, patients may experience seizures, coma, or even death",
            "Is there any way to prevent meningitis?",
            "Yes, there are vaccines available for some types of meningitis, and practicing good hygiene, such as washing your hands and avoiding close contact with sick people, can also help prevent the spread of the disease",
            "What are the treatments for meningitis?",
            "Treatment for meningitis depends on the type and severity of the disease. It may include antibiotics, antiviral medications, or other supportive treatments. It's important to seek medical attention if you suspect you have meningitis",
            "Thank you for your advice, Medi. How common is meningitis?"
        ],
        "knowledge": "Meningitis Meningitis  These occur in about 15% of survivors. Some of the hearing loss may be reversible. In adults, 66% of all cases emerge without disability. The main problems are deafness and cognitive impairment. Tuberculous meningitis in children continues to be associated with a significant risk of death even with treatment, and a significant proportion of the surviving children have ongoing neurological problems. Just over a third of all cases survive with no problems. Although meningitis is a notifiable disease in many countries, the exact incidence rate is unknown. Meningitis Meningitis",
        "response": "You're welcome. Let me know if you have any more questions about meningitis"
    },
    {
        "dialog": [
            "Hello Medi, I recently had a medical procedure and want to know how to take care of myself",
            "Sure, I'm here to help. Can you tell me more about the procedure?",
            "It was a minor surgery on my knee. I was told to stay off my feet for a few days and then start physical therapy",
            "That sounds like a good plan. In addition, you should take any prescribed pain medications as directed, apply ice to the affected area to reduce swelling, and elevate your leg to help with circulation",
            "Are there any foods I should avoid or eat more of?",
            "A balanced diet with plenty of fruits and vegetables is always a good idea, but there are some foods that can help with healing and others that can hinder it. For example, foods high in protein and vitamin C can promote healing, while sugary or processed foods can slow it down. It's best to talk to your doctor or a registered dietitian for personalized advice",
            "Thank you, Medi. What kind of physical therapy should I do?",
            "Your physical therapist will design a program tailored to your specific needs, but it will likely involve exercises to improve range of motion, strength, and flexibility in your knee. They may also use other modalities, such as heat or ultrasound, to help with pain and healing",
            "Okay, I'll keep that in mind. Thanks for your help, Medi"
        ],
        "knowledge": "No specific knowledge",
        "response": "You're welcome. Let me know if you have any other questions about post-surgery recovery"
    },
    {
        "dialog": [
            "Hello Medi, I am worried about meningitis. What are the symptoms?",
            "Hello there, the symptoms of meningitis are fever, headache, and neck stiffness.",
            "What about the other symptoms, Medi?",
            "Other symptoms include nausea, vomiting, sensitivity to light, and confusion.",
            "Is there any treatment for meningitis?",
            "Yes, meningitis can be treated with antibiotics and antiviral medications.",
            "What is the possibility of survival?",
            "Just over a third of all cases survive with no problems.",
            "What are the main problems that can result from meningitis, Medi?"
        ],
        "knowledge": "Meningitis Meningitis  These occur in about 15% of survivors.  Some of the hearing loss may be reversible.  In adults, 66% of all cases emerge without disability.  The main problems are deafness  and cognitive impairment . Tuberculous meningitis in children continues to be associated with a significant risk of death even with treatment , and a significant proportion of the surviving children have ongoing neurological problems.  Just over a third of all cases survives with no problems. Although meningitis is a notifiable disease in many countries, the exact incidence rate is unknown Meningitis Meningitis",
        "response": "The main problems are deafness and cognitive impairment, but some of the hearing loss may be reversible."
    },
    {
        "dialog": [
            "Hi Medi, I had meningitis before, can you give me advice on living a healthy life?",
            "Hello, I recommend that you get enough sleep, eat a balanced diet, and exercise regularly.",
            "Is there any particular diet that I should follow?",
            "A diet rich in fruits, vegetables, and whole grains can provide essential nutrients for a healthy lifestyle.",
            "How can I make sure that I get enough exercise, Medi?",
            "You can start by incorporating physical activity into your daily routine such as taking a walk or jogging in the morning.",
            "What precautions should I take to avoid getting meningitis again?",
            "Avoid close contact with people who have meningitis, wash your hands frequently, and maintain a healthy lifestyle.",
            "What are the chances of getting meningitis again, Medi?"
        ],
        "knowledge": "Meningitis Meningitis  These occur in about 15% of survivors.  Some of the hearing loss may be reversible.  In adults, 66% of all cases emerge without disability.  The main problems are deafness  and cognitive impairment . Tuberculous meningitis in children continues to be associated with a significant risk of death even with treatment, and a significant proportion of the surviving children have ongoing neurological problems.  Just over a third of all cases survives with no problems. Although meningitis is a notifiable disease in many countries, the exact incidence rate is unknown Meningitis Meningitis",
        "response": "The chances of getting meningitis again are very low, but it's important to take precautions to avoid it."
    },
    {
        "dialog": [
            "Hello Medi, I just had a lumbar puncture. What should I do now?",
            "Hello, it's important to rest and avoid any strenuous activities for the next 24 hours.",
            "What about my diet, Medi?",
            "You should eat a light and healthy meal and drink plenty of fluids to prevent headache and dehydration.",
            "Can I take a painkiller for the headache?",
            "You can take a painkiller such as acetaminophen or ibuprofen, but avoid aspirin as it can increase the risk of bleeding.",
            "How long will it take to recover from the lumbar puncture?",
            "It usually takes a few days to recover from a lumbar puncture, but you should contact your doctor if you experience any severe symptoms.",
            "What are the possible risks associated with a lumbar puncture, Medi?"
        ],
        "knowledge": "A lumbar puncture is a medical procedure used to collect and analyze cerebrospinal fluid to diagnose certain diseases.  The risks associated with a lumbar puncture include headache, infection, bleeding, nerve damage, herniation, and seizures.  It's important to rest and avoid any strenuous activities for the next 24 hours after a lumbar puncture.  You should eat a light and healthy meal and drink plenty of fluids to prevent headache and dehydration.  It usually takes a few days to recover from a lumbar puncture, but you should contact your doctor if you experience any severe symptoms.",
        "response": "The possible risks associated with a lumbar puncture include headache, infection, bleeding, nerve damage, herniation, and seizures."
    },
    {
        "dialog": [
            "Hi, Medi. I'm feeling dizzy and have a severe headache.",
            "Hello. Based on your symptoms, you may have meningitis. You should immediately seek emergency medical help.",
            "What is meningitis?",
            "It's a severe disease that causes inflammation of the protective membranes surrounding the brain and spinal cord.",
            "Is it treatable?",
            "Yes, it can be treated with antibiotics if it's bacterial meningitis. Prompt treatment is necessary to avoid severe outcomes.",
            "What are the symptoms of meningitis?",
            "Common symptoms include headache, fever, stiff neck, vomiting, and sensitivity to light.",
            "Thanks, Medi."
        ],
        "knowledge": "Meningitis Meningitis  These occur in about 15% of survivors.  Some of the hearing loss may be reversible.  In adults, 66% of all cases emerge without disability.  The main problems are deafness  and cognitive impairment. Tuberculous meningitis in children continues to be associated with a significant risk of death even with treatment, and a significant proportion of the surviving children have ongoing neurological problems.  Just over a third of all cases survive with no problems. Although meningitis is a notifiable disease in many countries, the exact incidence rate is unknown Meningitis Meningitis",
        "response": "You're welcome! I hope you'll feel better soon."
    },
    {
        "dialog": [
            "Hi, Medi. I'm worried about meningitis. Can you tell me more about it?",
            "Hello. Sure, meningitis is an inflammation of the meninges, which are the protective membranes surrounding the brain and spinal cord.",
            "What are the causes of meningitis?",
            "The causes of meningitis can be bacterial, viral, fungal, or parasitic. Bacterial meningitis is the most severe type, and it's often life-threatening if not treated promptly.",
            "What are the symptoms of meningitis?",
            "Common symptoms include headache, fever, stiff neck, vomiting, and sensitivity to light.",
            "Is it treatable?",
            "Yes, it can be treated with antibiotics if it's bacterial meningitis. Prompt treatment is necessary to avoid severe outcomes.",
            "Thanks for the information, Medi."
        ],
        "knowledge": "Meningitis Meningitis  These occur in about 15% of survivors.  Some of the hearing loss may be reversible.  In adults, 66% of all cases emerge without disability.  The main problems are deafness  and cognitive impairment. Tuberculous meningitis in children continues to be associated with a significant risk of death even with treatment, and a significant proportion of the surviving children have ongoing neurological problems.  Just over a third of all cases survive with no problems. Although meningitis is a notifiable disease in many countries, the exact incidence rate is unknown Meningitis Meningitis",
        "response": "No, that's all I wanted to know. Thanks, Medi."
    },
    {
        "dialog": [
            "Hi, Medi. I recently recovered from meningitis. What lifestyle changes can I make to prevent it from happening again?",
            "Hello. Meningitis can be prevented by maintaining good hygiene, washing hands frequently, and covering your mouth when coughing or sneezing.",
            "What about diet and exercise?",
            "A healthy and balanced diet, as well as regular exercise, can boost your immune system and lower the risk of infections.",
            "Can I still lead a normal life?",
            "In most cases, yes. However, some people may experience hearing loss or cognitive impairment after recovering from meningitis.",
            "Is there anything I can do to prevent these problems?",
            "Regular check-ups with a doctor can detect any hearing loss or cognitive impairment early, and treatment can be initiated.",
            "Thanks, Medi."
        ],
        "knowledge": "Meningitis Meningitis  These occur in about 15% of survivors.  Some of the hearing loss may be reversible.  In adults, 66% of all cases emerge without disability.  The main problems are deafness  and cognitive impairment. Tuberculous meningitis in children continues to be associated with a significant risk of death even with treatment, and a significant proportion of the surviving children have ongoing neurological problems.  Just over a third of all cases survive with no problems. Although meningitis is a notifiable disease in many countries, the exact incidence rate is unknown Meningitis Meningitis",
        "response": "You're welcome. Be sure to stay healthy!"
    },
    {
        "dialog": [
            "Hello Medi, I'm afraid I may have meningitis.",
            "What symptoms are you experiencing?",
            "Terrible headache, stiff neck, and I feel exhausted.",
            "Based on your symptoms, you might have meningitis. You should see a doctor immediately.",
            "Could I recover completely if I have meningitis?",
            "In some cases, yes. But there's a risk of hearing loss and cognitive impairment.",
            "What can I do to prevent meningitis?",
            "Maintain good hygiene, avoid sharing personal items, and get vaccinated.",
            "Is there any risk of death associated with meningitis?"
        ],
        "knowledge": "Meningitis Meningitis These occur in about 15% of survivors.  Some of the hearing loss may be reversible.  In adults, 66% of all cases emerge without disability.  The main problems are deafness  and cognitive impairment . Tuberculous meningitis in children continues to be associated with a significant risk of death even with treatment, and a significant proportion of the surviving children have ongoing neurological problems.  Just over a third of all cases survive with no problems. Although meningitis is a notifiable disease in many countries, the exact incidence rate is unknown Meningitis Meningitis",
        "response": "Yes, there is a risk of death associated with meningitis, especially in children with tuberculous meningitis."
    },
    {
        "dialog": [
            "Hey Medi, I want to know more about meningitis.",
            "Sure, what would you like to know?",
            "What are the main symptoms of meningitis?",
            "Symptoms include fever, headache, neck stiffness, and a rash that does not fade when pressure is applied.",
            "What are the different types of meningitis?",
            "There are several types, including viral, bacterial, and fungal. Bacterial meningitis is the most severe and requires immediate treatment.",
            "How is meningitis treated?",
            "Treatment depends on the cause of meningitis but may include antibiotics, antiviral medications, and antifungal medications.",
            "Can you die from meningitis?"
        ],
        "knowledge": "Meningitis Meningitis These occur in about 15% of survivors.  Some of the hearing loss may be reversible.  In adults, 66% of all cases emerge without disability.  The main problems are deafness  and cognitive impairment . Tuberculous meningitis in children continues to be associated with a significant risk of death even with treatment, and a significant proportion of the surviving children have ongoing neurological problems.  Just over a third of all cases survive with no problems. Although meningitis is a notifiable disease in many countries, the exact incidence rate is unknown Meningitis Meningitis",
        "response": "Yes, meningitis is a serious condition and can be fatal, especially if not treated promptly."
    },
    {
        "dialog": [
            "Hi Medi, I recently had meningitis and I want to know what I should do now.",
            "I'm sorry to hear that. What kind of meningitis did you have?",
            "I had bacterial meningitis.",
            "In that case, it's important to take all of your antibiotics as prescribed and get plenty of rest.",
            "Can I do anything to prevent getting meningitis again?",
            "Maintain good hygiene, avoid sharing personal items, and get vaccinated if appropriate.",
            "Will I experience any long-term effects from meningitis?",
            "It's possible, depending on the severity of the case. Some people experience hearing loss or cognitive impairment.",
            "What should I do if I experience symptoms of meningitis again?"
        ],
        "knowledge": "Meningitis Meningitis These occur in about 15% of survivors.  Some of the hearing loss may be reversible.  In adults, 66% of all cases emerge without disability.  The main problems are deafness  and cognitive impairment . Tuberculous meningitis in children continues to be associated with a significant risk of death even with treatment, and a significant proportion of the surviving children have ongoing neurological problems.  Just over a third of all cases survive with no problems. Although meningitis is a notifiable disease in many countries, the exact incidence rate is unknown Meningitis Meningitis",
        "response": "If you experience symptoms of meningitis again, you should see a doctor immediately."
    },
    {
        "dialog": [
            "Hi Medi, I think I have meningitis.",
            "What are your main symptoms?",
            "I feel a really bad headache and a stiff neck.",
            "Based on your symptoms, you could have meningitis.",
            "What should I do now?",
            "You need to go to the hospital right away to get a diagnosis.",
            "What are the main problems of this disease? ",
            "Some of the main problems are deafness and cognitive impairment.",
            "What is the incidence rate of meningitis? "
        ],
        "knowledge": "Meningitis Meningitis  These occur in about 15% of survivors.  Some of the hearing loss may be reversible.  In adults, 66% of all cases emerge without disability.  The main problems are deafness  and cognitive impairment . Tuberculous meningitis in children continues to be associated with a significant risk of death even with treatment , and a significant proportion of the surviving children have ongoing neurological problems.  Just over a third of all cases survives with no problems. Although meningitis is a notifiable disease in many countries, the exact incidence rate is unknown Meningitis Meningitis",
        "response": "Unfortunately, the exact incidence rate of meningitis is unknown."
    },
    {
        "dialog": [
            "Hi Medi, I have a question about meningitis.",
            "Sure, what is your question?",
            "What are the main problems that meningitis can cause?",
            "Some of the main problems are deafness and cognitive impairment.",
            "Is meningitis more common in adults or children?",
            "In adults, 66% of all cases emerge without disability, but tuberculous meningitis in children continues to be associated with a significant risk of death even with treatment, and a significant proportion of the surviving children have ongoing neurological problems.",
            "Can meningitis cause permanent disability?",
            "These occur in about 15% of survivors. Some of the hearing loss may be reversible.",
            "Are there any cases where meningitis does not cause any problems? "
        ],
        "knowledge": "Meningitis Meningitis  These occur in about 15% of survivors.  Some of the hearing loss may be reversible.  In adults, 66% of all cases emerge without disability.  The main problems are deafness  and cognitive impairment . Tuberculous meningitis in children continues to be associated with a significant risk of death even with treatment , and a significant proportion of the surviving children have ongoing neurological problems.  Just over a third of all cases survives with no problems. Although meningitis is a notifiable disease in many countries, the exact incidence rate is unknown Meningitis Meningitis",
        "response": "Yes, just over a third of all cases survive with no problems."
    },
    {
        "dialog": [
            "Hi Medi, I just had a lumbar puncture to diagnose meningitis.",
            "What advice do you have for me?",
            "Make sure you rest for the next few days and avoid any strenuous activity.",
            "What kind of diet should I follow?",
            "It's important to drink plenty of fluids and eat a balanced diet.",
            "What kind of physical activity should I do?",
            "It's best to avoid any physical activity for the next few days and then gradually resume your normal routine.",
            "What if my symptoms don't improve?",
            "If your symptoms don't improve or get worse, you should contact your doctor immediately."
        ],
        "knowledge": "Meningitis Meningitis  These occur in about 15% of survivors.  Some of the hearing loss may be reversible.  In adults, 66% of all cases emerge without disability.  The main problems are deafness  and cognitive impairment . Tuberculous meningitis in children continues to be associated with a significant risk of death even with treatment , and a significant proportion of the surviving children have ongoing neurological problems.  Just over a third of all cases survives with no problems. Although meningitis is a notifiable disease in many countries, the exact incidence rate is unknown Meningitis Meningitis",
        "response": "It's best to consult with your doctor about when you can go back to work based on your specific situation."
    },
    {
        "dialog": [
            "Hello Medi, I am feeling weak and a bit dizzy.",
            "I'm here to help. Can you explain your symptoms a bit more?",
            "I have a headache and neck stiffness, and I feel very tired.",
            "Based on your symptoms, it could be meningitis. Have you been in contact with someone who has it?",
            "No, I haven't been in contact with anyone who has it.",
            "In that case, you should visit a doctor as soon as possible. Meningitis can be very dangerous.",
            "What are some of the long-term effects of meningitis?",
            "Some survivors experience hearing loss and cognitive impairment. In children, there is a risk of death and ongoing neurological problems.",
            "Thank you, Medi. What is the exact incidence rate of meningitis?"
        ],
        "knowledge": "Meningitis Meningitis  These occur in about 15% of survivors.  Some of the hearing loss may be reversible.  In adults, 66% of all cases emerge without disability.  The main problems are deafness  and cognitive impairment . Tuberculous meningitis in children continues to be associated with a significant risk of death even with treatment , and a significant proportion of the surviving children have ongoing neurological problems.  Just over a third of all cases survives with no problems. Although meningitis is a notifiable disease in many countries, the exact incidence rate is unknown Meningitis Meningitis",
        "response": "The exact incidence rate of meningitis is unknown, but it is a notifiable disease in many countries."
    },
    {
        "dialog": [
            "Hi Medi, can you explain what meningitis is?",
            "Certainly. Meningitis is an inflammation of the protective membranes around the brain and spinal cord.",
            "What are the symptoms of meningitis?",
            "Symptoms include fever, headaches, neck stiffness, and a rash. It can progress rapidly and become life-threatening.",
            "Can meningitis be prevented?",
            "Some types of meningitis can be prevented with vaccines. Practicing good hygiene is also important.",
            "Thank you, Medi. How is meningitis treated?",
            "Meningitis is treated with antibiotics and supportive care in a hospital setting. Early treatment is important.",
            "I see. How long does it take to recover from meningitis?"
        ],
        "knowledge": "Meningitis Meningitis  These occur in about 15% of survivors.  Some of the hearing loss may be reversible.  In adults, 66% of all cases emerge without disability.  The main problems are deafness  and cognitive impairment . Tuberculous meningitis in children continues to be associated with a significant risk of death even with treatment , and a significant proportion of the surviving children have ongoing neurological problems.  Just over a third of all cases survives with no problems. Although meningitis is a notifiable disease in many countries, the exact incidence rate is unknown Meningitis Meningitis",
        "response": "The recovery time from meningitis can vary depending on the severity of the case. Some survivors experience hearing loss and cognitive impairment."
    },
    {
        "dialog": [
            "Hi Medi, I have recently undergone a lumbar puncture for meningitis.",
            "I hope you're feeling better. Do you have any questions about recovery?",
            "Yes, can you recommend any lifestyle changes for me?",
            "It's important to rest and take it easy for a few days after the procedure. You may also want to avoid strenuous physical activity.",
            "What about my diet?",
            "Try to maintain a balanced diet with plenty of fruits and vegetables. Drinking plenty of fluids is also important.",
            "I see. What kind of physical activity is recommended?",
            "Low-impact exercises like walking or swimming are best. Make sure to talk to your doctor before starting any exercise routine.",
            "Thank you, Medi. Is there anything else I should be aware of?"
        ],
        "knowledge": "Meningitis Meningitis  These occur in about 15% of survivors.  Some of the hearing loss may be reversible.  In adults, 66% of all cases emerge without disability.  The main problems are deafness  and cognitive impairment . Tuberculous meningitis in children continues to be associated with a significant risk of death even with treatment , and a significant proportion of the surviving children have ongoing neurological problems.  Just over a third of all cases survives with no problems. Although meningitis is a notifiable disease in many countries, the exact incidence rate is unknown Meningitis Meningitis",
        "response": "No, that's all for now. Thank you for your help, Medi."
    },
    {
        "dialog": [
            "Hi, Medi. I am feeling very sick and have a headache.",
            "Hello, I am here to help you. Can you tell me more about your symptoms?",
            "I feel headache, dizziness and nausea. I am also experiencing some confusion.",
            "Based on your symptoms, it seems like you might be suffering from meningitis. Have you been in contact with anyone who has a similar condition?",
            "Yes, I have been in contact with my friend who recently had meningitis.",
            "I recommend you to go see a doctor immediately and get tested for meningitis. This can be serious and requires immediate attention.",
            "What are the main problems caused by meningitis?",
            "Deafness and cognitive impairment are the main problems caused by meningitis according to medical knowledge.",
            "Will I be okay after the treatment?"
        ],
        "knowledge": "Meningitis Meningitis  These occur in about 15% of survivors.  Some of the hearing loss may be reversible.  In adults, 66% of all cases emerge without disability.  The main problems are deafness  and cognitive impairment . Tuberculous meningitis in children continues to be associated with a significant risk of death even with treatment , and a significant proportion of the surviving children have ongoing neurological problems.  Just over a third of all cases survives with no problems. Although meningitis is a notifiable disease in many countries, the exact incidence rate is unknown Meningitis Meningitis",
        "response": "It depends on the severity of the meningitis, but many people do recover without any problems. It's important to get treatment as soon as possible."
    },
    {
        "dialog": [
            "Hello Medi, I have some questions about meningitis.",
            "Hello, I am happy to answer any questions you have. What would you like to know?",
            "What are the common symptoms of meningitis?",
            "The common symptoms of meningitis include fever, headache, stiff neck, sensitivity to light, nausea, vomiting, and confusion.",
            "Is meningitis contagious?",
            "Yes, meningitis is contagious and can be spread through contact with the saliva, mucus, or feces of an infected person. It's important to take precautions to prevent the spread of the disease.",
            "How is meningitis treated?",
            "Meningitis is typically treated with antibiotics and sometimes antiviral medications. It's important to get treated as soon as possible to prevent complications.",
            "Can meningitis be prevented?"
        ],
        "knowledge": "Meningitis Meningitis  These occur in about 15% of survivors.  Some of the hearing loss may be reversible.  In adults, 66% of all cases emerge without disability.  The main problems are deafness  and cognitive impairment . Tuberculous meningitis in children continues to be associated with a significant risk of death even with treatment , and a significant proportion of the surviving children have ongoing neurological problems.  Just over a third of all cases survives with no problems. Although meningitis is a notifiable disease in many countries, the exact incidence rate is unknown Meningitis Meningitis",
        "response": "There are several ways to prevent meningitis, including getting vaccinated, practicing good hygiene, and avoiding close contact with infected individuals."
    },
    {
        "dialog": [
            "Hi, Medi. I recently recovered from meningitis. Can you give me some advice on how to take care of myself?",
            "Of course. I am happy to help. How are you feeling now?",
            "I am feeling better, but I am worried about any long-term effects of the disease.",
            "It's normal to feel worried after such a serious illness. I recommend that you eat a healthy diet, get plenty of rest, and exercise regularly to help your body recover.",
            "Are there any specific exercises that I should do?",
            "Yes, there are several exercises that can help improve cognitive function, such as yoga and meditation. You can also try aerobic exercises, such as walking, running, or swimming.",
            "What about my diet?",
            "It's important to eat a balanced diet that is rich in vitamins and nutrients to help your body recover. You should also avoid processed foods and sugary drinks.",
            "Thank you for your advice. How long will it take for me to fully recover?"
        ],
        "knowledge": "Meningitis Meningitis  These occur in about 15% of survivors.  Some of the hearing loss may be reversible.  In adults, 66% of all cases emerge without disability.  The main problems are deafness  and cognitive impairment . Tuberculous meningitis in children continues to be associated with a significant risk of death even with treatment , and a significant proportion of the surviving children have ongoing neurological problems.  Just over a third of all cases survives with no problems. Although meningitis is a notifiable disease in many countries, the exact incidence rate is unknown Meningitis Meningitis",
        "response": "It depends on the severity of the meningitis and individual factors, but it can take several weeks to several months to fully recover from the disease."
    },
    {
        "dialog": [
            "Hello, Medi. I think I may have meningitis. What should I do?",
            "Hi there. What are your symptoms?",
            "I have a severe headache, fever, and a stiff neck. ",
            "Based on your symptoms, it's best to see a doctor immediately. ",
            "What are the chances I will survive from meningitis?",
            "Although meningitis can be fatal, you have a good chance of survival if it's diagnosed early.",
            "What are the most common problems or complications with meningitis?",
            "The most common complications are deafness and cognitive impairment",
            "What can I do to prevent meningitis?"
        ],
        "knowledge": "Meningitis Meningitis  These occur in about 15% of survivors.  Some of the hearing loss may be reversible.  In adults, 66% of all cases emerge without disability.  The main problems are deafness  and cognitive impairment . Tuberculous meningitis in children continues to be associated with a significant risk of death even with treatment , and a significant proportion of the surviving children have ongoing neurological problems.  Just over a third of all cases survives with no problems. Although meningitis is a notifiable disease in many countries, the exact incidence rate is unknown Meningitis Meningitis",
        "response": "Vaccines are the best way to prevent meningitis, especially if you are at higher risk like college students or travelers to certain areas, and avoid contact with infected people."
    },
    {
        "dialog": [
            "Hello, Medi. I want to know more about meningitis.",
            "Sure, what would you like to know?",
            "I heard that meningitis can lead to deafness and cognitive problems. Is that true?",
            "Yes, meningitis can cause both hearing loss and cognitive impairment in some cases.",
            "What is the difference between viral and bacterial meningitis?",
            "Bacterial meningitis is more severe and can be life-threatening, while viral meningitis is usually less severe and goes away on its own.",
            "Is meningitis contagious?",
            "Yes, meningitis can be contagious and spread through close contact with an infected person.",
            "How is meningitis treated?"
        ],
        "knowledge": "Meningitis Meningitis  These occur in about 15% of survivors.  Some of the hearing loss may be reversible.  In adults, 66% of all cases emerge without disability.  The main problems are deafness  and cognitive impairment . Tuberculous meningitis in children continues to be associated with a significant risk of death even with treatment , and a significant proportion of the surviving children have ongoing neurological problems.  Just over a third of all cases survives with no problems. Although meningitis is a notifiable disease in many countries, the exact incidence rate is unknown Meningitis Meningitis",
        "response": "The treatment for meningitis depends on the cause, with bacterial meningitis requiring aggressive treatment with antibiotics, while viral meningitis usually goes away on its own and is treated with supportive care."
    },
    {
        "dialog": [
            "Hello, Medi. I just recovered from meningitis. What should I do now?",
            "Good to know you have recovered. You should take care of yourself and get plenty of rest.",
            "Are there any dietary restrictions that I should follow?",
            "No specific restrictions, but it's important to eat a balanced diet with plenty of fruits and vegetables to help your body recover.",
            "Can I exercise now?",
            "It's important to start with light exercise and gradually increase intensity as your body recovers. Consult with your doctor before starting any exercise program.",
            "Will I have any long-term complications?",
            "It's possible to have long-term complications like hearing loss or cognitive impairment, but not everyone experiences these. It's best to see a doctor for regular follow-ups.",
            "How can I prevent getting meningitis again?"
        ],
        "knowledge": "Meningitis Meningitis  These occur in about 15% of survivors.  Some of the hearing loss may be reversible.  In adults, 66% of all cases emerge without disability.  The main problems are deafness  and cognitive impairment . Tuberculous meningitis in children continues to be associated with a significant risk of death even with treatment , and a significant proportion of the surviving children have ongoing neurological problems.  Just over a third of all cases survives with no problems. Although meningitis is a notifiable disease in many countries, the exact incidence rate is unknown Meningitis Meningitis",
        "response": "Getting vaccinated is the best way to prevent meningitis, especially if you are at higher risk like college students or travelers to certain areas, and avoid close contact with infected people."
    }
]