[
    {
        "dialog": [
            "Hello Medi, I have some symptoms and I need help.",
            "Sure, I am here to assist you. Can you tell me your symptoms?",
            "I feel tired all the time, I have a loss of appetite and I experience pain in my stomach.",
            "I see. How long have you experienced these symptoms?",
            "I have been experiencing these symptoms for several weeks now.",
            "Based on your symptoms, you may be suffering from hepatitis. I recommend you to see a doctor immediately and get tested.",
            "What is hepatitis and how can I prevent it?",
            "Hepatitis is a liver disease and can be caused by a viral infection. You can prevent it by not sharing needles, having protected sex, and avoiding contaminated food and water.",
            "Thank you for your help, Medi."
        ],
        "knowledge": "Hepatitis Hepatitis A 2010 systematic review and meta-analysis found that Lamivudine initiated early in the third trimester also significantly reduced mother-to-child transmission of HBV, without any known adverse effects. The ACOG states that the evidence available does not suggest any particular mode of delivery  is better at reducing vertical transmission in mothers with HBV. The WHO and CDC recommend that neonates born to mothers with HBV should receive hepatitis B immune globulin  as well as the HBV vaccine within 12 hours of birth.  For infants who have received HBIG and the HBV vaccine, breastfeeding is safe. Estimates of the rate of HCV vertical transmission range from 2–8%; a 2014 systematic review and meta-analysis found the risk to be 5.8% in HCV-positive, HIV-negative women.  The same study found the risk of vertical transmission to be 10 Hepatitis Hepatitis",
        "response": "You're welcome. Don't forget to get tested and see a doctor as soon as possible."
    },
    {
        "dialog": [
            "Hello Medi, can you explain to me about hepatitis?",
            "Sure, hepatitis is a liver disease that can be caused by a viral infection. There are five types of hepatitis viruses: A, B, C, D, and E.",
            "How can we prevent hepatitis?",
            "You can prevent hepatitis by practicing good hygiene, not sharing needles, using protection during sex, and avoiding contaminated food and water.",
            "Can hepatitis be cured?",
            "It depends on the type of hepatitis. Some types can be cured, while others can only be managed with treatment.",
            "What are the symptoms of hepatitis?",
            "The symptoms of hepatitis can vary depending on the type and severity of the virus. Common symptoms include fatigue, nausea, vomiting, loss of appetite, and abdominal pain.",
            "Thank you for your explanation, Medi."
        ],
        "knowledge": "Hepatitis Hepatitis A 2010 systematic review and meta-analysis found that Lamivudine initiated early in the third trimester also significantly reduced mother-to-child transmission of HBV, without any known adverse effects. The ACOG states that the evidence available does not suggest any particular mode of delivery  is better at reducing vertical transmission in mothers with HBV. The WHO and CDC recommend that neonates born to mothers with HBV should receive hepatitis B immune globulin  as well as the HBV vaccine within 12 hours of birth.  For infants who have received HBIG and the HBV vaccine, breastfeeding is safe. Estimates of the rate of HCV vertical transmission range from 2–8%; a 2014 systematic review and meta-analysis found the risk to be 5.8% in HCV-positive, HIV-negative women.  The same study found the risk of vertical transmission to be 10 Hepatitis Hepatitis",
        "response": "You're welcome. Don't hesitate to ask me if you have any other questions."
    },
    {
        "dialog": [
            "Hello Medi, I just had a medical procedure and I need some advice.",
            "Of course, I am here to help you. What kind of procedure did you have?",
            "I had a liver transplant surgery.",
            "After a liver transplant, it is important to maintain a healthy lifestyle and take your medications as prescribed by your doctor. You should also avoid certain foods that may be harmful to your new liver.",
            "What kind of foods should I avoid?",
            "You should avoid alcohol, raw or undercooked seafood, and grapefruit or grapefruit juice. You should also limit your intake of sodium, sugar, and fat.",
            "Are there any physical activities that I should avoid?",
            "Yes, you should avoid contact sports and activities that could cause injury to your abdomen. You should also avoid lifting heavy objects and performing strenuous activities.",
            "Thank you for your advice, Medi."
        ],
        "knowledge": "Hepatitis Hepatitis A 2010 systematic review and meta-analysis found that Lamivudine initiated early in the third trimester also significantly reduced mother-to-child transmission of HBV, without any known adverse effects. The ACOG states that the evidence available does not suggest any particular mode of delivery  is better at reducing vertical transmission in mothers with HBV. The WHO and CDC recommend that neonates born to mothers with HBV should receive hepatitis B immune globulin  as well as the HBV vaccine within 12 hours of birth.  For infants who have received HBIG and the HBV vaccine, breastfeeding is safe. Estimates of the rate of HCV vertical transmission range from 2–8%; a 2014 systematic review and meta-analysis found the risk to be 5.8% in HCV-positive, HIV-negative women.  The same study found the risk of vertical transmission to be 10 Hepatitis Hepatitis",
        "response": "You're welcome. Good luck with your recovery."
    },
    {
        "dialog": [
            "Hi Medi, I have some symptoms and need your advice",
            "Sure, what symptoms are you experiencing?",
            "I have been having a fever for the past few days and feel weak",
            "Have you noticed any other symptoms like cough or sore throat?",
            "Yes, I have a cough and sore throat as well",
            "Based on your symptoms, it seems like you may have the flu",
            "What should I do now, Medi?",
            "You should rest and drink plenty of fluids. If your symptoms persist, consult a doctor",
            "Thanks for your advice"
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "Based on your symptoms, it seems like you may have the flu"
    },
    {
        "dialog": [
            "Hello Medi, I have a question about hepatitis B",
            "Sure, what would you like to know?",
            "Can hepatitis B be transmitted from mother to child?",
            "Yes, hepatitis B can be transmitted from mother to child during birth",
            "Is there any way to prevent this transmission?",
            "Yes, neonates born to mothers with HBV should receive hepatitis B immune globulin as well as the HBV vaccine within 12 hours of birth",
            "Is it safe for a mother with hepatitis B to breastfeed her child?",
            "Yes, for infants who have received HBIG and the HBV vaccine, breastfeeding is safe",
            "Thank you for the information"
        ],
        "knowledge": "Hepatitis Hepatitis  A 2010 systematic review and meta-analysis found that Lamivudine initiated early in the third trimester also significantly reduced mother-to-child transmission of HBV, without any known adverse effects. The ACOG states that the evidence available does not suggest any particular mode of delivery  is better at reducing vertical transmission in mothers with HBV. The WHO and CDC recommend that neonates born to mothers with HBV should receive hepatitis B immune globulin  as well as the HBV vaccine within 12 hours of birth.  For infants who have received HBIG and the HBV vaccine, breastfeeding is safe. Estimates of the rate of HCV vertical transmission range from 2–8%; a 2014 systematic review and meta-analysis found the risk to be 5. 8% in HCV-positive, HIV-negative women.  The same study found the risk of vertical transmission to be 10 Hepatitis Hepatitis",
        "response": "Yes, neonates born to mothers with HBV should receive hepatitis B immune globulin as well as the HBV vaccine within 12 hours of birth and breastfeeding is safe for infants who have received HBIG and the HBV vaccine"
    },
    {
        "dialog": [
            "Hi Medi, I just had a medical procedure done",
            "Okay, what kind of procedure did you have?",
            "I had a surgery on my knee",
            "Okay, after surgery, it's important to follow a healthy diet and do physical therapy to aid in the healing process",
            "What kind of physical therapy should I do?",
            "You should do exercises to help improve the strength and flexibility of your knee, along with exercises to improve balance and coordination",
            "Are there any specific foods that I should avoid or include in my diet?",
            "Foods that are high in protein and vitamins like fruits and vegetables are good for you. You should avoid processed foods and foods high in sugar or saturated fat",
            "Thanks for your advice"
        ],
        "knowledge": "Knee Surgery Knee Surgery  After surgery, it's important to follow a healthy diet and do physical therapy to aid in the healing process.  Physical therapy should include exercises to help improve the strength and flexibility of the knee, along with exercises to improve balance and coordination.  A healthy diet should include foods that are high in protein and vitamins, like fruits and vegetables.  Processed foods and foods high in sugar or saturated fat should be avoided Knee Surgery Knee Surgery",
        "response": "You should do exercises to help improve the strength and flexibility of your knee, along with exercises to improve balance and coordination. Foods that are high in protein and vitamins like fruits and vegetables are good for you. You should avoid processed foods and foods high in sugar or saturated fat"
    },
    {
        "dialog": [
            "Hello Medi, I suspect that I have Hepatitis B",
            "I'm sorry to hear that, can you tell me your symptoms?",
            "I have yellowish eyes and skin and feel very tired",
            "These symptoms could indicate Hepatitis B. You should see a doctor for proper diagnosis",
            "Do you have any advice for me?",
            "You should rest and avoid alcohol and drugs",
            "Thank you. Can Hepatitis B infect a newborn child?",
            "Yes, it can. Neonates born to mothers with HBV should receive hepatitis B immune globulin as well as the HBV vaccine within 12 hours of birth.",
            "Good to know. Thank you for your help."
        ],
        "knowledge": "Hepatitis Hepatitis  A 2010 systematic review and meta-analysis found that Lamivudine initiated early in the third trimester also significantly reduced mother-to-child transmission of HBV, without any known adverse effects. The ACOG states that the evidence available does not suggest any particular mode of delivery  is better at reducing vertical transmission in mothers with HBV. The WHO and CDC recommend that neonates born to mothers with HBV should receive hepatitis B immune globulin  as well as the HBV vaccine within 12 hours of birth.  For infants who have received HBIG and the HBV vaccine, breastfeeding is safe. Estimates of the rate of HCV vertical transmission range from 2–8%; a 2014 systematic review and meta-analysis found the risk to be 5.8% in HCV-positive, HIV-negative women.  The same study found the risk of vertical transmission to be 10 Hepatitis Hepatitis",
        "response": "You're welcome. Do you have any other questions regarding Hepatitis B?"
    },
    {
        "dialog": [
            "Hello Medi, can you explain what is Hepatitis A?",
            "Sure, Hepatitis A is a liver disease caused by the Hepatitis A virus",
            "How is it transmitted?",
            "It is usually transmitted through contaminated food or water or contact with an infected person",
            "What are the symptoms of Hepatitis A?",
            "The common symptoms are fatigue, nausea, abdominal pain, loss of appetite and fever",
            "Is Hepatitis A treatable?",
            "There is no specific treatment, but most people recover fully with rest and adequate nutrition",
            "Thank you for the explanation."
        ],
        "knowledge": "Hepatitis Hepatitis  A is a liver disease caused by the Hepatitis A virus. It is usually transmitted through contaminated food or water or contact with an infected person. The common symptoms are fatigue, nausea, abdominal pain, loss of appetite, and fever. There is no specific treatment, but most people recover fully with rest and adequate nutrition. Hepatitis A can be prevented by vaccination and good hygiene practices Hepatitis Hepatitis",
        "response": "You're welcome. Do you have any other questions regarding Hepatitis A?"
    },
    {
        "dialog": [
            "Hello Medi, I just had a liver biopsy. Can you give me some advice on my lifestyle?",
            "Sure. How do you feel after the procedure?",
            "I feel a bit sore and tired",
            "You should rest and avoid any strenuous activities for a few days",
            "What about my diet?",
            "You should avoid alcohol and fatty foods and eat more fruits and vegetables",
            "What kind of physical activities are safe for me?",
            "Low-impact exercises such as walking or swimming are safe, but you should consult with your doctor before starting any exercise program",
            "Thank you for your advice."
        ],
        "knowledge": "Hepatitis Hepatitis  A 2010 systematic review and meta-analysis found that Lamivudine initiated early in the third trimester also significantly reduced mother-to-child transmission of HBV, without any known adverse effects. The ACOG states that the evidence available does not suggest any particular mode of delivery  is better at reducing vertical transmission in mothers with HBV. The WHO and CDC recommend that neonates born to mothers with HBV should receive hepatitis B immune globulin  as well as the HBV vaccine within 12 hours of birth.  For infants who have received HBIG and the HBV vaccine, breastfeeding is safe. Estimates of the rate of HCV vertical transmission range from 2–8%; a 2014 systematic review and meta-analysis found the risk to be 5.8% in HCV-positive, HIV-negative women.  The same study found the risk of vertical transmission to be 10 Hepatitis Hepatitis",
        "response": "You're welcome. Do you have any other questions regarding lifestyle changes after liver biopsy?"
    },
    {
        "dialog": [
            "Hello Medi, I am worried about Hepatitis.",
            "Sure, I am here to help. Can you tell me about your symptoms?",
            "I don't have any symptoms actually. I just want to know more about it.",
            "Hepatitis is an inflammation of the liver. The most common types are A, B, and C.",
            "How do you get Hepatitis?",
            "Hepatitis A is usually spread through contaminated food or water, Hepatitis B and C are usually spread through contact with infected blood or body fluids.",
            "Is there a vaccine for Hepatitis?",
            "Yes, there are vaccines for Hepatitis A and B. You can ask your doctor about it.",
            "Thank you, Medi. Can you tell me more about Hepatitis B?"
        ],
        "knowledge": "Hepatitis Hepatitis  A 2010 systematic review and meta-analysis found that Lamivudine initiated early in the third trimester also significantly reduced mother-to-child transmission of HBV, without any known adverse effects. The ACOG states that the evidence available does not suggest any particular mode of delivery is better at reducing vertical transmission in mothers with HBV. The WHO and CDC recommend that neonates born to mothers with HBV should receive hepatitis B immune globulin  as well as the HBV vaccine within 12 hours of birth.  For infants who have received HBIG and the HBV vaccine, breastfeeding is safe. Estimates of the rate of HCV vertical transmission range from 2–8%; a 2014 systematic review and meta-analysis found the risk to be 5.8% in HCV-positive, HIV-negative women.  The same study found the risk of vertical transmission to be 10 Hepatitis Hepatitis.",
        "response": "Hepatitis B is usually spread through contact with infected blood or body fluids. There are vaccines for it and neonates born to mothers with HBV should receive hepatitis B immune globulin as well as the HBV vaccine within 12 hours of birth."
    },
    {
        "dialog": [
            "Hey Medi, I was recently diagnosed with Hepatitis B.",
            "I'm sorry to hear that. What questions do you have?",
            "What are some lifestyle changes I can make to manage it?",
            "You should avoid alcohol and drugs that can damage your liver. Also, maintain a healthy and balanced diet.",
            "Can I still go to work?",
            "Yes, you can still go to work but you should inform your employer about your condition so they can take necessary precautions.",
            "Will I be contagious to others?",
            "Yes, Hepatitis B is contagious. You should avoid sexual contact and use protection to prevent spreading it to others.",
            "Thank you for the information, Medi."
        ],
        "knowledge": "Hepatitis Hepatitis  A 2010 systematic review and meta-analysis found that Lamivudine initiated early in the third trimester also significantly reduced mother-to-child transmission of HBV, without any known adverse effects. The ACOG states that the evidence available does not suggest any particular mode of delivery is better at reducing vertical transmission in mothers with HBV. The WHO and CDC recommend that neonates born to mothers with HBV should receive hepatitis B immune globulin  as well as the HBV vaccine within 12 hours of birth.  For infants who have received HBIG and the HBV vaccine, breastfeeding is safe. Estimates of the rate of HCV vertical transmission range from 2–8%; a 2014 systematic review and meta-analysis found the risk to be 5.8% in HCV-positive, HIV-negative women.  The same study found the risk of vertical transmission to be 10 Hepatitis Hepatitis.",
        "response": "You're welcome. Remember to avoid alcohol and drugs that can damage your liver, maintain a healthy and balanced diet and avoid sexual contact as Hepatitis B is contagious."
    },
    {
        "dialog": [
            "Hi Medi, I just had Hepatitis B vaccine. What should I do now?",
            "Great! You should take a rest and avoid any intense physical activity for the next 24 hours.",
            "Can I drink alcohol?",
            "It's better to avoid alcohol for the next 24 hours",
            "How long does it take for the vaccine to be effective?",
            "It takes at least 2 weeks after the second dose of the vaccine for your body to develop enough antibodies to protect against Hepatitis B.",
            "Can I still get infected even after being vaccinated?",
            "The vaccine is highly effective but there is still a small chance of getting infected.",
            "Thank you for your help, Medi."
        ],
        "knowledge": "Hepatitis Hepatitis  A 2010 systematic review and meta-analysis found that Lamivudine initiated early in the third trimester also significantly reduced mother-to-child transmission of HBV, without any known adverse effects. The ACOG states that the evidence available does not suggest any particular mode of delivery is better at reducing vertical transmission in mothers with HBV. The WHO and CDC recommend that neonates born to mothers with HBV should receive hepatitis B immune globulin as well as the HBV vaccine within 12 hours of birth.  For infants who have received HBIG and the HBV vaccine, breastfeeding is safe. Estimates of the rate of HCV vertical transmission range from 2–8%; a 2014 systematic review and meta-analysis found the risk to be 5.8% in HCV-positive, HIV-negative women.  The same study found the risk of vertical transmission to be 10 Hepatitis Hepatitis.",
        "response": "You're welcome. Remember to take a rest and avoid any intense physical activity for the next 24 hours. The vaccine is highly effective but there is still a small chance of getting infected."
    },
    {
        "dialog": [
            "Hello Medi, I have some questions about Hepatitis.",
            "Sure, I am here to help. What do you want to know?",
            "What are the ways that we can get Hepatitis?",
            "There are different types of Hepatitis (A, B, C, D, E) and each has its own way of transmission. For example, Hepatitis A can be transmitted by food or water contaminated with fecal matter, while Hepatitis B and C can be transmitted by contact with infected blood or bodily fluids.",
            "Okay, I see. How can we prevent Hepatitis?",
            "The best way to prevent Hepatitis is to get vaccinated (for Hepatitis A and B), practice good hygiene, avoid sharing personal items such as razors and toothbrushes, and practice safe sex.",
            "I understand. If someone has Hepatitis, what should they do?",
            "It depends on the type of Hepatitis. They should see a doctor for proper diagnosis and treatment. Treatment may include antiviral medication, rest, and avoiding alcohol and certain medications that can be harmful to the liver.",
            "Thank you, Medi. Can you provide me with more information about Hepatitis B vaccine?"
        ],
        "knowledge": "Hepatitis Hepatitis  A 2010 systematic review and meta-analysis found that Lamivudine initiated early in the third trimester also significantly reduced mother-to-child transmission of HBV, without any known adverse effects. The ACOG states that the evidence available does not suggest any particular mode of delivery  is better at reducing vertical transmission in mothers with HBV. The WHO and CDC recommend that neonates born to mothers with HBV should receive hepatitis B immune globulin  as well as the HBV vaccine within 12 hours of birth.  For infants who have received HBIG and the HBV vaccine, breastfeeding is safe. Estimates of the rate of HCV vertical transmission range from 2–8%; a 2014 systematic review and meta-analysis found the risk to be 5. 8% in HCV-positive, HIV-negative women.  The same study found the risk of vertical transmission to be 10 Hepatitis Hepatitis",
        "response": "The Hepatitis B vaccine is recommended by the WHO and CDC for neonates born to mothers with HBV. The vaccine and hepatitis B immune globulin should be given to infants within 12 hours of birth to prevent vertical transmission of the virus. Breastfeeding is safe for infants who have received the vaccine and immune globulin."
    },
    {
        "dialog": [
            "Hello Medi, I just had a medical procedure and I am not sure what I should do now.",
            "Hello. What kind of procedure did you have?",
            "I had an endoscopy. What should I do now in terms of my diet and exercise?",
            "After an endoscopy, it is recommended to avoid eating or drinking anything for a few hours until the effects of the anesthesia wear off. After that, you can resume your normal diet and exercise routine unless your doctor advises otherwise.",
            "That's good to know. Are there any foods I should avoid?",
            "Your doctor may recommend avoiding certain foods or drinks for a short period of time after the procedure, such as spicy foods or alcohol. This is to give your body time to heal and avoid any irritation or discomfort.",
            "I see. What about physical activity? Should I take it easy?",
            "It is generally safe to resume your normal physical activity after an endoscopy. However, you may want to avoid any strenuous activity or heavy lifting for a few days to give your body time to recover.",
            "Thank you, Medi. Is there anything else I should know?"
        ],
        "knowledge": "No specific knowledge required for this dialogue.",
        "response": "No response needed."
    },
    {
        "dialog": [
            "Hi, Medi. I have been diagnosed with Hepatitis B. What should I do now?",
            "I'm sorry to hear that. The first step is to see a doctor for proper diagnosis and treatment. Your doctor may recommend antiviral medication, rest, and avoiding alcohol and certain medications that can be harmful to the liver.",
            "Okay, I will do that. What about my diet and lifestyle?",
            "It is important to maintain a healthy diet and lifestyle to support your overall health and liver function. This may include avoiding fatty or fried foods, reducing your sugar intake, and incorporating more fruits and vegetables into your diet. Regular exercise can also be beneficial.",
            "That makes sense. What about my family and friends? Can they get Hepatitis B from me?",
            "Hepatitis B can be transmitted through contact with infected blood or bodily fluids, so it is important to take precautions to avoid spreading the virus. This may include using condoms during sex, avoiding sharing personal items such as razors and toothbrushes, and not sharing needles or other injection equipment.",
            "Thanks for the information, Medi. Is there anything else I should know?",
            "Just be sure to follow any specific instructions or recommendations provided by your doctor, and don't hesitate to reach out if you have any questions or concerns.",
            "I will do that. Thanks again, Medi."
        ],
        "knowledge": "Hepatitis Hepatitis  A 2010 systematic review and meta-analysis found that Lamivudine initiated early in the third trimester also significantly reduced mother-to-child transmission of HBV, without any known adverse effects. The ACOG states that the evidence available does not suggest any particular mode of delivery  is better at reducing vertical transmission in mothers with HBV. The WHO and CDC recommend that neonates born to mothers with HBV should receive hepatitis B immune globulin  as well as the HBV vaccine within 12 hours of birth.  For infants who have received HBIG and the HBV vaccine, breastfeeding is safe. Estimates of the rate of HCV vertical transmission range from 2–8%; a 2014 systematic review and meta-analysis found the risk to be 5. 8% in HCV-positive, HIV-negative women.  The same study found the risk of vertical transmission to be 10 Hepatitis Hepatitis",
        "response": "Just be sure to follow any specific instructions or recommendations provided by your doctor, and don't hesitate to reach out if you have any questions or concerns."
    },
    {
        "dialog": [
            "Hello, Medi. I think I might have hepatitis.",
            "Hi, what makes you think you have hepatitis?",
            "I have been experiencing fatigue, dark urine, and jaundice for a week.",
            "Those symptoms could indicate hepatitis. Have you been vaccinated against hepatitis B?",
            "I'm not sure, I don't remember.",
            "You should check your vaccination record to see if you've been vaccinated. ",
            "What should I do in case I haven't?",
            "You should get vaccinated as soon as possible and avoid alcohol and certain medications.",
            "What are the chances of transmitting hepatitis to my baby if I have it?"
        ],
        "knowledge": "Hepatitis Hepatitis  A 2010 systematic review and meta-analysis found that Lamivudine initiated early in the third trimester also significantly reduced mother-to-child transmission of HBV, without any known adverse effects. The ACOG states that the evidence available does not suggest any particular mode of delivery  is better at reducing vertical transmission in mothers with HBV. The WHO and CDC recommend that neonates born to mothers with HBV should receive hepatitis B immune globulin  as well as the HBV vaccine within 12 hours of birth.  For infants who have received HBIG and the HBV vaccine, breastfeeding is safe. Estimates of the rate of HCV vertical transmission range from 2–8%; a 2014 systematic review and meta-analysis found the risk to be 5. 8% in HCV-positive, HIV-negative women.  The same study found the risk of vertical transmission to be 10 Hepatitis Hepatitis",
        "response": "The risk of transmitting hepatitis to your baby depends on the type of hepatitis you have. If you have hepatitis B, there is a risk of transmission to your baby during childbirth. However, if you take the appropriate precautions, such as getting vaccinated and receiving hepatitis B immune globulin, the risk can be reduced."
    },
    {
        "dialog": [
            "Hi, Medi. Can you tell me more about mother-to-child transmission of hepatitis B?",
            "Certainly, mother-to-child transmission of hepatitis B can occur during childbirth.",
            "What can be done to prevent this transmission?",
            "The WHO and CDC recommend that neonates born to mothers with HBV should receive hepatitis B immune globulin as well as the HBV vaccine within 12 hours of birth. ",
            "What if the mother has not been vaccinated against hepatitis B?",
            "If the mother has not been vaccinated, she should receive the vaccine as soon as possible. ",
            "Is breastfeeding safe if the mother has hepatitis B?",
            "Yes, if the infant receives hepatitis B immune globulin and the HBV vaccine, breastfeeding is safe.",
            "What are the symptoms of hepatitis A?"
        ],
        "knowledge": "Hepatitis Hepatitis  A 2010 systematic review and meta-analysis found that Lamivudine initiated early in the third trimester also significantly reduced mother-to-child transmission of HBV, without any known adverse effects. The ACOG states that the evidence available does not suggest any particular mode of delivery  is better at reducing vertical transmission in mothers with HBV. The WHO and CDC recommend that neonates born to mothers with HBV should receive hepatitis B immune globulin  as well as the HBV vaccine within 12 hours of birth.  For infants who have received HBIG and the HBV vaccine, breastfeeding is safe. Estimates of the rate of HCV vertical transmission range from 2–8%; a 2014 systematic review and meta-analysis found the risk to be 5. 8% in HCV-positive, HIV-negative women.  The same study found the risk of vertical transmission to be 10 Hepatitis Hepatitis",
        "response": "The symptoms of hepatitis A include fever, fatigue, loss of appetite, nausea, vomiting, abdominal pain, dark urine, and jaundice."
    },
    {
        "dialog": [
            "Hi, Medi. I recently had a liver biopsy. Can you provide some advice on how to take care of myself after the procedure?",
            "Sure, after a liver biopsy, it is important to rest for the remainder of the day.",
            "What about the following days?",
            "For the next few days, you should avoid heavy lifting, strenuous activity, and contact sports.",
            "What about my diet?",
            "It's best to avoid fatty and spicy foods for a few days after the biopsy.",
            "Can I take medication?",
            "You should avoid taking any blood-thinning medications, such as aspirin or ibuprofen, for a few days. ",
            "When can I resume my normal activities?"
        ],
        "knowledge": "Hepatitis Hepatitis  A 2010 systematic review and meta-analysis found that Lamivudine initiated early in the third trimester also significantly reduced mother-to-child transmission of HBV, without any known adverse effects. The ACOG states that the evidence available does not suggest any particular mode of delivery  is better at reducing vertical transmission in mothers with HBV. The WHO and CDC recommend that neonates born to mothers with HBV should receive hepatitis B immune globulin  as well as the HBV vaccine within 12 hours of birth.  For infants who have received HBIG and the HBV vaccine, breastfeeding is safe. Estimates of the rate of HCV vertical transmission range from 2–8%; a 2014 systematic review and meta-analysis found the risk to be 5. 8% in HCV-positive, HIV-negative women.  The same study found the risk of vertical transmission to be 10 Hepatitis Hepatitis",
        "response": "You can usually resume your normal activities within a few days after the biopsy, but it's best to ask your doctor for specific instructions based on the results of the biopsy and your overall health."
    },
    {
        "dialog": [
            "Hello Medi, I have some symptoms of hepatitis, can you help me?",
            "Of course, let me know your symptoms",
            "I feel very tired during the day, my urine is dark, and my skin has turned yellow",
            "Based on your symptoms, it seems you have hepatitis. You should see a doctor for further testing",
            "What is hepatitis, Medi?",
            "Hepatitis is the inflammation of the liver. It can be caused by viruses or other factors",
            "How is it treated?",
            "The treatment depends on the cause of hepatitis. Some types of hepatitis can be cured, while others can only be managed with medication and lifestyle changes",
            "Thank you for your help, Medi."
        ],
        "knowledge": "Hepatitis Hepatitis  A 2010 systematic review and meta-analysis found that Lamivudine initiated early in the third trimester also significantly reduced mother-to-child transmission of HBV, without any known adverse effects. The ACOG states that the evidence available does not suggest any particular mode of delivery  is better at reducing vertical transmission in mothers with HBV. The WHO and CDC recommend that neonates born to mothers with HBV should receive hepatitis B immune globulin  as well as the HBV vaccine within 12 hours of birth.  For infants who have received HBIG and the HBV vaccine, breastfeeding is safe. Estimates of the rate of HCV vertical transmission range from 2–8%; a 2014 systematic review and meta-analysis found the risk to be 5. 8% in HCV-positive, HIV-negative women.  The same study found the risk of vertical transmission to be 10 Hepatitis Hepatitis",
        "response": "You're welcome! Please see a doctor as soon as possible to confirm the diagnosis."
    },
    {
        "dialog": [
            "Hello Medi, what is the difference between Hepatitis A, B, and C?",
            "Hepatitis A, B, and C are all caused by different viruses that affect the liver",
            "Which one is the most serious?",
            "Hepatitis C is the most serious because it can cause long-term damage to the liver and lead to liver cancer or liver failure",
            "How are they transmitted?",
            "Hepatitis A is usually transmitted through contaminated food or water. Hepatitis B and C are transmitted through blood and other bodily fluids, such as shared needles or unprotected sex",
            "How can they be prevented?",
            "Hepatitis A and B can be prevented with a vaccine. Hepatitis C does not have a vaccine, but can be prevented by avoiding risky behaviors such as sharing needles or having unprotected sex",
            "Thank you for the explanation, Medi."
        ],
        "knowledge": "Hepatitis Hepatitis  A 2010 systematic review and meta-analysis found that Lamivudine initiated early in the third trimester also significantly reduced mother-to-child transmission of HBV, without any known adverse effects. The ACOG states that the evidence available does not suggest any particular mode of delivery  is better at reducing vertical transmission in mothers with HBV. The WHO and CDC recommend that neonates born to mothers with HBV should receive hepatitis B immune globulin  as well as the HBV vaccine within 12 hours of birth.  For infants who have received HBIG and the HBV vaccine, breastfeeding is safe. Estimates of the rate of HCV vertical transmission range from 2–8%; a 2014 systematic review and meta-analysis found the risk to be 5. 8% in HCV-positive, HIV-negative women.  The same study found the risk of vertical transmission to be 10 Hepatitis Hepatitis",
        "response": "You're welcome! Don't hesitate to ask if you have any more questions."
    },
    {
        "dialog": [
            "Hello Medi, I just had a medical procedure. What should I do now?",
            "It depends on what procedure you had. Can you tell me more about it?",
            "I had surgery to remove my gallbladder",
            "After gallbladder surgery, you should rest and avoid heavy lifting or strenuous exercise for a few weeks. You should also follow a low-fat diet to help your body adjust to the changes. Drink plenty of water and eat small, frequent meals throughout the day",
            "What kind of exercise is safe?",
            "Walking and light stretching are safe exercises after surgery. You should avoid any activities that put strain on your abdominal muscles",
            "What about pain medication?",
            "Your doctor will prescribe pain medication if necessary. Be sure to follow their instructions and don't take more than prescribed",
            "Thank you for the advice, Medi."
        ],
        "knowledge": "Hepatitis Hepatitis  A 2010 systematic review and meta-analysis found that Lamivudine initiated early in the third trimester also significantly reduced mother-to-child transmission of HBV, without any known adverse effects. The ACOG states that the evidence available does not suggest any particular mode of delivery  is better at reducing vertical transmission in mothers with HBV. The WHO and CDC recommend that neonates born to mothers with HBV should receive hepatitis B immune globulin  as well as the HBV vaccine within 12 hours of birth.  For infants who have received HBIG and the HBV vaccine, breastfeeding is safe. Estimates of the rate of HCV vertical transmission range from 2–8%; a 2014 systematic review and meta-analysis found the risk to be 5. 8% in HCV-positive, HIV-negative women.  The same study found the risk of vertical transmission to be 10 Hepatitis Hepatitis",
        "response": "You're welcome! Take care of yourself and don't hesitate to contact your doctor if you have any concerns."
    },
    {
        "dialog": [
            "Hello Medi, I have some symptoms related to hepatitis.",
            "I am here to help. Can you please tell me more about your symptoms?",
            "I have fatigue, fever, and abdominal pain. I am also experiencing dark urine and jaundice.",
            "Based on your symptoms, you may be experiencing hepatitis. I suggest you see a healthcare professional.",
            "Is there anything I can do now to alleviate the symptoms?",
            "You can get plenty of rest and eat small meals throughout the day. Avoid alcohol and take over-the-counter pain relievers such as acetaminophen.",
            "Thank you, Medi. Can you tell me more about how hepatitis can be transmitted?",
            "Sure, hepatitis can be transmitted through contaminated food and water, sharing needles, or having sex with an infected person.",
            "Got it. Is there any way to prevent hepatitis infection?"
        ],
        "knowledge": "Hepatitis Hepatitis A 2010 systematic review and meta-analysis found that Lamivudine initiated early in the third trimester also significantly reduced mother-to-child transmission of HBV, without any known adverse effects. The ACOG states that the evidence available does not suggest any particular mode of delivery  is better at reducing vertical transmission in mothers with HBV. The WHO and CDC recommend that neonates born to mothers with HBV should receive hepatitis B immune globulin  as well as the HBV vaccine within 12 hours of birth.  For infants who have received HBIG and the HBV vaccine, breastfeeding is safe. Estimates of the rate of HCV vertical transmission range from 2–8%; a 2014 systematic review and meta-analysis found the risk to be 5.8% in HCV-positive, HIV-negative women.  The same study found the risk of vertical transmission to be 10 Hepatitis Hepatitis",
        "response": "Yes, you can prevent hepatitis infection by getting vaccinated, practicing good hygiene, using condoms during sex, avoiding sharing needles, and being cautious when traveling to areas with high infection rates."
    },
    {
        "dialog": [
            "Hi Medi, I had hepatitis, and I'm wondering what I should eat during recovery.",
            "Good question. It's important to eat small, frequent meals that are high in nutrients and easy to digest.",
            "What specific foods should I focus on?",
            "I suggest you eat plenty of fruits and vegetables, lean protein such as chicken or fish, and complex carbohydrates like whole grains. Avoid processed foods, high-fat foods, and alcohol.",
            "What about drinks?",
            "It's important to stay hydrated, so drink plenty of water and other fluids. Avoid alcohol and sugary drinks.",
            "Thanks, Medi. What about physical activity during recovery?",
            "You should avoid strenuous physical activity but try to stay active with light exercise such as walking or yoga.",
            "Got it. How long will it take for me to recover from hepatitis?"
        ],
        "knowledge": "Hepatitis Hepatitis A 2010 systematic review and meta-analysis found that Lamivudine initiated early in the third trimester also significantly reduced mother-to-child transmission of HBV, without any known adverse effects. The ACOG states that the evidence available does not suggest any particular mode of delivery  is better at reducing vertical transmission in mothers with HBV. The WHO and CDC recommend that neonates born to mothers with HBV should receive hepatitis B immune globulin  as well as the HBV vaccine within 12 hours of birth.  For infants who have received HBIG and the HBV vaccine, breastfeeding is safe. Estimates of the rate of HCV vertical transmission range from 2–8%; a 2014 systematic review and meta-analysis found the risk to be 5.8% in HCV-positive, HIV-negative women.  The same study found the risk of vertical transmission to be 10 Hepatitis Hepatitis",
        "response": "The recovery time for hepatitis can vary, but it usually takes a few weeks to several months. It's important to follow your doctor's advice and take care of yourself to aid in the recovery process."
    },
    {
        "dialog": [
            "Hi Medi, I just had a hepatitis B vaccine. Do I need to take any special precautions?",
            "Congratulations on getting vaccinated! It's important to continue practicing good hygiene and avoiding contact with contaminated blood or bodily fluids.",
            "Should I avoid sharing personal items?",
            "Yes, it's a good idea to avoid sharing personal items such as razors or toothbrushes with others. You should also be cautious when getting tattoos or piercings.",
            "What if I come into contact with someone who has hepatitis B?",
            "If you come into contact with someone who has hepatitis B, it's important to seek medical advice right away. Your doctor may recommend post-exposure prophylaxis to help prevent infection.",
            "Thanks, Medi. Is there anything else I should know?",
            "Just remember to continue practicing good hygiene, avoid sharing personal items, and let your doctor know if you have any symptoms of hepatitis B.",
            "Got it. Thank you for your help, Medi."
        ],
        "knowledge": "Hepatitis Hepatitis A 2010 systematic review and meta-analysis found that Lamivudine initiated early in the third trimester also significantly reduced mother-to-child transmission of HBV, without any known adverse effects. The ACOG states that the evidence available does not suggest any particular mode of delivery  is better at reducing vertical transmission in mothers with HBV. The WHO and CDC recommend that neonates born to mothers with HBV should receive hepatitis B immune globulin  as well as the HBV vaccine within 12 hours of birth.  For infants who have received HBIG and the HBV vaccine, breastfeeding is safe. Estimates of the rate of HCV vertical transmission range from 2–8%; a 2014 systematic review and meta-analysis found the risk to be 5.8% in HCV-positive, HIV-negative women.  The same study found the risk of vertical transmission to be 10 Hepatitis Hepatitis",
        "response": "You're welcome. Please don't hesitate to reach out if you have any further questions or concerns about hepatitis B or your health in general."
    },
    {
        "dialog": [
            "Hi Medi, I have some symptoms and I need your help.",
            "Sure, tell me what is troubling you.",
            "I feel fatigue, nausea, and my urine is dark.",
            "These symptoms are characteristic of hepatitis. You should see a doctor soon.",
            "What kind of tests should I have?",
            "Blood tests can diagnose the type and severity of hepatitis.",
            "What is the best way to treat it?",
            "Treatment depends on the type of hepatitis, but antiviral medications can help.",
            "Thanks, Medi. How can I prevent it?"
        ],
        "knowledge": "Hepatitis Hepatitis A 2010 systematic review and meta-analysis found that Lamivudine initiated early in the third trimester also significantly reduced mother-to-child transmission of HBV, without any known adverse effects. The ACOG states that the evidence available does not suggest any particular mode of delivery  is better at reducing vertical transmission in mothers with HBV. The WHO and CDC recommend that neonates born to mothers with HBV should receive hepatitis B immune globulin  as well as the HBV vaccine within 12 hours of birth.  For infants who have received HBIG and the HBV vaccine, breastfeeding is safe. Estimates of the rate of HCV vertical transmission range from 2–8%; a 2014 systematic review and meta-analysis found the risk to be 5. 8% in HCV-positive, HIV-negative women.  The same study found the risk of vertical transmission to be 10 Hepatitis Hepatitis",
        "response": "You can prevent hepatitis by being vaccinated, practicing good hygiene, and avoiding risky behaviors such as unprotected sex and sharing needles."
    },
    {
        "dialog": [
            "Hi, Medi. Can you tell me more about hepatitis?",
            "Of course, what would you like to know?",
            "How is hepatitis transmitted?",
            "Hepatitis can be transmitted through contaminated food or water, blood, or sexual contact.",
            "Is there a cure for hepatitis?",
            "There is no cure for hepatitis, but it can be managed with antiviral medications and lifestyle changes.",
            "What are the most common types of hepatitis?",
            "The most common types of hepatitis are A, B, and C.",
            "Thank you, Medi. How can I know if I have hepatitis?"
        ],
        "knowledge": "Hepatitis Hepatitis A 2010 systematic review and meta-analysis found that Lamivudine initiated early in the third trimester also significantly reduced mother-to-child transmission of HBV, without any known adverse effects. The ACOG states that the evidence available does not suggest any particular mode of delivery  is better at reducing vertical transmission in mothers with HBV. The WHO and CDC recommend that neonates born to mothers with HBV should receive hepatitis B immune globulin  as well as the HBV vaccine within 12 hours of birth.  For infants who have received HBIG and the HBV vaccine, breastfeeding is safe. Estimates of the rate of HCV vertical transmission range from 2–8%; a 2014 systematic review and meta-analysis found the risk to be 5. 8% in HCV-positive, HIV-negative women.  The same study found the risk of vertical transmission to be 10 Hepatitis Hepatitis",
        "response": "You can know if you have hepatitis through blood tests and other diagnostic procedures ordered by your doctor."
    },
    {
        "dialog": [
            "Hi Medi, I recently had a medical procedure and I need some advice.",
            "Sure, I'm here to help. What procedure did you have?",
            "I had a liver biopsy.",
            "After a liver biopsy, it is important to rest and avoid heavy lifting or strenuous activity for several days.",
            "What should I eat to help my liver heal?",
            "A healthy diet with a balance of fruits, vegetables, lean protein, and whole grains can help your liver heal.",
            "Can I drink alcohol after a liver biopsy?",
            "It is best to avoid alcohol for at least 48 hours after a liver biopsy, or as long as your doctor advises.",
            "Thanks, Medi. How long will it take for my liver to heal?"
        ],
        "knowledge": "Hepatitis Hepatitis A 2010 systematic review and meta-analysis found that Lamivudine initiated early in the third trimester also significantly reduced mother-to-child transmission of HBV, without any known adverse effects. The ACOG states that the evidence available does not suggest any particular mode of delivery  is better at reducing vertical transmission in mothers with HBV. The WHO and CDC recommend that neonates born to mothers with HBV should receive hepatitis B immune globulin  as well as the HBV vaccine within 12 hours of birth.  For infants who have received HBIG and the HBV vaccine, breastfeeding is safe. Estimates of the rate of HCV vertical transmission range from 2–8%; a 2014 systematic review and meta-analysis found the risk to be 5. 8% in HCV-positive, HIV-negative women.  The same study found the risk of vertical transmission to be 10 Hepatitis Hepatitis",
        "response": "The healing time for a liver biopsy varies, but it often takes a few days to a week for the liver to recover fully."
    }
]