[
    {
        "dialog": [
            "Hi Medi, I've been experiencing visual disturbances with zigzagging lines. What could it be?",
            "Those symptoms may indicate a condition called prolonged aura. It's when visual disturbances persist for more than 60 minutes.",
            "I see. The lines I see are black and white, sometimes with colors. Is that normal?",
            "Yes, it's not uncommon for some people to see colored lines during visual disturbances.",
            "Got it. I also noticed a loss of vision in parts of my visual field. Is that related?",
            "Yes, some individuals experience a condition called hemianopsia, which involves losing part of their field of vision.",
            "That's exactly what's happening to me. Thanks for explaining. One more thing, what causes these symptoms?",
            "The exact cause of migraines and auras is not known, but genetics and certain triggers are believed to play a role.",
            "I understand. Thanks for your help, Medi."
        ],
        "knowledge": "Migraine Migraine If any symptom remains after 60 minutes, the state is known as prolonged aura. Visual disturbances often consist of a scintillating scotoma. These typically start near the center of vision and then spread out to the sides with zigzagging lines which have been described as looking like fortifications or walls of a castle. Usually, the lines are in black and white, but some people also see colored lines. Some people lose part of their field of vision known as hemianopsia while others experience blurring. Sensory aura is the second most common type; they occur in 30–40% of people with auras. Often, a feeling of pins-and-needles begins on one side in the hand and arm and spreads to the nose–mouth area on the same side. Migraine Migraine",
        "response": "You're experiencing a prolonged aura, which can include visual disturbances with zigzagging lines. The loss of vision in parts of your visual field is also related to this condition. The exact cause of migraines and auras is not known, but genetics and certain triggers are believed to play a role."
    },
    {
        "dialog": [
            "Hello Medi, I've been having these visual disturbances with zigzagging lines. Can you tell me what it could be?",
            "Based on your description, it's possible that you're experiencing a scintillating scotoma, which is a visual aura associated with migraines.",
            "I see. The lines I see start near the center of my vision and then spread out to the sides. They look like walls of a castle. Is that normal?",
            "Yes, the zigzagging lines you're seeing are commonly described as fortifications or walls of a castle in migraine auras.",
            "Interesting. I also sometimes have a tingling sensation that starts in my hand and arm and spreads to my nose and mouth. What's that about?",
            "That sensation is known as pins-and-needles and is another type of sensory aura that can occur during migraines.",
            "I never knew these symptoms were related to migraines. Thanks for explaining, Medi.",
            "You're welcome! If you have any more questions, feel free to ask."
        ],
        "knowledge": "Migraine Migraine If any symptom remains after 60 minutes, the state is known as prolonged aura. Visual disturbances often consist of a scintillating scotoma. These typically start near the center of vision and then spread out to the sides with zigzagging lines which have been described as looking like fortifications or walls of a castle. Usually, the lines are in black and white, but some people also see colored lines. Some people lose part of their field of vision known as hemianopsia while others experience blurring. Sensory aura is the second most common type; they occur in 30–40% of people with auras. Often, a feeling of pins-and-needles begins on one side in the hand and arm and spreads to the nose–mouth area on the same side. Migraine Migraine",
        "response": "The visual disturbances you're experiencing with zigzagging lines are likely a scintillating scotoma, which is associated with migraines. The tingling sensation starting in your hand and arm and spreading to your nose and mouth is called pins-and-needles and can also occur during migraines."
    },
    {
        "dialog": [
            "Hey Medi, I've been having these visual disturbances lately. Can you help me figure out what's going on?",
            "Of course! Please describe the visual disturbances you're experiencing in more detail.",
            "Well, I see these zigzagging lines that start near the center of my vision and then spread out to the sides. What could it be?",
            "Based on your description, it's likely a scintillating scotoma, which is a visual aura associated with migraines.",
            "Interesting. Sometimes the lines I see are in black and white, but other times they have colors. Is that normal?",
            "Yes, it's not uncommon for some people to see colored lines during visual disturbances caused by migraines.",
            "I see. I also sometimes experience blurring and a loss of vision in parts of my visual field. Is that related?",
            "Yes, blurring and a loss of vision in parts of the visual field can occur during migraines with auras.",
            "Thanks for explaining, Medi. Can these symptoms be a sign of something serious?"
        ],
        "knowledge": "Migraine Migraine If any symptom remains after 60 minutes, the state is known as prolonged aura. Visual disturbances often consist of a scintillating scotoma. These typically start near the center of vision and then spread out to the sides with zigzagging lines which have been described as looking like fortifications or walls of a castle. Usually, the lines are in black and white, but some people also see colored lines. Some people lose part of their field of vision known as hemianopsia while others experience blurring. Sensory aura is the second most common type; they occur in 30–40% of people with auras. Often, a feeling of pins-and-needles begins on one side in the hand and arm and spreads to the nose–mouth area on the same side. Migraine Migraine",
        "response": "The visual disturbances you're experiencing, such as zigzagging lines, blurring, and a loss of vision in parts of your visual field, are likely associated with migraines. While migraines can be debilitating, they are generally not considered life-threatening. It's recommended to consult with a healthcare professional for a proper diagnosis."
    },
    {
        "dialog": [
            "Hi Medi, I've been experiencing visual disturbances and blurring. What could be causing this?",
            "Hello! Based on your symptoms, it could be a manifestation of a migraine aura.",
            "What exactly is a migraine aura?",
            "A migraine aura is a set of neurological symptoms that can occur before or during a migraine headache.",
            "Are there specific visual disturbances associated with a migraine aura?",
            "Yes, visual disturbances often include a scintillating scotoma, which starts near the center of vision and spreads with zigzagging lines.",
            "Is there anything I can do to relieve these symptoms?",
            "You can try resting in a quiet, dark room and taking over-the-counter pain relievers. If the symptoms persist, it's best to consult a healthcare professional.",
            "Should I be concerned if the symptoms last longer than 60 minutes?"
        ],
        "knowledge": "Migraine Migraine  If any symptom remains after 60 minutes, the state is known as prolonged aura. Visual disturbances often consist of a scintillating scotoma. These typically start near the center of vision and then spread out to the sides with zigzagging lines which have been described as looking like fortifications or walls of a castle. Usually the lines are in black and white but some people also see colored lines. Some people lose part of their field of vision known as hemianopsia while others experience blurring. Sensory aura are the second most common type; they occur in 30–40% of people with auras. Often a feeling of pins-and-needles begins on one side in the hand and arm and spreads to the nose–mouth area on the same side Migraine Migraine",
        "response": "If the symptoms last longer than 60 minutes, it is considered a prolonged aura and it's advisable to seek medical attention."
    },
    {
        "dialog": [
            "Hey Medi, I've been having a pins-and-needles sensation in my hand and arm that spreads to my nose and mouth. What could be causing this?",
            "Hello! Based on your symptoms, it could be a sensory aura associated with migraines.",
            "What exactly is a sensory aura?",
            "A sensory aura is a type of neurological symptom that can occur before or during a migraine headache.",
            "Are there any other common symptoms associated with sensory aura?",
            "Yes, it's common to experience a feeling of pins-and-needles that starts on one side in the hand and arm and spreads to the nose and mouth area on the same side.",
            "How can I manage these symptoms?",
            "Resting in a quiet, dark room and taking over-the-counter pain relievers can help alleviate the symptoms. If they persist or worsen, it's advisable to consult a healthcare professional.",
            "Is there anything else I should be aware of?"
        ],
        "knowledge": "Migraine Migraine  If any symptom remains after 60 minutes, the state is known as prolonged aura. Visual disturbances often consist of a scintillating scotoma. These typically start near the center of vision and then spread out to the sides with zigzagging lines which have been described as looking like fortifications or walls of a castle. Usually the lines are in black and white but some people also see colored lines. Some people lose part of their field of vision known as hemianopsia while others experience blurring. Sensory aura are the second most common type; they occur in 30–40% of people with auras. Often a feeling of pins-and-needles begins on one side in the hand and arm and spreads to the nose–mouth area on the same side Migraine Migraine",
        "response": "It's important to note that if the symptoms persist or worsen, it's advisable to consult a healthcare professional for a proper evaluation."
    },
    {
        "dialog": [
            "Hi Medi, I recently had a migraine with visual disturbances. Is there anything I can do to prevent future episodes?",
            "Hello! There are some measures you can take to potentially reduce the frequency or severity of migraines.",
            "Could you provide some examples?",
            "Maintaining a regular sleep schedule, managing stress levels, and avoiding triggers like certain foods or strong smells may help prevent migraines.",
            "Is there any medication that can help prevent migraines?",
            "Yes, there are medications available that can be prescribed by a healthcare professional for migraine prevention. It's best to discuss this option with your doctor.",
            "Are there any other lifestyle changes I should consider?",
            "Regular exercise, staying hydrated, and practicing relaxation techniques like deep breathing or meditation can also be beneficial in managing migraines.",
            "Will these measures completely eliminate migraines?"
        ],
        "knowledge": "Migraine Migraine  If any symptom remains after 60 minutes, the state is known as prolonged aura. Visual disturbances often consist of a scintillating scotoma. These typically start near the center of vision and then spread out to the sides with zigzagging lines which have been described as looking like fortifications or walls of a castle. Usually the lines are in black and white but some people also see colored lines. Some people lose part of their field of vision known as hemianopsia while others experience blurring. Sensory aura are the second most common type; they occur in 30–40% of people with auras. Often a feeling of pins-and-needles begins on one side in the hand and arm and spreads to the nose–mouth area on the same side Migraine Migraine",
        "response": "While these measures can help in managing migraines, they may not completely eliminate them. It's important to work closely with your healthcare professional to find the best approach for you."
    },
    {
        "dialog": [
            "Hey Medi, I've been experiencing visual disturbances with zigzagging lines. What could be causing this?",
            "Those visual disturbances with zigzagging lines are known as scintillating scotoma, which are common in migraines.",
            "Are there any other symptoms associated with migraines?",
            "Yes, migraines can also cause hemianopsia, where you lose part of your field of vision, and blurring as well.",
            "Is there anything I can do to relieve these symptoms?",
            "Resting in a quiet, dark room and applying a cold or warm compress to your head may help.",
            "Thanks for the advice, Medi. One last question, how long does a prolonged aura last?",
            "If any symptom remains after 60 minutes, it is considered a prolonged aura.",
            "Got it. Thanks for your help!"
        ],
        "knowledge": "Migraine Migraine If any symptom remains after 60 minutes, the state is known as prolonged aura. Visual disturbances often consist of a scintillating scotoma. These typically start near the center of vision and then spread out to the sides with zigzagging lines which have been described as looking like fortifications or walls of a castle. Usually, the lines are in black and white but some people also see colored lines. Some people lose part of their field of vision known as hemianopsia while others experience blurring. Sensory aura is the second most common type; they occur in 30–40% of people with auras. Often a feeling of pins-and-needles begins on one side in the hand and arm and spreads to the nose–mouth area on the same side Migraine Migraine",
        "response": "If any symptom remains after 60 minutes, it is considered a prolonged aura."
    },
    {
        "dialog": [
            "Hello, Medi. I've been having a scintillating scotoma and loss of appetite. Could it be related to migraines?",
            "Yes, scintillating scotoma is a common visual disturbance associated with migraines.",
            "What other symptoms can occur during migraines?",
            "During migraines, some people experience hemianopsia, where they lose part of their field of vision.",
            "Is there any way to manage these symptoms?",
            "Resting in a quiet, dark room and taking over-the-counter pain relievers can help alleviate the symptoms.",
            "Thanks for the advice, Medi. By the way, can migraines cause colored lines in vision?",
            "Yes, migraines can cause colored lines in addition to the typical black and white lines.",
            "That's good to know. Thanks for your help, Medi!"
        ],
        "knowledge": "Migraine Migraine If any symptom remains after 60 minutes, the state is known as prolonged aura. Visual disturbances often consist of a scintillating scotoma. These typically start near the center of vision and then spread out to the sides with zigzagging lines which have been described as looking like fortifications or walls of a castle. Usually, the lines are in black and white but some people also see colored lines. Some people lose part of their field of vision known as hemianopsia while others experience blurring. Sensory aura is the second most common type; they occur in 30–40% of people with auras. Often a feeling of pins-and-needles begins on one side in the hand and arm and spreads to the nose–mouth area on the same side Migraine Migraine",
        "response": "Yes, migraines can cause colored lines in addition to the typical black and white lines."
    },
    {
        "dialog": [
            "Hey Medi, I recently had a prolonged aura with pins-and-needles sensation. What should I do?",
            "If you experience a prolonged aura, it's important to rest in a quiet, dark room until the symptoms subside.",
            "Are there any other symptoms associated with prolonged aura?",
            "Yes, some people also experience pins-and-needles sensation starting from the hand and arm and spreading to the nose and mouth.",
            "Is there anything I can do to prevent these prolonged auras?",
            "Avoiding triggers like stress, certain foods, and lack of sleep can help prevent migraine attacks.",
            "Thanks for the advice, Medi. One more thing, can prolonged aura cause blurred vision?",
            "Yes, blurred vision is a common symptom that can occur during a prolonged aura.",
            "Good to know. Thanks for your assistance, Medi!"
        ],
        "knowledge": "Migraine Migraine If any symptom remains after 60 minutes, the state is known as prolonged aura. Visual disturbances often consist of a scintillating scotoma. These typically start near the center of vision and then spread out to the sides with zigzagging lines which have been described as looking like fortifications or walls of a castle. Usually, the lines are in black and white but some people also see colored lines. Some people lose part of their field of vision known as hemianopsia while others experience blurring. Sensory aura is the second most common type; they occur in 30–40% of people with auras. Often a feeling of pins-and-needles begins on one side in the hand and arm and spreads to the nose–mouth area on the same side Migraine Migraine",
        "response": "Yes, blurred vision is a common symptom that can occur during a prolonged aura."
    },
    {
        "dialog": [
            "Hi Medi, I've been experiencing visual disturbances and blurring. What could be causing this?",
            "Those symptoms could be related to migraine with aura. Do you also have any other symptoms?",
            "Yes, I've been having a scintillating scotoma with zigzagging lines. It's quite unsettling.",
            "Based on your symptoms, it's likely that you're experiencing a migraine aura. It's important to rest and avoid triggers.",
            "I see. How long should the symptoms last before I seek medical attention?",
            "If any symptom remains after 60 minutes, it's known as prolonged aura. If that happens, it's best to consult a healthcare professional.",
            "Thank you, Medi. I'll keep an eye on the duration of my symptoms.",
            "You're welcome! If you have any more questions or concerns, feel free to ask.",
            "Can prolonged aura lead to any complications?"
        ],
        "knowledge": "Migraine Migraine If any symptom remains after 60 minutes, the state is known as prolonged aura. Visual disturbances often consist of a scintillating scotoma. These typically start near the center of vision and then spread out to the sides with zigzagging lines which have been described as looking like fortifications or walls of a castle. Usually, the lines are in black and white but some people also see colored lines. Some people lose part of their field of vision known as hemianopsia while others experience blurring. Sensory aura is the second most common type; they occur in 30–40% of people with auras. Often a feeling of pins-and-needles begins on one side in the hand and arm and spreads to the nose–mouth area on the same side Migraine Migraine",
        "response": "Prolonged aura can sometimes lead to complications, so it's important to monitor your symptoms closely and seek medical attention if needed."
    },
    {
        "dialog": [
            "Hello, Medi. Can you explain what a scintillating scotoma is?",
            "Certainly! A scintillating scotoma is a visual disturbance often associated with migraines.",
            "How does it appear? Is it different for everyone?",
            "It typically starts near the center of vision and then spreads out to the sides. The lines are described as zigzagging, like fortifications or walls of a castle. While most people see black and white lines, some may also see colored lines.",
            "That's interesting. Can you experience other symptoms along with a scintillating scotoma?",
            "Yes, other common symptoms include blurred vision, loss of part of the field of vision (hemianopsia), and sensory aura like pins-and-needles sensations.",
            "Thank you, Medi. This clarifies things for me.",
            "You're welcome! If you have any more questions, feel free to ask.",
            "Does a scintillating scotoma always indicate a migraine?"
        ],
        "knowledge": "Migraine Migraine If any symptom remains after 60 minutes, the state is known as prolonged aura. Visual disturbances often consist of a scintillating scotoma. These typically start near the center of vision and then spread out to the sides with zigzagging lines which have been described as looking like fortifications or walls of a castle. Usually, the lines are in black and white but some people also see colored lines. Some people lose part of their field of vision known as hemianopsia while others experience blurring. Sensory aura is the second most common type; they occur in 30–40% of people with auras. Often a feeling of pins-and-needles begins on one side in the hand and arm and spreads to the nose–mouth area on the same side Migraine Migraine",
        "response": "No, a scintillating scotoma is commonly associated with migraines, but it's important to consider other factors and consult a healthcare professional for an accurate diagnosis."
    },
    {
        "dialog": [
            "Hi Medi, I recently had a migraine and I'm wondering what lifestyle changes can help prevent future episodes.",
            "Making certain lifestyle changes can indeed reduce the frequency and intensity of migraines.",
            "Could you give me some examples of these lifestyle changes?",
            "Of course! Maintaining a regular sleep schedule, managing stress, staying hydrated, and avoiding triggers like certain foods can be helpful.",
            "That's good to know. Are there any specific exercises or physical activities that can help?",
            "Engaging in regular aerobic exercise, such as brisk walking or swimming, can be beneficial. However, it's important to start slowly and listen to your body.",
            "Thanks for the advice, Medi. I'll incorporate these changes into my routine.",
            "You're welcome! Remember, if you have any concerns or questions, don't hesitate to reach out.",
            "Can you recommend any specific foods to avoid?"
        ],
        "knowledge": "Migraine Migraine If any symptom remains after 60 minutes, the state is known as prolonged aura. Visual disturbances often consist of a scintillating scotoma. These typically start near the center of vision and then spread out to the sides with zigzagging lines which have been described as looking like fortifications or walls of a castle. Usually, the lines are in black and white but some people also see colored lines. Some people lose part of their field of vision known as hemianopsia while others experience blurring. Sensory aura is the second most common type; they occur in 30–40% of people with auras. Often a feeling of pins-and-needles begins on one side in the hand and arm and spreads to the nose–mouth area on the same side Migraine Migraine",
        "response": "Certain foods can act as triggers for migraines, but the specific triggers vary from person to person. It's best to keep a diary to identify any potential food triggers for you."
    },
    {
        "dialog": [
            "Hi Medi, I've been experiencing visual disturbances with zigzagging lines. What could be the cause?",
            "Those visual disturbances are known as scintillating scotoma and are often associated with migraines.",
            "I see. Is there anything I can do to relieve the symptoms?",
            "Resting in a quiet, dark room and taking over-the-counter pain relievers like ibuprofen may help.",
            "Okay, thank you. What if the symptoms persist even after an hour?",
            "If the symptoms continue for more than 60 minutes, it's considered a prolonged aura. You should consult a doctor for further evaluation.",
            "Got it. I'll keep an eye on it. Thanks for your advice, Medi."
        ],
        "knowledge": "Migraine Migraine  If any symptom remains after 60 minutes, the state is known as prolonged aura. Visual disturbances often consist of a scintillating scotoma .  These typically start near the center of vision and then spread out to the sides with zigzagging lines which have been described as looking like fortifications or walls of a castle.  Usually the lines are in black and white but some people also see colored lines.  Some people lose part of their field of vision known as hemianopsia while others experience blurring. Sensory aura are the second most common type; they occur in 30–40% of people with auras.  Often a feeling of pins-and-needles begins on one side in the hand and arm and spreads to the nose–mouth area on the same side Migraine Migraine",
        "response": "If the symptoms persist for more than 60 minutes, it's considered a prolonged aura. You should consult a doctor for further evaluation."
    },
    {
        "dialog": [
            "Hello Medi, can you explain what a scintillating scotoma is?",
            "Certainly! A scintillating scotoma refers to visual disturbances with zigzagging lines that start near the center of vision and spread out to the sides.",
            "Do these lines have any specific colors?",
            "Usually, the lines are in black and white, but some people may also see colored lines during a scintillating scotoma.",
            "Interesting. Is this condition common?",
            "Scintillating scotoma is often associated with migraines and occurs in about 30-40% of people who experience migraines with auras.",
            "I see. Thank you for the explanation, Medi.",
            "You're welcome! If you have any more questions, feel free to ask."
        ],
        "knowledge": "Migraine Migraine  If any symptom remains after 60 minutes, the state is known as prolonged aura. Visual disturbances often consist of a scintillating scotoma .  These typically start near the center of vision and then spread out to the sides with zigzagging lines which have been described as looking like fortifications or walls of a castle.  Usually the lines are in black and white but some people also see colored lines.  Some people lose part of their field of vision known as hemianopsia while others experience blurring. Sensory aura are the second most common type; they occur in 30–40% of people with auras.  Often a feeling of pins-and-needles begins on one side in the hand and arm and spreads to the nose–mouth area on the same side Migraine Migraine",
        "response": "Scintillating scotoma refers to visual disturbances with zigzagging lines that start near the center of vision and spread out to the sides."
    },
    {
        "dialog": [
            "Hi Medi, I recently had a migraine and I'm wondering if there's anything I can do to prevent it.",
            "There are some lifestyle changes that may help prevent migraines, such as maintaining a regular sleep schedule and managing stress.",
            "Are there any dietary changes that could be beneficial?",
            "Some people find that avoiding trigger foods like caffeine, chocolate, and processed meats can help prevent migraines.",
            "Good to know. Is there any recommended physical exercise for migraine prevention?",
            "Regular aerobic exercises like walking or swimming can be beneficial for migraine prevention.",
            "That's helpful advice, Medi. Thank you!",
            "You're welcome! If you have any more questions or need further assistance, feel free to ask."
        ],
        "knowledge": "Migraine Migraine  If any symptom remains after 60 minutes, the state is known as prolonged aura. Visual disturbances often consist of a scintillating scotoma .  These typically start near the center of vision and then spread out to the sides with zigzagging lines which have been described as looking like fortifications or walls of a castle.  Usually the lines are in black and white but some people also see colored lines.  Some people lose part of their field of vision known as hemianopsia while others experience blurring. Sensory aura are the second most common type; they occur in 30–40% of people with auras.  Often a feeling of pins-and-needles begins on one side in the hand and arm and spreads to the nose–mouth area on the same side Migraine Migraine",
        "response": "Regular aerobic exercises like walking or swimming can be beneficial for migraine prevention."
    },
    {
        "dialog": [
            "I have this visual disturbance with zigzagging lines. What could it be?",
            "It sounds like you might be experiencing a scintillating scotoma, which is common in migraines.",
            "How long does this usually last?",
            "If any symptom remains after 60 minutes, it's known as prolonged aura.",
            "Is there anything I can do to relieve the symptoms?",
            "Resting in a quiet, dark room and applying a cold compress to your head might help.",
            "What if the symptoms persist?",
            "If the symptoms persist, it's best to consult a healthcare professional for further evaluation.",
            "What could be causing these visual disturbances?"
        ],
        "knowledge": "Migraine Migraine  If any symptom remains after 60 minutes, the state is known as prolonged aura. Visual disturbances often consist of a scintillating scotoma .  These typically start near the center of vision and then spread out to the sides with zigzagging lines which have been described as looking like fortifications or walls of a castle.  Usually the lines are in black and white but some people also see colored lines.  Some people lose part of their field of vision known as hemianopsia while others experience blurring. Sensory aura are the second most common type; they occur in 30–40% of people with auras.  Often a feeling of pins-and-needles begins on one side in the hand and arm and spreads to the nose–mouth area on the same side Migraine Migraine",
        "response": "The visual disturbances you're experiencing are likely due to a condition called migraine aura, which can manifest as scintillating scotoma with zigzagging lines."
    },
    {
        "dialog": [
            "I've been having pins-and-needles on one side of my body and it spreads to my nose and mouth. What could be causing this?",
            "The pins-and-needles sensation starting in the hand and arm and spreading to the nose and mouth is a sensory aura associated with migraines.",
            "Does this mean I have migraines?",
            "It's possible, especially if you've been experiencing other symptoms like visual disturbances or headaches.",
            "What can I do to manage these symptoms?",
            "If you're diagnosed with migraines, your healthcare provider can recommend medications and lifestyle changes to help manage the symptoms.",
            "Are there any home remedies I can try?",
            "Resting in a quiet, dark room and applying a cold compress to your head might provide some relief.",
            "What if the symptoms persist or worsen?"
        ],
        "knowledge": "Migraine Migraine  If any symptom remains after 60 minutes, the state is known as prolonged aura. Visual disturbances often consist of a scintillating scotoma .  These typically start near the center of vision and then spread out to the sides with zigzagging lines which have been described as looking like fortifications or walls of a castle.  Usually the lines are in black and white but some people also see colored lines.  Some people lose part of their field of vision known as hemianopsia while others experience blurring. Sensory aura are the second most common type; they occur in 30–40% of people with auras.  Often a feeling of pins-and-needles begins on one side in the hand and arm and spreads to the nose–mouth area on the same side Migraine Migraine",
        "response": "If the symptoms persist or worsen, it's important to consult a healthcare professional for a proper evaluation and guidance."
    },
    {
        "dialog": [
            "I've been experiencing blurred vision and losing part of my field of vision. What could be causing this?",
            "Blurred vision and loss of part of the field of vision can be symptoms of a visual aura associated with migraines.",
            "How long do these symptoms typically last?",
            "If any symptom remains after 60 minutes, it's known as prolonged aura.",
            "What can I do to manage these symptoms?",
            "Resting in a quiet, dark room and applying a cold compress to your head might help alleviate the symptoms.",
            "Should I be concerned about these symptoms?",
            "If the symptoms persist or worsen, it's advisable to consult a healthcare professional for further evaluation.",
            "Is there a way to prevent these symptoms from occurring?"
        ],
        "knowledge": "Migraine Migraine  If any symptom remains after 60 minutes, the state is known as prolonged aura. Visual disturbances often consist of a scintillating scotoma .  These typically start near the center of vision and then spread out to the sides with zigzagging lines which have been described as looking like fortifications or walls of a castle.  Usually the lines are in black and white but some people also see colored lines.  Some people lose part of their field of vision known as hemianopsia while others experience blurring. Sensory aura are the second most common type; they occur in 30–40% of people with auras.  Often a feeling of pins-and-needles begins on one side in the hand and arm and spreads to the nose–mouth area on the same side Migraine Migraine",
        "response": "Unfortunately, there is no guaranteed way to prevent the occurrence of these symptoms, but identifying triggers and making lifestyle changes might help reduce their frequency."
    },
    {
        "dialog": [
            "Hi Medi, I've been experiencing visual disturbances with zigzagging lines. What could be causing this?",
            "It's possible that you're experiencing a scintillating scotoma, which is common in migraines.",
            "Is there anything I can do to alleviate these symptoms?",
            "Resting in a dark, quiet room and avoiding triggers like bright lights and certain foods may help.",
            "That's helpful. How long should I wait before seeking medical attention if the symptoms persist?",
            "If any symptoms remain after 60 minutes, it's considered prolonged aura. You should consult a healthcare professional.",
            "I see. Thank you for the information, Medi. One last question: Are there any other visual disturbances associated with migraines?"
        ],
        "knowledge": "Migraine Migraine If any symptom remains after 60 minutes, the state is known as prolonged aura. Visual disturbances often consist of a scintillating scotoma. These typically start near the center of vision and then spread out to the sides with zigzagging lines which have been described as looking like fortifications or walls of a castle. Usually the lines are in black and white but some people also see colored lines. Some people lose part of their field of vision known as hemianopsia while others experience blurring. Sensory aura are the second most common type; they occur in 30–40% of people with auras. Often a feeling of pins-and-needles begins on one side in the hand and arm and spreads to the nose–mouth area on the same side Migraine Migraine",
        "response": "Yes, other visual disturbances associated with migraines include hemianopsia, where part of the field of vision is lost, and blurred vision."
    },
    {
        "dialog": [
            "Hello Medi, I've been having pins-and-needles sensations in my hand and arm. What could be causing this?",
            "Those sensations are known as sensory aura and can be associated with migraines.",
            "Is there anything I can do to relieve these sensations?",
            "Some people find relief by applying heat or cold to the affected area or practicing relaxation techniques.",
            "That's good to know. How long should I wait before seeking medical advice if the sensations persist?",
            "If the symptoms last longer than 60 minutes or worsen, it's advisable to consult a healthcare professional.",
            "I understand. Thank you for your guidance, Medi. One more question: Can sensory aura affect other parts of the body?",
            "Yes, sensory aura can start in the hand and arm and spread to the nose-mouth area on the same side."
        ],
        "knowledge": "Migraine Migraine If any symptom remains after 60 minutes, the state is known as prolonged aura. Visual disturbances often consist of a scintillating scotoma. These typically start near the center of vision and then spread out to the sides with zigzagging lines which have been described as looking like fortifications or walls of a castle. Usually the lines are in black and white but some people also see colored lines. Some people lose part of their field of vision known as hemianopsia while others experience blurring. Sensory aura are the second most common type; they occur in 30–40% of people with auras. Often a feeling of pins-and-needles begins on one side in the hand and arm and spreads to the nose–mouth area on the same side Migraine Migraine",
        "response": "Yes, sensory aura can start in the hand and arm and spread to the nose-mouth area on the same side."
    },
    {
        "dialog": [
            "Hi Medi, I recently experienced a migraine with visual disturbances. How can I prevent it from happening again?",
            "Avoiding triggers like stress, certain foods, and bright lights can help reduce the frequency of migraines.",
            "Are there any lifestyle changes I should consider to prevent migraines?",
            "Maintaining a regular sleep schedule, managing stress, and staying hydrated can be beneficial.",
            "That's good to know. Is there any specific diet I should follow to prevent migraines?",
            "Some people find that avoiding trigger foods like chocolate, caffeine, and processed foods can help.",
            "I see. Thank you for the advice, Medi. One last question: Can migraines be hereditary?",
            "Yes, migraines can have a genetic component and run in families."
        ],
        "knowledge": "Migraine Migraine If any symptom remains after 60 minutes, the state is known as prolonged aura. Visual disturbances often consist of a scintillating scotoma. These typically start near the center of vision and then spread out to the sides with zigzagging lines which have been described as looking like fortifications or walls of a castle. Usually the lines are in black and white but some people also see colored lines. Some people lose part of their field of vision known as hemianopsia while others experience blurring. Sensory aura are the second most common type; they occur in 30–40% of people with auras. Often a feeling of pins-and-needles begins on one side in the hand and arm and spreads to the nose–mouth area on the same side Migraine Migraine",
        "response": "Yes, migraines can have a genetic component and run in families."
    },
    {
        "dialog": [
            "Hi Medi, I've been experiencing visual disturbances with zigzagging lines. What could be causing it?",
            "Those visual disturbances with zigzagging lines are called scintillating scotoma and are often associated with migraines.",
            "I see. Is there anything I can do to alleviate the symptoms?",
            "Resting in a quiet, dark room and applying a cold or warm compress to your head may help relieve the symptoms.",
            "Thank you, Medi. Just one more question: How long can a prolonged aura last?",
            "If any symptom remains after 60 minutes, it is known as a prolonged aura.",
            "Got it. Thanks for your help, Medi!"
        ],
        "knowledge": "Migraine Migraine If any symptom remains after 60 minutes, the state is known as prolonged aura. Visual disturbances often consist of a scintillating scotoma. These typically start near the center of vision and then spread out to the sides with zigzagging lines which have been described as looking like fortifications or walls of a castle. Usually the lines are in black and white but some people also see colored lines. Some people lose part of their field of vision known as hemianopsia while others experience blurring. Sensory aura are the second most common type; they occur in 30–40% of people with auras. Often a feeling of pins-and-needles begins on one side in the hand and arm and spreads to the nose–mouth area on the same side Migraine Migraine",
        "response": "You're welcome! If you have any more questions, feel free to ask."
    },
    {
        "dialog": [
            "Hi Medi, I've been experiencing a scintillating scotoma with black and white zigzag lines. Is this a common symptom?",
            "Yes, scintillating scotoma with zigzagging lines is a common visual disturbance associated with migraines.",
            "I see. Can you explain what hemianopsia is?",
            "Hemianopsia is when you lose part of your field of vision, either on the left or right side.",
            "Oh, I see. Thanks for clarifying that, Medi. Just one more question: How often do sensory aura occur?",
            "Sensory aura occur in 30-40% of people with migraines that have auras.",
            "Thank you, Medi. Your explanations have been very helpful!",
            "You're welcome! If there's anything else you'd like to know, feel free to ask."
        ],
        "knowledge": "Migraine Migraine If any symptom remains after 60 minutes, the state is known as prolonged aura. Visual disturbances often consist of a scintillating scotoma. These typically start near the center of vision and then spread out to the sides with zigzagging lines which have been described as looking like fortifications or walls of a castle. Usually the lines are in black and white but some people also see colored lines. Some people lose part of their field of vision known as hemianopsia while others experience blurring. Sensory aura are the second most common type; they occur in 30–40% of people with auras. Often a feeling of pins-and-needles begins on one side in the hand and arm and spreads to the nose–mouth area on the same side Migraine Migraine",
        "response": "You're welcome! Don't hesitate to ask if you have any more questions."
    },
    {
        "dialog": [
            "Hi Medi, I recently had a migraine and experienced a pins-and-needles sensation in my hand and arm. What causes this?",
            "The pins-and-needles sensation you felt is a sensory aura, which is commonly associated with migraines.",
            "I see. Is there anything I can do to prevent or reduce the occurrence of migraines?",
            "Maintaining a regular sleep schedule, managing stress, and avoiding triggers like certain foods or strong smells may help prevent migraines.",
            "That's helpful. Thanks, Medi! One last question: What other symptoms can occur during a migraine aura?",
            "Other symptoms that can occur during a migraine aura include visual disturbances, loss of appetite, and fatigue.",
            "Thank you for the information, Medi. I appreciate your assistance!",
            "You're welcome! If you have any more questions in the future, feel free to reach out."
        ],
        "knowledge": "Migraine Migraine If any symptom remains after 60 minutes, the state is known as prolonged aura. Visual disturbances often consist of a scintillating scotoma. These typically start near the center of vision and then spread out to the sides with zigzagging lines which have been described as looking like fortifications or walls of a castle. Usually the lines are in black and white but some people also see colored lines. Some people lose part of their field of vision known as hemianopsia while others experience blurring. Sensory aura are the second most common type; they occur in 30–40% of people with auras. Often a feeling of pins-and-needles begins on one side in the hand and arm and spreads to the nose–mouth area on the same side Migraine Migraine",
        "response": "You're welcome! I'm here to help whenever you need."
    },
    {
        "dialog": [
            "I've been experiencing visual disturbances with zigzagging lines. What could be causing this?",
            "Those visual disturbances with zigzagging lines are a common symptom of a migraine aura.",
            "How long does a migraine aura typically last?",
            "If any symptom remains after 60 minutes, it's known as prolonged aura.",
            "I see. What other symptoms can occur during a migraine aura?",
            "Some people may experience loss of vision, either partial or complete, and others may have a sensation of pins-and-needles in their hand and arm.",
            "Is there anything I can do to relieve the symptoms of a migraine aura?",
            "Resting in a quiet, dark room and applying a cold or warm compress to your head may help.",
            "What should I do if the symptoms persist or worsen?"
        ],
        "knowledge": "Migraine Migraine If any symptom remains after 60 minutes, the state is known as prolonged aura. Visual disturbances often consist of a scintillating scotoma. These typically start near the center of vision and then spread out to the sides with zigzagging lines which have been described as looking like fortifications or walls of a castle. Usually, the lines are in black and white but some people also see colored lines. Some people lose part of their field of vision known as hemianopsia while others experience blurring. Sensory aura is the second most common type; they occur in 30–40% of people with auras. Often a feeling of pins-and-needles begins on one side in the hand and arm and spreads to the nose–mouth area on the same side Migraine Migraine",
        "response": "If the symptoms persist or worsen, it's important to consult with a healthcare professional for further evaluation and appropriate treatment."
    },
    {
        "dialog": [
            "I've been experiencing visual disturbances with zigzagging lines. What could be causing this?",
            "Those visual disturbances with zigzagging lines are a common symptom of a migraine aura.",
            "Can you explain what a scintillating scotoma is?",
            "A scintillating scotoma is a visual aura that starts near the center of vision and spreads out to the sides with zigzagging lines.",
            "Do these lines appear in specific colors?",
            "Usually, the lines are in black and white, but some people also see colored lines.",
            "Is there anything else that can happen during a migraine aura?",
            "Some people may experience hemianopsia, which is the loss of part of their field of vision, while others may experience blurring.",
            "Why do some people experience pins-and-needles sensation during a migraine aura?"
        ],
        "knowledge": "Migraine Migraine If any symptom remains after 60 minutes, the state is known as prolonged aura. Visual disturbances often consist of a scintillating scotoma. These typically start near the center of vision and then spread out to the sides with zigzagging lines which have been described as looking like fortifications or walls of a castle. Usually, the lines are in black and white but some people also see colored lines. Some people lose part of their field of vision known as hemianopsia while others experience blurring. Sensory aura is the second most common type; they occur in 30–40% of people with auras. Often a feeling of pins-and-needles begins on one side in the hand and arm and spreads to the nose–mouth area on the same side Migraine Migraine",
        "response": "The pins-and-needles sensation during a migraine aura is believed to be caused by abnormal electrical activity in the brain affecting sensory nerves."
    },
    {
        "dialog": [
            "I've been experiencing visual disturbances with zigzagging lines. What could be causing this?",
            "Those visual disturbances with zigzagging lines are a common symptom of a migraine aura.",
            "Can you explain what sensory aura is?",
            "Sensory aura is the second most common type of aura that occurs in 30–40% of people with auras. It often starts with a feeling of pins-and-needles in the hand and arm and spreads to the nose–mouth area on the same side.",
            "Are there any other symptoms associated with sensory aura?",
            "Loss of vision, known as hemianopsia, and blurring can also occur during a sensory aura.",
            "Is there anything I can do to alleviate the symptoms of a migraine aura?",
            "Resting in a quiet, dark room and applying a cold or warm compress to your head may provide some relief.",
            "What if the symptoms don't go away or get worse?"
        ],
        "knowledge": "Migraine Migraine If any symptom remains after 60 minutes, the state is known as prolonged aura. Visual disturbances often consist of a scintillating scotoma. These typically start near the center of vision and then spread out to the sides with zigzagging lines which have been described as looking like fortifications or walls of a castle. Usually, the lines are in black and white but some people also see colored lines. Some people lose part of their field of vision known as hemianopsia while others experience blurring. Sensory aura is the second most common type; they occur in 30–40% of people with auras. Often a feeling of pins-and-needles begins on one side in the hand and arm and spreads to the nose–mouth area on the same side Migraine Migraine",
        "response": "If the symptoms persist or worsen, it's recommended to seek medical attention for further evaluation and appropriate management."
    },
    {
        "dialog": [
            "Hi Medi, I've been experiencing visual disturbances and blurring lately.",
            "I'm here to help. Visual disturbances and blurring can be associated with migraines.",
            "The lines I see look like fortifications and spread to the sides. Is that normal?",
            "Yes, that's called a scintillating scotoma. It's a common visual disturbance during migraines.",
            "What about losing part of my field of vision? Is that related to migraines too?",
            "Yes, some people experience hemianopsia, which is a partial loss of vision during migraines.",
            "I see. Is there anything I can do to manage these symptoms?",
            "Resting in a quiet, dark room and applying a cold compress to your forehead can help.",
            "What should I do if the symptoms last for more than 60 minutes?"
        ],
        "knowledge": "Migraine Migraine  If any symptom remains after 60 minutes, the state is known as prolonged aura. Visual disturbances often consist of a scintillating scotoma .  These typically start near the center of vision and then spread out to the sides with zigzagging lines which have been described as looking like fortifications or walls of a castle.  Usually the lines are in black and white but some people also see colored lines.  Some people lose part of their field of vision known as hemianopsia while others experience blurring. Sensory aura are the second most common type; they occur in 30–40% of people with auras.  Often a feeling of pins-and-needles begins on one side in the hand and arm and spreads to the nose–mouth area on the same side Migraine Migraine",
        "response": "If the symptoms last for more than 60 minutes, it's considered a prolonged aura. You should consult a healthcare professional."
    },
    {
        "dialog": [
            "Hey Medi, I have a question about migraines.",
            "Sure, go ahead. I'm here to answer your questions about migraines.",
            "Can migraines cause any sensory disturbances besides visual ones?",
            "Absolutely! Sensory disturbances like pins-and-needles sensations in the hand and arm are common with migraines.",
            "Do these sensations spread to any other areas of the body?",
            "Yes, they can spread to the nose-mouth area on the same side as well.",
            "I didn't know that. Thanks for the information, Medi.",
            "You're welcome! If you have any more questions, feel free to ask.",
            "One last question: Are migraines curable?"
        ],
        "knowledge": "Migraine Migraine  If any symptom remains after 60 minutes, the state is known as prolonged aura. Visual disturbances often consist of a scintillating scotoma .  These typically start near the center of vision and then spread out to the sides with zigzagging lines which have been described as looking like fortifications or walls of a castle.  Usually the lines are in black and white but some people also see colored lines.  Some people lose part of their field of vision known as hemianopsia while others experience blurring. Sensory aura are the second most common type; they occur in 30–40% of people with auras.  Often a feeling of pins-and-needles begins on one side in the hand and arm and spreads to the nose–mouth area on the same side Migraine Migraine",
        "response": "Migraines are a chronic condition, but they can be managed with proper treatment and lifestyle changes."
    },
    {
        "dialog": [
            "Hi Medi, I recently had a migraine and I need some advice.",
            "Of course, I'm here to help. What advice do you need?",
            "I've heard that lifestyle changes can help prevent migraines. Is that true?",
            "Yes, making certain lifestyle changes can help reduce the frequency and severity of migraines.",
            "What kind of lifestyle changes should I consider?",
            "Regular sleep patterns, stress management, and avoiding triggers like certain foods can be helpful.",
            "That makes sense. Are there any dietary changes I should make?",
            "Keeping a well-balanced diet, staying hydrated, and avoiding potential trigger foods can be beneficial.",
            "Got it. I'll try making these changes. Thank you, Medi!"
        ],
        "knowledge": "Migraine Migraine  If any symptom remains after 60 minutes, the state is known as prolonged aura. Visual disturbances often consist of a scintillating scotoma .  These typically start near the center of vision and then spread out to the sides with zigzagging lines which have been described as looking like fortifications or walls of a castle.  Usually the lines are in black and white but some people also see colored lines.  Some people lose part of their field of vision known as hemianopsia while others experience blurring. Sensory aura are the second most common type; they occur in 30–40% of people with auras.  Often a feeling of pins-and-needles begins on one side in the hand and arm and spreads to the nose–mouth area on the same side Migraine Migraine",
        "response": "You're welcome! I'm glad I could help. If you have any more questions, feel free to ask."
    },
    {
        "dialog": [
            "Hi Medi, I've been experiencing visual disturbances with zigzagging lines. What could be the cause?",
            "It sounds like you may be experiencing a migraine aura. Visual disturbances with zigzagging lines are a common symptom.",
            "Are there any other symptoms associated with migraine aura?",
            "Yes, some people also experience scotoma, which is a blind spot or loss of vision in one area.",
            "I see. Is there anything I can do to alleviate these symptoms?",
            "Resting in a quiet, dark room and taking over-the-counter pain relievers can help. Would you like more information?",
            "Yes, please. Are there any long-lasting effects of migraine aura?",
            "If any symptom remains after 60 minutes, it's known as prolonged aura. But in most cases, the symptoms subside within that time frame.",
            "Can prolonged aura be a cause for concern?"
        ],
        "knowledge": "Migraine Migraine If any symptom remains after 60 minutes, the state is known as prolonged aura. Visual disturbances often consist of a scintillating scotoma. These typically start near the center of vision and then spread out to the sides with zigzagging lines which have been described as looking like fortifications or walls of a castle. Usually the lines are in black and white but some people also see colored lines. Some people lose part of their field of vision known as hemianopsia while others experience blurring. Sensory aura are the second most common type; they occur in 30–40% of people with auras. Often a feeling of pins-and-needles begins on one side in the hand and arm and spreads to the nose–mouth area on the same side Migraine Migraine",
        "response": "Prolonged aura can be concerning if the symptoms persist beyond 60 minutes. It's advisable to seek medical attention if that happens."
    },
    {
        "dialog": [
            "Hey Medi, I've recently had a migraine with sensory aura. Can you tell me more about it?",
            "Of course! Sensory aura is the second most common type of aura experienced in migraines. It often starts with a pins-and-needles sensation in the hand and arm, spreading to the nose and mouth area on the same side.",
            "Are there any other symptoms associated with sensory aura?",
            "The pins-and-needles sensation is the main symptom, but some people may also experience temporary numbness or tingling in other parts of the body.",
            "Is there anything I can do to prevent or manage sensory aura?",
            "Maintaining a healthy lifestyle, managing stress, getting regular exercise, and avoiding triggers like certain foods or strong odors can help reduce the frequency and intensity of sensory aura.",
            "That's helpful to know. Can sensory aura last for a long time?",
            "Sensory aura typically lasts for a relatively short duration, usually less than an hour. However, if the symptoms persist or worsen, it's important to consult a healthcare professional.",
            "I appreciate the information. Is there a cure for sensory aura?"
        ],
        "knowledge": "Migraine Migraine If any symptom remains after 60 minutes, the state is known as prolonged aura. Visual disturbances often consist of a scintillating scotoma. These typically start near the center of vision and then spread out to the sides with zigzagging lines which have been described as looking like fortifications or walls of a castle. Usually the lines are in black and white but some people also see colored lines. Some people lose part of their field of vision known as hemianopsia while others experience blurring. Sensory aura are the second most common type; they occur in 30–40% of people with auras. Often a feeling of pins-and-needles begins on one side in the hand and arm and spreads to the nose–mouth area on the same side Migraine Migraine",
        "response": "There isn't a specific cure for sensory aura, but there are treatments available to help manage and reduce the frequency of migraines. It's best to consult with a healthcare professional for personalized advice."
    },
    {
        "dialog": [
            "Hi Medi, I recently had a migraine with hemianopsia. What does that mean?",
            "Hemianopsia refers to a loss of vision in half of the visual field, either to the left or right side. It can be a symptom of a migraine aura.",
            "Are there any other symptoms associated with hemianopsia?",
            "Blurring of vision is another common symptom experienced alongside hemianopsia during a migraine aura.",
            "What can I do to manage these symptoms?",
            "Resting in a quiet, dark room and applying a cold or warm compress to the affected area can help alleviate the symptoms. It's also important to identify and avoid any triggers that may contribute to your migraines.",
            "Thanks for the advice. Can hemianopsia last for a long time?",
            "Hemianopsia is usually a temporary symptom that resolves on its own as the migraine episode subsides. If the symptoms persist or worsen, it's advisable to consult a healthcare professional.",
            "I appreciate the information. Is there anything else I should be aware of?"
        ],
        "knowledge": "Migraine Migraine If any symptom remains after 60 minutes, the state is known as prolonged aura. Visual disturbances often consist of a scintillating scotoma. These typically start near the center of vision and then spread out to the sides with zigzagging lines which have been described as looking like fortifications or walls of a castle. Usually the lines are in black and white but some people also see colored lines. Some people lose part of their field of vision known as hemianopsia while others experience blurring. Sensory aura are the second most common type; they occur in 30–40% of people with auras. Often a feeling of pins-and-needles begins on one side in the hand and arm and spreads to the nose–mouth area on the same side Migraine Migraine",
        "response": "It's important to note that if you experience any new or unusual symptoms or if your migraines become more frequent or severe, it's best to consult with a healthcare professional for a proper evaluation."
    }
]