[
    {
        "dialog": [
            "Hi Medi, I think I got a cold.",
            "Hello, what are your symptoms?",
            "I have a runny nose, cough, and sneezing.",
            "It sounds like you have a cold virus. Get rest and drinks lots of fluids.",
            "What else can I do to feel better?",
            "You can take over-the-counter cold medicine to relieve symptoms.",
            "Thank you, Medi. Do you have any home remedies?",
            "Yes, drinking hot tea with honey and using a humidifier can help with symptoms.",
            "Okay, I will try that. How long will it last?"
        ],
        "knowledge": "Common cold Common cold  Other commonly implicated viruses include human coronaviruses , influenza viruses , adenoviruses , human respiratory syncytial virus , enteroviruses other than rhinoviruses, human parainfluenza viruses, and human metapneumovirus.  Frequently more than one virus is present.  In total, more than 200 viral types are associated with colds. The common cold virus is typically transmitted via airborne droplets , direct contact with infected nasal secretions, or fomites .  Which of these routes is of primary importance has not been determined.  The viruses may survive for prolonged periods in the environment  and can be picked up by people's hands and subsequently carried to their eyes or nose where infection occurs.  Transmission from animals is considered highly unlikely; an outbreak documented at a British scientific base on Adelaide Island after seventeen weeks of isolation was thought to have been caused by transmission from a contaminated object or an asymptomatic human carrier, rather than from the husky dogs which were also present at the base Common cold Common cold",
        "response": "Symptoms usually last 7-10 days, but can last up to 2 weeks."
    },
    {
        "dialog": [
            "Hi, Medi. Can you tell me more about the flu?",
            "Sure, what do you want to know?",
            "What are the symptoms?",
            "Flu symptoms include fever, chills, cough, sore throat, runny or stuffy nose, muscle or body aches, headache, and fatigue.",
            "How is it spread?",
            "The flu virus is spread through respiratory droplets when an infected person coughs or sneezes.",
            "Can the flu be prevented?",
            "Yes, the flu vaccine is the best way to prevent the flu.",
            "Thank you, Medi. When should I see a doctor?"
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "You should see a doctor if your symptoms are severe or if you are at risk for complications, such as young children, pregnant women, or people with chronic medical conditions."
    },
    {
        "dialog": [
            "Hi Medi, I just got over a cold. What can I do to prevent getting sick again?",
            "Great question. You can wash your hands frequently and avoid contact with sick people.",
            "What else can I do?",
            "You can boost your immune system by eating a healthy diet, getting enough sleep, and reducing stress.",
            "Are there any supplements I can take?",
            "Vitamin C and zinc supplements have been shown to boost the immune system and reduce the duration of colds.",
            "Thanks, Medi. Can exercise help prevent colds?",
            "Yes, regular exercise can boost the immune system and reduce the risk of getting sick.",
            "That's good to know. Any other tips for staying healthy?"
        ],
        "knowledge": "Common cold Common cold  Other commonly implicated viruses include human coronaviruses , influenza viruses , adenoviruses , human respiratory syncytial virus , enteroviruses other than rhinoviruses, human parainfluenza viruses, and human metapneumovirus.  Frequently more than one virus is present.  In total, more than 200 viral types are associated with colds. The common cold virus is typically transmitted via airborne droplets , direct contact with infected nasal secretions, or fomites .  Which of these routes is of primary importance has not been determined.  The viruses may survive for prolonged periods in the environment  and can be picked up by people's hands and subsequently carried to their eyes or nose where infection occurs.  Transmission from animals is considered highly unlikely; an outbreak documented at a British scientific base on Adelaide Island after seventeen weeks of isolation was thought to have been caused by transmission from a contaminated object or an asymptomatic human carrier, rather than from the husky dogs which were also present at the base Common cold Common cold",
        "response": "Yes, staying hydrated and avoiding smoking can also help prevent colds and other respiratory infections."
    },
    {
        "dialog": [
            "Hello Medi, I have been feeling very tired and my throat is sore.",
            "Hi there! Sorry to hear that. Do you have a fever or cough?",
            "No, I haven't noticed any fever or cough",
            "Okay, it's possible that you have a common cold. Rest and try drinking warm fluids to soothe your throat",
            "Thanks for the advice. How long will it take to recover from a cold?",
            "The duration of a cold can vary, but it usually takes about a week to ten days to recover",
            "Is there anything else I can do to help speed up the healing process?",
            "Make sure to get plenty of rest, stay hydrated, and try using a humidifier to ease any respiratory symptoms.",
            "Thank you for the advice, Medi"
        ],
        "knowledge": "Common cold Common cold  Other commonly implicated viruses include human coronaviruses , influenza viruses , adenoviruses , human respiratory syncytial virus , enteroviruses other than rhinoviruses, human parainfluenza viruses, and human metapneumovirus.  Frequently more than one virus is present.  In total, more than 200 viral types are associated with colds. The common cold virus is typically transmitted via airborne droplets , direct contact with infected nasal secretions, or fomites .  Which of these routes is of primary importance has not been determined.  The viruses may survive for prolonged periods in the environment  and can be picked up by people's hands and subsequently carried to their eyes or nose where infection occurs.  Transmission from animals is considered highly unlikely; an outbreak documented at a British scientific base on Adelaide Island after seventeen weeks of isolation was thought to have been caused by transmission from a contaminated object or an asymptomatic human carrier, rather than from the husky dogs which were also present at the base Common cold Common cold",
        "response": "You're welcome. I hope you feel better soon!"
    },
    {
        "dialog": [
            "Hello Medi, I was wondering if you could explain the different types of viruses that cause colds.",
            "Certainly! There are many viruses that can cause a cold, including human coronaviruses, influenza viruses, adenoviruses, and more",
            "How does the common cold virus spread?",
            "The common cold virus is typically transmitted via airborne droplets, direct contact with infected nasal secretions, or fomites.",
            "What are the symptoms of a common cold?",
            "The symptoms can include a sore throat, runny or congested nose, sneezing, coughing, and fatigue",
            "How can I prevent getting a cold?",
            "Frequent hand washing is the best way to prevent the spread of the virus. Avoid touching your face, especially your eyes and nose, and stay away from people who are sick",
            "Interesting, thank you for the information."
        ],
        "knowledge": "Common cold Common cold  Other commonly implicated viruses include human coronaviruses , influenza viruses , adenoviruses , human respiratory syncytial virus , enteroviruses other than rhinoviruses, human parainfluenza viruses, and human metapneumovirus.  Frequently more than one virus is present.  In total, more than 200 viral types are associated with colds. The common cold virus is typically transmitted via airborne droplets , direct contact with infected nasal secretions, or fomites .  Which of these routes is of primary importance has not been determined.  The viruses may survive for prolonged periods in the environment  and can be picked up by people's hands and subsequently carried to their eyes or nose where infection occurs.  Transmission from animals is considered highly unlikely; an outbreak documented at a British scientific base on Adelaide Island after seventeen weeks of isolation was thought to have been caused by transmission from a contaminated object or an asymptomatic human carrier, rather than from the husky dogs which were also present at the base Common cold Common cold",
        "response": "You're welcome. Let me know if you have any more questions!"
    },
    {
        "dialog": [
            "Hello Medi, I recently had a cold and am wondering what I can do to prevent getting sick again.",
            "Hi there! One of the best things you can do is practice good hygiene, like frequent hand washing and avoiding touching your face",
            "Are there any foods that could help prevent a cold?",
            "Eating a balanced diet with plenty of fruits and vegetables can help support your immune system and keep you healthy",
            "Is there anything else I can do?",
            "Regular exercise and getting enough sleep can also help support your immune system and reduce your risk of getting sick",
            "Thank you for the advice.",
            "You're welcome! Do you have any other questions?",
            "No, that's all. Thanks, Medi!"
        ],
        "knowledge": "Common cold Common cold  Other commonly implicated viruses include human coronaviruses , influenza viruses , adenoviruses , human respiratory syncytial virus , enteroviruses other than rhinoviruses, human parainfluenza viruses, and human metapneumovirus.  Frequently more than one virus is present.  In total, more than 200 viral types are associated with colds. The common cold virus is typically transmitted via airborne droplets , direct contact with infected nasal secretions, or fomites .  Which of these routes is of primary importance has not been determined.  The viruses may survive for prolonged periods in the environment  and can be picked up by people's hands and subsequently carried to their eyes or nose where infection occurs.  Transmission from animals is considered highly unlikely; an outbreak documented at a British scientific base on Adelaide Island after seventeen weeks of isolation was thought to have been caused by transmission from a contaminated object or an asymptomatic human carrier, rather than from the husky dogs which were also present at the base Common cold Common cold",
        "response": "You're welcome. Stay healthy!"
    },
    {
        "dialog": [
            "Hi Medi, I am not feeling well. I have a runny nose and a sore throat.",
            "Hi there, sorry to hear that. Based on your symptoms, it looks like you have a common cold.",
            "What should I do to feel better?",
            "You should get plenty of rest, drink lots of fluids, and take over-the-counter pain relievers if needed.",
            "What about antibiotics?",
            "Antibiotics are not effective against viruses like the common cold. They only work against bacterial infections.",
            "I see. Thank you. What are the ways that the common cold can be transmitted?",
            "The common cold is typically transmitted via airborne droplets, direct contact with infected nasal secretions, or fomites.",
            "Thank you for the information, Medi."
        ],
        "knowledge": "Common cold Common cold  Other commonly implicated viruses include human coronaviruses , influenza viruses , adenoviruses , human respiratory syncytial virus , enteroviruses other than rhinoviruses, human parainfluenza viruses, and human metapneumovirus.  Frequently more than one virus is present.  In total, more than 200 viral types are associated with colds. The common cold virus is typically transmitted via airborne droplets , direct contact with infected nasal secretions, or fomites .  Which of these routes is of primary importance has not been determined.  The viruses may survive for prolonged periods in the environment  and can be picked up by people's hands and subsequently carried to their eyes or nose where infection occurs.  Transmission from animals is considered highly unlikely; an outbreak documented at a British scientific base on Adelaide Island after seventeen weeks of isolation was thought to have been caused by transmission from a contaminated object or an asymptomatic human carrier, rather than from the husky dogs which were also present at the base Common cold Common cold",
        "response": "You're welcome. Do you have any other questions about the common cold?"
    },
    {
        "dialog": [
            "Hi Medi, I have a question about the influenza virus.",
            "Of course, what do you want to know?",
            "How is the influenza virus different from the common cold virus?",
            "The symptoms of the two viruses are similar, but the influenza virus is generally more severe and can lead to complications like pneumonia.",
            "How is the influenza virus transmitted?",
            "The influenza virus is spread through the air via droplets when someone with the virus coughs, sneezes, or talks. It can also be spread by touching a surface contaminated with the virus and then touching your mouth, nose, or eyes.",
            "What can I do to avoid getting the influenza virus?",
            "The best way to prevent getting the flu is to get vaccinated every year. You should also practice good hygiene, like washing your hands frequently and covering your mouth when coughing or sneezing.",
            "Thank you for the advice, Medi."
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "You're welcome. Let me know if you have any other questions."
    },
    {
        "dialog": [
            "Hi Medi, I recently had a medical procedure done. Do you have any advice for me?",
            "Sure, what kind of procedure did you have?",
            "I had a kidney transplant.",
            "Congratulations on your successful transplant. You should prioritize rest and follow your doctor's instructions for medication and lifestyle changes.",
            "What kind of lifestyle changes should I make?",
            "You should maintain a healthy diet and get regular exercise, but you should avoid contact sports or other activities that could injure your new kidney.",
            "What about medication?",
            "You will need to take immunosuppressant medications to prevent your body from rejecting the new kidney. It's important to take them exactly as prescribed and to keep up with regular check-ups with your doctor.",
            "How long should I expect to be in the hospital?"
        ],
        "knowledge": "Kidney transplant Kidney transplant  A kidney transplant is a surgical procedure that places a healthy kidney from a donor into your body.  The transplanted kidney takes over the work of the two kidneys that failed, so you no longer need dialysis.  During a transplant, the surgeon places the new kidney in your lower abdomen and connects the artery and vein of the new kidney to your artery and vein.  Often, the new kidney will start making urine as soon as your blood starts flowing through it, but sometimes dialysis is needed for a short time after surgery.  The immunosuppressant medications that you will need to take after the transplant can have side effects, so it's important to work closely with your doctor to manage them Kidney transplant Kidney transplant",
        "response": "You're welcome. Let me know if you have any other questions related to your kidney transplant."
    },
    {
        "dialog": [
            "Hi Medi, I'm not feeling well today.",
            "Hello! What seems to be the problem?",
            "I have a terrible headache and a runny nose.",
            "Those symptoms are commonly associated with the common cold.",
            "What should I do to get better?",
            "Drink plenty of fluids and get some rest. Over-the-counter medicine can help relieve symptoms.",
            "Alright, thanks for the advice. How long does it usually take to recover from a cold?",
            "It can take anywhere from a few days to a week or more to fully recover depending on your body's response to the virus.",
            "I see. What can I do to prevent getting a cold in the future?"
        ],
        "knowledge": "Common cold Common cold  Other commonly implicated viruses include human coronaviruses , influenza viruses , adenoviruses , human respiratory syncytial virus , enteroviruses other than rhinoviruses, human parainfluenza viruses, and human metapneumovirus.  Frequently more than one virus is present.  In total, more than 200 viral types are associated with colds. The common cold virus is typically transmitted via airborne droplets , direct contact with infected nasal secretions, or fomites .  Which of these routes is of primary importance has not been determined.  The viruses may survive for prolonged periods in the environment  and can be picked up by people's hands and subsequently carried to their eyes or nose where infection occurs.  Transmission from animals is considered highly unlikely; an outbreak documented at a British scientific base on Adelaide Island after seventeen weeks of isolation was thought to have been caused by transmission from a contaminated object or an asymptomatic human carrier, rather than from the husky dogs which were also present at the base Common cold Common cold",
        "response": "You can prevent getting a cold by washing your hands frequently and avoiding close contact with people who have a cold."
    },
    {
        "dialog": [
            "Hey Medi, I just got back from a medical procedure.",
            "I hope everything went well. How can I assist you?",
            "I'm not sure what to do to make sure I have a quick recovery.",
            "It's important to follow the instructions provided by your doctor. Rest and avoid any strenuous activity for a period of time.",
            "That makes sense. Is there anything else I can do to help the healing process?",
            "Eating a balanced diet and staying hydrated can also aid in the recovery process.",
            "Okay, I'll make sure to do that. How long does it usually take to fully recover from this procedure?",
            "The recovery time can vary depending on the type of procedure and your body's response to it. Your doctor can provide more specific information.",
            "Thanks for the information. Is there anything else I should keep in mind during my recovery?"
        ],
        "knowledge": "Medical procedure Medical procedure  Recovery times will vary depending on the procedure and the patient's overall health.  It is important to follow the doctor's instructions regarding rest, physical activity, and medication.  Eating a balanced diet and staying hydrated can also aid in the recovery process.  Be sure to monitor the incision site for signs of infection such as redness, swelling, or discharge.  If you experience severe pain or any unusual symptoms, contact your doctor immediately. Medical procedure Medical procedure",
        "response": "It's important to monitor the incision site for any signs of infection such as redness, swelling, or discharge. If you experience severe pain or any unusual symptoms, contact your doctor immediately."
    },
    {
        "dialog": [
            "Hi Medi, I have some questions about the common cold.",
            "I'm happy to help. What would you like to know?",
            "What causes someone to get a cold?",
            "Colds are usually caused by a virus, and can be contracted through airborne droplets, direct contact with infected nasal secretions, or by touching contaminated objects and then touching one's nose or eyes.",
            "Are there any ways to prevent getting a cold?",
            "Frequently washing your hands, avoiding close contact with people who have a cold, and avoiding touching your face can all help prevent the spread of the virus.",
            "Interesting. Can you tell me more about the symptoms of a cold?",
            "Symptoms can include a runny or stuffy nose, sore throat, cough, congestion, and occasionally a fever.",
            "Got it. Is there anything I can do to relieve the symptoms of a cold?"
        ],
        "knowledge": "Common cold Common cold  Other commonly implicated viruses include human coronaviruses , influenza viruses , adenoviruses , human respiratory syncytial virus , enteroviruses other than rhinoviruses, human parainfluenza viruses, and human metapneumovirus.  Frequently more than one virus is present.  In total, more than 200 viral types are associated with colds. The common cold virus is typically transmitted via airborne droplets , direct contact with infected nasal secretions, or fomites .  Which of these routes is of primary importance has not been determined.  The viruses may survive for prolonged periods in the environment  and can be picked up by people's hands and subsequently carried to their eyes or nose where infection occurs.  Transmission from animals is considered highly unlikely; an outbreak documented at a British scientific base on Adelaide Island after seventeen weeks of isolation was thought to have been caused by transmission from a contaminated object or an asymptomatic human carrier, rather than from the husky dogs which were also present at the base Common cold Common cold",
        "response": "No, that's all I wanted to know. Thanks for your help, Medi."
    },
    {
        "dialog": [
            "Hello Medi, I'm not feeling well and I suspect that I have a common cold.",
            "Alright, what are your symptoms?",
            "I have a runny nose and sore throat, and I'm feeling a bit tired.",
            "Based on your symptoms, you may have a common cold. Get plenty of rest, drink fluids, and take over the counter medication.",
            "Is there anything else I can do to alleviate my symptoms?",
            "Try gargling salt water, using a humidifier, and taking hot showers to help with congestion.",
            "Thanks, Medi. How long will it take for me to recover?",
            "It usually takes about a week to recover from a common cold.",
            "Are there any complications I should watch out for?"
        ],
        "knowledge": "Common cold Common cold  Other commonly implicated viruses include human coronaviruses , influenza viruses , adenoviruses , human respiratory syncytial virus , enteroviruses other than rhinoviruses, human parainfluenza viruses, and human metapneumovirus.  Frequently more than one virus is present.  In total, more than 200 viral types are associated with colds. The common cold virus is typically transmitted via airborne droplets , direct contact with infected nasal secretions, or fomites .  Which of these routes is of primary importance has not been determined.  The viruses may survive for prolonged periods in the environment  and can be picked up by people's hands and subsequently carried to their eyes or nose where infection occurs.  Transmission from animals is considered highly unlikely; an outbreak documented at a British scientific base on Adelaide Island after seventeen weeks of isolation was thought to have been caused by transmission from a contaminated object or an asymptomatic human carrier, rather than from the husky dogs which were also present at the base Common cold Common cold",
        "response": "Complications are rare, but you should see a doctor if you have a high fever, difficulty breathing, or chest pain."
    },
    {
        "dialog": [
            "Hi Medi, I just had a cold and I'm looking for advice on how to stay healthy.",
            "It's great that you're taking preventative measures. What do you want to know?",
            "What are some ways to prevent a cold?",
            "Wash your hands frequently, avoid touching your face, and avoid contact with people who are sick.",
            "Are there any foods that can help prevent a cold?",
            "Eating a balanced diet with plenty of fruits and vegetables can help boost your immune system.",
            "What about physical activity?",
            "Regular exercise can help reduce your risk of getting sick.",
            "Thanks for your help, Medi. Is there anything else I should do?"
        ],
        "knowledge": "Common cold Common cold  Other commonly implicated viruses include human coronaviruses , influenza viruses , adenoviruses , human respiratory syncytial virus , enteroviruses other than rhinoviruses, human parainfluenza viruses, and human metapneumovirus.  Frequently more than one virus is present.  In total, more than 200 viral types are associated with colds. The common cold virus is typically transmitted via airborne droplets , direct contact with infected nasal secretions, or fomites .  Which of these routes is of primary importance has not been determined.  The viruses may survive for prolonged periods in the environment  and can be picked up by people's hands and subsequently carried to their eyes or nose where infection occurs.  Transmission from animals is considered highly unlikely; an outbreak documented at a British scientific base on Adelaide Island after seventeen weeks of isolation was thought to have been caused by transmission from a contaminated object or an asymptomatic human carrier, rather than from the husky dogs which were also present at the base Common cold Common cold",
        "response": "No problem, good luck trying to stay healthy!"
    },
    {
        "dialog": [
            "Hi Medi, I recently had a cold and I'm wondering if there are any changes I should make to my diet or exercise routine.",
            "It's normal to feel a bit out of sorts after being sick. What are you curious about?",
            "I was wondering if there are any foods I should eat or avoid to help my body recover.",
            "Eating a balanced diet with plenty of fruits and vegetables can help boost your immune system. Avoid processed foods and sugar.",
            "Are there any exercises I should avoid?",
            "You should avoid intense exercise that can strain your muscles and cause more harm than good.",
            "Is there anything else I should do to recover?",
            "Make sure to get enough sleep and take it easy. Listen to your body and don't push yourself too hard.",
            "Thanks, Medi. How long does it take for the body to fully recover after a cold?"
        ],
        "knowledge": "Common cold Common cold  Other commonly implicated viruses include human coronaviruses , influenza viruses , adenoviruses , human respiratory syncytial virus , enteroviruses other than rhinoviruses, human parainfluenza viruses, and human metapneumovirus.  Frequently more than one virus is present.  In total, more than 200 viral types are associated with colds. The common cold virus is typically transmitted via airborne droplets , direct contact with infected nasal secretions, or fomites .  Which of these routes is of primary importance has not been determined.  The viruses may survive for prolonged periods in the environment  and can be picked up by people's hands and subsequently carried to their eyes or nose where infection occurs.  Transmission from animals is considered highly unlikely; an outbreak documented at a British scientific base on Adelaide Island after seventeen weeks of isolation was thought to have been caused by transmission from a contaminated object or an asymptomatic human carrier, rather than from the husky dogs which were also present at the base Common cold Common cold",
        "response": "It can take up to two weeks to fully recover from a cold, but the severity of your symptoms can vary."
    },
    {
        "dialog": [
            "Hello Medi, I have a stuffy nose and a sore throat.",
            "Sorry to hear that. Based on your symptoms, it may be a common cold.",
            "What can I do about it?",
            "You can rest and drink plenty of fluids. Also, try using a saline nasal spray.",
            "Will I need any medication?",
            "Over-the-counter pain relievers can help with any discomfort you may have.",
            "What are the chances of me getting it again?",
            "Unfortunately, there is no immunity to the common cold."
        ],
        "knowledge": "Common cold Common cold  Other commonly implicated viruses include human coronaviruses , influenza viruses , adenoviruses , human respiratory syncytial virus , enteroviruses other than rhinoviruses, human parainfluenza viruses, and human metapneumovirus.  Frequently more than one virus is present.  In total, more than 200 viral types are associated with colds. The common cold virus is typically transmitted via airborne droplets , direct contact with infected nasal secretions, or fomites .  Which of these routes is of primary importance has not been determined.  The viruses may survive for prolonged periods in the environment  and can be picked up by people's hands and subsequently carried to their eyes or nose where infection occurs.  Transmission from animals is considered highly unlikely; an outbreak documented at a British scientific base on Adelaide Island after seventeen weeks of isolation was thought to have been caused by transmission from a contaminated object or an asymptomatic human carrier, rather than from the husky dogs which were also present at the base Common cold Common cold",
        "response": "Yes, you may need to use over-the-counter pain relievers for discomfort."
    },
    {
        "dialog": [
            "Hi Medi, I have some questions about the flu.",
            "Sure, I'm here to answer your questions. What would you like to know?",
            "What are the symptoms of the flu?",
            "Symptoms of the flu include fever, cough, sore throat, runny or stuffy nose, body aches, headache, chills, and fatigue.",
            "Is there anything I can do to prevent getting the flu?",
            "Yes, getting a flu vaccine yearly, washing your hands often, and avoiding contact with sick individuals can help prevent getting the flu.",
            "What should I do if I think I have the flu?",
            "If you think you have the flu, rest, drink fluids, and take over-the-counter pain relievers. You should also stay home to avoid spreading the virus.",
            "Can I still get the flu even if I got the vaccine?"
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "Yes, you can still get the flu even if you got the vaccine, but the vaccine can reduce the severity of your symptoms."
    },
    {
        "dialog": [
            "Hey Medi, I just had a medical procedure done. What should I do?",
            "Congratulations! After a medical procedure, it's crucial to take it easy and rest.",
            "How much rest do I need?",
            "It depends on the type of procedure you had. Your doctor will give you specific instructions on how much rest you need.",
            "Are there any foods I should avoid?",
            "Yes, you should avoid spicy or greasy foods that may upset your stomach. You should also drink plenty of water.",
            "Can I exercise?",
            "You should avoid strenuous exercise for a few days after the procedure. Your doctor will let you know when you can resume physical activity.",
            "How often should I check in with my doctor?"
        ],
        "knowledge": "Common cold Common cold  Other commonly implicated viruses include human coronaviruses , influenza viruses , adenoviruses , human respiratory syncytial virus , enteroviruses other than rhinoviruses, human parainfluenza viruses, and human metapneumovirus.  Frequently more than one virus is present.  In total, more than 200 viral types are associated with colds. The common cold virus is typically transmitted via airborne droplets , direct contact with infected nasal secretions, or fomites .  Which of these routes is of primary importance has not been determined.  The viruses may survive for prolonged periods in the environment  and can be picked up by people's hands and subsequently carried to their eyes or nose where infection occurs.  Transmission from animals is considered highly unlikely; an outbreak documented at a British scientific base on Adelaide Island after seventeen weeks of isolation was thought to have been caused by transmission from a contaminated object or an asymptomatic human carrier, rather than from the husky dogs which were also present at the base Common cold Common cold",
        "response": "You should follow up with your doctor as often as they recommend to monitor your progress and make sure you're healing properly."
    }
]