[
    {
        "dialog": [
            "Hi Medi, I'm experiencing some symptoms related to kidney disease",
            "I'm here to help. Can you tell me more about your symptoms?",
            "I noticed that my urine is dark, and I have lower back pain",
            "Both of those symptoms may be related to kidney disease. Have you seen a doctor yet?",
            "No, not yet. What should I do?",
            "It's important to see a doctor as soon as possible to get a proper diagnosis",
            "Do you have any advice on how I can take care of my kidneys?",
            "Yes, you can start by drinking plenty of water and avoiding smoking and excessive alcohol consumption",
            "Thanks, I'll keep that in mind. What should be my next steps?"
        ],
        "knowledge": "Kidney disease Kidney disease Gabow 1990 talks about Autosomal Dominant Polycystic Kidney disease and how this disease is genetic.  They go on to say 'Autosomal dominant polycystic kidney disease  is the most common genetic disease, affecting a half million Americans.  The clinical phenotype can result from at least two different gene defects.  One gene that can cause ADPKD has been located on the short arm of chromosome 16. ' The same article also goes on to say that millions of Americans are effected by this disease and is very common. Yende & Parikh 2021 talk about the effects that COVID can have on a person that has a pre-existing health issue regarding kidney diseases.  'frailty, chronic diseases, disability and immunodeficiency are at increased risk of kidney disease and progression to kidney failure, and infection with SARS-CoV-2 can further increase this risk'  Kidney disease Kidney disease",
        "response": "You should schedule an appointment with a doctor as soon as possible to get a proper diagnosis and treatment plan"
    },
    {
        "dialog": [
            "Hi Medi, can you tell me more about Autosomal Dominant Polycystic Kidney Disease?",
            "Sure, ADPKD is a genetic disease that affects the kidneys and is the most common genetic disease",
            "How many people are affected by this disease?",
            "Half a million Americans are affected by ADPKD",
            "What are the symptoms of ADPKD?",
            "The symptoms of ADPKD include high blood pressure, pain in the back or sides, and blood in the urine",
            "Is there a cure for ADPKD?",
            "Currently, there is no cure for ADPKD, but there are treatments available to manage the symptoms",
            "Thanks, that was very helpful"
        ],
        "knowledge": "Kidney disease Kidney disease Gabow 1990 talks about Autosomal Dominant Polycystic Kidney disease and how this disease is genetic.  They go on to say 'Autosomal dominant polycystic kidney disease  is the most common genetic disease, affecting a half million Americans.  The clinical phenotype can result from at least two different gene defects.  One gene that can cause ADPKD has been located on the short arm of chromosome 16. ' The same article also goes on to say that millions of Americans are effected by this disease and is very common. Yende & Parikh 2021 talk about the effects that COVID can have on a person that has a pre-existing health issue regarding kidney diseases.  'frailty, chronic diseases, disability and immunodeficiency are at increased risk of kidney disease and progression to kidney failure, and infection with SARS-CoV-2 can further increase this risk'  Kidney disease Kidney disease",
        "response": "You're welcome. Let me know if you have any more questions"
    },
    {
        "dialog": [
            "Hi Medi, I recently underwent a kidney transplant. What kind of diet should I follow",
            "Congratulations on your transplant. You should follow a balanced diet with plenty of fruits and vegetables",
            "Are there any foods that I should avoid?",
            "Yes, you should avoid high-sodium foods and limit your intake of animal protein",
            "What about physical activity?",
            "Physical activity is important, but you should consult with your doctor first to determine what types of exercise are safe for you",
            "Thanks, I'll keep that in mind. Any other advice?",
            "Make sure to take your medications as prescribed and attend all follow-up appointments with your doctor",
            "Thanks for the advice"
        ],
        "knowledge": "Kidney disease Kidney disease Gabow 1990 talks about Autosomal Dominant Polycystic Kidney disease and how this disease is genetic.  They go on to say 'Autosomal dominant polycystic kidney disease  is the most common genetic disease, affecting a half million Americans.  The clinical phenotype can result from at least two different gene defects.  One gene that can cause ADPKD has been located on the short arm of chromosome 16. ' The same article also goes on to say that millions of Americans are effected by this disease and is very common. Yende & Parikh 2021 talk about the effects that COVID can have on a person that has a pre-existing health issue regarding kidney diseases.  'frailty, chronic diseases, disability and immunodeficiency are at increased risk of kidney disease and progression to kidney failure, and infection with SARS-CoV-2 can further increase this risk'  Kidney disease Kidney disease",
        "response": "You're welcome. Let me know if you have any other questions"
    },
    {
        "dialog": [
            "Hello, Medi. I think I have some symptoms related to kidney disease.",
            "I'm sorry to hear that. Can you describe your symptoms, please?",
            "I have back pain, swollen ankles, and fatigue.",
            "Based on your symptoms, it is possible that you have kidney disease.",
            "Can you give me some suggestions to improve my condition?",
            "You should limit salt and protein intake, stay hydrated, and avoid smoking.",
            "I see. Are there any factors that increase the risk of kidney disease?",
            "Yes, there are many factors such as diabetes, high blood pressure, and family history.",
            "Thank you for your advice, Medi. What should I do next?"
        ],
        "knowledge": "Kidney disease Kidney disease Gabow 1990 talks about Autosomal Dominant Polycystic Kidney disease and how this disease is genetic. They go on to say 'Autosomal dominant polycystic kidney disease is the most common genetic disease, affecting a half million Americans. The clinical phenotype can result from at least two different gene defects. One gene that can cause ADPKD has been located on the short arm of chromosome 16.' The same article also goes on to say that millions of Americans are affected by this disease and is very common. Yende & Parikh 2021 talk about the effects that COVID can have on a person that has a pre-existing health issue regarding kidney diseases. 'frailty, chronic diseases, disability and immunodeficiency are at increased risk of kidney disease and progression to kidney failure, and infection with SARS-CoV-2 can further increase this risk' Kidney disease Kidney disease",
        "response": "You should schedule an appointment with your doctor to confirm the diagnosis and discuss further treatment options."
    },
    {
        "dialog": [
            "Hi, Medi. Can you give me some information about Autosomal Dominant Polycystic Kidney disease?",
            "Sure, what would you like to know about it?",
            "I want to know what the symptoms of this disease are.",
            "The symptoms include back pain, high blood pressure, and kidney stones.",
            "Is it a genetic disease?",
            "Yes, it is. It is caused by a mutation in the PKD1 or PKD2 gene.",
            "How is it diagnosed?",
            "It is usually diagnosed through imaging tests such as an ultrasound or CT scan.",
            "I see. Is there any cure for this disease?"
        ],
        "knowledge": "Kidney disease Kidney disease Gabow 1990 talks about Autosomal Dominant Polycystic Kidney disease and how this disease is genetic. They go on to say 'Autosomal dominant polycystic kidney disease is the most common genetic disease, affecting a half million Americans. The clinical phenotype can result from at least two different gene defects. One gene that can cause ADPKD has been located on the short arm of chromosome 16.' The same article also goes on to say that millions of Americans are affected by this disease and is very common. Yende & Parikh 2021 talk about the effects that COVID can have on a person that has a pre-existing health issue regarding kidney diseases. 'frailty, chronic diseases, disability and immunodeficiency are at increased risk of kidney disease and progression to kidney failure, and infection with SARS-CoV-2 can further increase this risk' Kidney disease Kidney disease",
        "response": "There is no cure for this disease, but there are treatments available to manage the symptoms and slow the progression of the disease."
    },
    {
        "dialog": [
            "Hi, Medi. I recently had a kidney transplant. Can you give me some advice on how to stay healthy?",
            "Congratulations on your transplant. After the transplant, it is important to maintain a healthy lifestyle.",
            "What kind of lifestyle changes should I make?",
            "You should eat a healthy diet, exercise regularly, and take your medications as prescribed.",
            "Are there any specific foods that I should avoid?",
            "Yes, you should avoid high-sodium foods, processed foods, and sugary drinks.",
            "What kind of exercise should I do?",
            "You should do low-impact exercises such as walking, biking, and swimming.",
            "I understand. How often should I see my doctor?"
        ],
        "knowledge": "Kidney disease Kidney disease Gabow 1990 talks about Autosomal Dominant Polycystic Kidney disease and how this disease is genetic. They go on to say 'Autosomal dominant polycystic kidney disease is the most common genetic disease, affecting a half million Americans. The clinical phenotype can result from at least two different gene defects. One gene that can cause ADPKD has been located on the short arm of chromosome 16.' The same article also goes on to say that millions of Americans are affected by this disease and is very common. Yende & Parikh 2021 talk about the effects that COVID can have on a person that has a pre-existing health issue regarding kidney diseases. 'frailty, chronic diseases, disability and immunodeficiency are at increased risk of kidney disease and progression to kidney failure, and infection with SARS-CoV-2 can further increase this risk' Kidney disease Kidney disease",
        "response": "You should see your doctor regularly to monitor your kidney function and adjust your medications if necessary."
    },
    {
        "dialog": [
            "Hi Medi, I think I might have a kidney disease.",
            "Sure, can you tell me your symptoms?",
            "I feel pain on the sides of my waist and my urine is discolored.",
            "Those are symptoms of kidney disease. You may need to take some tests.",
            "Is this disease genetic?",
            "Yes, Autosomal Dominant Polycystic Kidney Disease is genetic and the most common type.",
            "Is it common?",
            "Yes, it affects millions of Americans.",
            "What should I do now?"
        ],
        "knowledge": "Kidney disease Kidney disease Gabow 1990 talks about Autosomal Dominant Polycystic Kidney disease and how this disease is genetic.  They go on to say 'Autosomal dominant polycystic kidney disease  is the most common genetic disease, affecting a half million Americans.  The clinical phenotype can result from at least two different gene defects.  One gene that can cause ADPKD has been located on the short arm of chromosome 16. ' The same article also goes on to say that millions of Americans are effected by this disease and is very common. Yende & Parikh 2021 talk about the effects that COVID can have on a person that has a pre-existing health issue regarding kidney diseases.  'frailty, chronic diseases, disability and immunodeficiency are at increased risk of kidney disease and progression to kidney failure, and infection with SARS-CoV-2 can further increase this risk'  Kidney disease Kidney disease",
        "response": "You should consult a doctor as soon as possible. They will recommend the appropriate treatment and tests for you."
    },
    {
        "dialog": [
            "Hi Medi, can you explain to me what is Autosomal Dominant Polycystic Kidney Disease",
            "Sure. It is a genetic disease that causes cysts in the kidneys, leading to kidney failure.",
            "Is it common?",
            "Yes, it's the most common genetic disease and affects millions of Americans.",
            "How does it happen?",
            "It's caused by a gene defect on chromosome 16.",
            "What are the symptoms?",
            "The symptoms are pain on the sides of the waist, blood in the urine, and high blood pressure.",
            "Is there a cure?"
        ],
        "knowledge": "Kidney disease Kidney disease Gabow 1990 talks about Autosomal Dominant Polycystic Kidney disease and how this disease is genetic.  They go on to say 'Autosomal dominant polycystic kidney disease  is the most common genetic disease, affecting a half million Americans.  The clinical phenotype can result from at least two different gene defects.  One gene that can cause ADPKD has been located on the short arm of chromosome 16. ' The same article also goes on to say that millions of Americans are effected by this disease and is very common. Yende & Parikh 2021 talk about the effects that COVID can have on a person that has a pre-existing health issue regarding kidney diseases.  'frailty, chronic diseases, disability and immunodeficiency are at increased risk of kidney disease and progression to kidney failure, and infection with SARS-CoV-2 can further increase this risk'  Kidney disease Kidney disease",
        "response": "Unfortunately, there is no cure for the disease. Treatment focuses on managing the symptoms and slowing the progression of the disease."
    },
    {
        "dialog": [
            "Hi Medi, I just had a kidney transplant. What kind of lifestyle should I maintain?",
            "Congratulations! You should eat healthy, exercise regularly, and take your medication as prescribed.",
            "What kind of diet should I follow?",
            "You should eat a balanced diet with plenty of fruits and vegetables. Avoid high-sodium and high-fat foods.",
            "What type of exercise is good for me?",
            "You can do moderate-intensity exercises like walking, cycling, or swimming. Avoid high-impact activities like running.",
            "Should I avoid alcohol?",
            "It's best to avoid alcohol as it can damage your new kidney.",
            "Will I need to take medication for the rest of my life?"
        ],
        "knowledge": "Kidney disease Kidney disease Gabow 1990 talks about Autosomal Dominant Polycystic Kidney disease and how this disease is genetic.  They go on to say 'Autosomal dominant polycystic kidney disease  is the most common genetic disease, affecting a half million Americans.  The clinical phenotype can result from at least two different gene defects.  One gene that can cause ADPKD has been located on the short arm of chromosome 16. ' The same article also goes on to say that millions of Americans are effected by this disease and is very common. Yende & Parikh 2021 talk about the effects that COVID can have on a person that has a pre-existing health issue regarding kidney diseases.  'frailty, chronic diseases, disability and immunodeficiency are at increased risk of kidney disease and progression to kidney failure, and infection with SARS-CoV-2 can further increase this risk'  Kidney disease Kidney disease",
        "response": "Yes, you will need to take immunosuppressant medication for the rest of your life to prevent your body from rejecting the new kidney."
    },
    {
        "dialog": [
            "Hi Medi, I am feeling very sick, and have some symptoms",
            "Hello! Please tell me about your symptoms so that I can diagnose better.",
            "I feel nauseous, my stomach hurts, and I have trouble eating",
            "It sounds like you might be suffering from kidney disease.",
            "Can you tell me more about kidney disease so that I can understand better?",
            "Kidney disease occurs when the kidneys are damaged and can't properly filter the blood, leading to waste buildup in the body.",
            "What can I do to prevent kidney disease?",
            "Preventative measures include staying hydrated, maintaining a healthy weight, avoiding excessive use of medications, and monitoring blood pressure and blood sugar levels.",
            "Thanks for the advice, what should I eat to help my kidneys?"
        ],
        "knowledge": "Kidney disease Kidney disease Gabow 1990 talks about Autosomal Dominant Polycystic Kidney disease and how this disease is genetic. They go on to say \"Autosomal dominant polycystic kidney disease is the most common genetic disease, affecting a half million Americans. The clinical phenotype can result from at least two different gene defects. One gene that can cause ADPKD has been located on the short arm of chromosome 16.\" The same article also goes on to say that millions of Americans are effected by this disease and is very common. Yende & Parikh 2021 talk about the effects that COVID can have on a person that has a pre-existing health issue regarding kidney diseases. \"frailty, chronic diseases, disability and immunodeficiency are at increased risk of kidney disease and progression to kidney failure, and infection with SARS-CoV-2 can further increase this risk\" Kidney disease Kidney disease",
        "response": "You're welcome. Remember to stay hydrated and maintain a healthy weight to prevent kidney disease."
    },
    {
        "dialog": [
            "Hi Medi, I've been experiencing some symptoms lately and wanted to get some advice.",
            "Of course, I'm here to help! What are your symptoms?",
            "I've been having trouble sleeping lately and have been feeling really tired during the day",
            "This might be a result of chronic kidney disease, which can lead to fatigue and sleep disturbances.",
            "What is chronic kidney disease and how is it treated?",
            "Chronic kidney disease occurs when the kidneys are damaged and can't properly filter the blood, leading to waste buildup in the body. Treatment options include lifestyle changes, medications, and potentially dialysis or a kidney transplant.",
            "What kind of lifestyle changes can I make to help my kidneys?",
            "Maintaining a healthy weight, staying hydrated, monitoring your blood pressure and blood sugar levels, and avoiding excessive use of medications can all help keep kidneys healthy.",
            "Thank you for the advice, Medi! What kind of exercises can I do to help my kidneys?"
        ],
        "knowledge": "Kidney disease Kidney disease Gabow 1990 talks about Autosomal Dominant Polycystic Kidney disease and how this disease is genetic. They go on to say \"Autosomal dominant polycystic kidney disease is the most common genetic disease, affecting a half million Americans. The clinical phenotype can result from at least two different gene defects. One gene that can cause ADPKD has been located on the short arm of chromosome 16.\" The same article also goes on to say that millions of Americans are effected by this disease and is very common. Yende & Parikh 2021 talk about the effects that COVID can have on a person that has a pre-existing health issue regarding kidney diseases. \"frailty, chronic diseases, disability and immunodeficiency are at increased risk of kidney disease and progression to kidney failure, and infection with SARS-CoV-2 can further increase this risk\" Kidney disease Kidney disease",
        "response": "You're welcome. Remember to maintain a healthy lifestyle and consult with your doctor before starting any new exercise regimen."
    },
    {
        "dialog": [
            "Hi Medi, I recently had a medical procedure related to my kidneys and wanted some advice",
            "Sure! What kind of procedure did you have?",
            "I had a kidney transplant and wanted to know what kind of diet I should follow",
            "After a kidney transplant, it's important to maintain a healthy diet that is low in sodium and high in nutrients.",
            "What kind of foods should I avoid after a kidney transplant?",
            "Avoid high-sodium foods, processed foods, and foods that are high in potassium and phosphorus.",
            "Thanks for the advice, Medi! What kind of physical activity should I do?",
            "Low-impact exercises like walking, yoga, and swimming can all help keep kidneys healthy. Consult with your doctor before starting any new exercise regimen.",
            "Thanks for your help, Medi. What kind of lifestyle changes should I make?"
        ],
        "knowledge": "Kidney disease Kidney disease Gabow 1990 talks about Autosomal Dominant Polycystic Kidney disease and how this disease is genetic. They go on to say \"Autosomal dominant polycystic kidney disease is the most common genetic disease, affecting a half million Americans. The clinical phenotype can result from at least two different gene defects. One gene that can cause ADPKD has been located on the short arm of chromosome 16.\" The same article also goes on to say that millions of Americans are effected by this disease and is very common. Yende & Parikh 2021 talk about the effects that COVID can have on a person that has a pre-existing health issue regarding kidney diseases. \"frailty, chronic diseases, disability and immunodeficiency are at increased risk of kidney disease and progression to kidney failure, and infection with SARS-CoV-2 can further increase this risk\" Kidney disease Kidney disease",
        "response": "You're welcome. Remember to consult with your doctor before starting any new exercise regimen and maintaining a healthy weight."
    },
    {
        "dialog": [
            "Hi Medi, I've been feeling unwell lately and I'm worried it might be something related to my kidneys.",
            "I see, What are the symptoms that you have?",
            "I've been feeling very tired and my back hurts, and I've been having trouble sleeping as well.",
            "That sounds worrying. Have you noticed any unusual changes in your urine?",
            "Yes, actually it's been darker than usual and I've been needing to go more often.",
            "Based on the symptoms you've described, it's possible that you may have a kidney infection.",
            "What should I do next, Medi?",
            "I recommend that you see a doctor as soon as possible for further testing and treatment options.",
            "Thank you, Medi. I'll make an appointment right away."
        ],
        "knowledge": "Kidney disease Kidney disease Gabow 1990 talks about Autosomal Dominant Polycystic Kidney disease and how this disease is genetic.  They go on to say \"Autosomal dominant polycystic kidney disease  is the most common genetic disease, affecting a half million Americans.  The clinical phenotype can result from at least two different gene defects.  One gene that can cause ADPKD has been located on the short arm of chromosome 16. \" The same article also goes on to say that millions of Americans are effected by this disease and is very common. Yende & Parikh 2021 talk about the effects that COVID can have on a person that has a pre-existing health issue regarding kidney diseases.  \"frailty, chronic diseases, disability and immunodeficiency are at increased risk of kidney disease and progression to kidney failure, and infection with SARS-CoV-2 can further increase this risk\"  Kidney disease Kidney disease",
        "response": "I recommend that you see a doctor as soon as possible for further testing and treatment options."
    },
    {
        "dialog": [
            "Hi Medi, I've heard about Autosomal Dominant Polycystic Kidney disease and I'm wondering if it's something I should be concerned about.",
            "That's a good question. Do you have any family members with the disease?",
            "Yes, actually my aunt was diagnosed with it a few years ago.",
            "In that case, you should be aware that it is a genetic disease and you may be at risk of developing it as well.",
            "What are some symptoms of this disease?",
            "Common symptoms include abdominal pain, high blood pressure, and blood in the urine.",
            "Is there anything I can do to reduce my risk of developing this disease?",
            "Unfortunately, there is no cure for ADPKD, but you can manage your symptoms through lifestyle changes and medication.",
            "Thanks for the information, Medi. I'll be sure to keep an eye out for any symptoms and talk to my doctor about it."
        ],
        "knowledge": "Kidney disease Kidney disease Gabow 1990 talks about Autosomal Dominant Polycystic Kidney disease and how this disease is genetic.  They go on to say \"Autosomal dominant polycystic kidney disease  is the most common genetic disease, affecting a half million Americans.  The clinical phenotype can result from at least two different gene defects.  One gene that can cause ADPKD has been located on the short arm of chromosome 16. \" The same article also goes on to say that millions of Americans are effected by this disease and is very common. Yende & Parikh 2021 talk about the effects that COVID can have on a person that has a pre-existing health issue regarding kidney diseases.  \"frailty, chronic diseases, disability and immunodeficiency are at increased risk of kidney disease and progression to kidney failure, and infection with SARS-CoV-2 can further increase this risk\"  Kidney disease Kidney disease",
        "response": "Thanks for the information, Medi. I'll be sure to keep an eye out for any symptoms and talk to my doctor about it."
    },
    {
        "dialog": [
            "Hi Medi, I just had a kidney stone removed and I'm wondering what I should do to prevent another one from forming.",
            "Congratulations on getting that taken care of. There are a few steps you can take to reduce your risk of forming another kidney stone.",
            "What are some of those steps?",
            "You should drink plenty of water, limit your salt intake, and eat a balanced diet rich in fruits and vegetables.",
            "Is there anything else I should be doing?",
            "You may also want to limit your intake of animal protein and oxalate-rich foods such as spinach, rhubarb, and chocolate.",
            "That's good to know. How much water should I be drinking?",
            "Aim for at least 8 glasses of water a day, and more if you're physically active or live in a hot climate.",
            "Thanks for the advice, Medi. I'll be sure to follow it to the best of my ability."
        ],
        "knowledge": "Kidney disease Kidney disease Gabow 1990 talks about Autosomal Dominant Polycystic Kidney disease and how this disease is genetic.  They go on to say \"Autosomal dominant polycystic kidney disease  is the most common genetic disease, affecting a half million Americans.  The clinical phenotype can result from at least two different gene defects.  One gene that can cause ADPKD has been located on the short arm of chromosome 16. \" The same article also goes on to say that millions of Americans are effected by this disease and is very common. Yende & Parikh 2021 talk about the effects that COVID can have on a person that has a pre-existing health issue regarding kidney diseases.  \"frailty, chronic diseases, disability and immunodeficiency are at increased risk of kidney disease and progression to kidney failure, and infection with SARS-CoV-2 can further increase this risk\"  Kidney disease Kidney disease",
        "response": "Thanks for the advice, Medi. I'll be sure to follow it to the best of my ability."
    },
    {
        "dialog": [
            "Hi Medi, I feel a pain in my lower back and having trouble urinating.",
            "Hello, I'm here to help. How long have you been experiencing these symptoms?",
            "It started yesterday afternoon and hasn't gotten better.",
            "It sounds like you may have a urinary tract infection. You should see a doctor as soon as possible.",
            "What should I expect at the doctor's office?",
            "The doctor may take a urine sample and prescribe antibiotics. It's important to drink plenty of fluids to flush out the infection.",
            "Thank you for your help, Medi.",
            "You're welcome. Please take care and seek medical attention soon.",
            "What causes urinary tract infections?"
        ],
        "knowledge": "Urinary tract infection Urinary tract infection A urinary tract infection (UTI) is an infection in any part of the urinary system, including the kidneys, bladder, and urethra. Most UTIs are caused by bacteria, such as Escherichia coli (E. coli), Klebsiella pneumonia, or Staphylococcus saprophyticus. Women are more likely to develop UTIs than men. Some common symptoms of UTIs include pain during urination, frequent urination, and cloudy or strong-smelling urine. A UTI should be treated with antibiotics to prevent the infection from spreading to the kidneys. Drinking plenty of fluids can help flush out the infection.",
        "response": "A UTI is usually caused by bacteria such as E. coli, Klebsiella pneumonia, or Staphylococcus saprophyticus."
    },
    {
        "dialog": [
            "Hi Medi, I have a family history of polycystic kidney disease. What can you tell me about it?",
            "I'm here to help. Polycystic kidney disease is a genetic disorder that causes cysts to form on the kidneys. It affects about 500,000 Americans.",
            "What are the symptoms of polycystic kidney disease?",
            "Symptoms can include pain in the back or side, headaches, high blood pressure, and frequent urination.",
            "Is polycystic kidney disease curable?",
            "There is no cure, but treatment can help manage the symptoms. This may include medication for pain and high blood pressure, as well as a low-salt diet.",
            "Thank you, Medi. Is there anything else I should know?",
            "It's important to get regular checkups if you have a family history of polycystic kidney disease, as early detection and treatment can help slow the progression of the disease.",
            "How is polycystic kidney disease diagnosed?"
        ],
        "knowledge": "Polycystic kidney disease Polycystic kidney disease Polycystic kidney disease is a genetic disorder that causes cysts to form on the kidneys. It is the most common genetic disease, affecting 500,000 Americans. Symptoms may include pain in the back or side, headaches, high blood pressure, and frequent urination. There is no cure, but treatment can help manage the symptoms. This may include medication for pain and high blood pressure, as well as a low-salt diet. It's important to get regular checkups if you have a family history of polycystic kidney disease, as early detection and treatment can help slow the progression of the disease.",
        "response": "Polycystic kidney disease is diagnosed through imaging tests such as an ultrasound or CT scan."
    },
    {
        "dialog": [
            "Hi Medi, I recently underwent a kidney transplant. What should I expect in terms of recovery?",
            "Congratulations on your transplant! Recovery can take several weeks to months depending on the individual, but it's important to follow your doctor's instructions.",
            "What should I do to take care of my new kidney?",
            "It's important to take your medication as prescribed to prevent rejection of the new kidney. You should also maintain a healthy lifestyle with a balanced diet and regular exercise.",
            "Is there anything I should avoid?",
            "You should avoid contact with sick people and practice good hygiene, as infections can be dangerous for transplant patients. It's also important to avoid certain medications that can harm the new kidney.",
            "Thank you for your advice, Medi.",
            "You're welcome. Please take care and follow up with your doctor regularly.",
            "What is the success rate of kidney transplants?"
        ],
        "knowledge": "Kidney transplant Kidney transplant A kidney transplant is a surgical procedure that replaces a damaged or diseased kidney with a healthy one from a donor. The success rate of kidney transplants varies depending on many factors, but in general, the survival rate for a transplanted kidney is around 90 percent after one year and 75 percent after five years. It's important to take good care of the new kidney to ensure its long-term success.",
        "response": "The survival rate for a transplanted kidney is around 90 percent after one year and 75 percent after five years."
    },
    {
        "dialog": [
            "Hello Medi, I am worried about kidney disease.",
            "Don't worry, I'll help you. Tell me about your symptoms.",
            "I have back pain, blood in urine and frequent urination.",
            "Based on your symptoms, it's better to make an appointment with a doctor and get your kidneys checked.",
            "Can you suggest a healthy diet for people with kidney disease?",
            "Yes, a diet with less sodium, potassium, and phosphorus is recommended. Also, limit protein intake",
            "What kind of exercises are good for me?",
            "Low-impact exercises like walking, cycling, and stretching are good options. Talk to your doctor before starting.",
            "Thank you for your help, Medi. What causes kidney disease?"
        ],
        "knowledge": "Kidney disease Kidney disease Gabow 1990 talks about Autosomal Dominant Polycystic Kidney disease and how this disease is genetic. They go on to say 'Autosomal dominant polycystic kidney disease is the most common genetic disease, affecting half a million Americans. The clinical phenotype can result from at least two different gene defects. One gene that can cause ADPKD has been located on the short arm of chromosome 16.' The same article also goes on to say that millions of Americans are affected by this disease and is very common. Yende & Parikh 2021 talk about the effects that COVID can have on a person that has a pre-existing health issue regarding kidney diseases. 'Frailty, chronic diseases, disability, and immunodeficiency are at increased risk of kidney disease and progression to kidney failure, and infection with SARS-CoV-2 can further increase this risk' Kidney disease Kidney disease",
        "response": "There are many causes of kidney disease, for example, genetic factors, COVID-19, and chronic diseases."
    },
    {
        "dialog": [
            "Hi Medi, what can you tell me about Polycystic Kidney Disease?",
            "Polycystic Kidney Disease is a genetic disorder that causes cysts to form in the kidneys.",
            "What are the symptoms of Polycystic Kidney Disease?",
            "The common symptoms are back and side pain, headache, high blood pressure, and blood in the urine.",
            "Is there any cure for Polycystic Kidney Disease?",
            "Currently, there is no cure for PKD. Treatment is aimed at managing symptoms and complications.",
            "What kind of complications can occur?",
            "Complications of PKD include high blood pressure, kidney stones, and kidney failure.",
            "Thanks for the information, Medi. Is it possible to prevent PKD?"
        ],
        "knowledge": "Kidney disease Kidney disease Gabow 1990 talks about Autosomal Dominant Polycystic Kidney disease and how this disease is genetic. They go on to say 'Autosomal dominant polycystic kidney disease is the most common genetic disease, affecting half a million Americans. The clinical phenotype can result from at least two different gene defects. One gene that can cause ADPKD has been located on the short arm of chromosome 16.' The same article also goes on to say that millions of Americans are affected by this disease and is very common. Yende & Parikh 2021 talk about the effects that COVID can have on a person that has a pre-existing health issue regarding kidney diseases. 'Frailty, chronic diseases, disability, and immunodeficiency are at increased risk of kidney disease and progression to kidney failure, and infection with SARS-CoV-2 can further increase this risk' Kidney disease Kidney disease",
        "response": "PKD is a genetic disorder, so there is no way to prevent it. Treatment is focused on managing symptoms and complications."
    },
    {
        "dialog": [
            "Hello Medi, I just had a kidney transplant surgery.",
            "Congratulations, I hope you're feeling well. Do you have any questions?",
            "Yes, what kind of food should I eat?",
            "It's important to eat a balanced, healthy diet to keep your new kidney healthy. Avoid high sodium, high phosphorus, and high potassium foods.",
            "Can I exercise after the transplant?",
            "Yes, exercise is very important for your overall health. But start slowly and talk to your doctor about what exercises are safe for you.",
            "What about medications? Do I need to take them?",
            "Yes, it's important to take your medications as prescribed to prevent rejection of the new kidney.",
            "Thank you, Medi. How long should I wait before returning to work?"
        ],
        "knowledge": "Kidney disease Kidney disease Gabow 1990 talks about Autosomal Dominant Polycystic Kidney disease and how this disease is genetic. They go on to say 'Autosomal dominant polycystic kidney disease is the most common genetic disease, affecting half a million Americans. The clinical phenotype can result from at least two different gene defects. One gene that can cause ADPKD has been located on the short arm of chromosome 16.' The same article also goes on to say that millions of Americans are affected by this disease and is very common. Yende & Parikh 2021 talk about the effects that COVID can have on a person that has a pre-existing health issue regarding kidney diseases. 'Frailty, chronic diseases, disability, and immunodeficiency are at increased risk of kidney disease and progression to kidney failure, and infection with SARS-CoV-2 can further increase this risk' Kidney disease Kidney disease",
        "response": "It depends on your job and your recovery progress. Talk to your doctor about when it's safe to return to work after the transplant surgery."
    },
    {
        "dialog": [
            "Hello Medi, I feel pain in my right side, can you help me?",
            "Sure, I'm here to help. Can you describe the pain in more detail?",
            "It's a sharp and constant pain, and it's been going on for a while.",
            "Based on your symptoms, it could be a kidney stone. I recommend you see a doctor for further examination",
            "Oh no, is there anything I can do in the meantime?",
            "Yes, drink plenty of water to help flush out the stone and take pain medication such as ibuprofen to relieve the pain.",
            "Alright, thank you for your help Medi.",
            "You're welcome. Take care and keep me updated on your situation.",
            "Is kidney disease genetic? "
        ],
        "knowledge": "Kidney disease Kidney disease Gabow 1990 talks about Autosomal Dominant Polycystic Kidney disease and how this disease is genetic.  They go on to say 'Autosomal dominant polycystic kidney disease  is the most common genetic disease, affecting a half million Americans.  The clinical phenotype can result from at least two different gene defects.  One gene that can cause ADPKD has been located on the short arm of chromosome 16. ' The same article also goes on to say that millions of Americans are affected by this disease and is very common. Yende & Parikh 2021 talk about the effects that COVID can have on a person that has a pre-existing health issue regarding kidney diseases.  'Frailty, chronic diseases, disability and immunodeficiency are at increased risk of kidney disease and progression to kidney failure, and infection with SARS-CoV-2 can further increase this risk'  Kidney disease Kidney disease",
        "response": "Yes, kidney disease can be genetic. For example, Autosomal Dominant Polycystic Kidney Disease is caused by a gene defect and is the most common genetic disease."
    },
    {
        "dialog": [
            "Hi Medi, can you tell me more about kidney disease?",
            "Of course, what do you want to know?",
            "What are some symptoms of kidney disease?",
            "Common symptoms include fatigue, swelling in the legs and feet, difficulty sleeping, nausea, and trouble concentrating. However, some people may not experience any symptoms at all.",
            "What causes kidney disease?",
            "There are many causes, including diabetes, high blood pressure, and genetic factors.",
            "How can I prevent kidney disease?",
            "Maintaining a healthy lifestyle can help prevent kidney disease. This includes eating a balanced diet, exercising regularly, not smoking, and managing underlying conditions such as diabetes and high blood pressure.",
            "Thanks for the information, Medi. Goodbye for now."
        ],
        "knowledge": "Kidney disease Kidney disease Gabow 1990 talks about Autosomal Dominant Polycystic Kidney disease and how this disease is genetic.  They go on to say 'Autosomal dominant polycystic kidney disease  is the most common genetic disease, affecting a half million Americans.  The clinical phenotype can result from at least two different gene defects.  One gene that can cause ADPKD has been located on the short arm of chromosome 16. ' The same article also goes on to say that millions of Americans are affected by this disease and is very common. Yende & Parikh 2021 talk about the effects that COVID can have on a person that has a pre-existing health issue regarding kidney diseases.  'Frailty, chronic diseases, disability and immunodeficiency are at increased risk of kidney disease and progression to kidney failure, and infection with SARS-CoV-2 can further increase this risk'  Kidney disease Kidney disease",
        "response": "People with pre-existing kidney disease are at an increased risk of developing severe illness from COVID-19. This includes people with chronic kidney disease, kidney transplants, and those on dialysis."
    },
    {
        "dialog": [
            "Hi Medi, I just had a kidney transplant. What should I do now?",
            "Congratulations on your successful transplant! After a kidney transplant, it's important to take immunosuppressant medication to prevent rejection of the new kidney.",
            "Are there any lifestyle changes I should make?",
            "Yes, it's important to maintain a healthy lifestyle by eating a balanced diet, exercising regularly, not smoking, and monitoring your blood pressure and blood sugar levels.",
            "Are there any activities I should avoid?",
            "Yes, you should avoid contact sports and heavy lifting to prevent damage to the new kidney. It's also important to avoid exposure to infections and germs.",
            "Okay, thanks for the advice, Medi.",
            "You're welcome. Keep me updated on your progress.",
            "What are the risks of a kidney transplant?"
        ],
        "knowledge": "Kidney disease Kidney disease Gabow 1990 talks about Autosomal Dominant Polycystic Kidney disease and how this disease is genetic.  They go on to say 'Autosomal dominant polycystic kidney disease  is the most common genetic disease, affecting a half million Americans.  The clinical phenotype can result from at least two different gene defects.  One gene that can cause ADPKD has been located on the short arm of chromosome 16. ' The same article also goes on to say that millions of Americans are affected by this disease and is very common. Yende & Parikh 2021 talk about the effects that COVID can have on a person that has a pre-existing health issue regarding kidney diseases.  'Frailty, chronic diseases, disability and immunodeficiency are at increased risk of kidney disease and progression to kidney failure, and infection with SARS-CoV-2 can further increase this risk'  Kidney disease Kidney disease",
        "response": "There are risks associated with kidney transplant surgery, such as bleeding, infection, and rejection of the new kidney. It's important to follow your doctor's instructions and attend regular check-ups to monitor your progress."
    },
    {
        "dialog": [
            "Hi Medi, I think I might have Kidney disease. Can you help me?",
            "Of course, I am here to help you. What symptoms are you experiencing?",
            "I have been experiencing lower back pain and frequent urination for a few days.",
            "I see. Have you noticed any blood in your urine or difficulty passing urine?",
            "Yes, I have noticed a little blood in my urine and I have to strain a little to pass urine.",
            "Based on your symptoms, you might have a kidney infection or stones. You should see a doctor immediately.",
            "What should I do until I see the doctor?",
            "You should drink plenty of fluids, especially water, and avoid caffeine and alcohol until you see the doctor.",
            "Thanks, Medi. How common is Kidney disease?"
        ],
        "knowledge": "Kidney disease Kidney disease Gabow 1990 talks about Autosomal Dominant Polycystic Kidney disease and how this disease is genetic.  They go on to say 'Autosomal dominant polycystic kidney disease  is the most common genetic disease, affecting a half million Americans.  The clinical phenotype can result from at least two different gene defects.  One gene that can cause ADPKD has been located on the short arm of chromosome 16. ' The same article also goes on to say that millions of Americans are affected by this disease and is very common. Yende & Parikh 2021 talk about the effects that COVID can have on a person that has a pre-existing health issue regarding kidney diseases.  'Frailty, chronic diseases, disability and immunodeficiency are at increased risk of kidney disease and progression to kidney failure, and infection with SARS-CoV-2 can further increase this risk.'  Kidney disease Kidney disease",
        "response": "Kidney disease is very common, and millions of Americans are affected by it."
    },
    {
        "dialog": [
            "Hi Medi, I have a question about Kidney disease.",
            "Sure, what would you like to know?",
            "What causes Kidney disease?",
            "Kidney disease can be caused by various factors such as high blood pressure, diabetes, and genetic factors.",
            "What are the symptoms of Kidney disease?",
            "The symptoms of Kidney disease include fatigue, swollen ankles, decreased appetite, itchy skin, and increased urination.",
            "How can I prevent Kidney disease?",
            "To prevent Kidney disease, you should maintain a healthy and balanced diet, exercise regularly, manage your blood pressure and blood sugar levels, and avoid smoking and excessive alcohol consumption.",
            "Thanks, Medi. Is Kidney disease curable?"
        ],
        "knowledge": "Kidney disease Kidney disease Gabow 1990 talks about Autosomal Dominant Polycystic Kidney disease and how this disease is genetic.  They go on to say 'Autosomal dominant polycystic kidney disease  is the most common genetic disease, affecting a half million Americans.  The clinical phenotype can result from at least two different gene defects.  One gene that can cause ADPKD has been located on the short arm of chromosome 16. ' The same article also goes on to say that millions of Americans are affected by this disease and is very common. Yende & Parikh 2021 talk about the effects that COVID can have on a person that has a pre-existing health issue regarding kidney diseases.  'Frailty, chronic diseases, disability and immunodeficiency are at increased risk of kidney disease and progression to kidney failure, and infection with SARS-CoV-2 can further increase this risk.'  Kidney disease Kidney disease",
        "response": "The treatment for Kidney disease depends on the underlying cause and severity of the disease. In some cases, Kidney disease can be cured, but in other cases, it can only be managed."
    },
    {
        "dialog": [
            "Hi Medi, I just underwent a medical procedure for Kidney disease. What should I do now?",
            "After your medical procedure, you should rest and avoid strenuous activities for a few days.",
            "Should I change my diet?",
            "Yes, you should avoid foods that are high in sodium and potassium and follow a low-protein diet as recommended by your doctor.",
            "Can I exercise?",
            "Yes, but you should wait for a few days, and only do light exercises. Consult with your doctor for specific recommendations.",
            "Are there any supplements I can take?",
            "You should always consult with your doctor before taking any supplements, as some supplements can be harmful to your kidneys.",
            "Thanks, Medi. What else should I be aware of after my procedure?"
        ],
        "knowledge": "Kidney disease Kidney disease Gabow 1990 talks about Autosomal Dominant Polycystic Kidney disease and how this disease is genetic.  They go on to say 'Autosomal dominant polycystic kidney disease  is the most common genetic disease, affecting a half million Americans.  The clinical phenotype can result from at least two different gene defects.  One gene that can cause ADPKD has been located on the short arm of chromosome 16. ' The same article also goes on to say that millions of Americans are affected by this disease and is very common. Yende & Parikh 2021 talk about the effects that COVID can have on a person that has a pre-existing health issue regarding kidney diseases.  'Frailty, chronic diseases, disability and immunodeficiency are at increased risk of kidney disease and progression to kidney failure, and infection with SARS-CoV-2 can further increase this risk.'  Kidney disease Kidney disease",
        "response": "After your procedure, you should avoid smoking and excessive alcohol consumption, and follow up with your doctor for regular check-ups to monitor your kidney function."
    }
]