[
    {
        "dialog": [
            "Hi, Medi! I have symptoms of a cold. Can you help me?",
            "Of course! Please describe your symptoms.",
            "I've been coughing a lot with a sore throat and a runny nose.",
            "Based on your symptoms, you may have a common cold.",
            "How can I treat my cold?",
            "You can treat your cold by getting plenty of rest and drinking lots of fluids.",
            "Okay, thank you for the advice. How long does a cold usually last?",
            "A cold usually lasts about a week, but you should start to feel better after a few days.",
            "Thanks for your help, Medi! Goodbye."
        ],
        "knowledge": "Common cold Common cold  As a result, parents missed 126 million workdays to stay home to care for their children. When added to the 150 million workdays missed by employees who have a cold, the total economic impact of cold-related work loss exceeds $20 billion per year. This accounts for 40% of time lost from work in the United States. NotesBibliography Common cold Common cold",
        "response": "You're welcome! Take care of yourself and get plenty of rest."
    },
    {
        "dialog": [
            "Hi, Medi! Can you tell me more about the common cold?",
            "Certainly! The common cold is a viral infection that affects the upper respiratory tract.",
            "What are some symptoms of a cold?",
            "Common symptoms of a cold include coughing, sneezing, runny nose, sore throat, and congestion.",
            "How is a cold spread?",
            "A cold is spread through droplets in the air when someone with a cold coughs or sneezes. You can also catch a cold by touching a surface contaminated with the virus and then touching your face.",
            "Okay, thank you for the information! Is there a cure for the common cold?",
            "There is no cure for the common cold, but you can treat the symptoms with rest, fluids, and over-the-counter medication.",
            "Alright, thanks for your help, Medi! Goodbye."
        ],
        "knowledge": "Common cold Common cold  As a result, parents missed 126 million workdays to stay home to care for their children. When added to the 150 million workdays missed by employees who have a cold, the total economic impact of cold-related work loss exceeds $20 billion per year. This accounts for 40% of time lost from work in the United States. NotesBibliography Common cold Common cold",
        "response": "You're welcome! Stay healthy and avoid contact with people who have a cold if possible."
    },
    {
        "dialog": [
            "Hi, Medi! I just recovered from a cold. What should I do to prevent catching another one?",
            "Good job on recovering from your cold! To prevent catching another one, you should wash your hands often, avoid touching your face, and avoid close contact with people who are sick.",
            "Are there any other steps I can take to prevent a cold?",
            "Yes, make sure you get plenty of rest, eat a healthy diet, and exercise regularly to strengthen your immune system.",
            "Okay, thank you for the advice! Can I still exercise while I have a cold?",
            "It's best to avoid exercising when you have a cold and let your body rest. Exercise can make your symptoms worse and prolong your recovery time.",
            "Alright, thank you for the help, Medi! Goodbye.",
            "You're welcome! Stay healthy and take care!"
        ],
        "knowledge": "Common cold Common cold  As a result, parents missed 126 million workdays to stay home to care for their children. When added to the 150 million workdays missed by employees who have a cold, the total economic impact of cold-related work loss exceeds $20 billion per year. This accounts for 40% of time lost from work in the United States. NotesBibliography Common cold Common cold",
        "response": "You're welcome! Let me know if you have any other questions."
    },
    {
        "dialog": [
            "Hello Medi, I have a terrible cold.",
            "I'm sorry to hear that. What are your symptoms?",
            "I have a runny nose, coughing, and a fever.",
            "Based on your symptoms, you might have a cold. Get plenty of rest and drink lots of fluids.",
            "Is there anything else I can do to feel better?",
            "You can use a humidifier to help with congestion or take over-the-counter medication.",
            "Thank you for your help. How long will this cold last?",
            "It varies, but usually lasts around a week. Be sure to get lots of rest and stay hydrated.",
            "Okay, thank you for your advice."
        ],
        "knowledge": "Common cold Common cold  As a result, parents missed 126 million workdays to stay home to care for their children.  When added to the 150 million workdays missed by employees who have a cold, the total economic impact of cold-related work loss exceeds $20 billion per year.  This accounts for 40% of time lost from work in the United States. NotesBibliography Common cold Common cold",
        "response": "You're welcome. Get plenty of rest and stay hydrated. The cold usually lasts around a week."
    },
    {
        "dialog": [
            "Hello Medi, I have a question about the common cold.",
            "Sure, what would you like to know?",
            "What causes the common cold?",
            "The common cold is caused by a virus that infects the upper respiratory system.",
            "How can I prevent getting a cold?",
            "You can prevent getting a cold by washing your hands frequently, avoiding close contact with sick people, and not touching your face.",
            "Are there any treatments for the common cold?",
            "There is no cure for the common cold, but you can treat the symptoms with over-the-counter medication and get plenty of rest.",
            "Thank you, that was very helpful."
        ],
        "knowledge": "Common cold Common cold  As a result, parents missed 126 million workdays to stay home to care for their children.  When added to the 150 million workdays missed by employees who have a cold, the total economic impact of cold-related work loss exceeds $20 billion per year.  This accounts for 40% of time lost from work in the United States. NotesBibliography Common cold Common cold",
        "response": "You're welcome. Remember to wash your hands frequently and avoid close contact with sick people to prevent getting a cold."
    },
    {
        "dialog": [
            "Hello Medi, I recently had a cold and want to improve my health.",
            "Sure, what would you like advice on?",
            "What should I eat to help my body recover from the cold?",
            "You should eat foods that are high in nutrients like fruits and vegetables, and drink plenty of fluids like water and herbal tea.",
            "What kind of exercise should I do?",
            "You should start with light exercise like walking or yoga and gradually increase intensity as you feel better.",
            "Is there anything else I can do to improve my health?",
            "You can get plenty of rest, manage stress with activities like meditation or deep breathing, and avoid smoking and alcohol.",
            "Thank you for your help."
        ],
        "knowledge": "Common cold Common cold  As a result, parents missed 126 million workdays to stay home to care for their children.  When added to the 150 million workdays missed by employees who have a cold, the total economic impact of cold-related work loss exceeds $20 billion per year.  This accounts for 40% of time lost from work in the United States. NotesBibliography Common cold Common cold",
        "response": "You're welcome. Remember to eat nutrient-rich foods, get plenty of rest, exercise lightly, manage stress, and avoid smoking and alcohol to improve your health."
    },
    {
        "dialog": [
            "Hi Medi, I've been feeling under the weather lately.",
            "I'm sorry to hear that. Can you tell me more about your symptoms?",
            "I've been sneezing, coughing, and have a runny nose.",
            "Sounds like you might have caught a cold. Have you been taking any medications?",
            "No, I haven't. What do you recommend I take?",
            "You should try taking some over-the-counter cold medicine to relieve your symptoms.",
            "Alright, I'll give that a try. Thanks, Medi!",
            "You're welcome. Let me know if you need anything else.",
            "What can I do to prevent getting a cold in the future?"
        ],
        "knowledge": "Common cold Common cold  As a result, parents missed 126 million workdays to stay home to care for their children.  When added to the 150 million workdays missed by employees who have a cold, the total economic impact of cold-related work loss exceeds $20 billion per year.  This accounts for 40% of time lost from work in the United States. NotesBibliography Common cold Common cold",
        "response": "The best way to prevent getting a cold is to wash your hands regularly and avoid close contact with people who are sick."
    },
    {
        "dialog": [
            "Hi Medi, I heard that some people get colds more often than others. Why is that?",
            "Some people have weaker immune systems than others, making them more susceptible to getting sick.",
            "What can I do to strengthen my immune system?",
            "Eating a balanced diet, getting enough sleep, and exercising regularly can all help boost your immune system.",
            "That's good to know. Are there any supplements I should be taking?",
            "There is no one supplement that will guarantee a strong immune system, but some supplements such as Vitamin C and Zinc have been shown to help.",
            "I see. Thanks for the advice, Medi!",
            "Of course, happy to help.",
            "What about taking antibiotics to treat a cold? Is that a good idea?"
        ],
        "knowledge": "Common cold Common cold  As a result, parents missed 126 million workdays to stay home to care for their children.  When added to the 150 million workdays missed by employees who have a cold, the total economic impact of cold-related work loss exceeds $20 billion per year.  This accounts for 40% of time lost from work in the United States. NotesBibliography Common cold Common cold",
        "response": "Antibiotics are not effective against colds, as they only work against bacteria and not viruses like the common cold."
    },
    {
        "dialog": [
            "Hi Medi, I just recovered from a cold. What should I do to prevent getting another cold?",
            "Glad to hear you're feeling better. You should continue to practice good hygiene, such as washing your hands regularly and avoiding close contact with people who are sick.",
            "What about wearing a face mask? Is that effective at preventing a cold?",
            "Wearing a face mask can be effective at preventing the spread of a cold, especially if you are already sick.",
            "That makes sense. What else can I do to prevent getting sick in general?",
            "Eating a balanced diet, getting enough sleep, and managing your stress levels can all help boost your immune system and prevent illness.",
            "Thanks for the advice, Medi! I'll be sure to keep that in mind.",
            "You're welcome. Let me know if you have any other questions.",
            "Is it possible to get a cold in the summer?"
        ],
        "knowledge": "Common cold Common cold  As a result, parents missed 126 million workdays to stay home to care for their children.  When added to the 150 million workdays missed by employees who have a cold, the total economic impact of cold-related work loss exceeds $20 billion per year.  This accounts for 40% of time lost from work in the United States. NotesBibliography Common cold Common cold",
        "response": "Yes, it is possible to get a cold in the summer, although it is less common than during the winter months."
    },
    {
        "dialog": [
            "Hello Medi, I've been feeling under the weather lately.",
            "Hi there, let me know what kind of symptoms do you have?",
            "I have a runny nose, sore throat, and a mild headache",
            "Based on your symptoms, you might have a common cold. Have you taken your temperature?",
            "Yes, I have a fever of 37.8 degrees Celsius.",
            "It seems like your symptoms are due to a cold. I recommend you to rest and drink plenty of water",
            "Thanks for your advice. Do you have any medication recommendations for my symptoms?",
            "There is no cure for the common cold, but over-the-counter drugs like paracetamol or ibuprofen can reduce fever and relieve pain.",
            "Thanks, Medi. How long will it take for me to recover?"
        ],
        "knowledge": "Common cold Common cold As a result, parents missed 126 million workdays to stay home to care for their children. When added to the 150 million workdays missed by employees who have a cold, the total economic impact of cold-related work loss exceeds $20 billion per year. This accounts for 40% of time lost from work in the United States. NotesBibliography Common cold Common cold",
        "response": "It usually takes 7-10 days to recover from a common cold. However, if your symptoms persist or get worse, you should seek medical care."
    },
    {
        "dialog": [
            "Hi Medi, I have a question about the common cold.",
            "Sure, I'm here to answer your question. What do you want to know?",
            "I'm curious about how the common cold is spread.",
            "The common cold is spread through the air when an infected person coughs, sneezes, or talks. It can also be spread by touching contaminated surfaces or objects.",
            "That's interesting. How can I protect myself from getting a cold?",
            "You can protect yourself by washing your hands regularly, avoiding close contact with sick people, and not touching your face with unwashed hands.",
            "Thank you, Medi. One more thing, can a cold turn into a more serious illness?",
            "In rare cases, a cold can lead to more serious infections like pneumonia, bronchitis, or sinusitis. However, most cases of the common cold are mild and self-limited.",
            "Thanks for the information, Medi. I'll make sure to take precautions to avoid getting a cold."
        ],
        "knowledge": "Common cold Common cold As a result, parents missed 126 million workdays to stay home to care for their children. When added to the 150 million workdays missed by employees who have a cold, the total economic impact of cold-related work loss exceeds $20 billion per year. This accounts for 40% of time lost from work in the United States. NotesBibliography Common cold Common cold",
        "response": "You're welcome. Remember to take care of yourself and take precautions to avoid getting a cold."
    },
    {
        "dialog": [
            "Hello Medi, I recently had a procedure at the hospital. Can you give me some advice on post-procedure care?",
            "Sure, what kind of procedure did you have?",
            "I had surgery to remove my appendix",
            "After surgery, it's important to get plenty of rest and avoid strenuous physical activity. You should also follow a healthy diet and drink plenty of fluids.",
            "Should I take any medication for pain relief?",
            "Your doctor will prescribe pain medication if necessary. Make sure to take it as directed.",
            "Got it. When can I resume my regular activities?",
            "You should avoid strenuous activity for at least a week, and gradually return to your normal routine as you feel better.",
            "Thank you, Medi. Do you have any other advice?"
        ],
        "knowledge": "Common cold Common cold As a result, parents missed 126 million workdays to stay home to care for their children. When added to the 150 million workdays missed by employees who have a cold, the total economic impact of cold-related work loss exceeds $20 billion per year. This accounts for 40% of time lost from work in the United States. NotesBibliography Common cold Common cold",
        "response": "You're welcome. Remember to take it easy and follow your doctor's instructions for a smooth recovery."
    },
    {
        "dialog": [
            "Hello Medi, I think I got the common cold.",
            "Hi! What are your symptoms?",
            "I have a runny nose, sore throat, and a cough.",
            "It sounds like you have the common cold. Get plenty of rest and drink lots of fluids.",
            "Is there anything else I can do to feel better?",
            "Try using a humidifier or taking a steamy shower to help clear your sinuses.",
            "Thank you, Medi. How long does the common cold usually last?",
            "Typically, it lasts for about a week. If your symptoms persist or worsen, please contact a healthcare provider.",
            "Okay, I will keep that in mind. Thank you, Medi."
        ],
        "knowledge": "Common cold Common cold  As a result, parents missed 126 million workdays to stay home to care for their children.  When added to the 150 million workdays missed by employees who have a cold, the total economic impact of cold-related work loss exceeds $20 billion per year.  This accounts for 40% of time lost from work in the United States. NotesBibliography Common cold Common cold",
        "response": "You're welcome! Glad to help."
    },
    {
        "dialog": [
            "Hello Medi, I just recovered from a cold. What can I do to prevent getting sick again?",
            "Hi! There are some things you can do to prevent getting sick again.",
            "Tell me more about that.",
            "Wash your hands regularly, avoid close contact with sick people, and disinfect frequently touched surfaces.",
            "Are there any foods or supplements I can take to boost my immune system?",
            "Eating a healthy, balanced diet and getting enough sleep are the best ways to boost your immune system.",
            "Great, thank you, Medi. Is there anything else I can do?",
            "Stress can weaken your immune system, so try to manage your stress levels and make time for relaxation.",
            "That's helpful, thanks a lot Medi."
        ],
        "knowledge": "Common cold Common cold  As a result, parents missed 126 million workdays to stay home to care for their children.  When added to the 150 million workdays missed by employees who have a cold, the total economic impact of cold-related work loss exceeds $20 billion per year.  This accounts for 40% of time lost from work in the United States. NotesBibliography Common cold Common cold",
        "response": "You're welcome! Have a nice day."
    },
    {
        "dialog": [
            "Hello Medi, I just got over a cold. What can I do to get my energy back?",
            "Hi! Getting plenty of rest and drinking lots of fluids can help restore your energy levels.",
            "What about exercise? Can I start exercising again?",
            "It's best to wait until you have fully recovered before starting to exercise again.",
            "Okay, that makes sense. How about my diet? Are there any foods that can help me regain my energy?",
            "Eating a healthy, balanced diet with plenty of fruits, vegetables, and whole grains can help you feel more energized.",
            "That's helpful, thank you, Medi. Is there anything else I can do?",
            "Reducing your stress levels and making time for relaxation can also help you feel more energized.",
            "Thanks, Medi. I will keep that in mind."
        ],
        "knowledge": "Common cold Common cold  As a result, parents missed 126 million workdays to stay home to care for their children.  When added to the 150 million workdays missed by employees who have a cold, the total economic impact of cold-related work loss exceeds $20 billion per year.  This accounts for 40% of time lost from work in the United States. NotesBibliography Common cold Common cold",
        "response": "You're welcome! Stay healthy!"
    },
    {
        "dialog": [
            "Hi Medi, I feel like I'm catching a cold.",
            "Hello! I'm here to help. Can you tell me your symptoms?",
            "I have a sore throat and runny nose. My head also hurts",
            "You might have a cold. Drink plenty of fluids and get some rest",
            "What else can I do to feel better?",
            "Taking over-the-counter medication can help with symptoms. Avoid contact with others to prevent spreading it",
            "Thanks, I'll follow your advice",
            "You're welcome. Hope you feel better soon",
            "Can I take ibuprofen for the headache?"
        ],
        "knowledge": "Common cold Common cold As a result, parents missed 126 million workdays to stay home to care for their children.  When added to the 150 million workdays missed by employees who have a cold, the total economic impact of cold-related work loss exceeds $20 billion per year.  This accounts for 40% of time lost from work in the United States. NotesBibliography Common cold Common cold",
        "response": "Yes, ibuprofen can help relieve headaches. But make sure to follow the recommended dosage."
    },
    {
        "dialog": [
            "Hey Medi, I had a cold last week and I'm worried it might turn into something worse",
            "Hello! What symptoms are you experiencing now?",
            "I'm still coughing and have a runny nose",
            "It's common for a cough to last for a few weeks after a cold. But if you're worried, you can visit a doctor",
            "Okay, I'll keep an eye on it",
            "Make sure to rest and stay hydrated. Also, wash your hands to prevent spreading it",
            "Thanks, I'll do that",
            "You're welcome. Let me know if you need any more advice",
            "Do I need to take any medication?"
        ],
        "knowledge": "Common cold Common cold As a result, parents missed 126 million workdays to stay home to care for their children. When added to the 150 million workdays missed by employees who have a cold, the total economic impact of cold-related work loss exceeds $20 billion per year. This accounts for 40% of time lost from work in the United States. NotesBibliography Common cold Common cold",
        "response": "If your symptoms aren't severe, medication might not be necessary. But you can take over-the-counter medication to help with symptoms if needed."
    },
    {
        "dialog": [
            "Hi Medi, I just recovered from a cold. What can I do to avoid getting it again?",
            "Hello! Congratulations on your recovery. To avoid getting sick again, make sure to wash your hands frequently",
            "What else can I do?",
            "Try to avoid close contact with sick people. Also, avoid touching your face since this can spread germs",
            "Anything else?",
            "A healthy diet and regular exercise can also boost your immune system",
            "That makes sense. Thanks for the advice",
            "You're welcome! Stay healthy",
            "How often should I wash my hands?"
        ],
        "knowledge": "Common cold Common cold As a result, parents missed 126 million workdays to stay home to care for their children.  When added to the 150 million workdays missed by employees who have a cold, the total economic impact of cold-related work loss exceeds $20 billion per year.  This accounts for 40% of time lost from work in the United States. NotesBibliography Common cold Common cold",
        "response": "Wash your hands for at least 20 seconds, especially before eating, after using the restroom, and after being in public places."
    },
    {
        "dialog": [
            "Hi there Medi, I think I have a cold.",
            "Hello! Let me help you out, what are your symptoms?",
            "I am experiencing a runny nose, a sore throat, and a headache.",
            "Okay, based on your symptoms, you might have a common cold. Please take rest and drink plenty of fluids.",
            "Is there anything else I can do to help?",
            "You can also gargle with salt water and take pain relievers to alleviate your symptoms.",
            "Alright, I will follow your advice. Thank you, Medi!",
            "You're welcome! Take care and let me know if you have any more concerns."
        ],
        "knowledge": "Common cold Common cold  As a result, parents missed 126 million workdays to stay home to care for their children.  When added to the 150 million workdays missed by employees who have a cold, the total economic impact of cold-related work loss exceeds $20 billion per year.  This accounts for 40% of time lost from work in the United States. NotesBibliography Common cold Common cold",
        "response": "Thank you for your advice, Medi. Can I take any medication for my cold?"
    },
    {
        "dialog": [
            "Hello Medi, can you tell me more about the common cold?",
            "Certainly! A common cold is a viral infection that affects your upper respiratory tract.",
            "What are the symptoms of a common cold?",
            "The most common symptoms are stuffy or runny nose, sore throat, cough, and congestion. Some people also experience headaches, body aches, and a low-grade fever.",
            "How long does it last?",
            "The symptoms usually last for about a week, but it can take up to two weeks to fully recover.",
            "Is there anything I can do to prevent it?",
            "Washing your hands regularly, avoiding contact with people who have colds, and refraining from touching your face are some ways to prevent it.",
            "Good to know, thanks for the information, Medi!"
        ],
        "knowledge": "Common cold Common cold  As a result, parents missed 126 million workdays to stay home to care for their children.  When added to the 150 million workdays missed by employees who have a cold, the total economic impact of cold-related work loss exceeds $20 billion per year.  This accounts for 40% of time lost from work in the United States. NotesBibliography Common cold Common cold",
        "response": "That was helpful, Medi. Can a common cold lead to any other complications?"
    },
    {
        "dialog": [
            "Hi Medi, I just recovered from a cold. What can I do to prevent getting another one?",
            "Hello! One way to prevent another cold is to boost your immune system by eating a balanced diet, exercising regularly, and getting enough sleep.",
            "Are there any specific foods or supplements that help boost the immune system?",
            "Foods rich in Vitamin C, such as citrus fruits and leafy greens, can help improve your immune system. Zinc supplements have also been shown to be effective in preventing colds.",
            "Is there anything else I should be doing?",
            "Washing your hands regularly and avoiding contact with sick people can also reduce your risk of getting a cold.",
            "Thank you, Medi. I'll make sure to take care of myself.",
            "You're welcome! Take care and let me know if you have any more questions."
        ],
        "knowledge": "Common cold Common cold  As a result, parents missed 126 million workdays to stay home to care for their children.  When added to the 150 million workdays missed by employees who have a cold, the total economic impact of cold-related work loss exceeds $20 billion per year.  This accounts for 40% of time lost from work in the United States. NotesBibliography Common cold Common cold",
        "response": "Thanks for the advice, Medi. Is it possible to get a cold during the summer months?"
    },
    {
        "dialog": [
            "Hi Medi, I am suffering from a cold and I need your help.",
            "Hi, I am here to assist you. What symptoms do you have?",
            "I have a cough and I feel tired all the time.",
            "Okay. You may have a common cold. You should rest and drink plenty of fluids.",
            "What should I do about the cough? It's really bothersome.",
            "You can try over-the-counter cough medicine for relief.",
            "Thank you, Medi. Is there anything else I can do?",
            "Yes. You should also practice good hygiene, like washing your hands frequently, and avoid close contact with others.",
            "Thank you for your help, Medi."
        ],
        "knowledge": "Common cold Common cold  As a result, parents missed 126 million workdays to stay home to care for their children.  When added to the 150 million workdays missed by employees who have a cold, the total economic impact of cold-related work loss exceeds $20 billion per year.  This accounts for 40% of time lost from work in the United States. NotesBibliography Common cold Common cold",
        "response": "You're welcome. I hope you feel better soon."
    },
    {
        "dialog": [
            "Hello Medi, I heard that vitamin C can help fight against a cold. Is that true?",
            "Hi, that's correct. Vitamin C can boost your immune system to help fight off a cold.",
            "How much vitamin C should I take?",
            "You can take up to 2000mg per day, but it's important to talk to your doctor before taking any supplements.",
            "I see. Are there any natural sources of vitamin C?",
            "Yes, you can get vitamin C from citrus fruits like oranges and grapefruits, as well as from vegetables like broccoli and bell peppers.",
            "Thank you, Medi. Is there anything else I should know?",
            "Yes, make sure to stay hydrated and get plenty of rest to help your body fight off the cold.",
            "Thank you for the advice, Medi. I appreciate your help."
        ],
        "knowledge": "Common cold Common cold  As a result, parents missed 126 million workdays to stay home to care for their children.  When added to the 150 million workdays missed by employees who have a cold, the total economic impact of cold-related work loss exceeds $20 billion per year.  This accounts for 40% of time lost from work in the United States. NotesBibliography Common cold Common cold",
        "response": "You're welcome. I'm happy to help."
    },
    {
        "dialog": [
            "Hi Medi, I just recovered from a cold and I would like to know what I can do to prevent getting sick again.",
            "Hi. You can prevent getting sick by washing your hands frequently and avoiding close contact with people who are sick.",
            "What about taking vitamins or supplements?",
            "Taking a daily multivitamin can help boost your immune system, but it's important to talk to your doctor before taking any supplements.",
            "I see. What about getting a flu shot?",
            "Getting a flu shot can prevent you from getting the flu, but it won't protect you from other viruses like the common cold.",
            "Thank you for the advice, Medi. Is there anything else I should know?",
            "Yes, make sure to practice good hygiene like covering your mouth and nose when you cough or sneeze, and avoid touching your face.",
            "Thank you for the advice, Medi. I appreciate your help."
        ],
        "knowledge": "Common cold Common cold  As a result, parents missed 126 million workdays to stay home to care for their children.  When added to the 150 million workdays missed by employees who have a cold, the total economic impact of cold-related work loss exceeds $20 billion per year.  This accounts for 40% of time lost from work in the United States. NotesBibliography Common cold Common cold",
        "response": "You're welcome. Stay healthy!"
    },
    {
        "dialog": [
            "Hi Medi, I have some symptoms like headache and sore throat.",
            "Hello there! I'm here to help. How long have you had these symptoms?",
            "It's been a couple of days now. And also I feel a bit tired.",
            "Based on your symptoms, it seems like you might be having a cold.",
            "What should I do next?",
            "It's important to rest, drink plenty of fluids and take over-the-counter medications for relief.",
            "Alright. Is there anything else I should be doing?",
            "You should avoid contact with others to prevent transmission of the virus.",
            "Thanks for the advice. How long will it take for me to get better?"
        ],
        "knowledge": "Common cold Common cold  As a result, parents missed 126 million workdays to stay home to care for their children.  When added to the 150 million workdays missed by employees who have a cold, the total economic impact of cold-related work loss exceeds $20 billion per year.  This accounts for 40% of time lost from work in the United States. NotesBibliography Common cold Common cold",
        "response": "It usually takes about a week for the symptoms to go away completely."
    },
    {
        "dialog": [
            "Hi Medi, I heard that colds are caused by viruses. Is this true?",
            "Yes, that's correct. The common cold is caused by a virus.",
            "What kind of virus is it?",
            "The virus responsible for the common cold is called the rhinovirus.",
            "How does the virus spread?",
            "The virus is spread from person to person through the air when someone with the virus coughs or sneezes.",
            "I see. Is there anything I can do to prevent getting a cold?",
            "Washing your hands frequently, avoiding close contact with people who have a cold, and keeping your immune system healthy by eating a balanced diet and getting enough rest can all help prevent a cold.",
            "Great advice. Thank you!"
        ],
        "knowledge": "Common cold Common cold  As a result, parents missed 126 million workdays to stay home to care for their children.  When added to the 150 million workdays missed by employees who have a cold, the total economic impact of cold-related work loss exceeds $20 billion per year.  This accounts for 40% of time lost from work in the United States. NotesBibliography Common cold Common cold",
        "response": "You're welcome! I'm glad I could help."
    },
    {
        "dialog": [
            "Hi Medi, I just recovered from a cold. What should I do now?",
            "Congratulations on your recovery! To prevent getting sick again, you should make sure to wash your hands regularly and avoid close contact with people who have a cold.",
            "Is there anything else I should be doing?",
            "Eating a balanced diet and getting enough rest can also help keep your immune system healthy.",
            "What about exercise?",
            "Moderate exercise can help boost your immune system, but you should avoid overexerting yourself.",
            "Thanks for the advice. What kind of foods should I be eating?",
            "You should focus on eating a variety of fruits and vegetables, lean protein, whole grains, and healthy fats.",
            "That sounds doable. Thank you!"
        ],
        "knowledge": "Common cold Common cold  As a result, parents missed 126 million workdays to stay home to care for their children.  When added to the 150 million workdays missed by employees who have a cold, the total economic impact of cold-related work loss exceeds $20 billion per year.  This accounts for 40% of time lost from work in the United States. NotesBibliography Common cold Common cold",
        "response": "You're welcome. I'm happy to help. Let me know if you have any other questions."
    }
]