[
    {
        "dialog": [
            "Hi Medi, I think I might have asthma.",
            "Hello, can you explain your symptoms ?",
            "I have a hard time breathing and I often cough.",
            "I see. Based on your symptoms, asthma might be a possibility.",
            "What should I do if I have asthma ?",
            "It's best to see a doctor for diagnosis and treatment. You may need medication and lifestyle changes.",
            "Is there any way to prevent asthma?",
            "Avoiding exposure to indoor allergens and avoiding gas stoves can lower your risk of developing asthma.",
            "Thank you Medi. Can you tell me more about the link between gas stoves and asthma?"
        ],
        "knowledge": "Asthma Asthma  A meta-analysis concluded gas stoves are a major risk factor for asthma, finding around one in eight cases in the U. S.  could be attributed to these. The majority of the evidence does not support a causal role between paracetamol  or antibiotic use and asthma.  A 2014 systematic review found that the association between paracetamol use and asthma disappeared when respiratory infections were taken into account.  Maternal psychological stress during pregnancy is a risk factor for the child to develop asthma. Asthma is associated with exposure to indoor allergens Asthma Asthma",
        "response": "Gas stoves are a major risk factor for asthma, around one in eight cases in the U. S. could be attributed to these."
    },
    {
        "dialog": [
            "Hi Medi, I have a question about asthma.",
            "What's your question ?",
            "Can asthma develop later in life ?",
            "Yes, it's possible for asthma to develop in adulthood. It is called adult-onset asthma",
            "What are the causes of adult-onset asthma ?",
            "The causes of adult-onset asthma are not well understood, but exposure to allergens, air pollution, and respiratory infections could play a role.",
            "Is there any way to treat or manage adult-onset asthma ?",
            "Yes, treatment for adult-onset asthma is similar to childhood asthma, including medication and lifestyle changes.",
            "Thank you Medi. Can you tell me more about the link between asthma and allergens?"
        ],
        "knowledge": "Asthma Asthma  A meta-analysis concluded gas stoves are a major risk factor for asthma, finding around one in eight cases in the U. S.  could be attributed to these. The majority of the evidence does not support a causal role between paracetamol  or antibiotic use and asthma.  A 2014 systematic review found that the association between paracetamol use and asthma disappeared when respiratory infections were taken into account.  Maternal psychological stress during pregnancy is a risk factor for the child to develop asthma. Asthma is associated with exposure to indoor allergens Asthma Asthma",
        "response": "Exposure to indoor allergens such as dust mites, pet dander, mold, and cockroaches are associated with the development of asthma."
    },
    {
        "dialog": [
            "Hi Medi, I recently had a medical procedure for my asthma and I want some advice.",
            "Sure, what kind of advice do you need ?",
            "I want to know what kind of exercise I can do after the procedure.",
            "Moderate exercise is good for asthma patients after a medical procedure. You can try walking, swimming, or cycling.",
            "What about my diet ?",
            "A healthy diet with plenty of fruits, vegetables, and lean protein is recommended for asthma patients. Avoiding processed foods and sugary drinks is also helpful.",
            "Are there any lifestyle changes I need to make ?",
            "Yes, avoiding exposure to allergens and irritants that trigger your asthma symptoms is important. You can also practice stress-reducing activities like yoga or meditation.",
            "Thank you Medi. Can you tell me more about the link between stress and asthma ?"
        ],
        "knowledge": "Asthma Asthma  A meta-analysis concluded gas stoves are a major risk factor for asthma, finding around one in eight cases in the U. S.  could be attributed to these. The majority of the evidence does not support a causal role between paracetamol  or antibiotic use and asthma.  A 2014 systematic review found that the association between paracetamol use and asthma disappeared when respiratory infections were taken into account.  Maternal psychological stress during pregnancy is a risk factor for the child to develop asthma. Asthma is associated with exposure to indoor allergens Asthma Asthma",
        "response": "Psychological stress during pregnancy is a risk factor for the child to develop asthma."
    },
    {
        "dialog": [
            "Hello Medi, I have been coughing for a week. Can you help me?",
            "Sure, Is there anything else you feel besides coughing?",
            "Well, yes, I also feel a bit short of breath and tightness in my chest.",
            "I see. Based on your symptoms, you may have asthma. Do you have a history of asthma?",
            "No, I don't have any history of asthma.",
            "Okay, I suggest you see a doctor immediately for further examination. In the meantime, avoid triggers that can worsen your symptoms.",
            "What kind of triggers should I avoid?",
            "Avoid exposure to allergens such as dust, pollen or pet dander, cold air, and smoke.",
            "Thank you for your advice, Medi. What kind of treatment is available for asthma?"
        ],
        "knowledge": "Asthma Asthma A meta-analysis concluded gas stoves are a major risk factor for asthma, finding around one in eight cases in the U. S.  could be attributed to these. The majority of the evidence does not support a causal role between paracetamol  or antibiotic use and asthma.  A 2014 systematic review found that the association between paracetamol use and asthma disappeared when respiratory infections were taken into account.  Maternal psychological stress during pregnancy is a risk factor for the child to develop asthma. Asthma is associated with exposure to indoor allergens Asthma Asthma",
        "response": "There are several treatments available such as inhalers that help relax the muscles around the airways, corticosteroids, and bronchodilators."
    },
    {
        "dialog": [
            "Hello Medi, can you tell me more about asthma?",
            "Sure, what would you like to know about asthma?",
            "I want to know what are the common symptoms of asthma?",
            "The most common symptoms of asthma are coughing, wheezing, shortness of breath, and chest tightness.",
            "What are the triggers that can cause asthma symptoms?",
            "There are many triggers that can cause asthma symptoms such as dust, pollen, pet dander, cold air, and smoke.",
            "Is there any way to prevent asthma attacks?",
            "Yes, managing your asthma triggers, taking your medication as prescribed, and keeping regular check-ups with your doctor can help prevent asthma attacks.",
            "Thank you, Medi. One last question, can asthma be cured?"
        ],
        "knowledge": "Asthma Asthma A meta-analysis concluded gas stoves are a major risk factor for asthma, finding around one in eight cases in the U. S.  could be attributed to these. The majority of the evidence does not support a causal role between paracetamol  or antibiotic use and asthma.  A 2014 systematic review found that the association between paracetamol use and asthma disappeared when respiratory infections were taken into account.  Maternal psychological stress during pregnancy is a risk factor for the child to develop asthma. Asthma is associated with exposure to indoor allergens Asthma Asthma",
        "response": "Currently, there is no cure for asthma, but it can be managed effectively with appropriate treatment and lifestyle changes."
    },
    {
        "dialog": [
            "Hello Medi, I just had a spirometry test and was diagnosed with asthma. What should I do now?",
            "I suggest you work with your doctor to develop an asthma action plan. This plan will help you manage your symptoms and prevent asthma attacks.",
            "What should I include in my asthma action plan?",
            "Your asthma action plan should include your daily medications, how to recognize worsening symptoms, what to do during an asthma attack, and when to seek emergency medical care.",
            "Can I still exercise or play sports with asthma?",
            "Yes, you can still exercise and play sports with asthma. In fact, regular exercise can improve your lung function and overall health. Just make sure to talk to your doctor and include exercise in your asthma action plan.",
            "Thank you, Medi. One last question, how often should I see my doctor?",
            "You should see your doctor regularly to monitor your symptoms and adjust your treatment plan if necessary. Your doctor will let you know how often you should come in for check-ups based on the severity of your asthma.",
            "Thank you for your advice, Medi."
        ],
        "knowledge": "Asthma Asthma A meta-analysis concluded gas stoves are a major risk factor for asthma, finding around one in eight cases in the U. S.  could be attributed to these. The majority of the evidence does not support a causal role between paracetamol  or antibiotic use and asthma.  A 2014 systematic review found that the association between paracetamol use and asthma disappeared when respiratory infections were taken into account.  Maternal psychological stress during pregnancy is a risk factor for the child to develop asthma. Asthma is associated with exposure to indoor allergens Asthma Asthma",
        "response": "You're welcome. I hope this information helps you manage your asthma effectively."
    },
    {
        "dialog": [
            "Hi Medi, I have been experiencing difficulty breathing lately.",
            "Hello! I'm here to help. Can you tell me more?",
            "I feel like I can't catch my breath and my chest feels tight.",
            "Based on your symptoms, it's possible that you may have asthma.",
            "What can I do to alleviate my symptoms?",
            "You can try using an inhaler to open up your airways. Avoiding triggers like pollen or smoke can also help.",
            "Is this condition serious?",
            "It can be serious if not managed properly. Regular check-ups with a doctor are important.",
            "What are some common triggers of asthma?"
        ],
        "knowledge": "Asthma Asthma  A meta-analysis concluded gas stoves are a major risk factor for asthma, finding around one in eight cases in the U. S.  could be attributed to these. The majority of the evidence does not support a causal role between paracetamol  or antibiotic use and asthma.  A 2014 systematic review found that the association between paracetamol use and asthma disappeared when respiratory infections were taken into account.  Maternal psychological stress during pregnancy is a risk factor for the child to develop asthma. Asthma is associated with exposure to indoor allergens Asthma Asthma",
        "response": "Some common triggers of asthma include pollen, dust mites, mold, pet dander, and smoke."
    },
    {
        "dialog": [
            "Hi Medi, I have a question about asthma.",
            "Sure, what's your question?",
            "Can asthma go away on its own?",
            "Unfortunately, asthma is a chronic condition and cannot go away on its own. However, it can be managed with proper treatment.",
            "What kind of treatment options are available for asthma?",
            "Treatment options include inhalers, steroids, or bronchodilators to help open up airways and reduce inflammation.",
            "Are there any lifestyle changes I can make to help manage my asthma?",
            "Yes, regular exercise and a healthy diet can help manage symptoms. It's also important to avoid triggers like smoke or pollution.",
            "Can asthma be cured?"
        ],
        "knowledge": "Asthma Asthma  A meta-analysis concluded gas stoves are a major risk factor for asthma, finding around one in eight cases in the U. S.  could be attributed to these. The majority of the evidence does not support a causal role between paracetamol  or antibiotic use and asthma.  A 2014 systematic review found that the association between paracetamol use and asthma disappeared when respiratory infections were taken into account.  Maternal psychological stress during pregnancy is a risk factor for the child to develop asthma. Asthma is associated with exposure to indoor allergens Asthma Asthma",
        "response": "No, asthma cannot be cured. However, it can be managed with proper treatment and lifestyle changes."
    },
    {
        "dialog": [
            "Hi Medi, I recently had an asthma attack and I'm wondering how to prevent it from happening again.",
            "I'm sorry to hear that. Can you tell me more about what happened?",
            "I was out running and felt short of breath. I started wheezing and had a tightness in my chest.",
            "It's possible that exercise-induced asthma may have contributed to your attack. It's important to use your inhaler before exercise and warm up properly.",
            "What are some other triggers I should be aware of to prevent future attacks?",
            "Other triggers include pollen, dust mites, mold, and pet dander. It's important to avoid these triggers and keep your environment clean.",
            "What can I do if I experience an asthma attack?",
            "If you experience an attack, use your inhaler and seek medical attention immediately if your symptoms worsen.",
            "Is it possible to die from an asthma attack?"
        ],
        "knowledge": "Asthma Asthma  A meta-analysis concluded gas stoves are a major risk factor for asthma, finding around one in eight cases in the U. S.  could be attributed to these. The majority of the evidence does not support a causal role between paracetamol  or antibiotic use and asthma.  A 2014 systematic review found that the association between paracetamol use and asthma disappeared when respiratory infections were taken into account.  Maternal psychological stress during pregnancy is a risk factor for the child to develop asthma. Asthma is associated with exposure to indoor allergens Asthma Asthma",
        "response": "In severe cases, asthma attacks can be life-threatening. It's important to seek medical attention immediately if your symptoms worsen during an attack."
    },
    {
        "dialog": [
            "Hello, Medi. I have been experiencing some difficulty breathing lately.",
            "Hi there. Can you tell me more about your symptoms?",
            "I feel like I can't catch my breath and I'm wheezing a lot.",
            "Based on your symptoms, you might have asthma. Have you had asthma before?",
            "I think I had it when I was a kid. But I'm not sure.",
            "I would suggest seeing a doctor to get an official diagnosis and get proper treatment.",
            "What kind of treatment options are available for asthma?",
            "There are different types of inhalers that can help relieve symptoms and prevent asthma attacks. Your doctor can help you choose the best option for you.",
            "Thank you, Medi. What are some common triggers for asthma?"
        ],
        "knowledge": "Asthma Asthma A meta-analysis concluded gas stoves are a major risk factor for asthma, finding around one in eight cases in the U. S.  could be attributed to these. The majority of the evidence does not support a causal role between paracetamol  or antibiotic use and asthma.  A 2014 systematic review found that the association between paracetamol use and asthma disappeared when respiratory infections were taken into account.  Maternal psychological stress during pregnancy is a risk factor for the child to develop asthma. Asthma is associated with exposure to indoor allergens Asthma Asthma",
        "response": "Some common triggers for asthma include exposure to indoor allergens, respiratory infections, and stress during pregnancy."
    },
    {
        "dialog": [
            "Hi Medi, I have some questions about asthma.",
            "Hi there. I'm here to help answer your questions.",
            "What exactly is asthma and how does it affect the body?",
            "Asthma is a chronic respiratory disease that causes inflammation and narrowing of the airways. This makes it difficult to breathe and can lead to wheezing, coughing, and shortness of breath.",
            "What are some of the common symptoms of asthma?",
            "Some common symptoms of asthma include wheezing, coughing, shortness of breath, and chest tightness.",
            "Is asthma curable?",
            "While asthma is not curable, it can be managed with proper treatment and medication. This can help reduce symptoms and improve quality of life.",
            "Thank you, Medi. What are some ways to prevent asthma attacks?"
        ],
        "knowledge": "Asthma Asthma A meta-analysis concluded gas stoves are a major risk factor for asthma, finding around one in eight cases in the U. S.  could be attributed to these. The majority of the evidence does not support a causal role between paracetamol  or antibiotic use and asthma.  A 2014 systematic review found that the association between paracetamol use and asthma disappeared when respiratory infections were taken into account.  Maternal psychological stress during pregnancy is a risk factor for the child to develop asthma. Asthma is associated with exposure to indoor allergens Asthma Asthma",
        "response": "Some ways to prevent asthma attacks include avoiding triggers such as allergens or irritants, taking medication as prescribed by your doctor, and having a written asthma action plan."
    },
    {
        "dialog": [
            "Hello, Medi. I recently had an asthma attack and had to be hospitalized.",
            "Oh no, I'm sorry to hear that. How are you feeling now?",
            "I'm feeling much better now, but I'm worried about having another attack.",
            "It's understandable to feel anxious after having an asthma attack. But there are steps you can take to prevent future attacks.",
            "What are some of those steps?",
            "You can work with your doctor to develop an asthma action plan that includes taking your medication as prescribed, avoiding triggers, and monitoring your symptoms.",
            "Are there any lifestyle changes I can make to help manage my asthma?",
            "Yes, adopting a healthy lifestyle can help manage asthma. This includes eating a balanced diet, getting regular exercise, and avoiding tobacco smoke.",
            "Thank you, Medi. What are some common medications used to treat asthma?"
        ],
        "knowledge": "Asthma Asthma A meta-analysis concluded gas stoves are a major risk factor for asthma, finding around one in eight cases in the U. S.  could be attributed to these. The majority of the evidence does not support a causal role between paracetamol  or antibiotic use and asthma.  A 2014 systematic review found that the association between paracetamol use and asthma disappeared when respiratory infections were taken into account.  Maternal psychological stress during pregnancy is a risk factor for the child to develop asthma. Asthma is associated with exposure to indoor allergens Asthma Asthma",
        "response": "Some common medications used to treat asthma include inhaled corticosteroids, long-acting bronchodilators, and leukotriene modifiers. Your doctor can help determine the best medication for you based on your symptoms and medical history."
    },
    {
        "dialog": [
            "Hello Medi, I have been having trouble breathing lately.",
            "Hello! I can help with that. Can you describe your symptoms?",
            "I have been wheezing and coughing a lot, especially at night.",
            "Hmm, it sounds like you may have asthma. Have you experienced this before?",
            "No, this is the first time. What should I do about it?",
            "Well, it's important to see a doctor for a proper diagnosis and treatment plan. In the meantime, try to avoid triggers like smoke or pollen.",
            "Okay, thank you. Can asthma be caused by anything in particular?",
            "Yes, exposure to indoor allergens or air pollution can be risk factors for developing asthma.",
            "That's good to know. How can I prevent asthma attacks in the future?"
        ],
        "knowledge": "Asthma Asthma  A meta-analysis concluded gas stoves are a major risk factor for asthma, finding around one in eight cases in the U. S.  could be attributed to these. The majority of the evidence does not support a causal role between paracetamol  or antibiotic use and asthma.  A 2014 systematic review found that the association between paracetamol use and asthma disappeared when respiratory infections were taken into account.  Maternal psychological stress during pregnancy is a risk factor for the child to develop asthma. Asthma is associated with exposure to indoor allergens Asthma Asthma",
        "response": "Try to avoid triggers like smoke or pollen. Exposure to indoor allergens or air pollution can be risk factors for developing asthma."
    },
    {
        "dialog": [
            "Hey Medi, can you tell me more about the link between antibiotics and asthma?",
            "Hi there! While there isn't a clear causal link between antibiotics and asthma, they may contribute to the development of asthma in certain individuals.",
            "How so?",
            "Antibiotics can disrupt the natural balance of bacteria in the gut, which can affect the immune system and increase the risk of asthma.",
            "Is there anything I can do to lower my risk?",
            "Yes, you can avoid unnecessary antibiotic use and focus on maintaining a healthy gut microbiome through diet and probiotics.",
            "That's good to know. What about pain relievers like paracetamol?",
            "There isn't strong evidence to suggest a direct link between paracetamol and asthma, but it's important to use pain relievers as directed.",
            "I see. Thank you for the advice, Medi!"
        ],
        "knowledge": "Asthma Asthma  A meta-analysis concluded gas stoves are a major risk factor for asthma, finding around one in eight cases in the U. S.  could be attributed to these. The majority of the evidence does not support a causal role between paracetamol  or antibiotic use and asthma.  A 2014 systematic review found that the association between paracetamol use and asthma disappeared when respiratory infections were taken into account.  Maternal psychological stress during pregnancy is a risk factor for the child to develop asthma. Asthma is associated with exposure to indoor allergens Asthma Asthma",
        "response": "There isn't strong evidence to suggest a direct link between paracetamol and asthma, but it's important to use pain relievers as directed. Antibiotics can disrupt the natural balance of bacteria in the gut, which can affect the immune system and increase the risk of asthma."
    },
    {
        "dialog": [
            "Hi Medi, I just had an asthma attack and was prescribed an inhaler.",
            "Hi there! I'm sorry to hear that. It's good that you have an inhaler now. Do you have any questions?",
            "Yes, how often should I use it?",
            "Typically, inhalers are used as needed to relieve symptoms. However, your doctor may have specific instructions for you based on your individual needs.",
            "Okay, thank you. Can I do anything else to manage my asthma?",
            "Yes! Maintaining a healthy lifestyle can help, such as eating a balanced diet, exercising regularly, and avoiding triggers like smoke or pollution.",
            "Got it. Is there anything else I should be aware of?",
            "It's important to have an action plan in case of an asthma attack. Make sure you know what to do and have emergency medication on hand if needed.",
            "Good advice. Thank you, Medi!"
        ],
        "knowledge": "Asthma Asthma  A meta-analysis concluded gas stoves are a major risk factor for asthma, finding around one in eight cases in the U. S.  could be attributed to these. The majority of the evidence does not support a causal role between paracetamol  or antibiotic use and asthma.  A 2014 systematic review found that the association between paracetamol use and asthma disappeared when respiratory infections were taken into account.  Maternal psychological stress during pregnancy is a risk factor for the child to develop asthma. Asthma is associated with exposure to indoor allergens Asthma Asthma",
        "response": "Maintaining a healthy lifestyle can help manage asthma, such as eating a balanced diet, exercising regularly, and avoiding triggers like smoke or pollution. It's important to have an action plan in case of an asthma attack and have emergency medication on hand if needed."
    },
    {
        "dialog": [
            "Hi Medi, I think I might have asthma. Can you help me?",
            "Of course. What are your symptoms?",
            "I have been wheezing and coughing a lot, especially at night.",
            "Okay. Have you been exposed to any indoor allergens?",
            "Yes, I have a cat and I live in an apartment with a gas stove.",
            "Based on your symptoms and exposure to indoor allergens, it's possible you have asthma.",
            "What should I do?",
            "I recommend seeing a doctor for a proper diagnosis and treatment plan.",
            "Is there anything else I can do to manage my symptoms in the meantime?"
        ],
        "knowledge": "Asthma Asthma  A meta-analysis concluded gas stoves are a major risk factor for asthma, finding around one in eight cases in the U. S.  could be attributed to these. The majority of the evidence does not support a causal role between paracetamol  or antibiotic use and asthma.  A 2014 systematic review found that the association between paracetamol use and asthma disappeared when respiratory infections were taken into account.  Maternal psychological stress during pregnancy is a risk factor for the child to develop asthma. Asthma is associated with exposure to indoor allergens Asthma Asthma",
        "response": "In the meantime, you can try avoiding exposure to indoor allergens such as dust and pet dander, and avoid using gas stoves if possible."
    },
    {
        "dialog": [
            "Hi Medi, can you tell me more about asthma?",
            "Sure. Asthma is a chronic respiratory condition characterized by inflammation and narrowing of the airways.",
            "What are some common triggers?",
            "Common triggers include allergens, exercise, cold air, and respiratory infections.",
            "Is there a cure for asthma?",
            "There is no cure for asthma, but it can be managed with medication and lifestyle changes.",
            "What kind of medication is used to treat asthma?",
            "There are several types of medication used to treat asthma, including inhaled corticosteroids, bronchodilators, and leukotriene modifiers.",
            "Are there any natural remedies for asthma?"
        ],
        "knowledge": "Asthma Asthma  A meta-analysis concluded gas stoves are a major risk factor for asthma, finding around one in eight cases in the U. S.  could be attributed to these. The majority of the evidence does not support a causal role between paracetamol  or antibiotic use and asthma.  A 2014 systematic review found that the association between paracetamol use and asthma disappeared when respiratory infections were taken into account.  Maternal psychological stress during pregnancy is a risk factor for the child to develop asthma. Asthma is associated with exposure to indoor allergens Asthma Asthma",
        "response": "Some natural remedies for asthma include breathing exercises, avoiding triggers, and maintaining a healthy lifestyle."
    },
    {
        "dialog": [
            "Hi Medi, I just had a procedure done for my asthma. What lifestyle changes should I make?",
            "Congratulations on taking steps to manage your asthma. I recommend avoiding smoking and exposure to secondhand smoke, avoiding indoor and outdoor allergens, and getting regular exercise.",
            "What kind of exercise is best for asthma?",
            "Low-impact exercises like walking, swimming, and cycling are best for people with asthma.",
            "What kind of diet is best for asthma?",
            "A healthy, balanced diet with plenty of fruits, vegetables, whole grains, and lean protein is best.",
            "Are there any foods I should avoid?",
            "Some people with asthma are sensitive to certain foods like dairy, soy, and nuts. It's important to identify if you have any food sensitivities and avoid those foods if necessary.",
            "Thank you for the advice, Medi."
        ],
        "knowledge": "Asthma Asthma  A meta-analysis concluded gas stoves are a major risk factor for asthma, finding around one in eight cases in the U. S.  could be attributed to these. The majority of the evidence does not support a causal role between paracetamol  or antibiotic use and asthma.  A 2014 systematic review found that the association between paracetamol use and asthma disappeared when respiratory infections were taken into account.  Maternal psychological stress during pregnancy is a risk factor for the child to develop asthma. Asthma is associated with exposure to indoor allergens Asthma Asthma",
        "response": "Remember to also monitor your symptoms and keep track of any triggers that worsen your asthma. Good luck!"
    },
    {
        "dialog": [
            "Hi, Medi. I think I may have asthma. What should I do?",
            "Hello. It's important to see a doctor for a proper diagnosis and treatment.",
            "What are the symptoms of asthma?",
            "Common symptoms include coughing, wheezing, shortness of breath, and chest tightness.",
            "What causes asthma?",
            "Asthma can be caused by exposure to allergens, pollution, and other irritants.",
            "Can asthma be prevented?",
            "There isn't a way to prevent asthma, but you can manage it by avoiding triggers and taking medication as prescribed.",
            "What are some common triggers for asthma?"
        ],
        "knowledge": "Asthma Asthma  A meta-analysis concluded gas stoves are a major risk factor for asthma, finding around one in eight cases in the U. S.  could be attributed to these. The majority of the evidence does not support a causal role between paracetamol  or antibiotic use and asthma.  A 2014 systematic review found that the association between paracetamol use and asthma disappeared when respiratory infections were taken into account.  Maternal psychological stress during pregnancy is a risk factor for the child to develop asthma. Asthma is associated with exposure to indoor allergens Asthma Asthma",
        "response": "Exposure to allergens, pollution, and other irritants are common triggers for asthma."
    },
    {
        "dialog": [
            "Hi Medi, I had an asthma attack yesterday. What should I do to prevent it from happening again?",
            "Hello. It's important to take your medication as prescribed and avoid triggers.",
            "What medication should I take?",
            "You should take a bronchodilator to help open up your airways and an inhaled corticosteroid to reduce inflammation in your airways.",
            "What are some common asthma triggers?",
            "Common triggers include pollen, dust mites, pet dander, and air pollution.",
            "Is there anything else I can do to manage my asthma?",
            "You can also keep track of your symptoms and peak flow readings, and create an asthma action plan with your doctor.",
            "How can I create an asthma action plan?"
        ],
        "knowledge": "Asthma Asthma  A meta-analysis concluded gas stoves are a major risk factor for asthma, finding around one in eight cases in the U. S.  could be attributed to these. The majority of the evidence does not support a causal role between paracetamol  or antibiotic use and asthma.  A 2014 systematic review found that the association between paracetamol use and asthma disappeared when respiratory infections were taken into account.  Maternal psychological stress during pregnancy is a risk factor for the child to develop asthma. Asthma is associated with exposure to indoor allergens Asthma Asthma",
        "response": "To create an asthma action plan, you should work with your doctor to outline steps to take when you experience symptoms or have an asthma attack."
    },
    {
        "dialog": [
            "Hi, Medi. I recently found out that I have asthma. Are there any lifestyle changes I should make?",
            "Hello. Yes, there are some lifestyle changes you can make to manage your asthma.",
            "What are some changes I can make?",
            "You can quit smoking if you smoke, avoid exposure to allergens and irritants, and exercise regularly.",
            "Can exercise trigger asthma symptoms?",
            "Yes, exercise can trigger asthma symptoms, but you can manage it by taking your medication before exercising and doing warm-up exercises.",
            "What foods should I eat to manage my asthma?",
            "There aren't specific foods that help manage asthma, but a healthy diet with fruits, vegetables, and lean protein can help maintain a healthy weight and overall health.",
            "Are there any supplements or vitamins that can help with asthma?"
        ],
        "knowledge": "Asthma Asthma  A meta-analysis concluded gas stoves are a major risk factor for asthma, finding around one in eight cases in the U. S.  could be attributed to these. The majority of the evidence does not support a causal role between paracetamol  or antibiotic use and asthma.  A 2014 systematic review found that the association between paracetamol use and asthma disappeared when respiratory infections were taken into account.  Maternal psychological stress during pregnancy is a risk factor for the child to develop asthma. Asthma is associated with exposure to indoor allergens Asthma Asthma",
        "response": "There isn't strong evidence that supplements or vitamins help with asthma, but a healthy diet can help maintain overall health and manage weight."
    }
]