[
    {
        "dialog": [
            "Hi Medi, I think I have Hepatitis B and D.",
            "Okay, let's figure out what's going on. What are your symptoms?",
            "I'm feeling very tired lately and my skin and eyes are turning yellow.",
            "Based on your symptoms, you may have Hepatitis B or D. Have you been vaccinated?",
            "I'm not sure. What should I do now?",
            "You should get tested and vaccinated immediately. Treatment will depend on the severity of your illness.",
            "Can I still spread the disease even if I'm vaccinated?",
            "It's unlikely, but still possible. Practice safe sex and don't share needles or other drug paraphernalia.",
            "What are the long-term effects of this disease?"
        ],
        "knowledge": "Hepatitis Hepatitis Most patients who acquire hepatitis D at the same time as hepatitis B  recover without developing a chronic infection.  In people with hepatitis B who later acquire hepatitis D , chronic infection is much more common at 80–90%, and liver disease progression is accelerated. Chronic hepatitis C progresses towards cirrhosis, with estimates of cirrhosis prevalence of 16% at 20 years after infection.  While the major causes of mortality in hepatitis C is end stage liver disease, hepatocellular carcinoma is an important additional long term complication and cause of death in chronic hepatitis. Rates of mortality increase with progression of the underlying liver disease.  Series of patients with compensated cirrhosis due to HCV have shown 3,5, and 10-year survival rates of 96, 91, and 79% respectively.   The 5-year survival rate drops to 50% upon if the cirrhosis becomes decompensated Hepatitis Hepatitis",
        "response": "The long-term effects of Hepatitis B and D include an increased risk of developing cirrhosis, liver cancer, and liver failure."
    },
    {
        "dialog": [
            "Hi Medi, I heard about Hepatitis C. Can you explain what it is?",
            "Sure. Hepatitis C is a viral infection that affects the liver.",
            "What are the symptoms of Hepatitis C?",
            "Most people with Hepatitis C don't have any symptoms. But if they do, it includes fatigue, joint pain, and abdominal pain.",
            "Is Hepatitis C curable?",
            "Yes, it is. The treatment involves antiviral medications that can clear the virus from your body.",
            "What is the chance of getting infected with Hepatitis C?",
            "It is mainly spread through blood-to-blood contact, such as sharing needles or receiving a blood transfusion. The risk is low if proper precautions are taken.",
            "Can Hepatitis C lead to any other diseases?"
        ],
        "knowledge": "Hepatitis Hepatitis Most patients who acquire hepatitis D at the same time as hepatitis B  recover without developing a chronic infection.  In people with hepatitis B who later acquire hepatitis D , chronic infection is much more common at 80–90%, and liver disease progression is accelerated. Chronic hepatitis C progresses towards cirrhosis, with estimates of cirrhosis prevalence of 16% at 20 years after infection.  While the major causes of mortality in hepatitis C is end stage liver disease, hepatocellular carcinoma is an important additional long term complication and cause of death in chronic hepatitis. Rates of mortality increase with progression of the underlying liver disease.  Series of patients with compensated cirrhosis due to HCV have shown 3,5, and 10-year survival rates of 96, 91, and 79% respectively.   The 5-year survival rate drops to 50% upon if the cirrhosis becomes decompensated Hepatitis Hepatitis",
        "response": "Yes, it can. It can lead to liver damage, liver cancer, and other severe complications."
    },
    {
        "dialog": [
            "Hi Medi, I recently had a liver biopsy. What should I do now?",
            "After a liver biopsy, you should rest for several hours and avoid any strenuous activities for the next few days.",
            "What are some lifestyle changes I can make to improve my liver health?",
            "Eating a healthy diet, exercising regularly, and avoiding alcohol and drugs can improve your liver health.",
            "What is cirrhosis and how does it affect the liver?",
            "Cirrhosis is a severe liver disease in which healthy liver tissue is replaced with scar tissue. It can cause liver failure, liver cancer, and other severe complications.",
            "Can cirrhosis be cured?",
            "No, cirrhosis cannot be cured. But early treatment can help prevent further damage and complications.",
            "What are the main causes of cirrhosis?"
        ],
        "knowledge": "Hepatitis Hepatitis Most patients who acquire hepatitis D at the same time as hepatitis B  recover without developing a chronic infection.  In people with hepatitis B who later acquire hepatitis D , chronic infection is much more common at 80–90%, and liver disease progression is accelerated. Chronic hepatitis C progresses towards cirrhosis, with estimates of cirrhosis prevalence of 16% at 20 years after infection.  While the major causes of mortality in hepatitis C is end stage liver disease, hepatocellular carcinoma is an important additional long term complication and cause of death in chronic hepatitis. Rates of mortality increase with progression of the underlying liver disease.  Series of patients with compensated cirrhosis due to HCV have shown 3,5, and 10-year survival rates of 96, 91, and 79% respectively.   The 5-year survival rate drops to 50% upon if the cirrhosis becomes decompensated Hepatitis Hepatitis",
        "response": "Alcohol abuse, hepatitis B and C, and non-alcoholic fatty liver disease are the main causes of cirrhosis."
    },
    {
        "dialog": [
            "Hello Medi, I am feeling unwell after getting hepatitis vaccination.",
            "I'm sorry to hear that. Can you tell me what kind of symptoms you are experiencing?",
            "I have a headache, fever, and my joints are sore",
            "It's common to have a mild fever or headache after the hepatitis vaccination. It should go away within a day or two. But if you experience any serious symptoms like breathing difficulties or hives, you should see a doctor immediately.",
            "Oh, I see. How about taking any medication to relieve these symptoms?",
            "You can take acetaminophen to relieve fever and headache. But please consult with your doctor first if you have any health concerns or taking any other medications.",
            "Thank you, Medi. I'll try to get some rest.",
            "You're welcome. I hope you feel better soon.",
            "Medi, can you tell me more about the hepatitis D infection?"
        ],
        "knowledge": "Hepatitis Hepatitis Most patients who acquire hepatitis D at the same time as hepatitis B  recover without developing a chronic infection.  In people with hepatitis B who later acquire hepatitis D , chronic infection is much more common at 80–90%, and liver disease progression is accelerated. Chronic hepatitis C progresses towards cirrhosis, with estimates of cirrhosis prevalence of 16% at 20 years after infection.  While the major causes of mortality in hepatitis C is end stage liver disease, hepatocellular carcinoma is an important additional long term complication and cause of death in chronic hepatitis. Rates of mortality increase with progression of the underlying liver disease.  Series of patients with compensated cirrhosis due to HCV have shown 3,5, and 10-year survival rates of 96, 91, and 79% respectively.   The 5-year survival rate drops to 50% upon if the cirrhosis becomes decompensated Hepatitis Hepatitis",
        "response": "Hepatitis D infection occurs in people who have hepatitis B. It is a serious liver disease, and chronic infection is much more common than in hepatitis B alone."
    },
    {
        "dialog": [
            "Hello Medi, I have been diagnosed with chronic hepatitis C. Can you tell me more about this disease?",
            "Certainly. Chronic hepatitis C progresses towards cirrhosis, with estimates of cirrhosis prevalence of 16% at 20 years after infection.",
            "What is cirrhosis, Medi?",
            "Cirrhosis is the scarring of the liver tissue, which can cause the liver to function poorly or not at all.",
            "What are the long-term complications of chronic hepatitis C?",
            "The major causes of mortality in hepatitis C are end-stage liver disease. Hepatocellular carcinoma is an important additional long-term complication and cause of death in chronic hepatitis. Rates of mortality increase with progression of the underlying liver disease",
            "How can I prevent the progression of hepatitis C?",
            "You can manage your hepatitis C through lifestyle changes like avoiding alcohol, eating a healthy diet, exercising regularly, and avoiding risky behavior like sharing needles. Medications are also available and can cure hepatitis C in many cases",
            "Thank you, Medi. I'll try to follow your advice."
        ],
        "knowledge": "Hepatitis Hepatitis Most patients who acquire hepatitis D at the same time as hepatitis B  recover without developing a chronic infection.  In people with hepatitis B who later acquire hepatitis D , chronic infection is much more common at 80–90%, and liver disease progression is accelerated. Chronic hepatitis C progresses towards cirrhosis, with estimates of cirrhosis prevalence of 16% at 20 years after infection.  While the major causes of mortality in hepatitis C is end stage liver disease, hepatocellular carcinoma is an important additional long term complication and cause of death in chronic hepatitis. Rates of mortality increase with progression of the underlying liver disease.  Series of patients with compensated cirrhosis due to HCV have shown 3,5, and 10-year survival rates of 96, 91, and 79% respectively.   The 5-year survival rate drops to 50% upon if the cirrhosis becomes decompensated Hepatitis Hepatitis",
        "response": "Compensated cirrhosis is a condition where the liver is severely damaged, but the patient does not yet show symptoms of liver failure. A long-term study has shown that the survival rate of patients with compensated cirrhosis due to HCV was 96%, 91%, and 79% over 3,5, and 10 years respectively."
    },
    {
        "dialog": [
            "Hello Medi, I just recovered from hepatitis B. Can you give me some advice on maintaining my health?",
            "Congratulations on recovering from hepatitis B! You can maintain your health by avoiding alcohol, eating a healthy diet, exercising regularly, and getting enough rest.",
            "Are there any specific foods I should eat or avoid?",
            "You should avoid processed and fried foods, sugary beverages, and food high in saturated and trans fats. Instead, focus on eating a balanced diet that includes plenty of fruits, vegetables, lean protein, and whole grains. You can also consider taking a multivitamin supplement.",
            "Can I still drink alcohol in moderation, Medi?",
            "It is recommended that you avoid alcohol altogether as it can damage your liver further and impair your immune system.",
            "I understand. What about physical exercise?",
            "Physical exercise can help improve your liver function and reduce the risk of liver disease complications. Aim for at least 30 minutes of moderate-intensity exercise most days of the week.",
            "Thank you, Medi. I'll try my best!"
        ],
        "knowledge": "Hepatitis Hepatitis Most patients who acquire hepatitis D at the same time as hepatitis B  recover without developing a chronic infection.  In people with hepatitis B who later acquire hepatitis D , chronic infection is much more common at 80–90%, and liver disease progression is accelerated. Chronic hepatitis C progresses towards cirrhosis, with estimates of cirrhosis prevalence of 16% at 20 years after infection.  While the major causes of mortality in hepatitis C is end stage liver disease, hepatocellular carcinoma is an important additional long term complication and cause of death in chronic hepatitis. Rates of mortality increase with progression of the underlying liver disease.  Series of patients with compensated cirrhosis due to HCV have shown 3,5, and 10-year survival rates of 96, 91, and 79% respectively.   The 5-year survival rate drops to 50% upon if the cirrhosis becomes decompensated Hepatitis Hepatitis",
        "response": "The symptoms of liver failure include jaundice, nausea and vomiting, abdominal pain and swelling, fatigue, and confusion. If you experience any of these symptoms, please seek medical attention right away."
    },
    {
        "dialog": [
            "Hi Medi, I have some symptoms and I'm worried about hepatitis.",
            "Hi there, what are the symptoms you have?",
            "I have fatigue, nausea, and abdominal pain. Can it be related to hepatitis?",
            "It can be, but we need to check for other symptoms as well. Have you experienced jaundice or dark urine?",
            "No, I haven't.",
            "Alright, have you been exposed to any blood or body fluids from someone who has hepatitis?",
            "No, I don't think so.",
            "Based on your symptoms, it's hard to say if you have hepatitis. It's best if you talk to your healthcare provider about your symptoms and get tested.",
            "Okay, I will. Thank you, Medi."
        ],
        "knowledge": "Hepatitis Hepatitis Most patients who acquire hepatitis D at the same time as hepatitis B  recover without developing a chronic infection.  In people with hepatitis B who later acquire hepatitis D , chronic infection is much more common at 80–90%, and liver disease progression is accelerated. Chronic hepatitis C progresses towards cirrhosis, with estimates of cirrhosis prevalence of 16% at 20 years after infection.  While the major causes of mortality in hepatitis C is end stage liver disease, hepatocellular carcinoma is an important additional long term complication and cause of death in chronic hepatitis. Rates of mortality increase with progression of the underlying liver disease.  Series of patients with compensated cirrhosis due to HCV have shown 3,5, and 10-year survival rates of 96, 91, and 79% respectively.   The 5-year survival rate drops to 50% upon if the cirrhosis becomes decompensated Hepatitis Hepatitis",
        "response": "It's hard to say without tests, but it's best to talk to your healthcare provider about your symptoms and get tested for hepatitis."
    },
    {
        "dialog": [
            "Hi Medi, I have a question about hepatitis.",
            "Of course, what is your question?",
            "Can hepatitis C be cured?",
            "Yes, hepatitis C can be cured with antiviral medication. The treatment can last for several weeks to several months, depending on the severity of the infection.",
            "Is there any way to prevent hepatitis C?",
            "Yes, you can reduce your risk of getting hepatitis C by not sharing needles or other equipment used for injecting drugs, using condoms during sex, and avoiding tattoos or body piercings from an unlicensed facility.",
            "Thank you for the information, Medi.",
            "You're welcome."
        ],
        "knowledge": "Hepatitis Hepatitis Most patients who acquire hepatitis D at the same time as hepatitis B  recover without developing a chronic infection.  In people with hepatitis B who later acquire hepatitis D , chronic infection is much more common at 80–90%, and liver disease progression is accelerated. Chronic hepatitis C progresses towards cirrhosis, with estimates of cirrhosis prevalence of 16% at 20 years after infection.  While the major causes of mortality in hepatitis C is end stage liver disease, hepatocellular carcinoma is an important additional long term complication and cause of death in chronic hepatitis. Rates of mortality increase with progression of the underlying liver disease.  Series of patients with compensated cirrhosis due to HCV have shown 3,5, and 10-year survival rates of 96, 91, and 79% respectively.   The 5-year survival rate drops to 50% upon if the cirrhosis becomes decompensated Hepatitis Hepatitis",
        "response": "Yes, hepatitis C can be cured with antiviral medication and you can reduce your risk of getting hepatitis C by not sharing needles or other equipment used for injecting drugs, using condoms during sex, and avoiding tattoos or body piercings from an unlicensed facility."
    },
    {
        "dialog": [
            "Hi Medi, I just had a medical procedure related to hepatitis. What should I do now?",
            "Hi, what kind of procedure did you have?",
            "I had a liver biopsy.",
            "Okay, after the liver biopsy, you should avoid heavy lifting and strenuous activity for a few days. You should also avoid taking aspirin or any blood thinning medication for a few days.",
            "What about my diet?",
            "It's best to eat a light meal after the procedure. Drink lots of fluids and avoid alcohol for at least 24 hours. You should also avoid fatty or greasy foods as they can cause discomfort.",
            "Thank you for the advice, Medi.",
            "You're welcome. If you experience any severe pain or discomfort, please contact your healthcare provider immediately."
        ],
        "knowledge": "Hepatitis Hepatitis Most patients who acquire hepatitis D at the same time as hepatitis B  recover without developing a chronic infection.  In people with hepatitis B who later acquire hepatitis D , chronic infection is much more common at 80–90%, and liver disease progression is accelerated. Chronic hepatitis C progresses towards cirrhosis, with estimates of cirrhosis prevalence of 16% at 20 years after infection.  While the major causes of mortality in hepatitis C is end stage liver disease, hepatocellular carcinoma is an important additional long term complication and cause of death in chronic hepatitis. Rates of mortality increase with progression of the underlying liver disease.  Series of patients with compensated cirrhosis due to HCV have shown 3,5, and 10-year survival rates of 96, 91, and 79% respectively.   The 5-year survival rate drops to 50% upon if the cirrhosis becomes decompensated Hepatitis Hepatitis",
        "response": "If you experience any severe pain or discomfort, please contact your healthcare provider immediately after the procedure and avoid heavy lifting and strenuous activity for a few days, also avoid taking aspirin or any blood thinning medication for a few days. It's best to eat a light meal after the procedure. Drink lots of fluids and avoid alcohol for at least 24 hours. You should also avoid fatty or greasy foods as they can cause discomfort."
    },
    {
        "dialog": [
            "Hi Medi, I have recently been diagnosed with hepatitis B and hepatitis D.",
            "I am here to help you, what symptoms are you experiencing?",
            "I have fatigue, nausea and abdominal pain.",
            "It sounds like you may have a chronic infection. Have you been vaccinated for hepatitis B?",
            "Yes, I have been vaccinated, but I am still worried about the chronic infection.",
            "Most people with hepatitis D who acquire hepatitis B recover without developing a chronic infection, but in chronic hepatitis D infection is much more common. You should monitor your symptoms and get regular check-ups with your doctor.",
            "Okay, I will do that. Do you have any recommendations for managing my symptoms?",
            "Eating a balanced diet and getting regular exercise can help alleviate some of your symptoms. You should also avoid alcohol and talk to your doctor about any medications you are taking.",
            "Thanks for the advice, Medi. One last question, what are the long-term complications associated with chronic hepatitis?"
        ],
        "knowledge": "Hepatitis Hepatitis Most patients who acquire hepatitis D at the same time as hepatitis B  recover without developing a chronic infection.  In people with hepatitis B who later acquire hepatitis D , chronic infection is much more common at 80–90%, and liver disease progression is accelerated. Chronic hepatitis C progresses towards cirrhosis, with estimates of cirrhosis prevalence of 16% at 20 years after infection.  While the major causes of mortality in hepatitis C is end stage liver disease, hepatocellular carcinoma is an important additional long term complication and cause of death in chronic hepatitis. Rates of mortality increase with progression of the underlying liver disease.  Series of patients with compensated cirrhosis due to HCV have shown 3,5, and 10-year survival rates of 96, 91, and 79% respectively.   The 5-year survival rate drops to 50% upon if the cirrhosis becomes decompensated Hepatitis Hepatitis",
        "response": "The long-term complications of chronic hepatitis can include liver failure, cirrhosis, and an increased risk of liver cancer."
    },
    {
        "dialog": [
            "Hi Medi, I have a question about hepatitis C.",
            "Of course, I'm here to help. What's your question?",
            "What is the most common way to contract hepatitis C?",
            "The most common way to contract hepatitis C is through exposure to infected blood, such as using contaminated needles or receiving a blood transfusion before 1992.",
            "What are the symptoms of hepatitis C?",
            "In the initial stages, many people with hepatitis C have no symptoms. When symptoms do occur, they can include fatigue, fever, stomach pain, and joint pain.",
            "Is there a cure for hepatitis C?",
            "Yes, there are now highly effective antiviral medications that can cure hepatitis C in most cases.",
            "That's great to know. One last question, what can I do to prevent contracting hepatitis C?"
        ],
        "knowledge": "Hepatitis Hepatitis Hepatitis C is a blood-borne infection that primarily affects the liver.  The most common way to contract hepatitis C is through exposure to infected blood, such as using contaminated needles or receiving a blood transfusion before 1992.  In the initial stages, many people with hepatitis C have no symptoms. When symptoms do occur, they can include fatigue, fever, stomach pain, and joint pain.  There are now highly effective antiviral medications that can cure hepatitis C in most cases.  Prevention includes avoiding exposure to infected blood, practicing safe sex, and not sharing needles or other drug injection equipment Hepatitis Hepatitis",
        "response": "To prevent contracting hepatitis C, you should avoid exposure to infected blood, practice safe sex, and not share needles or other drug injection equipment."
    },
    {
        "dialog": [
            "Hi Medi, I recently had a liver biopsy for my hepatitis C and I'm not sure what to expect next.",
            "A liver biopsy is a common procedure used to diagnose liver diseases. What questions do you have?",
            "What can I expect after the biopsy?",
            "After the biopsy, you may experience some pain, bruising, or soreness at the biopsy site. You should rest for the remainder of the day and avoid strenuous activity for several days afterward.",
            "Are there any complications associated with a liver biopsy?",
            "Complications from a liver biopsy are rare, but can include bleeding, infection, or damage to other organs. You should contact your doctor immediately if you experience severe pain, fever, or difficulty breathing after the biopsy.",
            "Okay, I will keep that in mind. One last question, are there any lifestyle changes I should make to help manage my hepatitis C?",
            "Yes, maintaining a healthy diet, getting regular exercise, and avoiding alcohol and tobacco can help improve liver function and manage symptoms.",
            "Thanks for your help, Medi. That's all the questions I have for now."
        ],
        "knowledge": "Hepatitis Hepatitis Hepatitis C is a blood-borne infection that primarily affects the liver.  A liver biopsy is a common procedure used to diagnose liver diseases.  After the biopsy, you may experience some pain, bruising, or soreness at the biopsy site. Complications from a liver biopsy are rare, but can include bleeding, infection, or damage to other organs.  Maintaining a healthy diet, getting regular exercise, and avoiding alcohol and tobacco can help improve liver function and manage symptoms Hepatitis Hepatitis",
        "response": "You're welcome. Don't hesitate to contact your doctor if you have any further questions or concerns."
    },
    {
        "dialog": [
            "Hello Medi, I am concerned about Hepatitis",
            "Sure, I can help. What's your concern, and can you share about your symptoms?",
            "I don't have any symptoms, but I want to know more about Hepatitis",
            "Hepatitis is the inflammation of the liver, caused mainly by viral infections. There are five main types of hepatitis viruses. Hepatitis A, B, and C are the most common.",
            "Is there any difference in the symptoms of the three main types?",
            "Hepatitis A is usually a mild, short-term illness. Hepatitis B and C can cause chronic hepatitis, liver damage and liver cancer. Hepatitis B and C can go unnoticed for many years because they can cause initial symptoms like those of a mild flu. ",
            "That's good to know. So, how can I prevent Hepatitis?",
            "You can prevent Hepatitis A by practising good hygiene such as washing your hands frequently, especially after using the toilet, and before preparing food. Hepatitis B and C can be prevented by not sharing needles, toothbrushes, razors, etc. and avoiding unprotected sex with infected persons.",
            "Thank you very much for your advice Medi. One last question, can hepatitis be cured completely?"
        ],
        "knowledge": "Hepatitis Hepatitis Most patients who acquire hepatitis D at the same time as hepatitis B  recover without developing a chronic infection.  In people with hepatitis B who later acquire hepatitis D , chronic infection is much more common at 80–90%, and liver disease progression is accelerated. Chronic hepatitis C progresses towards cirrhosis, with estimates of cirrhosis prevalence of 16% at 20 years after infection.  While the major causes of mortality in hepatitis C is end stage liver disease, hepatocellular carcinoma is an important additional long term complication and cause of death in chronic hepatitis. Rates of mortality increase with progression of the underlying liver disease.  Series of patients with compensated cirrhosis due to HCV have shown 3,5, and 10-year survival rates of 96, 91, and 79% respectively.   The 5-year survival rate drops to 50% upon if the cirrhosis becomes decompensated Hepatitis Hepatitis",
        "response": "The cure for Hepatitis depends on the type and severity of the disease. Hepatitis A usually improves with time, while Hepatitis B and C can be treated with antiviral medications, but in some cases, they can cause chronic infections that may require a liver transplant."
    },
    {
        "dialog": [
            "Hello Medi, I have been diagnosed with Hepatitis B.",
            "I'm sorry to hear that. How are you feeling now? Do you have any symptoms?",
            "I am feeling tired and nauseous, and I have some pain in my upper right abdomen.",
            "Those are common symptoms of Hepatitis B. Are you taking any medications for it?",
            "Yes, the doctor prescribed me antiviral medications.",
            "That's good to hear. In addition to taking medications, you should also maintain a healthy lifestyle. ",
            "What kind of lifestyle changes do I need to make?",
            "You should avoid alcohol and drugs as they can cause further damage to your liver. You should also maintain a healthy diet by eating more fruits, vegetables, and whole grains. Lastly, you should get plenty of rest.",
            "Thank you, Medi. Is there anything else I can do to speed up my recovery?"
        ],
        "knowledge": "Hepatitis Hepatitis Most patients who acquire hepatitis D at the same time as hepatitis B  recover without developing a chronic infection.  In people with hepatitis B who later acquire hepatitis D , chronic infection is much more common at 80–90%, and liver disease progression is accelerated. Chronic hepatitis C progresses towards cirrhosis, with estimates of cirrhosis prevalence of 16% at 20 years after infection.  While the major causes of mortality in hepatitis C is end stage liver disease, hepatocellular carcinoma is an important additional long term complication and cause of death in chronic hepatitis. Rates of mortality increase with progression of the underlying liver disease.  Series of patients with compensated cirrhosis due to HCV have shown 3,5, and 10-year survival rates of 96, 91, and 79% respectively.   The 5-year survival rate drops to 50% upon if the cirrhosis becomes decompensated Hepatitis Hepatitis",
        "response": "The recovery time for Hepatitis B varies from person to person and depends on the severity of the disease. It can take several weeks to several months for the symptoms to improve, and in some cases, it can take up to 6 months to a year to recover completely."
    },
    {
        "dialog": [
            "Hello Medi. I recently had a liver transplant due to Hepatitis C. What should I do now?",
            "Congratulations on your successful transplant. After a liver transplant, it is important to take care of yourself and follow a healthy lifestyle.",
            "What kind of healthy lifestyle should I follow?",
            "You should avoid alcohol and drugs as they can harm your new liver. You should also avoid fatty and spicy foods, as they can cause indigestion. Lastly, you should get plenty of rest and avoid stressful situations.",
            "That makes sense. Should I also take any medications?",
            "Yes. After a liver transplant, you will need to take medications to prevent your body from rejecting the new liver. You will need to take these medications for the rest of your life.",
            "That sounds like a long time. What are the possible side effects of these medications?",
            "The medications may cause side effects such as high blood pressure, high cholesterol, and diabetes. You will need to have regular checkups with your doctor to monitor your health and adjust your medications as needed.",
            "Thank you for your advice, Medi. One last question, how often should I see my doctor?"
        ],
        "knowledge": "Hepatitis Hepatitis Most patients who acquire hepatitis D at the same time as hepatitis B  recover without developing a chronic infection.  In people with hepatitis B who later acquire hepatitis D , chronic infection is much more common at 80–90%, and liver disease progression is accelerated. Chronic hepatitis C progresses towards cirrhosis, with estimates of cirrhosis prevalence of 16% at 20 years after infection.  While the major causes of mortality in hepatitis C is end stage liver disease, hepatocellular carcinoma is an important additional long term complication and cause of death in chronic hepatitis. Rates of mortality increase with progression of the underlying liver disease.  Series of patients with compensated cirrhosis due to HCV have shown 3,5, and 10-year survival rates of 96, 91, and 79% respectively.   The 5-year survival rate drops to 50% upon if the cirrhosis becomes decompensated Hepatitis Hepatitis",
        "response": "You're welcome. I'm happy to help. If you have any further questions, feel free to contact me anytime."
    },
    {
        "dialog": [
            "Hi Medi, I think I might have hepatitis.",
            "What symptoms are you experiencing?",
            "I have been experiencing fatigue, nausea, and yellowing of my skin and eyes.",
            "Based on your symptoms, it is possible that you have hepatitis. I recommend you see a doctor immediately for a proper diagnosis and treatment.",
            "Is hepatitis curable?",
            "It depends on the type and severity of hepatitis. Some types of hepatitis can be cured with medication and lifestyle changes, while others can only be managed.",
            "Thank you for your advice, Medi.",
            "You're welcome. Take care and see a doctor as soon as possible.",
            "Is hepatitis contagious?"
        ],
        "knowledge": "Hepatitis Hepatitis Most patients who acquire hepatitis D at the same time as hepatitis B  recover without developing a chronic infection.  In people with hepatitis B who later acquire hepatitis D , chronic infection is much more common at 80–90%, and liver disease progression is accelerated. Chronic hepatitis C progresses towards cirrhosis, with estimates of cirrhosis prevalence of 16% at 20 years after infection.  While the major causes of mortality in hepatitis C is end stage liver disease, hepatocellular carcinoma is an important additional long term complication and cause of death in chronic hepatitis. Rates of mortality increase with progression of the underlying liver disease.  Series of patients with compensated cirrhosis due to HCV have shown 3,5, and 10-year survival rates of 96, 91, and 79% respectively.   The 5-year survival rate drops to 50% upon if the cirrhosis becomes decompensated Hepatitis Hepatitis",
        "response": "Hepatitis can be contagious, but the transmission method varies depending on the type of hepatitis."
    },
    {
        "dialog": [
            "Hi Medi, can you tell me more about hepatitis C?",
            "Of course, what would you like to know?",
            "What are the symptoms of hepatitis C?",
            "Most people with hepatitis C are asymptomatic or have mild symptoms, but some may experience fatigue, joint pain, nausea, and abdominal pain.",
            "How is hepatitis C diagnosed?",
            "Hepatitis C is diagnosed through blood tests that look for antibodies and genetic material of the virus.",
            "Is hepatitis C preventable?",
            "There is no vaccine for hepatitis C, but it can be prevented by avoiding high-risk behaviors such as sharing needles, having unprotected sex, and getting tattoos or piercings from unlicensed facilities.",
            "Thank you, Medi. I appreciate the information."
        ],
        "knowledge": "Hepatitis Hepatitis Most patients who acquire hepatitis D at the same time as hepatitis B  recover without developing a chronic infection.  In people with hepatitis B who later acquire hepatitis D , chronic infection is much more common at 80–90%, and liver disease progression is accelerated. Chronic hepatitis C progresses towards cirrhosis, with estimates of cirrhosis prevalence of 16% at 20 years after infection.  While the major causes of mortality in hepatitis C is end stage liver disease, hepatocellular carcinoma is an important additional long term complication and cause of death in chronic hepatitis. Rates of mortality increase with progression of the underlying liver disease.  Series of patients with compensated cirrhosis due to HCV have shown 3,5, and 10-year survival rates of 96, 91, and 79% respectively.   The 5-year survival rate drops to 50% upon if the cirrhosis becomes decompensated Hepatitis Hepatitis",
        "response": "Hepatitis C can be cured with medication, but it depends on the individual case and how early the disease is diagnosed."
    },
    {
        "dialog": [
            "Hi Medi, I just had a liver biopsy.",
            "How are you feeling?",
            "I am feeling a little sore, but overall okay.",
            "After a liver biopsy, it is important to rest and avoid heavy lifting or strenuous activity for a few days.",
            "Are there any foods I should avoid?",
            "It is recommended that you avoid fatty or greasy foods, as they can cause discomfort and stress on the liver. You should also avoid alcohol and any medications that your doctor has advised against.",
            "How long does it take to recover from a liver biopsy?",
            "Recovery time can vary, but most people are able to return to their normal activities within a week.",
            "Thank you for your help, Medi."
        ],
        "knowledge": "Hepatitis Hepatitis Most patients who acquire hepatitis D at the same time as hepatitis B  recover without developing a chronic infection.  In people with hepatitis B who later acquire hepatitis D , chronic infection is much more common at 80–90%, and liver disease progression is accelerated. Chronic hepatitis C progresses towards cirrhosis, with estimates of cirrhosis prevalence of 16% at 20 years after infection.  While the major causes of mortality in hepatitis C is end stage liver disease, hepatocellular carcinoma is an important additional long term complication and cause of death in chronic hepatitis. Rates of mortality increase with progression of the underlying liver disease.  Series of patients with compensated cirrhosis due to HCV have shown 3,5, and 10-year survival rates of 96, 91, and 79% respectively.   The 5-year survival rate drops to 50% upon if the cirrhosis becomes decompensated Hepatitis Hepatitis",
        "response": "Some long-term effects of a liver biopsy can include pain or discomfort, bleeding, or infection. However, these complications are rare."
    },
    {
        "dialog": [
            "Hi Medi, I'm having some symptoms and I'm worried it might be Hepatitis.",
            "Let's see how I can help you. What kind of symptoms are you experiencing?",
            "I have been feeling extremely tired and weak lately. I'm also experiencing some nausea and vomiting.",
            "I see. Have you noticed any yellowing of the skin or eyes?",
            "No, I haven't noticed anything like that.",
            "Alright. Based on your symptoms, you should consider getting tested for Hepatitis.",
            "What kind of test do I need?",
            "You should get a blood test to check for Hepatitis B and C.",
            "Thank you, Medi. If I do have Hepatitis, what are the chances of a chronic infection?"
        ],
        "knowledge": "Hepatitis Hepatitis Most patients who acquire hepatitis D at the same time as hepatitis B  recover without developing a chronic infection.  In people with hepatitis B who later acquire hepatitis D , chronic infection is much more common at 80–90%, and liver disease progression is accelerated. Chronic hepatitis C progresses towards cirrhosis, with estimates of cirrhosis prevalence of 16% at 20 years after infection.  While the major causes of mortality in hepatitis C is end stage liver disease, hepatocellular carcinoma is an important additional long term complication and cause of death in chronic hepatitis. Rates of mortality increase with progression of the underlying liver disease.  Series of patients with compensated cirrhosis due to HCV have shown 3,5, and 10-year survival rates of 96, 91, and 79% respectively.   The 5-year survival rate drops to 50% upon if the cirrhosis becomes decompensated Hepatitis Hepatitis",
        "response": "In people with Hepatitis B who later acquire Hepatitis D, chronic infection is much more common at 80-90%, and liver disease progression is accelerated."
    },
    {
        "dialog": [
            "Hi Medi, I just had a liver biopsy and I'm not sure what to expect after.",
            "Hi there. After a liver biopsy, you should rest for the remainder of the day.",
            "Is there anything I should avoid doing?",
            "You should avoid any heavy lifting or strenuous activities for a week.",
            "What about my diet? Is there anything I should avoid eating?",
            "It's best to avoid fatty or greasy foods for a few days after the biopsy.",
            "Will I experience any pain or discomfort?",
            "You may experience some pain or discomfort at the site of the biopsy, but this should subside within a few days.",
            "Thank you, Medi. Is there anything else I should be aware of?"
        ],
        "knowledge": "Hepatitis Hepatitis Most patients who acquire hepatitis D at the same time as hepatitis B  recover without developing a chronic infection.  In people with hepatitis B who later acquire hepatitis D , chronic infection is much more common at 80–90%, and liver disease progression is accelerated. Chronic hepatitis C progresses towards cirrhosis, with estimates of cirrhosis prevalence of 16% at 20 years after infection.  While the major causes of mortality in hepatitis C is end stage liver disease, hepatocellular carcinoma is an important additional long term complication and cause of death in chronic hepatitis. Rates of mortality increase with progression of the underlying liver disease.  Series of patients with compensated cirrhosis due to HCV have shown 3,5, and 10-year survival rates of 96, 91, and 79% respectively.   The 5-year survival rate drops to 50% upon if the cirrhosis becomes decompensated Hepatitis Hepatitis",
        "response": "You're welcome. Just remember to take it easy for the next few days and avoid any strenuous activities."
    },
    {
        "dialog": [
            "Hello, Medi. I was diagnosed with Hepatitis C and I'm not sure what changes I need to make to my lifestyle.",
            "Hi there. It's important to maintain a healthy lifestyle when living with Hepatitis C.",
            "What changes should I make to my diet?",
            "A healthy diet is important, but there are no specific foods you need to avoid. It's best to eat a balanced diet with plenty of fruits, vegetables, and lean protein.",
            "Is alcohol consumption safe?",
            "No, it's best to avoid alcohol completely as it can cause liver damage and further complications.",
            "What about physical activity?",
            "Moderate physical activity is encouraged, but you should avoid anything too strenuous that could cause injury or fatigue.",
            "Thank you, Medi. Is there anything else I should be aware of?"
        ],
        "knowledge": "Hepatitis Hepatitis Most patients who acquire hepatitis D at the same time as hepatitis B  recover without developing a chronic infection.  In people with hepatitis B who later acquire hepatitis D , chronic infection is much more common at 80–90%, and liver disease progression is accelerated. Chronic hepatitis C progresses towards cirrhosis, with estimates of cirrhosis prevalence of 16% at 20 years after infection.  While the major causes of mortality in hepatitis C is end stage liver disease, hepatocellular carcinoma is an important additional long term complication and cause of death in chronic hepatitis. Rates of mortality increase with progression of the underlying liver disease.  Series of patients with compensated cirrhosis due to HCV have shown 3,5, and 10-year survival rates of 96, 91, and 79% respectively.   The 5-year survival rate drops to 50% upon if the cirrhosis becomes decompensated Hepatitis Hepatitis",
        "response": "You're welcome. Just remember to maintain a healthy lifestyle and avoid alcohol completely."
    },
    {
        "dialog": [
            "Hi Medi, I think I might have hepatitis. What should I do?",
            "Hi there, what are your symptoms?",
            "I feel very fatigued and my skin and eyes are yellowish.",
            "Based on that, you may need to get a blood test to check for hepatitis",
            "What should I do if I test positive?",
            "It depends on the type of hepatitis you have. You should see a doctor to discuss treatment options",
            "What are the risks of hepatitis C?",
            "The risks include cirrhosis and hepatocellular carcinoma.  The mortality rates increase with progression of the underlying liver disease.",
            "Is hepatitis curable or just treatable?"
        ],
        "knowledge": "Hepatitis Hepatitis Most patients who acquire hepatitis D at the same time as hepatitis B recover without developing a chronic infection. In people with hepatitis B who later acquire hepatitis D, chronic infection is much more common at 80–90%, and liver disease progression is accelerated. Chronic hepatitis C progresses towards cirrhosis, with estimates of cirrhosis prevalence of 16% at 20 years after infection. While the major causes of mortality in hepatitis C is end stage liver disease, hepatocellular carcinoma is an important additional long term complication and cause of death in chronic hepatitis. Rates of mortality increase with progression of the underlying liver disease. Series of patients with compensated cirrhosis due to HCV have shown 3,5, and 10-year survival rates of 96, 91, and 79% respectively. The 5-year survival rate drops to 50% upon if the cirrhosis becomes decompensated Hepatitis Hepatitis",
        "response": "Hepatitis can be cured depending on the type, but some types can be only treated. You should see a doctor to discuss possible treatments."
    },
    {
        "dialog": [
            "Hi Medi, can you explain what chronic hepatitis C is?",
            "Sure, chronic hepatitis C progresses towards cirrhosis with an estimated prevalence of 16% at 20 years after infection",
            "What is cirrhosis and what are the symptoms?",
            "Cirrhosis is a liver condition that causes irreversible scarring of the liver. Symptoms include jaundice, fatigue, nausea, and loss of appetite.",
            "Is chronic hepatitis C fatal?",
            "While the major causes of mortality in hepatitis C is end stage liver disease, hepatocellular carcinoma is an important additional long term complication and cause of death in chronic hepatitis. Rates of mortality increase with progression of the underlying liver disease",
            "Oh, thank you for the information. Is there anything you can recommend to prevent hepatitis C?",
            "The best way to prevent hepatitis C is to avoid exposure to infected blood. Avoid sharing needles, razors, toothbrushes, and nail clippers with others. Get vaccinated for hepatitis A and B if you are at risk.",
            "Is there any food that can help prevent hepatitis C?"
        ],
        "knowledge": "Hepatitis Hepatitis Most patients who acquire hepatitis D at the same time as hepatitis B recover without developing a chronic infection. In people with hepatitis B who later acquire hepatitis D, chronic infection is much more common at 80–90%, and liver disease progression is accelerated. Chronic hepatitis C progresses towards cirrhosis, with estimates of cirrhosis prevalence of 16% at 20 years after infection. While the major causes of mortality in hepatitis C is end stage liver disease, hepatocellular carcinoma is an important additional long term complication and cause of death in chronic hepatitis. Rates of mortality increase with progression of the underlying liver disease. Series of patients with compensated cirrhosis due to HCV have shown 3,5, and 10-year survival rates of 96, 91, and 79% respectively. The 5-year survival rate drops to 50% upon if the cirrhosis becomes decompensated Hepatitis Hepatitis",
        "response": "A healthy diet can help improve liver function, but there is no specific food that can cure or prevent hepatitis C."
    },
    {
        "dialog": [
            "Hi Medi, I recently had a liver biopsy. What can I do to speed up my recovery?",
            "Hi there. After a liver biopsy, you should take it easy for a few days. Avoid heavy lifting and strenuous activities. ",
            "Should I continue my medication as usual?",
            "Most medications are safe to continue after a liver biopsy, but you should speak with your doctor to confirm",
            "Are there any foods I should avoid or should eat more of?",
            "It's important to eat a healthy diet after a liver biopsy. You should eat plenty of fruits, vegetables, and lean protein while avoiding alcohol, caffeine, and fatty foods",
            "Can I exercise after a liver biopsy?",
            "You should avoid strenuous activities for a few days after a liver biopsy, but you can resume light activities such as walking as soon as you feel able",
            "How long does it take to recover from a liver biopsy?"
        ],
        "knowledge": "Hepatitis Hepatitis Most patients who acquire hepatitis D at the same time as hepatitis B recover without developing a chronic infection. In people with hepatitis B who later acquire hepatitis D, chronic infection is much more common at 80–90%, and liver disease progression is accelerated. Chronic hepatitis C progresses towards cirrhosis, with estimates of cirrhosis prevalence of 16% at 20 years after infection. While the major causes of mortality in hepatitis C is end stage liver disease, hepatocellular carcinoma is an important additional long term complication and cause of death in chronic hepatitis. Rates of mortality increase with progression of the underlying liver disease. Series of patients with compensated cirrhosis due to HCV have shown 3,5, and 10-year survival rates of 96, 91, and 79% respectively. The 5-year survival rate drops to 50% upon if the cirrhosis becomes decompensated Hepatitis Hepatitis",
        "response": "It usually takes a few days to a week to recover from a liver biopsy. If you experience excessive pain or bleeding, you should contact your doctor immediately."
    },
    {
        "dialog": [
            "Hi Medi, I think I might have hepatitis. Can you help me?",
            "Sure, What symptoms do you have?",
            "I am feeling tired all the time and I have been nauseous lately.",
            "I see. Have you had any other symptoms?",
            "Yes, I have been having stomach pain and my skin and eyes have been turning yellow.",
            "Based on your symptoms, it is possible that you have hepatitis. I recommend you to get tested and see a doctor as soon as possible.",
            "Is there anything else I should be aware of?",
            "In people with hepatitis B who later acquire hepatitis D, chronic infection is much more common at 80-90%, and liver disease progression is accelerated.",
            "What is the next step if I do have hepatitis?"
        ],
        "knowledge": "Hepatitis Hepatitis Most patients who acquire hepatitis D at the same time as hepatitis B  recover without developing a chronic infection.  In people with hepatitis B who later acquire hepatitis D , chronic infection is much more common at 80–90%, and liver disease progression is accelerated. Chronic hepatitis C progresses towards cirrhosis, with estimates of cirrhosis prevalence of 16% at 20 years after infection.  While the major causes of mortality in hepatitis C is end stage liver disease, hepatocellular carcinoma is an important additional long term complication and cause of death in chronic hepatitis. Rates of mortality increase with progression of the underlying liver disease.  Series of patients with compensated cirrhosis due to HCV have shown 3,5, and 10-year survival rates of 96, 91, and 79% respectively.   The 5-year survival rate drops to 50% upon if the cirrhosis becomes decompensated Hepatitis Hepatitis",
        "response": "The next step would be to follow the doctor's advice and start the treatment as soon as possible."
    },
    {
        "dialog": [
            "Hi Medi, can you explain to me what hepatitis is?",
            "Of course, hepatitis is an inflammation of the liver that can be caused by a virus, autoimmune response, or exposure to toxins.",
            "What are the common symptoms of hepatitis?",
            "The most common symptoms are fatigue, nausea, abdominal pain, jaundice, and loss of appetite.",
            "Is there any way to prevent hepatitis?",
            "Yes, there are a few ways to prevent it such as avoiding contaminated food and water, getting vaccinated, not sharing needles or personal hygiene items, and practicing safe sex.",
            "Are there different types of hepatitis?",
            "Yes, there are several types including hepatitis A, B, C, D, and E.",
            "Which type of hepatitis is the most dangerous?"
        ],
        "knowledge": "Hepatitis Hepatitis Most patients who acquire hepatitis D at the same time as hepatitis B  recover without developing a chronic infection.  In people with hepatitis B who later acquire hepatitis D , chronic infection is much more common at 80–90%, and liver disease progression is accelerated. Chronic hepatitis C progresses towards cirrhosis, with estimates of cirrhosis prevalence of 16% at 20 years after infection.  While the major causes of mortality in hepatitis C is end stage liver disease, hepatocellular carcinoma is an important additional long term complication and cause of death in chronic hepatitis. Rates of mortality increase with progression of the underlying liver disease.  Series of patients with compensated cirrhosis due to HCV have shown 3,5, and 10-year survival rates of 96, 91, and 79% respectively.   The 5-year survival rate drops to 50% upon if the cirrhosis becomes decompensated Hepatitis Hepatitis",
        "response": "Hepatitis C is considered the most dangerous as it can progress towards cirrhosis and has a higher risk of liver disease and cancer mortality."
    },
    {
        "dialog": [
            "Hi Medi, I just had a liver transplant. What should I do now?",
            "Congratulations on your successful transplant! After a liver transplant, it is important to follow a healthy diet, take your prescribed medications, and exercise regularly. You should also avoid alcohol and tobacco.",
            "Are there any foods that I should avoid?",
            "Yes, there are some foods that you should avoid such as raw or undercooked meat, fish, or eggs, unpasteurized dairy products, and raw or undercooked fruits and vegetables.",
            "What about physical activity?",
            "Physical activity is important, but you should avoid high-impact activities and consult with your doctor before starting any new exercise routine.",
            "How long will it take for me to recover?",
            "Recovery time varies for each individual, but it usually takes several weeks to a few months to fully recover from a liver transplant.",
            "Can I return to my normal routine after recovery?"
        ],
        "knowledge": "Hepatitis Hepatitis Most patients who acquire hepatitis D at the same time as hepatitis B  recover without developing a chronic infection.  In people with hepatitis B who later acquire hepatitis D , chronic infection is much more common at 80–90%, and liver disease progression is accelerated. Chronic hepatitis C progresses towards cirrhosis, with estimates of cirrhosis prevalence of 16% at 20 years after infection.  While the major causes of mortality in hepatitis C is end stage liver disease, hepatocellular carcinoma is an important additional long term complication and cause of death in chronic hepatitis. Rates of mortality increase with progression of the underlying liver disease.  Series of patients with compensated cirrhosis due to HCV have shown 3,5, and 10-year survival rates of 96, 91, and 79% respectively.   The 5-year survival rate drops to 50% upon if the cirrhosis becomes decompensated Hepatitis Hepatitis",
        "response": "You can return to your normal routine after recovery, but you should continue to follow a healthy lifestyle and take care of your liver."
    },
    {
        "dialog": [
            "Hello Medi, I feel very tired today and my liver hurts.",
            "I am sorry to hear that. How long have you been feeling this way?",
            "I have been feeling this way for a week now.",
            "Have you been drinking alcohol?",
            "Yes, I have been drinking alcohol frequently.",
            "Based on your symptoms, it sounds like you may have liver damage due to excessive alcohol consumption.",
            "What should I do now?",
            "You should stop drinking and get a liver function test to determine the extent of the damage.",
            "Thank you for your advice. Is there anything else I can do to improve my liver health?"
        ],
        "knowledge": "Hepatitis Hepatitis Most patients who acquire hepatitis D at the same time as hepatitis B  recover without developing a chronic infection.  In people with hepatitis B who later acquire hepatitis D , chronic infection is much more common at 80–90%, and liver disease progression is accelerated. Chronic hepatitis C progresses towards cirrhosis, with estimates of cirrhosis prevalence of 16% at 20 years after infection.  While the major causes of mortality in hepatitis C is end stage liver disease, hepatocellular carcinoma is an important additional long term complication and cause of death in chronic hepatitis. Rates of mortality increase with progression of the underlying liver disease.  Series of patients with compensated cirrhosis due to HCV have shown 3,5, and 10-year survival rates of 96, 91, and 79% respectively.   The 5-year survival rate drops to 50% upon if the cirrhosis becomes decompensated Hepatitis Hepatitis",
        "response": "Stopping alcohol consumption is the best step to improve your liver health, and you can also get a liver function test to determine the extent of the damage."
    },
    {
        "dialog": [
            "Hello Medi, I have a question about hepatitis B and D.",
            "Sure, what would you like to know?",
            "What is the difference between hepatitis B and D?",
            "Hepatitis B is caused by the hepatitis B virus, while hepatitis D is caused by the hepatitis D virus.",
            "What are the symptoms of hepatitis B and D?",
            "The symptoms of both hepatitis B and D are similar, including fever, fatigue, loss of appetite, nausea, vomiting, abdominal pain, dark urine and jaundice.",
            "Are there any treatments available?",
            "There is a vaccine for hepatitis B, but there is no specific treatment for hepatitis D.",
            "Can hepatitis B turn into hepatitis D?"
        ],
        "knowledge": "Hepatitis Hepatitis Most patients who acquire hepatitis D at the same time as hepatitis B  recover without developing a chronic infection.  In people with hepatitis B who later acquire hepatitis D , chronic infection is much more common at 80–90%, and liver disease progression is accelerated. Chronic hepatitis C progresses towards cirrhosis, with estimates of cirrhosis prevalence of 16% at 20 years after infection.  While the major causes of mortality in hepatitis C is end stage liver disease, hepatocellular carcinoma is an important additional long term complication and cause of death in chronic hepatitis. Rates of mortality increase with progression of the underlying liver disease.  Series of patients with compensated cirrhosis due to HCV have shown 3,5, and 10-year survival rates of 96, 91, and 79% respectively.   The 5-year survival rate drops to 50% upon if the cirrhosis becomes decompensated Hepatitis Hepatitis",
        "response": "You're welcome. If you have any other questions, feel free to ask."
    },
    {
        "dialog": [
            "Hi Medi, I have just had a liver biopsy.",
            "I see. How are you feeling?",
            "I feel a little bit of pain and discomfort in my abdomen.",
            "That's normal. It's important to take it easy and avoid any strenuous activities for a few days.",
            "How long does it take for the results to come back?",
            "It usually takes a few days to a week to get the results.",
            "What should I do while waiting for the results?",
            "In the meantime, you should rest and avoid any activities that may put strain on your liver.",
            "Thank you for your advice. Do you have any tips for maintaining good liver health?"
        ],
        "knowledge": "Hepatitis Hepatitis Most patients who acquire hepatitis D at the same time as hepatitis B  recover without developing a chronic infection.  In people with hepatitis B who later acquire hepatitis D , chronic infection is much more common at 80–90%, and liver disease progression is accelerated. Chronic hepatitis C progresses towards cirrhosis, with estimates of cirrhosis prevalence of 16% at 20 years after infection.  While the major causes of mortality in hepatitis C is end stage liver disease, hepatocellular carcinoma is an important additional long term complication and cause of death in chronic hepatitis. Rates of mortality increase with progression of the underlying liver disease.  Series of patients with compensated cirrhosis due to HCV have shown 3,5, and 10-year survival rates of 96, 91, and 79% respectively.   The 5-year survival rate drops to 50% upon if the cirrhosis becomes decompensated Hepatitis Hepatitis",
        "response": "Some tips for maintaining good liver health is to limit alcohol intake, maintain a healthy weight, avoid exposure to toxins and chemicals, and eat a balanced diet."
    }
]