[
    {
        "dialog": [
            "Hi Medi, I feel like I'm getting sick. Can you help me?",
            "Of course. What are your symptoms?",
            "I have a fever, cough, and body aches.",
            "Based on your symptoms, it's possible that you have the flu. Have you had a flu vaccine this season?",
            "No, I haven't. Is it too late to get one now?",
            "It's not too late. I recommend getting vaccinated as soon as possible to protect yourself from the flu.",
            "Thank you, Medi. I will schedule an appointment to get vaccinated soon.",
            "You're welcome. Let me know if you have any more questions.",
            "Sure. What are some other ways I can prevent getting the flu?"
        ],
        "knowledge": "Influenza Influenza  It is recommended that it be offered to people who have yet to receive a vaccine for the current flu season, who have been vaccinated less than two week since contact, if there is a significant mismatch between vaccine and circulating strains, or during an outbreak in a closed setting regardless of vaccination history. Hand hygiene is important in reducing the spread of influenza.  This includes frequent hand washing with soap and water, using alcohol-based hand sanitizers, and not touching one's eyes, nose, and mouth with one's hands.  Covering one's nose and mouth when coughing or sneezing is important.  Other methods to limit influenza transmission include staying home when sick, avoiding contact with others until one day after symptoms end, and disinfecting surfaces likely to be contaminated by the virus, such as doorknobs.  Health education through media and posters is often used to remind people of the aforementioned etiquette and hygiene. There is uncertainty about the use of masks since research thus far has not shown a significant reduction in seasonal influenza with mask usage Influenza Influenza",
        "response": "Some other ways to prevent getting the flu include practicing good hand hygiene, covering your nose and mouth when coughing or sneezing, staying home when sick, avoiding contact with others until one day after symptoms end, and disinfecting surfaces likely to be contaminated by the virus."
    },
    {
        "dialog": [
            "Hello Medi, I am feeling better after having the flu.",
            "That's great to hear! How are you feeling now?",
            "I am feeling good, but I want to make sure I don't get the flu again. What can I do?",
            "One of the best things you can do is to get your flu vaccine every year. It helps protect you and those around you from the flu.",
            "That's a good idea. Are there any other ways to prevent getting the flu?",
            "Yes, another way is to practice good hand hygiene. Wash your hands frequently with soap and water or use hand sanitizer. Avoid touching your face and stay away from people who are sick.",
            "Okay, I will make sure to do that. Thank you for your advice, Medi.",
            "You're welcome. Let me know if you have any other questions.",
            "I do. Can you explain the difference between the flu and a cold?"
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "The flu is a respiratory illness caused by the influenza virus, while a cold is caused by a different virus. The flu tends to have more severe symptoms, such as fever, muscle aches, and fatigue, while a cold is usually milder with symptoms like a runny nose and cough."
    },
    {
        "dialog": [
            "Hi Medi, I just had a flu shot and I want to make sure I'm doing everything I can to prevent getting the flu.",
            "Getting vaccinated is a great first step. What other questions do you have?",
            "What are some other ways to prevent getting the flu?",
            "Washing your hands frequently and avoiding touching your face are important. It's also a good idea to stay away from people who are sick and to cover your mouth and nose when you cough or sneeze.",
            "Okay, I will make sure to do those things. What should I do if I do get the flu?",
            "If you do get the flu, it's important to stay home and rest. Drink plenty of fluids and take over-the-counter medications for symptom relief. If your symptoms are severe or you are at high risk for complications from the flu, contact your healthcare provider.",
            "I see. What are some of the complications of the flu?",
            "Complications can include pneumonia, bronchitis, and sinus and ear infections. People who are at high risk for complications from the flu include young children, older adults, pregnant women, and people with certain medical conditions.",
            "Okay, I will keep that in mind. Thank you for your help, Medi."
        ],
        "knowledge": "Influenza Influenza  It is recommended that it be offered to people who have yet to receive a vaccine for the current flu season, who have been vaccinated less than two week since contact, if there is a significant mismatch between vaccine and circulating strains, or during an outbreak in a closed setting regardless of vaccination history. Hand hygiene is important in reducing the spread of influenza.  This includes frequent hand washing with soap and water, using alcohol-based hand sanitizers, and not touching one's eyes, nose, and mouth with one's hands.  Covering one's nose and mouth when coughing or sneezing is important.  Other methods to limit influenza transmission include staying home when sick, avoiding contact with others until one day after symptoms end, and disinfecting surfaces likely to be contaminated by the virus, such as doorknobs.  Health education through media and posters is often used to remind people of the aforementioned etiquette and hygiene. There is uncertainty about the use of masks since research thus far has not shown a significant reduction in seasonal influenza with mask usage Influenza Influenza",
        "response": "You're welcome. Remember to stay home and rest if you do get the flu, and contact your healthcare provider if your symptoms are severe or you are at high risk for complications."
    },
    {
        "dialog": [
            "Hello Medi, I have a high fever and a cough.",
            "I recommend you to stay at home and get some rest. Drinking fluids and taking fever reducers may help alleviate symptoms.",
            "What if the fever gets worse?",
            "If your fever persists or worsens, you should seek medical attention from a doctor.",
            "Is there anything else I can do to avoid getting sick?",
            "You can practice good hand hygiene, avoid touching your face, and avoid close contact with people who are sick.",
            "Can influenza spread through surfaces?",
            "Influenza viruses can survive on surfaces for up to 24 hours. It's recommended to clean and disinfect frequently touched surfaces to prevent transmission.",
            "Thanks for your advice, Medi."
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common.",
        "response": "You're welcome. I hope you feel better soon."
    },
    {
        "dialog": [
            "Hi Medi, I'm thinking about getting a flu shot.",
            "That's a great idea! The flu shot is the best way to prevent getting the flu.",
            "When is the best time to get a flu shot?",
            "It's recommended to get a flu shot before the start of flu season, which is usually in the fall.",
            "What if I've already had the flu this year?",
            "Even if you've already had the flu this year, it's still recommended to get a flu shot to protect against other strains of the virus.",
            "Are there any side effects to getting a flu shot?",
            "Common side effects include soreness or redness at the injection site, fever, and aches. These side effects are usually mild and go away on their own.",
            "Thanks for the information, Medi."
        ],
        "knowledge": "Influenza Influenza  It is recommended that the flu vaccine be offered to people who have yet to receive a vaccine for the current flu season, who have been vaccinated less than two week since contact, if there is a significant mismatch between vaccine and circulating strains, or during an outbreak in a closed setting regardless of vaccination history. Hand hygiene is important in reducing the spread of influenza.  This includes frequent hand washing with soap and water, using alcohol-based hand sanitizers, and not touching one's eyes, nose, and mouth with one's hands.  Covering one's nose and mouth when coughing or sneezing is important.  Other methods to limit influenza transmission include staying home when sick, avoiding contact with others until one day after symptoms end, and disinfecting surfaces likely to be contaminated by the virus, such as doorknobs.  Health education through media and posters is often used to remind people of the aforementioned etiquette and hygiene. There is uncertainty about the use of masks since research thus far has not shown a significant reduction in seasonal influenza with mask usage.",
        "response": "You're welcome. Let me know if you have any other questions."
    },
    {
        "dialog": [
            "Hi Medi, I just recovered from the flu and want to know how to prevent getting it again.",
            "You can practice good hand hygiene, avoid touching your face, and avoid close contact with people who are sick.",
            "What about wearing a mask?",
            "Wearing a mask can help prevent the spread of the flu, but it's not 100% effective. It's still important to practice good hand hygiene and avoid close contact with people who are sick.",
            "What should I do if someone in my household gets the flu?",
            "It's important to isolate the sick person and have them wear a mask. You should also practice good hand hygiene and avoid close contact with the sick person.",
            "Are there any home remedies for the flu?",
            "Drinking plenty of fluids, getting plenty of rest, and taking fever reducers can help alleviate symptoms. It's also important to eat a healthy diet.",
            "Thanks for the advice, Medi."
        ],
        "knowledge": "Influenza Influenza  It is recommended that the flu vaccine be offered to people who have yet to receive a vaccine for the current flu season, who have been vaccinated less than two week since contact, if there is a significant mismatch between vaccine and circulating strains, or during an outbreak in a closed setting regardless of vaccination history. Hand hygiene is important in reducing the spread of influenza.  This includes frequent hand washing with soap and water, using alcohol-based hand sanitizers, and not touching one's eyes, nose, and mouth with one's hands.  Covering one's nose and mouth when coughing or sneezing is important.  Other methods to limit influenza transmission include staying home when sick, avoiding contact with others until one day after symptoms end, and disinfecting surfaces likely to be contaminated by the virus, such as doorknobs.  Health education through media and posters is often used to remind people of the aforementioned etiquette and hygiene. There is uncertainty about the use of masks since research thus far has not shown a significant reduction in seasonal influenza with mask usage.",
        "response": "You're welcome. Let me know if you have any other questions."
    },
    {
        "dialog": [
            "Hi Medi, I think I have symptoms of flu.",
            "Hello, please tell me more about your symptoms.",
            "I have a headache, fever and body aches.",
            "I see, it sounds like you might have the flu.",
            "Is there anything I can do to feel better?",
            "Get plenty of rest and fluids, and take over-the-counter flu medicine.",
            "Can I prevent others from getting sick?",
            "Cover your nose and mouth when coughing or sneezing, and wash your hands often.",
            "Should I get the flu vaccine?"
        ],
        "knowledge": "Influenza Influenza  It is recommended that it be offered to people who have yet to receive a vaccine for the current flu season, who have been vaccinated less than two week since contact, if there is a significant mismatch between vaccine and circulating strains, or during an outbreak in a closed setting regardless of vaccination history. Hand hygiene is important in reducing the spread of influenza.  This includes frequent hand washing with soap and water, using alcohol-based hand sanitizers, and not touching one's eyes, nose, and mouth with one's hands.  Covering one's nose and mouth when coughing or sneezing is important.  Other methods to limit influenza transmission include staying home when sick, avoiding contact with others until one day after symptoms end, and disinfecting surfaces likely to be contaminated by the virus, such as doorknobs.  Health education through media and posters is often used to remind people of the aforementioned etiquette and hygiene. There is uncertainty about the use of masks since research thus far has not shown a significant reduction in seasonal influenza with mask usage Influenza Influenza",
        "response": "Yes, getting a flu vaccine is a good way to prevent the flu. You should consult your doctor for more information."
    },
    {
        "dialog": [
            "Hi Medi, I have a question about flu transmission.",
            "Hello, what would you like to know?",
            "How does the flu spread from person to person?",
            "The flu is mainly spread through droplets when someone with the flu coughs or sneezes.",
            "What can I do to avoid getting the flu?",
            "Wash your hands often, avoid close contact with people who are sick, and get vaccinated.",
            "Can I get the flu from touching something contaminated?",
            "It is possible, but less likely than getting it from droplets.",
            "What should I do if I think I have the flu?"
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "You should see a doctor as soon as possible, get plenty of rest, and take over-the-counter flu medicine to relieve your symptoms."
    },
    {
        "dialog": [
            "Hello Medi, I recently had the flu and I want to avoid getting it again.",
            "Hello, that's understandable. What would you like to know?",
            "What can I do to boost my immune system?",
            "Eating a healthy diet, getting enough sleep, and exercising regularly can help boost your immune system.",
            "What foods are good for my immune system?",
            "Foods high in vitamin C and antioxidants, such as citrus fruits, berries, and leafy greens.",
            "What else can I do to avoid getting the flu again?",
            "Wash your hands often, avoid close contact with people who are sick, and get vaccinated.",
            "Can the flu vaccine give me the flu?"
        ],
        "knowledge": "Influenza Influenza  It is recommended that it be offered to people who have yet to receive a vaccine for the current flu season, who have been vaccinated less than two week since contact, if there is a significant mismatch between vaccine and circulating strains, or during an outbreak in a closed setting regardless of vaccination history. Hand hygiene is important in reducing the spread of influenza.  This includes frequent hand washing with soap and water, using alcohol-based hand sanitizers, and not touching one's eyes, nose, and mouth with one's hands.  Covering one's nose and mouth when coughing or sneezing is important.  Other methods to limit influenza transmission include staying home when sick, avoiding contact with others until one day after symptoms end, and disinfecting surfaces likely to be contaminated by the virus, such as doorknobs.  Health education through media and posters is often used to remind people of the aforementioned etiquette and hygiene. There is uncertainty about the use of masks since research thus far has not shown a significant reduction in seasonal influenza with mask usage Influenza Influenza",
        "response": "No, the flu vaccine cannot give you the flu. It is made from an inactivated virus or pieces of the virus, so it cannot cause the flu."
    },
    {
        "dialog": [
            "Hi Medi, I have a running nose and a dry cough.",
            "Hello! It could be a seasonal change or a common cold.",
            "I am worried that it could be more serious than that.",
            "It could also be the flu. Do you have a fever or body aches?",
            "Yes, I do feel a little feverish and achy.",
            "It's likely to be the flu. You should rest and drink plenty of fluids.",
            "What else can I do to feel better?",
            "Continue to practice good hygiene and avoid contact with others to prevent spreading the flu.",
            "Thanks for your advice, Medi!"
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "You likely have the flu. Rest and drink plenty of fluids. Continue to practice good hygiene and avoid contact with others to prevent spreading the flu."
    },
    {
        "dialog": [
            "Hi Medi, I have never had the flu vaccine. Should I get it?",
            "Hello! It is recommended that the flu vaccine be offered to people who have yet to receive a vaccine for the current flu season.",
            "What if I have been vaccinated less than two weeks ago?",
            "If you have been vaccinated within two weeks of contact, you may still be susceptible to the flu.",
            "What if there is a significant mismatch between the vaccine and circulating strains?",
            "If there is a significant mismatch between vaccine and circulating strains, the vaccine may not be as effective.",
            "What if there is an outbreak in a closed setting?",
            "During an outbreak in a closed setting, regardless of vaccination history, it is recommended to get vaccinated.",
            "Thanks for the information, Medi!"
        ],
        "knowledge": "Influenza Influenza  It is recommended that it be offered to people who have yet to receive a vaccine for the current flu season, who have been vaccinated less than two week since contact, if there is a significant mismatch between vaccine and circulating strains, or during an outbreak in a closed setting regardless of vaccination history. Hand hygiene is important in reducing the spread of influenza.  This includes frequent hand washing with soap and water, using alcohol-based hand sanitizers, and not touching one's eyes, nose, and mouth with one's hands.  Covering one's nose and mouth when coughing or sneezing is important.  Other methods to limit influenza transmission include staying home when sick, avoiding contact with others until one day after symptoms end, and disinfecting surfaces likely to be contaminated by the virus, such as doorknobs.  Health education through media and posters is often used to remind people of the aforementioned etiquette and hygiene. There is uncertainty about the use of masks since research thus far has not shown a significant reduction in seasonal influenza with mask usage Influenza Influenza",
        "response": "You should get vaccinated for the flu for the current flu season unless there is a significant mismatch between the vaccine and circulating strains. It is recommended to practice good hygiene and avoid contact with others to limit influenza transmission."
    },
    {
        "dialog": [
            "Hello Medi, I recently had the flu and recovered. What should I do now?",
            "Hello! After having the flu, it is important to take care of yourself and focus on a healthy lifestyle.",
            "What should I do to have a healthy lifestyle?",
            "You should prioritize getting enough sleep, eating a balanced diet, and staying active regularly.",
            "What kind of food should I eat?",
            "Fruits, vegetables, lean protein, and whole grains are all good choices.",
            "What kind of physical activities should I do?",
            "You can try walking, biking, swimming, or other activities that get your heart rate up.",
            "Thanks for the advice, Medi!"
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "You should prioritize getting enough sleep, eating a balanced diet, and staying active regularly. Fruits, vegetables, lean protein, and whole grains are all good choices. Walking, biking, swimming, or other activities that get your heart rate up are good options for physical activity."
    },
    {
        "dialog": [
            "Hi Medi, I'm not feeling well. I have a fever and a cough.",
            "Hello, sorry to hear that. Do you have any other symptoms?",
            "I feel a little tired and have a headache.",
            "Based on your symptoms, you may have influenza. Get rest and stay home to avoid spreading the virus.",
            "What can I do to feel better?",
            "You can take over-the-counter medication for fever and cough. Drink plenty of water and get rest. If your symptoms worsen, seek medical attention.",
            "Thanks, Medi. How can I prevent getting the flu?",
            "Wash your hands frequently, avoid touching your face, and avoid close contact with sick people. Get vaccinated for the flu every year to reduce your risk of getting sick.",
            "Got it, thanks for your help!"
        ],
        "knowledge": "Influenza Influenza  It is recommended that it be offered to people who have yet to receive a vaccine for the current flu season, who have been vaccinated less than two week since contact, if there is a significant mismatch between vaccine and circulating strains, or during an outbreak in a closed setting regardless of vaccination history. Hand hygiene is important in reducing the spread of influenza.  This includes frequent hand washing with soap and water, using alcohol-based hand sanitizers, and not touching one's eyes, nose, and mouth with one's hands.  Covering one's nose and mouth when coughing or sneezing is important.  Other methods to limit influenza transmission include staying home when sick, avoiding contact with others until one day after symptoms end, and disinfecting surfaces likely to be contaminated by the virus, such as doorknobs.  Health education through media and posters is often used to remind people of the aforementioned etiquette and hygiene. There is uncertainty about the use of masks since research thus far has not shown a significant reduction in seasonal influenza with mask usage Influenza Influenza",
        "response": "You're welcome. Take care and get plenty of rest. Remember to wash your hands and avoid close contact with sick people to prevent getting the flu."
    },
    {
        "dialog": [
            "Medi, can you explain what influenza is?",
            "Sure, influenza is a viral infection that affects the respiratory system.",
            "What are the symptoms?",
            "Symptoms include fever, cough, sore throat, runny or stuffy nose, body aches, headache, chills, and fatigue.",
            "How is it spread?",
            "It's spread through respiratory droplets when an infected person coughs or sneezes. It can also be spread by touching a surface contaminated with the virus and then touching one's mouth, nose, or eyes.",
            "Is there a cure for influenza?",
            "There is no cure, but antiviral medication can help lessen the severity and duration of symptoms.",
            "Thanks for explaining, Medi. How can I prevent getting the flu?"
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "You're welcome. Remember to practice good hygiene, such as washing your hands frequently and avoiding close contact with sick people, to prevent getting the flu."
    },
    {
        "dialog": [
            "Hi Medi, I just got vaccinated for the flu. What should I do now?",
            "Congratulations on getting vaccinated! You should continue to practice good hygiene to reduce your risk of getting sick.",
            "What are some ways I can practice good hygiene?",
            "Wash your hands frequently, avoid touching your face, and avoid close contact with sick people. Cover your nose and mouth when you cough or sneeze, and stay home if you're sick.",
            "Are there any side effects of the flu vaccine?",
            "Some people may experience mild side effects, such as soreness or redness at the injection site, low-grade fever, or body aches. These side effects usually go away within a few days.",
            "Thanks, Medi. Is there anything else I should know?",
            "Just remember to get vaccinated every year, as the vaccine changes to match the circulating strains of the virus. And if you start to experience flu-like symptoms, seek medical attention.",
            "Got it. Thanks for your help!"
        ],
        "knowledge": "Influenza Influenza  It is recommended that it be offered to people who have yet to receive a vaccine for the current flu season, who have been vaccinated less than two week since contact, if there is a significant mismatch between vaccine and circulating strains, or during an outbreak in a closed setting regardless of vaccination history. Hand hygiene is important in reducing the spread of influenza.  This includes frequent hand washing with soap and water, using alcohol-based hand sanitizers, and not touching one's eyes, nose, and mouth with one's hands.  Covering one's nose and mouth when coughing or sneezing is important.  Other methods to limit influenza transmission include staying home when sick, avoiding contact with others until one day after symptoms end, and disinfecting surfaces likely to be contaminated by the virus, such as doorknobs.  Health education through media and posters is often used to remind people of the aforementioned etiquette and hygiene. There is uncertainty about the use of masks since research thus far has not shown a significant reduction in seasonal influenza with mask usage Influenza Influenza",
        "response": "You're welcome. Remember to practice good hygiene and get vaccinated every year to protect yourself from the flu."
    },
    {
        "dialog": [
            "Hello, Medi. I'm not feeling well due to a headache.",
            "Hi there. Can you tell me more about your headache?",
            "I have been experiencing it for about 2 days. It's not too severe, but it's bothering me.",
            "Have you experienced any other symptoms aside from the headache?",
            "Yes, I feel fatigued and have a runny nose.",
            "Based on your symptoms, you may have the flu. It is recommended to rest and drink plenty of fluids.",
            "Is there anything else I can do?",
            "Make sure to practice proper hand hygiene. Frequent hand washing and avoiding close contact with others can help prevent the spread of the virus.",
            "Thank you, Medi. What about taking medication?"
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "It is recommended to rest, drink plenty of fluids, and practice proper hand hygiene when experiencing flu-like symptoms."
    },
    {
        "dialog": [
            "Hello, Medi. I have a question about the flu vaccine.",
            "Hi there. What would you like to know?",
            "When is it recommended to get the flu vaccine?",
            "It is recommended to get the flu vaccine every year, especially if you have not received it for the current flu season yet.",
            "What if I have already been vaccinated this season?",
            "If you have already received the flu vaccine this season, it is still recommended to practice proper hand hygiene and avoid close contact with others to prevent the spread of the virus.",
            "What if there is a significant mismatch between the vaccine and circulating strains?",
            "Even if there is a significant mismatch between the vaccine and circulating strains, it is still recommended to get the vaccine as it can still provide some protection.",
            "Thank you, Medi. How else can I prevent the spread of the flu?"
        ],
        "knowledge": "Influenza Influenza  It is recommended that it be offered to people who have yet to receive a vaccine for the current flu season, who have been vaccinated less than two week since contact, if there is a significant mismatch between vaccine and circulating strains, or during an outbreak in a closed setting regardless of vaccination history. Hand hygiene is important in reducing the spread of influenza.  This includes frequent hand washing with soap and water, using alcohol-based hand sanitizers, and not touching one's eyes, nose, and mouth with one's hands.  Covering one's nose and mouth when coughing or sneezing is important.  Other methods to limit influenza transmission include staying home when sick, avoiding contact with others until one day after symptoms end, and disinfecting surfaces likely to be contaminated by the virus, such as doorknobs.  Health education through media and posters is often used to remind people of the aforementioned etiquette and hygiene. There is uncertainty about the use of masks since research thus far has not shown a significant reduction in seasonal influenza with mask usage Influenza Influenza",
        "response": "It is recommended to get the flu vaccine every year, practice proper hand hygiene, and avoid close contact with others to prevent the spread of the flu."
    },
    {
        "dialog": [
            "Hi, Medi. I recently had the flu and recovered. What can I do to prevent getting it again?",
            "Hi there. After recovering from the flu, it is important to take care of yourself and practice good hygiene.",
            "What kind of hygiene practices should I follow?",
            "Frequent hand washing with soap and water, using alcohol-based hand sanitizers, and avoiding touching your eyes, nose, and mouth with your hands can help prevent the spread of the flu.",
            "Is there anything else I can do?",
            "Getting enough sleep, eating a healthy and balanced diet, and staying physically active can also help boost your immune system and prevent getting the flu again.",
            "Thank you, Medi. What about the flu vaccine?",
            "Even if you have already had the flu, it is still recommended to get the flu vaccine as it can provide protection against other strains of the virus.",
            "When should I get the vaccine?"
        ],
        "knowledge": "Influenza Influenza  It is recommended that it be offered to people who have yet to receive a vaccine for the current flu season, who have been vaccinated less than two week since contact, if there is a significant mismatch between vaccine and circulating strains, or during an outbreak in a closed setting regardless of vaccination history. Hand hygiene is important in reducing the spread of influenza.  This includes frequent hand washing with soap and water, using alcohol-based hand sanitizers, and not touching one's eyes, nose, and mouth with one's hands.  Covering one's nose and mouth when coughing or sneezing is important.  Other methods to limit influenza transmission include staying home when sick, avoiding contact with others until one day after symptoms end, and disinfecting surfaces likely to be contaminated by the virus, such as doorknobs.  Health education through media and posters is often used to remind people of the aforementioned etiquette and hygiene. There is uncertainty about the use of masks since research thus far has not shown a significant reduction in seasonal influenza with mask usage Influenza Influenza",
        "response": "It is recommended to practice good hygiene, get enough sleep, eat a healthy and balanced diet, and get the flu vaccine every year to prevent getting the flu again."
    },
    {
        "dialog": [
            "Hi Medi, I have some symptoms, can you help me?",
            "Sure, what are your symptoms?",
            "I have a fever and cough, and I feel tired",
            "Do you have any trouble breathing?",
            "No, I don't",
            "Based on your symptoms, you may have the flu. You should rest and drink fluids.",
            "What else can I do to help myself?",
            "You should avoid contact with other people and cover your mouth and nose when you cough or sneeze.",
            "Thank you, Medi. How can I prevent the flu?"
        ],
        "knowledge": "Influenza Influenza It is recommended that it be offered to people who have yet to receive a vaccine for the current flu season, who have been vaccinated less than two week since contact, if there is a significant mismatch between vaccine and circulating strains, or during an outbreak in a closed setting regardless of vaccination history. Hand hygiene is important in reducing the spread of influenza.  This includes frequent hand washing with soap and water, using alcohol-based hand sanitizers, and not touching one's eyes, nose, and mouth with one's hands.  Covering one's nose and mouth when coughing or sneezing is important.  Other methods to limit influenza transmission include staying home when sick, avoiding contact with others until one day after symptoms end, and disinfecting surfaces likely to be contaminated by the virus, such as doorknobs.  Health education through media and posters is often used to remind people of the aforementioned etiquette and hygiene. There is uncertainty about the use of masks since research thus far has not shown a significant reduction in seasonal influenza with mask usage Influenza Influenza",
        "response": "You can prevent the flu by washing your hands frequently, covering your mouth and nose when you cough or sneeze, avoiding contact with sick people, and disinfecting surfaces likely to be contaminated by the virus."
    },
    {
        "dialog": [
            "Hi Medi, can you give me more information about the flu?",
            "Of course, what would you like to know?",
            "What causes the flu and how does it spread?",
            "The flu is caused by the influenza virus and it spreads through droplets when an infected person talks, coughs, or sneezes.",
            "What are the symptoms of the flu?",
            "The symptoms of the flu include fever, cough, sore throat, muscle aches, fatigue, and headaches.",
            "What can I do to protect myself from the flu?",
            "You can get vaccinated, wash your hands frequently, cover your mouth and nose when you cough or sneeze, avoid contact with sick people, and disinfect surfaces likely to be contaminated by the virus.",
            "Thank you, Medi. How effective is the flu vaccine?"
        ],
        "knowledge": "Influenza Influenza The effectiveness of the flu vaccine varies depending on the match between the vaccine and the circulating strains of the virus.  Generally, the vaccine is most effective when the vaccine strains match the circulating strains.  The vaccine is less effective in older people, those with certain chronic illnesses, and those with weakened immune systems.  Despite this, the vaccine remains an important means of reducing the overall impact of influenza.  The vaccine may also reduce the severity of the disease in those who become infected despite vaccination.  Vaccination of high-risk individuals and healthcare workers is recommended to reduce the impact of the disease in these populations Influenza Influenza",
        "response": "The effectiveness of the flu vaccine varies depending on the match between the vaccine and the circulating strains of the virus. However, the vaccine remains an important means of reducing the overall impact of the influenza and is recommended for high-risk individuals and healthcare workers."
    },
    {
        "dialog": [
            "Hello Medi, I just recovered from the flu. Do you have any advice for me?",
            "Yes, I do. You should get plenty of rest, drink fluids, and eat nutritious foods.",
            "What kind of foods should I eat?",
            "You should eat a balanced diet with plenty of fruits, vegetables, lean proteins, and whole grains.",
            "Can I exercise?",
            "You can exercise, but you should start slowly and gradually increase your activity level as you start feeling better. Don't push yourself too hard too quickly.",
            "What about going back to work?",
            "You should wait until you have been fever-free for at least 24 hours before going back to work, and you should avoid contact with sick people.",
            "Thank you, Medi. Is there anything else I should know?"
        ],
        "knowledge": "Influenza Influenza After recovering from the flu, it is important to get plenty of rest, drink fluids, eat nutritious foods, and gradually resume physical activity.  It is also important to avoid contact with sick people and to stay home if you are sick.  If you have a weakened immune system, chronic health condition, or are pregnant, you may be at risk of complications from the flu and should talk to your doctor about additional precautions Influenza Influenza",
        "response": "After recovering from the flu, it is important to get plenty of rest, drink fluids, eat nutritious foods, and gradually resume physical activity. It is also important to avoid contact with sick people and to stay home if you are sick. If you have a weakened immune system, chronic health condition, or are pregnant, you may be at risk of complications from the flu and should talk to your doctor about additional precautions."
    }
]