[
    {
        "dialog": [
            "Hello Medi, I'm having trouble breathing",
            "I'm sorry to hear that. Can you describe your symptoms more specifically?",
            "I feel a tightness in my chest and shortness of breath",
            "Based on your symptoms, it is possible that you have asthma",
            "What should I do to alleviate my symptoms?",
            "You may need to use an inhaler, avoid triggers, and maintain a healthy lifestyle",
            "Is there a cure for asthma?",
            "There's no cure for asthma, but it can be managed with proper treatment and care.",
            "What kind of triggers should I avoid?"
        ],
        "knowledge": "Asthma Asthma  In 2010 the death rate was 170 per million for males and 90 per million for females.  Rates vary between countries by 100 fold. Globally it causes moderate or severe disability in 19. 4 million people as of 2004 .  Of asthma diagnosed during childhood, half of cases will no longer carry the diagnosis after a decade.  Airway remodeling is observed, but it is unknown whether these represent harmful or beneficial changes.  Early treatment with corticosteroids seems to prevent or ameliorates a decline in lung function Asthma Asthma",
        "response": "It is better to avoid dust, smoke, and pet hair, as these are some of the common triggers for asthma."
    },
    {
        "dialog": [
            "Hi Medi, I've been diagnosed with asthma",
            "I'm sorry to hear that. Do you have any questions regarding your condition?",
            "What kind of exercises should I do?",
            "You should engage in low-impact exercises, such as walking and swimming",
            "What kind of foods should I avoid?",
            "It's better to avoid foods that can trigger your asthma, such as dairy products and refined sugars",
            "Can my asthma go away?",
            "There's no cure for asthma, but it can be managed with proper treatment and care. ",
            "What kind of medications should I take?"
        ],
        "knowledge": "Asthma Asthma  In 2010 the death rate was 170 per million for males and 90 per million for females.  Rates vary between countries by 100 fold. Globally it causes moderate or severe disability in 19. 4 million people as of 2004 .  Of asthma diagnosed during childhood, half of cases will no longer carry the diagnosis after a decade.  Airway remodeling is observed, but it is unknown whether these represent harmful or beneficial changes.  Early treatment with corticosteroids seems to prevent or ameliorates a decline in lung function Asthma Asthma",
        "response": "It depends on your specific condition, but your doctor may prescribe you with bronchodilators, corticosteroids, or combination inhalers."
    },
    {
        "dialog": [
            "Hi Medi, I'm struggling with managing my asthma",
            "I'm sorry to hear that. Can you tell me more about your symptoms?",
            "I'm experiencing frequent asthma attacks and my inhaler doesn't seem to be helping",
            "You may need to consult your doctor to adjust your medication or try different treatment options",
            "What other treatment options are available for asthma?",
            "Other treatment options include immunomodulators, biologics, and airway clearance techniques",
            "What are the side effects of these treatments?",
            "The side effects vary depending on the treatment, but your doctor will discuss these with you before starting any new medication",
            "Can I still exercise with asthma?"
        ],
        "knowledge": "Asthma Asthma  In 2010 the death rate was 170 per million for males and 90 per million for females.  Rates vary between countries by 100 fold. Globally it causes moderate or severe disability in 19. 4 million people as of 2004 .  Of asthma diagnosed during childhood, half of cases will no longer carry the diagnosis after a decade.  Airway remodeling is observed, but it is unknown whether these represent harmful or beneficial changes.  Early treatment with corticosteroids seems to prevent or ameliorates a decline in lung function Asthma Asthma",
        "response": "Yes, you can still exercise with asthma, but it's important to consult with your doctor and take necessary precautions, such as using your inhaler before and after exercise."
    },
    {
        "dialog": [
            "Hello Medi, I have some trouble breathing.",
            "I see. Can you describe your symptoms for me?",
            "I feel tightness in my chest and I'm wheezing.",
            "Based on your symptoms, it sounds like you may have asthma.",
            "Is asthma serious?",
            "It can be, but it's manageable with the right treatment.",
            "What kind of treatment is available?",
            "There are many options available, including inhalers and corticosteroids.",
            "Thank you Medi. What should I do if my symptoms get worse?"
        ],
        "knowledge": "Asthma Asthma  In 2010 the death rate was 170 per million for males and 90 per million for females.  Rates vary between countries by 100 fold. Globally it causes moderate or severe disability in 19.4 million people as of 2004 .  Of asthma diagnosed during childhood, half of cases will no longer carry the diagnosis after a decade.  Airway remodeling is observed, but it is unknown whether these represent harmful or beneficial changes.  Early treatment with corticosteroids seems to prevent or ameliorates a decline in lung function Asthma Asthma",
        "response": "You should contact your doctor immediately if your symptoms get worse, or if you experience shortness of breath or chest pain."
    },
    {
        "dialog": [
            "Hello Medi, I have a question about asthma.",
            "Of course, I'm happy to help. What do you want to know?",
            "How common is asthma?",
            "Asthma is a fairly common condition, affecting millions of people worldwide.",
            "Is asthma hereditary?",
            "There is some evidence to suggest that genetics may play a role in the development of asthma.",
            "What are some triggers for asthma?",
            "Common triggers include allergens, exercise, stress, and pollution.",
            "Thank you Medi, that's very helpful. How is asthma diagnosed?"
        ],
        "knowledge": "Asthma Asthma  In 2010 the death rate was 170 per million for males and 90 per million for females.  Rates vary between countries by 100 fold. Globally it causes moderate or severe disability in 19.4 million people as of 2004 .  Of asthma diagnosed during childhood, half of cases will no longer carry the diagnosis after a decade.  Airway remodeling is observed, but it is unknown whether these represent harmful or beneficial changes.  Early treatment with corticosteroids seems to prevent or ameliorates a decline in lung function Asthma Asthma",
        "response": "There are a variety of tests that can be used to diagnose asthma, including spirometry, bronchoprovocation testing, and allergy testing."
    },
    {
        "dialog": [
            "Hello Medi, I recently had an asthma attack and I'm not sure what to do next.",
            "I'm sorry to hear that. Are you okay now?",
            "Yes, I'm feeling better, but I'm worried it might happen again.",
            "It's important to have an asthma action plan in place so you know what to do if your symptoms get worse.",
            "What's an asthma action plan?",
            "It's a personalized plan that outlines the steps you should take if your symptoms worsen, including which medications to take and when to contact your doctor.",
            "That sounds like it would be helpful. How do I get an asthma action plan?",
            "You can work with your doctor to create one based on your specific needs and medical history.",
            "Thank you Medi, I'll make sure to talk to my doctor about it. Is there anything else I should know?"
        ],
        "knowledge": "Asthma Asthma  In 2010 the death rate was 170 per million for males and 90 per million for females.  Rates vary between countries by 100 fold. Globally it causes moderate or severe disability in 19.4 million people as of 2004 .  Of asthma diagnosed during childhood, half of cases will no longer carry the diagnosis after a decade.  Airway remodeling is observed, but it is unknown whether these represent harmful or beneficial changes.  Early treatment with corticosteroids seems to prevent or ameliorates a decline in lung function Asthma Asthma",
        "response": "Just remember to always carry your rescue inhaler with you, and to seek medical attention immediately if your symptoms become severe."
    },
    {
        "dialog": [
            "Hello Medi, I have some trouble with my breathing.",
            "Hi there, can you tell me more about your symptoms?",
            "I feel like I can't take a deep breath and my chest is tight.",
            "I see, you may have some symptoms of asthma. Have you ever been diagnosed with it?",
            "No, I haven't. What should I do now?",
            "Don't worry, I recommend you to visit a doctor as soon as possible to get a correct diagnosis and treatment.",
            "But what can I do to relieve my symptoms in the meantime?",
            "You can try using an inhaler if you have one, and avoid exposure to triggers such as smoke, dust, and pollen.",
            "Ok, thanks for your advice. What is asthma exactly?"
        ],
        "knowledge": "Asthma Asthma  In 2010 the death rate was 170 per million for males and 90 per million for females.  Rates vary between countries by 100 fold. Globally it causes moderate or severe disability in 19. 4 million people as of 2004 .  Of asthma diagnosed during childhood, half of cases will no longer carry the diagnosis after a decade.  Airway remodeling is observed, but it is unknown whether these represent harmful or beneficial changes.  Early treatment with corticosteroids seems to prevent or ameliorates a decline in lung function Asthma Asthma",
        "response": "Asthma is a chronic respiratory disease that causes inflammation and narrowing of the airways, making it difficult to breathe. It can be triggered by a variety of factors, including allergens, exercise, and stress."
    },
    {
        "dialog": [
            "Hi Medi, can you tell me more about the symptoms of asthma?",
            "Of course, asthma can cause a range of symptoms including wheezing, coughing, tightness in the chest, and shortness of breath.",
            "What causes asthma?",
            "The exact cause of asthma is unknown, but it's thought to be a combination of genetic and environmental factors.",
            "Can asthma be cured?",
            "Currently, there is no cure for asthma, but it can be managed with proper treatment and lifestyle changes.",
            "What kind of treatment is available?",
            "Treatment for asthma typically involves medications such as inhalers and corticosteroids, as well as avoiding triggers and making lifestyle changes.",
            "Thanks for your help, Medi. Is there anything else I should know about asthma?"
        ],
        "knowledge": "Asthma Asthma  In 2010 the death rate was 170 per million for males and 90 per million for females.  Rates vary between countries by 100 fold. Globally it causes moderate or severe disability in 19. 4 million people as of 2004 .  Of asthma diagnosed during childhood, half of cases will no longer carry the diagnosis after a decade.  Airway remodeling is observed, but it is unknown whether these represent harmful or beneficial changes.  Early treatment with corticosteroids seems to prevent or ameliorates a decline in lung function Asthma Asthma",
        "response": "Asthma can be a serious condition and it's important to have a proper diagnosis and treatment plan in place. It's also important to avoid triggers and make lifestyle changes to help manage symptoms."
    },
    {
        "dialog": [
            "Hi Medi, I just had a medical procedure and I'm wondering what I should do to recover quickly.",
            "Hello, what kind of procedure did you have?",
            "I had a surgery to remove a tumor.",
            "I see, it's important to follow your doctor's instructions for recovery, including getting enough rest and taking any medications as prescribed.",
            "Is there anything else I can do to help speed up my recovery?",
            "Yes, a healthy diet and regular exercise can also help improve your recovery time and overall health.",
            "Are there any foods or supplements I should focus on?",
            "Foods rich in protein and vitamin C can be especially helpful for recovery, as well as supplements like probiotics and omega-3 fatty acids.",
            "Thank you for your advice, Medi. Anything else I should keep in mind?"
        ],
        "knowledge": "Asthma Asthma  In 2010 the death rate was 170 per million for males and 90 per million for females.  Rates vary between countries by 100 fold. Globally it causes moderate or severe disability in 19. 4 million people as of 2004 .  Of asthma diagnosed during childhood, half of cases will no longer carry the diagnosis after a decade.  Airway remodeling is observed, but it is unknown whether these represent harmful or beneficial changes.  Early treatment with corticosteroids seems to prevent or ameliorates a decline in lung function Asthma Asthma",
        "response": "It's important to take care of yourself after a medical procedure, including getting enough rest, eating a healthy diet, and attending follow-up appointments with your doctor."
    },
    {
        "dialog": [
            "Hello Medi, I have some difficulty breathing.",
            "I am here to help you. Can you tell me more about your breathing difficulty?",
            "I feel like I can't catch my breath, and it's getting worse.",
            "Do you have a cough or wheezing?",
            "Yes, I have a cough and some wheezing in my chest.",
            "Based on your symptoms, you may have asthma. You should see a doctor immediately.",
            "What causes asthma, Medi?",
            "Asthma is caused by inflammation and narrowing of the airways. It can be triggered by allergens or irritants.",
            "Thank you, Medi."
        ],
        "knowledge": "Asthma Asthma In 2010 the death rate was 170 per million for males and 90 per million for females. Rates vary between countries by 100 fold. Globally it causes moderate or severe disability in 19.4 million people as of 2004. Of asthma diagnosed during childhood, half of cases will no longer carry the diagnosis after a decade. Airway remodeling is observed, but it is unknown whether these represent harmful or beneficial changes. Early treatment with corticosteroids seems to prevent or ameliorate a decline in lung function Asthma Asthma",
        "response": "Asthma is caused by inflammation and narrowing of the airways. It can be triggered by allergens or irritants."
    },
    {
        "dialog": [
            "Hi Medi, can you tell me more about asthma?",
            "Of course, what would you like to know?",
            "What are the symptoms of asthma?",
            "The most common symptoms of asthma are coughing, wheezing, shortness of breath, and chest tightness. These symptoms can be worse at night or in the early morning.",
            "Can asthma be cured?",
            "There is no cure for asthma, but it can be managed with medications and lifestyle changes.",
            "What lifestyle changes can help with asthma?",
            "Avoiding triggers, staying active, and maintaining a healthy weight can all help manage asthma.",
            "Thank you, Medi."
        ],
        "knowledge": "Asthma Asthma In 2010 the death rate was 170 per million for males and 90 per million for females. Rates vary between countries by 100 fold. Globally it causes moderate or severe disability in 19.4 million people as of 2004. Of asthma diagnosed during childhood, half of cases will no longer carry the diagnosis after a decade. Airway remodeling is observed, but it is unknown whether these represent harmful or beneficial changes. Early treatment with corticosteroids seems to prevent or ameliorate a decline in lung function Asthma Asthma",
        "response": "The most common symptoms of asthma are coughing, wheezing, shortness of breath, and chest tightness. These symptoms can be worse at night or in the early morning."
    },
    {
        "dialog": [
            "Hi Medi, I have just been diagnosed with asthma. What can I do to manage it?",
            "I can help you with that. Do you have any questions?",
            "Yes, what medications are commonly used to manage asthma?",
            "There are two types of medications for asthma: quick-relief medications and long-term control medications. Quick-relief medications are used to relieve asthma symptoms, while long-term control medications are used to prevent asthma symptoms.",
            "What lifestyle changes can I make to manage my asthma?",
            "Avoiding triggers, staying active, maintaining a healthy weight, and using a peak flow meter can all help manage asthma.",
            "What is a peak flow meter?",
            "A peak flow meter is a small device that measures how well you can breathe out. It can be used at home to monitor your asthma.",
            "Thank you, Medi."
        ],
        "knowledge": "Asthma Asthma In 2010 the death rate was 170 per million for males and 90 per million for females. Rates vary between countries by 100 fold. Globally it causes moderate or severe disability in 19.4 million people as of 2004. Of asthma diagnosed during childhood, half of cases will no longer carry the diagnosis after a decade. Airway remodeling is observed, but it is unknown whether these represent harmful or beneficial changes. Early treatment with corticosteroids seems to prevent or ameliorate a decline in lung function Asthma Asthma",
        "response": "Remember to see your doctor regularly to keep your asthma under control."
    },
    {
        "dialog": [
            "Hello Medi, I have difficulty breathing recently",
            "I am sorry to hear that. Can you describe your symptoms more specifically?",
            "I have a hard time breathing, especially when I'm lying down. I'm also coughing and wheezing.",
            "Based on your symptoms, you may have asthma. Have you suffered from this before?",
            "Yes, I was diagnosed with asthma a few years ago.",
            "It seems like your asthma may be getting worse. You should talk to your doctor about adjusting your medications.",
            "I will definitely do that. Thanks for your advice, Medi.",
            "You're welcome. Don't hesitate to ask me any other questions you may have.",
            "Can you tell me more about early treatment with corticosteroids for asthma?"
        ],
        "knowledge": "Asthma Asthma  In 2010 the death rate was 170 per million for males and 90 per million for females. Rates vary between countries by 100 fold. Globally it causes moderate or severe disability in 19. 4 million people as of 2004 . Of asthma diagnosed during childhood, half of cases will no longer carry the diagnosis after a decade.Airway remodeling is observed, but it is unknown whether these represent harmful or beneficial changes. Early treatment with corticosteroids seems to prevent or ameliorates a decline in lung function Asthma Asthma",
        "response": "Corticosteroids are a type of anti-inflammatory medication that can help reduce airway inflammation and improve lung function in people with asthma."
    },
    {
        "dialog": [
            "Hello Medi, I want to know more about the death rate of asthma.",
            "Sure, I can help you with that. Asthma can be a serious condition, but it is usually manageable with proper treatment.",
            "But what about the death rate?",
            "In 2010, the death rate was 170 per million for males and 90 per million for females. However, it's important to remember that these numbers may vary between countries.",
            "Wow, that's much higher than I expected.",
            "Yes, it's important to take asthma seriously and to work with your doctor to properly manage the condition.",
            "Thank you for the information, Medi.",
            "You're welcome. Let me know if you have any other questions.",
            "Can asthma cause long-term lung damage?"
        ],
        "knowledge": "Asthma Asthma  In 2010 the death rate was 170 per million for males and 90 per million for females. Rates vary between countries by 100 fold. Globally it causes moderate or severe disability in 19. 4 million people as of 2004 . Of asthma diagnosed during childhood, half of cases will no longer carry the diagnosis after a decade.Airway remodeling is observed, but it is unknown whether these represent harmful or beneficial changes. Early treatment with corticosteroids seems to prevent or ameliorates a decline in lung function Asthma Asthma",
        "response": "There is some evidence of airway remodeling in people with long-term asthma, but it is unclear whether these changes are harmful or beneficial. Early treatment with corticosteroids may help prevent or improve any decline in lung function."
    },
    {
        "dialog": [
            "Hello Medi, I recently had a medical procedure and I'm not sure what I should be doing to take care of myself.",
            "I'm here to help. What procedure did you have?",
            "I had a bronchoscopy.",
            "After a bronchoscopy, it's important to rest and avoid any strenuous physical activity for a few days. You should also drink plenty of fluids to help flush out any anesthesia or other medications from your system.",
            "Are there any specific foods I should be eating?",
            "It's important to eat a healthy and balanced diet that includes plenty of fruits and vegetables. You should also avoid any spicy, acidic, or fatty foods that could irritate your throat.",
            "Thank you for the advice, Medi.",
            "You're welcome. Remember to follow any other instructions your doctor gave you and don't hesitate to reach out if you have any other questions.",
            "Can bronchoscopy cause any long-term complications?"
        ],
        "knowledge": "Asthma Asthma  In 2010 the death rate was 170 per million for males and 90 per million for females. Rates vary between countries by 100 fold. Globally it causes moderate or severe disability in 19. 4 million people as of 2004 . Of asthma diagnosed during childhood, half of cases will no longer carry the diagnosis after a decade.Airway remodeling is observed, but it is unknown whether these represent harmful or beneficial changes. Early treatment with corticosteroids seems to prevent or ameliorates a decline in lung function Asthma Asthma",
        "response": "There is a small risk of complications from bronchoscopy, such as bleeding or infection, but these are usually rare and treatable. Your doctor will discuss any potential risks with you before the procedure."
    },
    {
        "dialog": [
            "Hello Medi, I have been coughing for a week now.",
            "Hi patient, can you describe the cough? Is it dry or does it produce mucus?",
            "It's been dry for the most part.",
            "Have you had any other symptoms?",
            "I've had a bit of a sore throat and a runny nose.",
            "Based on your symptoms, it sounds like you might have a viral infection.",
            "What can I do to feel better?",
            "Make sure to get plenty of rest and drink plenty of fluids. Over the counter cough medicine may help too.",
            "Thanks for your help Medi, I appreciate it. "
        ],
        "knowledge": "Cough Cough  A cough is a sudden expulsion of air from the lungs that clears the airway of foreign matter.  A dry cough is a type of cough that does not produce any sputum or phlegm.  It can be caused by upper respiratory infections, allergies, asthma, or environmental irritants.  A sore throat is a common symptom of a viral illness, as are runny nose and coughing.  For most people, a cough and other symptoms of a viral infection will resolve on their own within a week or two. Cough Cough",
        "response": "You're welcome. If you have any more questions, feel free to ask."
    },
    {
        "dialog": [
            "Hello Medi, I have been diagnosed with asthma. What should I do?",
            "Hi patient, asthma can be managed with the right treatment and lifestyle changes.",
            "What kind of treatments are available?",
            "There are various medications that can help manage asthma symptoms, such as inhaled corticosteroids and bronchodilators.",
            "Are there any lifestyle changes I should make?",
            "Avoiding triggers like smoke or pollen, exercising regularly, and maintaining a healthy weight can all help manage asthma.",
            "How often should I see a doctor?",
            "You should see your doctor regularly to monitor your symptoms and adjust your treatment as necessary.",
            "Thanks Medi, I appreciate the advice."
        ],
        "knowledge": "Asthma Asthma  Asthma is a chronic disease that affects the airways in the lungs.  It is characterized by inflammation and narrowing of the airways, resulting in symptoms such as wheezing, coughing, and shortness of breath.  Asthma can be managed with the right treatment and lifestyle changes.  Medications such as inhaled corticosteroids and bronchodilators can help manage asthma symptoms.  Lifestyle changes such as avoiding triggers like smoke or pollen, exercising regularly, and maintaining a healthy weight can also help manage asthma. Asthma Asthma",
        "response": "You're welcome. Remember to always follow your doctor's advice and take your medication as prescribed."
    },
    {
        "dialog": [
            "Hello Medi, I recently had a lung biopsy. What should I do to recover?",
            "Hi patient, recovering from a lung biopsy can take some time, but there are things you can do to help speed up the process.",
            "What can I do?",
            "It's important to rest and avoid strenuous activity for a few days after the biopsy. You may also need to avoid certain medications, like blood thinners, for a period of time.",
            "What about my diet?",
            "A healthy diet can help support your body's healing process. Make sure to eat plenty of fruits and vegetables, and avoid processed foods.",
            "Are there any exercises I can do?",
            "Breathing exercises can help improve your lung function and reduce the risk of complications. Your doctor can recommend specific exercises to you.",
            "Thank you Medi, I appreciate the advice."
        ],
        "knowledge": "Lung Biopsy Lung Biopsy  A lung biopsy is a medical procedure in which a small sample of lung tissue is removed for examination.  Recovery from a lung biopsy can take several days to a few weeks, depending on the type of biopsy.  After the biopsy, it's important to rest and avoid strenuous activity for a few days.  You may also need to avoid certain medications, like blood thinners, for a period of time.  A healthy diet can help support your body's healing process, and breathing exercises can help improve your lung function and reduce the risk of complications. Lung Biopsy Lung Biopsy",
        "response": "You're welcome. If you have any concerns or notice any unusual symptoms during your recovery, be sure to contact your doctor."
    },
    {
        "dialog": [
            "Hi Medi, I have trouble breathing and a wheezing sound",
            "Hi, it seems you may have symptoms of asthma",
            "What is asthma?",
            "Asthma is a chronic respiratory disease that causes inflammation and narrowing of the airways, making it difficult to breathe.",
            "How do I manage it?",
            "It can be managed by avoiding triggers, taking medication, and regular check up with a doctor",
            "What are some triggers to avoid?",
            "Common triggers are air pollution, pollen, pet dander, and exercise. Talk to your doctor for personalized advice",
            "Thanks for your help. Do you have any resources for more information?"
        ],
        "knowledge": "Asthma Asthma In 2010 the death rate was 170 per million for males and 90 per million for females.  Rates vary between countries by 100 fold. Globally it causes moderate or severe disability in 19. 4 million people as of 2004 .  Of asthma diagnosed during childhood, half of cases will no longer carry the diagnosis after a decade.  Airway remodeling is observed, but it is unknown whether these represent harmful or beneficial changes.  Early treatment with corticosteroids seems to prevent or ameliorates a decline in lung function Asthma Asthma",
        "response": "Yes, you can go to the American Lung Association website for more information about asthma"
    },
    {
        "dialog": [
            "Hi Medi, I have a question about asthma",
            "Sure, what's your question?",
            "Can asthma be cured?",
            "No, there is no cure for asthma, but it can be managed with medication and lifestyle changes",
            "What medication can help?",
            "There are various types of medication such as inhalers, nebulizers, and corticosteroids. Talk to your doctor for personalized advice",
            "What lifestyle changes can help?",
            "Lifestyle changes such as avoiding triggers, maintaining a healthy weight, and regular exercise can help manage asthma",
            "Thanks, one more question. Can asthma be hereditary?"
        ],
        "knowledge": "Asthma Asthma In 2010 the death rate was 170 per million for males and 90 per million for females.  Rates vary between countries by 100 fold. Globally it causes moderate or severe disability in 19. 4 million people as of 2004 .  Of asthma diagnosed during childhood, half of cases will no longer carry the diagnosis after a decade.  Airway remodeling is observed, but it is unknown whether these represent harmful or beneficial changes.  Early treatment with corticosteroids seems to prevent or ameliorates a decline in lung function Asthma Asthma",
        "response": "Yes, asthma can be hereditary. If you have a family history of asthma, you are more likely to develop asthma"
    },
    {
        "dialog": [
            "Hi Medi, I've just been diagnosed with asthma and had to do a spirometry test",
            "Hi, what would you like to know about your diagnosis and test?",
            "What does the spirometry test measure?",
            "The spirometry test measures how much air you can inhale and exhale, and how quickly you can exhale",
            "What does the diagnosis of asthma mean for me?",
            "It means that you have a chronic respiratory disease that causes inflammation and narrowing of the airways. But, with proper management, you can live a normal life.",
            "What kind of medications will I need?",
            "Your doctor may prescribe medication such as inhalers, nebulizers, and corticosteroids based on the severity of your asthma. It's important to work with your doctor to find the best treatment plan for you.",
            "Thank you. What kind of lifestyle changes should I make?"
        ],
        "knowledge": "Asthma Asthma In 2010 the death rate was 170 per million for males and 90 per million for females.  Rates vary between countries by 100 fold. Globally it causes moderate or severe disability in 19. 4 million people as of 2004 .  Of asthma diagnosed during childhood, half of cases will no longer carry the diagnosis after a decade.  Airway remodeling is observed, but it is unknown whether these represent harmful or beneficial changes.  Early treatment with corticosteroids seems to prevent or ameliorates a decline in lung function Asthma Asthma",
        "response": "Lifestyle changes such as avoiding triggers, maintaining a healthy weight, and regular exercise can help manage asthma. Talk to your doctor for personalized advice."
    },
    {
        "dialog": [
            "Hi Medi, I am having trouble breathing.",
            "I'm sorry to hear that. Can you give me more details about your condition?",
            "It feels like there's a heavy weight on my chest and I'm wheezing.",
            "Based on your symptoms, it sounds like you may have asthma. Have you been previously diagnosed with it?",
            "No, I haven't. What should I do now?",
            "It's important to see a doctor for a proper diagnosis and treatment plan. In the meantime, avoid triggers like smoke and dust to prevent worsening of symptoms.",
            "Is there anything else I can do to help relieve my symptoms?",
            "Try using a bronchodilator inhaler if you have one, and avoid strenuous activities. Rest and drink plenty of fluids.",
            "Thanks for your advice. What are some long-term treatments for asthma?"
        ],
        "knowledge": "Asthma Asthma  In 2010 the death rate was 170 per million for males and 90 per million for females.  Rates vary between countries by 100 fold. Globally it causes moderate or severe disability in 19. 4 million people as of 2004 .  Of asthma diagnosed during childhood, half of cases will no longer carry the diagnosis after a decade.  Airway remodeling is observed, but it is unknown whether these represent harmful or beneficial changes.  Early treatment with corticosteroids seems to prevent or ameliorates a decline in lung function Asthma Asthma",
        "response": "Some long-term treatments for asthma are inhaled corticosteroids, leukotriene modifiers, and bronchodilators."
    },
    {
        "dialog": [
            "Hello Medi, what exactly is asthma?",
            "Hi there. Asthma is a chronic respiratory disease that causes narrowing of the airways and difficulty breathing.",
            "What causes asthma?",
            "The exact causes of asthma are unknown, but it is believed to be a combination of genetic and environmental factors.",
            "Is asthma curable?",
            "There is no cure for asthma, but with proper management and treatment, it can be kept under control and symptoms can be minimized.",
            "What kind of treatments are available for asthma?",
            "There are various treatments available for asthma such as inhaled corticosteroids, bronchodilator inhalers, and leukotriene modifiers.",
            "Thank you for the information. Is it okay to exercise if I have asthma?"
        ],
        "knowledge": "Asthma Asthma  In 2010 the death rate was 170 per million for males and 90 per million for females.  Rates vary between countries by 100 fold. Globally it causes moderate or severe disability in 19. 4 million people as of 2004 .  Of asthma diagnosed during childhood, half of cases will no longer carry the diagnosis after a decade.  Airway remodeling is observed, but it is unknown whether these represent harmful or beneficial changes.  Early treatment with corticosteroids seems to prevent or ameliorates a decline in lung function Asthma Asthma",
        "response": "Yes, it's safe to exercise with asthma. Just be sure to talk to your doctor about the appropriate level of activity and take your medication as prescribed."
    },
    {
        "dialog": [
            "Hi Medi, I recently underwent a bronchial thermoplasty. What should I do now?",
            "After a bronchial thermoplasty, it's important to take it easy for a few days and avoid any strenuous activity.",
            "What kind of diet should I follow after the procedure?",
            "It's important to eat a healthy and balanced diet to help with the healing process. Avoid foods that are high in fat and sugar, and try to eat more lean proteins and vegetables.",
            "Can I go back to work immediately?",
            "It's best to take a few days off work to rest and recover before returning to work. Be sure to follow your doctor's instructions.",
            "What kind of physical activity should I avoid?",
            "For the first few days after the procedure, you should avoid any strenuous activity. After that, gradually increase your activity level as tolerated.",
            "Thank you for the advice. Should I expect any long-term effects after the procedure?"
        ],
        "knowledge": "Asthma Asthma  In 2010 the death rate was 170 per million for males and 90 per million for females.  Rates vary between countries by 100 fold. Globally it causes moderate or severe disability in 19. 4 million people as of 2004 .  Of asthma diagnosed during childhood, half of cases will no longer carry the diagnosis after a decade.  Airway remodeling is observed, but it is unknown whether these represent harmful or beneficial changes.  Early treatment with corticosteroids seems to prevent or ameliorates a decline in lung function Asthma Asthma",
        "response": "Bronchial thermoplasty can have long-term effects such as improved asthma control and quality of life."
    },
    {
        "dialog": [
            "Hello Medi, I am feeling shortness of breath and wheezing.",
            "I am here to help, can you give me more details about your condition?",
            "I have been experiencing these symptoms for a few days now.",
            "Based on your symptoms, it sounds like you may have asthma.",
            "What can I do to manage asthma symptoms?",
            "Taking your prescribed medication regularly and avoiding triggers, such as allergens or irritants, can help manage your symptoms.",
            "I see, what kind of medication is used to treat asthma?",
            "There are different types of medications, including inhaled corticosteroids, bronchodilators, and leukotriene modifiers.",
            "Thank you for the information Medi. How can I avoid triggers? "
        ],
        "knowledge": "Asthma Asthma  In 2010 the death rate was 170 per million for males and 90 per million for females.  Rates vary between countries by 100 fold. Globally it causes moderate or severe disability in 19. 4 million people as of 2004 .  Of asthma diagnosed during childhood, half of cases will no longer carry the diagnosis after a decade.  Airway remodeling is observed, but it is unknown whether these represent harmful or beneficial changes.  Early treatment with corticosteroids seems to prevent or ameliorates a decline in lung function Asthma Asthma",
        "response": "You can avoid triggers by staying indoors during high pollen counts, keeping your home clean, and avoiding tobacco smoke."
    },
    {
        "dialog": [
            "Hi Medi, I have a question about asthma.",
            "Of course, what is your question?",
            "What is the effect of airway remodeling on asthma patients?",
            "Airway remodeling is observed in asthma patients and it is currently unknown whether these represent harmful or beneficial changes.",
            "That's interesting. How long does asthma usually last?",
            "Asthma is a chronic condition with no cure, but it can be managed with proper treatment.",
            "So, can asthma go away on its own?",
            "Of asthma diagnosed during childhood, half of cases will no longer carry the diagnosis after a decade.",
            "Thanks for the information, Medi. Is asthma more common in males or females?"
        ],
        "knowledge": "Asthma Asthma  In 2010 the death rate was 170 per million for males and 90 per million for females.  Rates vary between countries by 100 fold. Globally it causes moderate or severe disability in 19. 4 million people as of 2004 .  Of asthma diagnosed during childhood, half of cases will no longer carry the diagnosis after a decade.  Airway remodeling is observed, but it is unknown whether these represent harmful or beneficial changes.  Early treatment with corticosteroids seems to prevent or ameliorates a decline in lung function Asthma Asthma",
        "response": "In 2010, the death rate was higher for males than for females, with 170 per million for males and 90 per million for females."
    },
    {
        "dialog": [
            "Hello Medi, I just had a medical procedure for my asthma and need advice.",
            "Sure thing, what can I help you with?",
            "I want to know if there are any lifestyle changes I can make to manage my asthma.",
            "Yes, there are lifestyle changes that can help manage asthma, such as avoiding triggers and exercising regularly.",
            "Can you give me more information on exercising with asthma?",
            "Exercising with asthma can be done safely as long as you take your medication before exercising and warm up properly.",
            "I see. What kind of diet should I follow to help manage my asthma?",
            "A healthy diet rich in fruits, vegetables, and omega-3 fatty acids can help manage asthma symptoms.",
            "Thanks for the information, Medi. Are there any foods I should avoid?"
        ],
        "knowledge": "Asthma Asthma  In 2010 the death rate was 170 per million for males and 90 per million for females.  Rates vary between countries by 100 fold. Globally it causes moderate or severe disability in 19. 4 million people as of 2004 .  Of asthma diagnosed during childhood, half of cases will no longer carry the diagnosis after a decade.  Airway remodeling is observed, but it is unknown whether these represent harmful or beneficial changes.  Early treatment with corticosteroids seems to prevent or ameliorates a decline in lung function Asthma Asthma",
        "response": "It's generally recommended to avoid foods that can trigger asthma symptoms, such as processed foods, sugar, and alcohol."
    },
    {
        "dialog": [
            "Hi Medi, I'm having trouble breathing and coughing",
            "Sorry to hear that. Have you had these symptoms for a long time?",
            "I've been feeling this way for a week now",
            "Based on your symptoms, it's possible that you have asthma. Do you have a history of the disease?",
            "Yeah, I was diagnosed with asthma when I was a child",
            "I see. It's important to take your prescribed medication and avoid triggers like smoke and dust",
            "Is there anything else I can do to manage my asthma?",
            "Regular exercise and a healthy diet are recommended. Also, avoid extreme weather and wear a mask if necessary",
            "Thanks for your advice, Medi! How often should I get my inhaler refilled?"
        ],
        "knowledge": "Asthma Asthma In 2010 the death rate was 170 per million for males and 90 per million for females.  Rates vary between countries by 100 fold. Globally it causes moderate or severe disability in 19. 4 million people as of 2004 .  Of asthma diagnosed during childhood, half of cases will no longer carry the diagnosis after a decade.  Airway remodeling is observed, but it is unknown whether these represent harmful or beneficial changes.  Early treatment with corticosteroids seems to prevent or ameliorates a decline in lung function Asthma Asthma",
        "response": "You should refill your inhaler whenever it runs out or as directed by your doctor"
    },
    {
        "dialog": [
            "Hi Medi, I'm curious about asthma. What is it exactly?",
            "Hi! Asthma is a chronic respiratory disease characterized by inflammation and narrowing of the airways",
            "What are the symptoms of asthma?",
            "Symptoms include wheezing, coughing, shortness of breath, and chest tightness",
            "How is asthma diagnosed?",
            "A doctor will evaluate your symptoms and perform lung function tests to diagnose asthma",
            "Is there a cure for asthma?",
            "Unfortunately, there is no cure for asthma. But it can be managed with proper medication and lifestyle changes",
            "Thanks for clarifying, Medi. What kind of lifestyle changes can help with asthma?"
        ],
        "knowledge": "Asthma Asthma In 2010 the death rate was 170 per million for males and 90 per million for females.  Rates vary between countries by 100 fold. Globally it causes moderate or severe disability in 19. 4 million people as of 2004 .  Of asthma diagnosed during childhood, half of cases will no longer carry the diagnosis after a decade.  Airway remodeling is observed, but it is unknown whether these represent harmful or beneficial changes.  Early treatment with corticosteroids seems to prevent or ameliorates a decline in lung function Asthma Asthma",
        "response": "Regular exercise and a balanced diet can help control asthma symptoms and reduce the risk of attacks"
    },
    {
        "dialog": [
            "Hi Medi, I just underwent a lung transplant. What should I do now?",
            "Congratulations on the successful transplant! It's important to take care of yourself after the surgery",
            "What kind of physical activity can I do after the surgery?",
            "You should consult your doctor for a personalized exercise plan, but light exercise like walking is usually recommended",
            "How should I take my medication?",
            "It's important to take your medication as prescribed by your doctor and follow the instructions carefully",
            "What should I eat to maintain my health?",
            "Eating a well-balanced diet with plenty of fruits and vegetables is recommended. Avoiding food and drinks that may interact with your medication is also important",
            "Thanks for your advice, Medi. How often should I get a check-up?"
        ],
        "knowledge": "Asthma Asthma In 2010 the death rate was 170 per million for males and 90 per million for females.  Rates vary between countries by 100 fold. Globally it causes moderate or severe disability in 19. 4 million people as of 2004 .  Of asthma diagnosed during childhood, half of cases will no longer carry the diagnosis after a decade.  Airway remodeling is observed, but it is unknown whether these represent harmful or beneficial changes.  Early treatment with corticosteroids seems to prevent or ameliorates a decline in lung function Asthma Asthma",
        "response": "Your doctor will let you know when you need to come in for check-ups. It's usually recommended to have regular follow-ups after a lung transplant"
    }
]