[
    {
        "dialog": [
            "Hello Medi, could you help me with my symptoms?",
            "Of course, let's start with your symptoms.",
            "I am experiencing fatigue and have difficulty maintaining my blood sugar levels.",
            "Based on your symptoms, it is possible that you have diabetes. I recommend consulting with a doctor.",
            "What can I do to manage my blood sugar levels until then?",
            "You can make some lifestyle changes such as reducing your carbohydrate intake and increasing physical activity.",
            "Should I be worried about complications?",
            "If you maintain tight glucose control, you can reduce the risk of complications such as kidney and eye problems.",
            "What are the warning signs of hypoglycemia? "
        ],
        "knowledge": "Diabetes Diabetes  According to the ADA, 'reducing overall carbohydrate intake for individuals with diabetes has demonstrated the most evidence for improving glycemia', and for individuals with type 2 diabetes who cannot meet the glycemic targets or where reducing anti-glycemic medications is a priority, low or very-low carbohydrate diets are a viable approach.  For overweight people with type 2 diabetes, any diet that achieves weight loss is effective. Most medications used to treat diabetes act by lowering blood sugar levels through different mechanisms.  There is broad consensus that when people with diabetes maintain tight glucose control – keeping the glucose levels in their blood within normal ranges – they experience fewer complications, such as kidney problems or eye problems.  There is however debate as to whether this is appropriate and cost effective for people later in life in whom the risk of hypoglycemia may be more significant Diabetes Diabetes",
        "response": "Symptoms of hypoglycemia include dizziness, confusion, sweating, and shakiness."
    },
    {
        "dialog": [
            "Hi Medi, I have some questions about diabetes",
            "Of course, what questions do you have?",
            "Can diabetes be prevented?",
            "Yes, making lifestyle changes such as exercising regularly and maintaining a healthy diet can lower your risk of developing diabetes",
            "What are some common complications of diabetes?",
            "Complications of diabetes include kidney damage, nerve damage, and eye problems",
            "Are non-nutritive sweeteners a good alternative to sugar for people with diabetes?",
            "A 2020 Cochrane review showed unclear evidence for the effects of non-nutritive sweeteners on glycemic control.",
            "How can I manage my blood sugar levels?"
        ],
        "knowledge": "Diabetes Diabetes  According to the ADA, 'reducing overall carbohydrate intake for individuals with diabetes has demonstrated the most evidence for improving glycemia', and for individuals with type 2 diabetes who cannot meet the glycemic targets or where reducing anti-glycemic medications is a priority, low or very-low carbohydrate diets are a viable approach.  For overweight people with type 2 diabetes, any diet that achieves weight loss is effective. A 2020 Cochrane systematic review compared several non-nutritive sweeteners to sugar, placebo and a nutritive low-calorie sweetener , but the results were unclear for effects on HbA1c, body weight and adverse events.  The studies included were mainly of very low-certainty and did not report on health-related quality of life, diabetes complications, all-cause mortality or socioeconomic effects. Most medications used to treat diabetes act by lowering blood sugar levels through different mechanisms.  There is broad consensus that when people with diabetes maintain tight glucose control – keeping the glucose levels in their blood within normal ranges – they experience fewer complications, such as kidney problems or eye problems.  There is however debate as to whether this is appropriate and cost effective for people later in life in whom the risk of hypoglycemia may be more significant Diabetes Diabetes",
        "response": "Non-nutritive sweeteners may not be the best alternative and lifestyle changes such as limiting carbohydrate intake and increasing physical activity can help manage blood sugar levels."
    },
    {
        "dialog": [
            "Hi Medi, I recently underwent a medical procedure. What should I do now?",
            "What is the procedure you underwent?",
            "I had a surgery to remove a tumor.",
            "In that case, it is important to rest and follow the instructions given by your doctor.",
            "I am concerned about my diet and physical activity.",
            "You should follow a balanced diet that includes plenty of vegetables and whole grains. You can also start with low-intensity physical activities, such as walking, and gradually increase the intensity.",
            "What about my medication?",
            "You should take your medication as prescribed by your doctor. If you experience any side effects, you should inform your doctor as soon as possible.",
            "How long will it take to recover?"
        ],
        "knowledge": "Diabetes Diabetes  According to the ADA, 'reducing overall carbohydrate intake for individuals with diabetes has demonstrated the most evidence for improving glycemia', and for individuals with type 2 diabetes who cannot meet the glycemic targets or where reducing anti-glycemic medications is a priority, low or very-low carbohydrate diets are a viable approach.  For overweight people with type 2 diabetes, any diet that achieves weight loss is effective. Most medications used to treat diabetes act by lowering blood sugar levels through different mechanisms.  There is broad consensus that when people with diabetes maintain tight glucose control – keeping the glucose levels in their blood within normal ranges – they experience fewer complications, such as kidney problems or eye problems.  There is however debate as to whether this is appropriate and cost effective for people later in life in whom the risk of hypoglycemia may be more significant Diabetes Diabetes",
        "response": "Recovery time varies depending on the type of surgery and your health condition. Please consult your doctor for more details."
    },
    {
        "dialog": [
            "Hi Medi, I think I might have diabetes",
            "What makes you say that? Can you tell me your symptoms?",
            "I feel thirsty all the time, hungry even after I have eaten, frequently needing to pee, and I am tired all the time",
            "Based on your symptoms, you might have diabetes, but it is best to consult with a doctor for confirmation",
            "What can I do to manage diabetes?",
            "Lifestyle changes such as eating a healthy diet, exercising regularly, and monitoring your blood sugar levels are essential for managing diabetes",
            "Can I eat sugar with diabetes?",
            "You should limit your sugar intake and opt for natural sweeteners like stevia instead.",
            "Got it, thank you Medi!"
        ],
        "knowledge": "Diabetes Diabetes  According to the ADA, \"reducing overall carbohydrate intake for individuals with diabetes has demonstrated the most evidence for improving glycemia\", and for individuals with type 2 diabetes who cannot meet the glycemic targets or where reducing anti-glycemic medications is a priority, low or very-low carbohydrate diets are a viable approach.  For overweight people with type 2 diabetes, any diet that achieves weight loss is effective. A 2020 Cochrane systematic review compared several non-nutritive sweeteners to sugar, placebo and a nutritive low-calorie sweetener , but the results were unclear for effects on HbA1c, body weight and adverse events.  The studies included were mainly of very low-certainty and did not report on health-related quality of life, diabetes complications, all-cause mortality or socioeconomic effects. Most medications used to treat diabetes act by lowering blood sugar levels through different mechanisms.  There is broad consensus that when people with diabetes maintain tight glucose control – keeping the glucose levels in their blood within normal ranges – they experience fewer complications, such as kidney problems or eye problems.  There is however debate as to whether this is appropriate and cost effective for people later in life in whom the risk of hypoglycemia may be more significant Diabetes Diabetes",
        "response": "You're welcome, take care!"
    },
    {
        "dialog": [
            "Hi Medi, I have type 2 diabetes and I'm struggling to maintain a healthy diet",
            "I am here to help! What are your current eating habits?",
            "I tend to eat a lot of carbs, and I have a sweet tooth. I also don't always have time to cook healthy meals",
            "You should try to incorporate more protein and fiber into your diet and limit your carbohydrate intake. As for your sweet tooth, try natural sweeteners like stevia or fruit",
            "What are some quick and easy meal options that are diabetes-friendly?",
            "Some quick options could be a salad with grilled chicken, a veggie omelette with whole-grain toast, or a stir-fry with lean protein and lots of veggies.",
            "Thanks Medi, I'll give those a try!",
            "You're welcome! Also, make sure to monitor your blood sugar levels regularly and follow your doctor's advice",
            "Will do, thanks again!"
        ],
        "knowledge": "Diabetes Diabetes  According to the ADA, \"reducing overall carbohydrate intake for individuals with diabetes has demonstrated the most evidence for improving glycemia\", and for individuals with type 2 diabetes who cannot meet the glycemic targets or where reducing anti-glycemic medications is a priority, low or very-low carbohydrate diets are a viable approach.  For overweight people with type 2 diabetes, any diet that achieves weight loss is effective. A 2020 Cochrane systematic review compared several non-nutritive sweeteners to sugar, placebo and a nutritive low-calorie sweetener , but the results were unclear for effects on HbA1c, body weight and adverse events.  The studies included were mainly of very low-certainty and did not report on health-related quality of life, diabetes complications, all-cause mortality or socioeconomic effects. Most medications used to treat diabetes act by lowering blood sugar levels through different mechanisms.  There is broad consensus that when people with diabetes maintain tight glucose control – keeping the glucose levels in their blood within normal ranges – they experience fewer complications, such as kidney problems or eye problems.  There is however debate as to whether this is appropriate and cost effective for people later in life in whom the risk of hypoglycemia may be more significant Diabetes Diabetes",
        "response": "You're welcome, take care!"
    },
    {
        "dialog": [
            "Hi Medi, I recently had a medical procedure for my diabetes and I'm not sure what to do next",
            "I can help! What was the procedure you had?",
            "I had a pancreas transplant",
            "After a pancreas transplant, it is important to take immunosuppressant medications to prevent rejection of the transplant. You should also monitor your blood sugar levels regularly and follow your doctor's instructions closely",
            "I'm concerned about the risks of the immunosuppressant medications",
            "While there are risks associated with immunosuppressant medications, they are necessary to prevent rejection of the transplant. Your doctor will monitor you closely and adjust your medications as needed",
            "What lifestyle changes should I make after the transplant?",
            "You should continue to eat a healthy diet, exercise regularly, and monitor your blood sugar levels. You should also avoid smoking and limit your alcohol intake",
            "Great, thank you for the advice Medi!"
        ],
        "knowledge": "Diabetes Diabetes  According to the ADA, \"reducing overall carbohydrate intake for individuals with diabetes has demonstrated the most evidence for improving glycemia\", and for individuals with type 2 diabetes who cannot meet the glycemic targets or where reducing anti-glycemic medications is a priority, low or very-low carbohydrate diets are a viable approach.  For overweight people with type 2 diabetes, any diet that achieves weight loss is effective. A 2020 Cochrane systematic review compared several non-nutritive sweeteners to sugar, placebo and a nutritive low-calorie sweetener , but the results were unclear for effects on HbA1c, body weight and adverse events.  The studies included were mainly of very low-certainty and did not report on health-related quality of life, diabetes complications, all-cause mortality or socioeconomic effects. Most medications used to treat diabetes act by lowering blood sugar levels through different mechanisms.  There is broad consensus that when people with diabetes maintain tight glucose control – keeping the glucose levels in their blood within normal ranges – they experience fewer complications, such as kidney problems or eye problems.  There is however debate as to whether this is appropriate and cost effective for people later in life in whom the risk of hypoglycemia may be more significant Diabetes Diabetes",
        "response": "You're welcome, take care!"
    },
    {
        "dialog": [
            "Hello Medi, I have a problem with my diabetes",
            "I'm here to help. Can you please tell me your symptoms?",
            "I have been feeling dizzy and tired even though I've been taking my medications",
            "Have you been monitoring your blood sugar?",
            "Yes, and it's been consistently high",
            "I suggest you increase your physical activity and make changes to your diet",
            "What kind of changes should I make to my diet?",
            "Try to reduce your overall carbohydrate intake and focus on low or very-low carbohydrate diets",
            "Got it. Thank you Medi."
        ],
        "knowledge": "Diabetes Diabetes  According to the ADA, 'reducing overall carbohydrate intake for individuals with diabetes has demonstrated the most evidence for improving glycemia', and for individuals with type 2 diabetes who cannot meet the glycemic targets or where reducing anti-glycemic medications is a priority, low or very-low carbohydrate diets are a viable approach.  For overweight people with type 2 diabetes, any diet that achieves weight loss is effective. A 2020 Cochrane systematic review compared several non-nutritive sweeteners to sugar, placebo and a nutritive low-calorie sweetener , but the results were unclear for effects on HbA1c, body weight and adverse events.  The studies included were mainly of very low-certainty and did not report on health-related quality of life, diabetes complications, all-cause mortality or socioeconomic effects. Most medications used to treat diabetes act by lowering blood sugar levels through different mechanisms.  There is broad consensus that when people with diabetes maintain tight glucose control – keeping the glucose levels in their blood within normal ranges – they experience fewer complications, such as kidney problems or eye problems.  There is however debate as to whether this is appropriate and cost effective for people later in life in whom the risk of hypoglycemia may be more significant Diabetes Diabetes",
        "response": "You're welcome. Remember to reduce your overall carbohydrate intake and focus on low or very-low carbohydrate diets. Let me know if you have any other questions."
    },
    {
        "dialog": [
            "Hello Medi, I have a question about diabetes type 2",
            "Sure, what would you like to know?",
            "How can we prevent type 2 diabetes?",
            "The best way to prevent type 2 diabetes is to maintain a healthy weight and engage in regular physical activity",
            "What are some other ways to prevent type 2 diabetes?",
            "If you have a family history of type 2 diabetes, you should be mindful of your risk and get regular checkups. You should also focus on eating a healthy diet and avoiding sugary drinks",
            "Are there any early warning signs of type 2 diabetes?",
            "Yes, early signs include increased thirst, increased hunger, and frequent urination",
            "Got it. Thank you Medi."
        ],
        "knowledge": "Diabetes Diabetes  The defective responsiveness of body tissues to insulin is believed to involve the insulin receptor.  However, the specific defects are not known.  Diabetes mellitus cases due to a known defect are classified separately.  Type 2 diabetes is the most common type of diabetes mellitus accounting for 95% of diabetes.  Many people with type 2 diabetes have evidence of prediabetes  before meeting the criteria for type 2 diabetes.  The progression of prediabetes to overt type 2 diabetes can be slowed or reversed by lifestyle changes or medications that improve insulin sensitivity or reduce the liver's glucose production. Type 2 diabetes is primarily due to lifestyle factors and genetics Diabetes Diabetes",
        "response": "You're welcome. Remember to maintain a healthy weight, engage in regular physical activity, and be mindful of any early warning signs such as increased thirst, increased hunger, and frequent urination. Let me know if you have any other questions."
    },
    {
        "dialog": [
            "Hello Medi, I just underwent a medical procedure. Can you give me some advice on my lifestyle?",
            "Of course, what kind of procedure did you undergo?",
            "I had a procedure to address my diabetes",
            "After your procedure, it's important to maintain a healthy lifestyle. This includes regular exercise and healthy eating habits",
            "What kind of diet should I follow?",
            "A low-carbohydrate diet is often recommended for individuals with diabetes. You should also focus on eating plenty of fruits and vegetables",
            "Are there any other lifestyle changes I should make?",
            "Try to limit your alcohol consumption and stop smoking if you are a smoker. It's also important to monitor your blood sugar levels regularly",
            "Got it. Thank you Medi."
        ],
        "knowledge": "Diabetes Diabetes  According to the ADA, 'reducing overall carbohydrate intake for individuals with diabetes has demonstrated the most evidence for improving glycemia', and for individuals with type 2 diabetes who cannot meet the glycemic targets or where reducing anti-glycemic medications is a priority, low or very-low carbohydrate diets are a viable approach.  For overweight people with type 2 diabetes, any diet that achieves weight loss is effective. A 2020 Cochrane systematic review compared several non-nutritive sweeteners to sugar, placebo and a nutritive low-calorie sweetener , but the results were unclear for effects on HbA1c, body weight and adverse events.  The studies included were mainly of very low-certainty and did not report on health-related quality of life, diabetes complications, all-cause mortality or socioeconomic effects. Most medications used to treat diabetes act by lowering blood sugar levels through different mechanisms.  There is broad consensus that when people with diabetes maintain tight glucose control – keeping the glucose levels in their blood within normal ranges – they experience fewer complications, such as kidney problems or eye problems.  There is however debate as to whether this is appropriate and cost effective for people later in life in whom the risk of hypoglycemia may be more significant Diabetes Diabetes",
        "response": "You're welcome. Remember to maintain a healthy lifestyle, including regular exercise, healthy eating habits, and monitoring your blood sugar levels regularly. Let me know if you have any other questions."
    },
    {
        "dialog": [
            "Hello Medi, what is the best diet for type 2 diabetes?",
            "For overweight people with type 2 diabetes, any diet that achieves weight loss is effective. ",
            "What about carbohydrate intake? Is it important?",
            "Reducing overall carbohydrate intake for individuals with diabetes has demonstrated evidence for improving glycemia",
            "Should I take medications?",
            "Most medications used to treat diabetes act by lowering blood sugar levels through different mechanisms.",
            "What is the best approach for individuals who cannot meet the glycemic targets?",
            "Low or very-low carbohydrate diets are a viable approach for individuals with type 2 diabetes who cannot meet the glycemic targets",
            "Is there any side effect or risk of hypoglycemia ?"
        ],
        "knowledge": "Diabetes Diabetes According to the ADA, 'reducing overall carbohydrate intake for individuals with diabetes has demonstrated the most evidence for improving glycemia', and for individuals with type 2 diabetes who cannot meet the glycemic targets or where reducing anti-glycemic medications is a priority, low or very-low carbohydrate diets are a viable approach.  For overweight people with type 2 diabetes, any diet that achieves weight loss is effective. Most medications used to treat diabetes act by lowering blood sugar levels through different mechanisms.  There is however debate as to whether this is appropriate and cost effective for people later in life in whom the risk of hypoglycemia may be more significant Diabetes Diabetes",
        "response": "Yes, the risk of hypoglycemia may be more significant, especially for people later in life, as there is debate whether tight glucose control is appropriate and cost effective for these individuals."
    },
    {
        "dialog": [
            "Hi Medi, can you tell me more about non-nutritive sweeteners for diabetes?",
            "A 2020 Cochrane systematic review compared several non-nutritive sweeteners to sugar, placebo and a nutritive low-calorie sweetener",
            "What were the results of the Cochrane review?",
            "The results were unclear for effects on HbA1c, body weight and adverse events. ",
            "Were there any limitations to the studies included in the review?",
            "The studies included were mainly of very low-certainty and did not report on health-related quality of life, diabetes complications, all-cause mortality or socioeconomic effects. ",
            "What can you say about diabetes complications?",
            "When people with diabetes maintain tight glucose control, they experience fewer complications, such as kidney problems or eye problems. ",
            "Is it necessary for everyone with diabetes to maintain tight glucose control? "
        ],
        "knowledge": "Diabetes Diabetes A 2020 Cochrane systematic review compared several non-nutritive sweeteners to sugar, placebo and a nutritive low-calorie sweetener, but the results were unclear for effects on HbA1c, body weight and adverse events. The studies included were mainly of very low-certainty and did not report on health-related quality of life, diabetes complications, all-cause mortality or socioeconomic effects. There is broad consensus that when people with diabetes maintain tight glucose control – keeping the glucose levels in their blood within normal ranges – they experience fewer complications, such as kidney problems or eye problems. There is however debate as to whether this is appropriate and cost effective for people later in life in whom the risk of hypoglycemia may be more significant Diabetes Diabetes",
        "response": "There is debate as to whether tight glucose control is appropriate and cost effective for people later in life in whom the risk of hypoglycemia may be more significant, but maintaining tight glucose control can reduce the risk of diabetes complications, such as kidney problems or eye problems."
    },
    {
        "dialog": [
            "Hey Medi, I am looking for advice on lifestyle and diet after a recent diabetes diagnosis",
            "We can start by modifying your lifestyle. What is your current diet like?",
            "I have been eating a lot of sugary and processed foods lately",
            "I suggest you balance your diet with more vitamins and vegetables and eat less sugar.",
            "Should I start any physical exercises?",
            "Yes, it would be helpful. Exercise can improve insulin sensitivity and help with weight loss.",
            "What can you say about medications?",
            "For individuals with type 2 diabetes who cannot meet the glycemic targets or where reducing anti-glycemic medications is a priority, low or very-low carbohydrate diets are a viable approach. ",
            "What about anti-glycemic medications?"
        ],
        "knowledge": "Diabetes Diabetes According to the ADA, 'reducing overall carbohydrate intake for individuals with diabetes has demonstrated the most evidence for improving glycemia', and for individuals with type 2 diabetes who cannot meet the glycemic targets or where reducing anti-glycemic medications is a priority, low or very-low carbohydrate diets are a viable approach. For overweight people with type 2 diabetes, any diet that achieves weight loss is effective. Most medications used to treat diabetes act by lowering blood sugar levels through different mechanisms. There is however debate as to whether this is appropriate and cost effective for people later in life in whom the risk of hypoglycemia may be more significant Diabetes Diabetes",
        "response": "You're welcome! I'm glad I could help. Do you have any more questions? "
    },
    {
        "dialog": [
            "Hello Medi, I have a symptom of diabetes. Can you help me?",
            "Sure, I can help you. What are your symptoms?",
            "I feel very thirsty all the time and always hungry, no matter how much I eat",
            "Frequent urination and feeling tired all the time are also symptoms of diabetes",
            "What should I do now?",
            "You should visit a doctor and have a blood test done to check your blood sugar levels",
            "If you are diagnosed with diabetes, you need to make some lifestyle changes",
            "Like what changes?",
            "You should eat a healthy diet and avoid foods that are high in sugar and carbohydrates."
        ],
        "knowledge": "Diabetes Diabetes  According to the ADA, 'reducing overall carbohydrate intake for individuals with diabetes has demonstrated the most evidence for improving glycemia', and for individuals with type 2 diabetes who cannot meet the glycemic targets or where reducing anti-glycemic medications is a priority, low or very-low carbohydrate diets are a viable approach.  For overweight people with type 2 diabetes, any diet that achieves weight loss is effective. A 2020 Cochrane systematic review compared several non-nutritive sweeteners to sugar, placebo and a nutritive low-calorie sweetener , but the results were unclear for effects on HbA1c, body weight and adverse events.  The studies included were mainly of very low-certainty and did not report on health-related quality of life, diabetes complications, all-cause mortality or socioeconomic effects. Most medications used to treat diabetes act by lowering blood sugar levels through different mechanisms.  There is broad consensus that when people with diabetes maintain tight glucose control – keeping the glucose levels in their blood within normal ranges – they experience fewer complications, such as kidney problems or eye problems.  There is however debate as to whether this is appropriate and cost effective for people later in life in whom the risk of hypoglycemia may be more significant Diabetes Diabetes",
        "response": "You should eat a healthy diet and avoid foods that are high in sugar and carbohydrates."
    },
    {
        "dialog": [
            "Medi, I have a question about diabetes. Can you explain it to me?",
            "Sure, what would you like to know?",
            "How can diabetes affect my eyes?",
            "Diabetes can cause damage to the blood vessels in the retina, which can lead to diabetic retinopathy",
            "What is diabetic retinopathy?",
            "It's a complication of diabetes that causes damage to the blood vessels in the retina",
            "What are the symptoms of diabetic retinopathy?",
            "Symptoms include blurry or distorted vision, floaters, and even complete vision loss in severe cases",
            "How can I prevent diabetic retinopathy?"
        ],
        "knowledge": "Diabetes Diabetes  According to the ADA, 'reducing overall carbohydrate intake for individuals with diabetes has demonstrated the most evidence for improving glycemia', and for individuals with type 2 diabetes who cannot meet the glycemic targets or where reducing anti-glycemic medications is a priority, low or very-low carbohydrate diets are a viable approach.  For overweight people with type 2 diabetes, any diet that achieves weight loss is effective. A 2020 Cochrane systematic review compared several non-nutritive sweeteners to sugar, placebo and a nutritive low-calorie sweetener , but the results were unclear for effects on HbA1c, body weight and adverse events.  The studies included were mainly of very low-certainty and did not report on health-related quality of life, diabetes complications, all-cause mortality or socioeconomic effects. Most medications used to treat diabetes act by lowering blood sugar levels through different mechanisms.  There is broad consensus that when people with diabetes maintain tight glucose control – keeping the glucose levels in their blood within normal ranges – they experience fewer complications, such as kidney problems or eye problems.  There is however debate as to whether this is appropriate and cost effective for people later in life in whom the risk of hypoglycemia may be more significant Diabetes Diabetes",
        "response": "You can prevent diabetic retinopathy by controlling your blood sugar levels and having regular eye exams"
    },
    {
        "dialog": [
            "Hello Medi, I recently had a medical procedure and need advice on my diet",
            "Sure, what medical procedure did you have?",
            "I had a surgery to remove a tumor",
            "After surgery, it's important to eat a balanced diet to help your body recover",
            "What should I eat?",
            "You should eat foods that are rich in protein, like chicken, fish, and beans",
            "You should also eat plenty of fruits and vegetables for vitamins and minerals",
            "Are there any foods I should avoid?",
            "You should avoid processed foods, high-fat foods, and foods that are high in sugar or salt"
        ],
        "knowledge": "Diabetes Diabetes  According to the ADA, 'reducing overall carbohydrate intake for individuals with diabetes has demonstrated the most evidence for improving glycemia', and for individuals with type 2 diabetes who cannot meet the glycemic targets or where reducing anti-glycemic medications is a priority, low or very-low carbohydrate diets are a viable approach.  For overweight people with type 2 diabetes, any diet that achieves weight loss is effective. A 2020 Cochrane systematic review compared several non-nutritive sweeteners to sugar, placebo and a nutritive low-calorie sweetener , but the results were unclear for effects on HbA1c, body weight and adverse events.  The studies included were mainly of very low-certainty and did not report on health-related quality of life, diabetes complications, all-cause mortality or socioeconomic effects. Most medications used to treat diabetes act by lowering blood sugar levels through different mechanisms.  There is broad consensus that when people with diabetes maintain tight glucose control – keeping the glucose levels in their blood within normal ranges – they experience fewer complications, such as kidney problems or eye problems.  There is however debate as to whether this is appropriate and cost effective for people later in life in whom the risk of hypoglycemia may be more significant Diabetes Diabetes",
        "response": "You should avoid processed foods, high-fat foods, and foods that are high in sugar or salt."
    },
    {
        "dialog": [
            "Hello Medi, I think I have diabetes. What should I do?",
            "Don't worry, let's start by checking your blood sugar and symptoms.",
            "I have been feeling extremely thirsty and tired, and my vision has become blurry.",
            "Based on your symptoms and high blood sugar levels, I suspect you have diabetes.",
            "What can I do to manage it?",
            "A low carb diet and regular exercise can help control blood sugar levels.",
            "What about medication?",
            "It depends on your condition, but there are many effective medications for diabetes management.",
            "Are there any long-term risks associated with diabetes?"
        ],
        "knowledge": "Diabetes Diabetes According to the ADA, \"reducing overall carbohydrate intake for individuals with diabetes has demonstrated the most evidence for improving glycemia\", and for individuals with type 2 diabetes who cannot meet the glycemic targets or where reducing anti-glycemic medications is a priority, low or very-low carbohydrate diets are a viable approach.  For overweight people with type 2 diabetes, any diet that achieves weight loss is effective. A 2020 Cochrane systematic review compared several non-nutritive sweeteners to sugar, placebo and a nutritive low-calorie sweetener , but the results were unclear for effects on HbA1c, body weight and adverse events.  The studies included were mainly of very low-certainty and did not report on health-related quality of life, diabetes complications, all-cause mortality or socioeconomic effects. Most medications used to treat diabetes act by lowering blood sugar levels through different mechanisms.  There is broad consensus that when people with diabetes maintain tight glucose control – keeping the glucose levels in their blood within normal ranges – they experience fewer complications, such as kidney problems or eye problems.  There is however debate as to whether this is appropriate and cost effective for people later in life in whom the risk of hypoglycemia may be more significant Diabetes Diabetes",
        "response": "Yes, if left unmanaged, diabetes can lead to complications such as kidney problems, eye problems, and nerve damage."
    },
    {
        "dialog": [
            "Hi Medi, I just got diagnosed with diabetes. What can I eat?",
            "You should focus on a diet that is low in carbohydrates and high in fiber.",
            "Can you give me an example of what I can eat?",
            "You can eat leafy greens, non-starchy vegetables, and lean protein.",
            "What about snacks?",
            "You can snack on nuts, seeds, and low-carb fruits like berries.",
            "Can I still eat sweets?",
            "In moderation, yes. There are also sugar-free alternatives you can try.",
            "What can I drink?"
        ],
        "knowledge": "Diabetes Diabetes According to the ADA, \"reducing overall carbohydrate intake for individuals with diabetes has demonstrated the most evidence for improving glycemia\", and for individuals with type 2 diabetes who cannot meet the glycemic targets or where reducing anti-glycemic medications is a priority, low or very-low carbohydrate diets are a viable approach.  For overweight people with type 2 diabetes, any diet that achieves weight loss is effective. A 2020 Cochrane systematic review compared several non-nutritive sweeteners to sugar, placebo and a nutritive low-calorie sweetener , but the results were unclear for effects on HbA1c, body weight and adverse events.  The studies included were mainly of very low-certainty and did not report on health-related quality of life, diabetes complications, all-cause mortality or socioeconomic effects. Most medications used to treat diabetes act by lowering blood sugar levels through different mechanisms.  There is broad consensus that when people with diabetes maintain tight glucose control – keeping the glucose levels in their blood within normal ranges – they experience fewer complications, such as kidney problems or eye problems.  There is however debate as to whether this is appropriate and cost effective for people later in life in whom the risk of hypoglycemia may be more significant Diabetes Diabetes",
        "response": "You're welcome. Remember to check with your doctor or dietitian for personalized advice."
    },
    {
        "dialog": [
            "Hi Medi, I recently got diagnosed with diabetes. Can you recommend some exercises?",
            "Definitely. Regular exercise can help control blood sugar levels and improve overall health.",
            "What exercises are best for diabetes?",
            "Aerobic exercises like walking, jogging, or swimming are great options.",
            "What about strength training?",
            "Yes, strength training can also be beneficial for improving insulin sensitivity.",
            "How often should I exercise?",
            "Aim for at least 30 minutes of moderate-intensity exercise most days of the week.",
            "Are there any precautions I should take?"
        ],
        "knowledge": "Diabetes Diabetes According to the ADA, \"reducing overall carbohydrate intake for individuals with diabetes has demonstrated the most evidence for improving glycemia\", and for individuals with type 2 diabetes who cannot meet the glycemic targets or where reducing anti-glycemic medications is a priority, low or very-low carbohydrate diets are a viable approach.  For overweight people with type 2 diabetes, any diet that achieves weight loss is effective. A 2020 Cochrane systematic review compared several non-nutritive sweeteners to sugar, placebo and a nutritive low-calorie sweetener , but the results were unclear for effects on HbA1c, body weight and adverse events.  The studies included were mainly of very low-certainty and did not report on health-related quality of life, diabetes complications, all-cause mortality or socioeconomic effects. Most medications used to treat diabetes act by lowering blood sugar levels through different mechanisms.  There is broad consensus that when people with diabetes maintain tight glucose control – keeping the glucose levels in their blood within normal ranges – they experience fewer complications, such as kidney problems or eye problems.  There is however debate as to whether this is appropriate and cost effective for people later in life in whom the risk of hypoglycemia may be more significant Diabetes Diabetes",
        "response": "You're welcome. Always talk to your doctor before starting a new exercise routine."
    },
    {
        "dialog": [
            "Hello Medi, I have been diagnosed with type 2 diabetes.",
            "I'm here to help. What do you need?",
            "I don't know what to eat to keep my blood sugar levels in check.",
            "You should reduce your overall carbohydrate intake, especially simple carbs.",
            "What carbs should I avoid?",
            "You should avoid white rice, bread, and pasta. Opt for whole-grain options.",
            "Are there any other foods I should avoid?",
            "You should also limit your intake of sugary foods and drinks.",
            "What about fruits?"
        ],
        "knowledge": "Diabetes Diabetes  Reducing overall carbohydrate intake for individuals with diabetes has demonstrated the most evidence for improving glycemia. Low or very-low carbohydrate diets are a viable approach for individuals with type 2 diabetes who cannot meet the glycemic targets or where reducing anti-glycemic medications is a priority. For overweight people with type 2 diabetes, any diet that achieves weight loss is effective. Diabetes Diabetes",
        "response": "You can eat fruits, but it's best to eat them in moderation and choose fruits with a lower glycemic index."
    },
    {
        "dialog": [
            "Hi Medi, I recently had a medical procedure done. What can I do to recover faster?",
            "It's best to rest and take it easy for a few days after the procedure.",
            "Are there any lifestyle changes I should make?",
            "It's important to have a healthy diet, rich in vitamins and minerals.",
            "Can you give me specific examples of what I should eat?",
            "You should eat plenty of fruits and vegetables, lean protein, and whole grains.",
            "What about physical activities?",
            "You should avoid strenuous activities and exercise for a few days.",
            "How about after a few days?"
        ],
        "knowledge": "Recovery Recovery After a medical procedure, it's important to take it easy and rest for a few days. A healthy diet rich in vitamins and minerals can aid in recovery. You should avoid strenuous activities and exercise for a few days after the procedure. Recovery Recovery",
        "response": "After a few days, you can start light activities and exercise, but make sure to listen to your body and not push yourself too hard."
    },
    {
        "dialog": [
            "Hi Medi, I have been diagnosed with type 2 diabetes and I am obese.",
            "I'm here to help. What can I do for you?",
            "What lifestyle changes can I make to manage my diabetes and lose weight?",
            "You can start by reducing your overall calorie intake and increasing physical activity.",
            "What type of physical activity is best for me?",
            "You should aim for at least 30 minutes of moderate-intensity exercise most days of the week.",
            "Can you give me examples of moderate-intensity exercises?",
            "You can walk briskly, swim, or ride a bike. Yoga and strength training are also good options.",
            "What about my diet?"
        ],
        "knowledge": "Obesity Diabetes Obesity is a major risk factor for type 2 diabetes. Lifestyle changes such as reducing calorie intake and increasing physical activity can aid in weight loss and diabetes management. At least 30 minutes of moderate-intensity exercise most days of the week is recommended. Examples of moderate-intensity exercises include brisk walking, swimming, or riding a bike. Yoga and strength training can also be beneficial. Reducing overall carbohydrate intake and limiting sugary foods and drinks is recommended for diabetes management. Obesity Diabetes",
        "response": "It's important to reduce overall carbohydrate intake and limit sugary foods and drinks. Opt for whole grains, lean protein, and plenty of fruits and vegetables."
    },
    {
        "dialog": [
            "Hello Medi, I have some symptoms and I need your help",
            "Sure, I'm here to assist you. Please tell me your symptoms",
            "I have been feeling very thirsty and hungry, and I'm also losing weight.",
            "Based on your symptoms, it's possible that you have diabetes. You should go to a doctor for a blood test to confirm the diagnosis. ",
            "What can I do to manage my diabetes?",
            "You can watch your carbohydrate intake, do regular physical activity, check your blood sugar levels, and take medication as prescribed. ",
            "Will I have to take insulin?",
            "It depends on the severity of your diabetes, but other medications can also be used. ",
            "What should I expect during my first visit to the doctor?"
        ],
        "knowledge": "Diabetes Diabetes  According to the ADA, 'reducing overall carbohydrate intake for individuals with diabetes has demonstrated the most evidence for improving glycemia', and for individuals with type 2 diabetes who cannot meet the glycemic targets or where reducing anti-glycemic medications is a priority, low or very-low carbohydrate diets are a viable approach.  For overweight people with type 2 diabetes, any diet that achieves weight loss is effective. Most medications used to treat diabetes act by lowering blood sugar levels through different mechanisms.  There is broad consensus that when people with diabetes maintain tight glucose control – keeping the glucose levels in their blood within normal ranges – they experience fewer complications, such as kidney problems or eye problems. Diabetes Diabetes",
        "response": "During your first visit, the doctor will likely perform a physical exam, ask about your medical history and symptoms, and order blood tests to confirm the diagnosis. "
    },
    {
        "dialog": [
            "Hello Medi, I have a question about a low-carb diet for my diabetes",
            "Sure, what would you like to know?",
            "Can you give me some examples of low-carb meals?",
            "Certainly, you could have a spinach omelet for breakfast, grilled chicken with roasted vegetables for lunch, and a salmon fillet with a side salad for dinner.",
            "Are there any foods that I should avoid completely?",
            "Yes, you should avoid sugary drinks, processed foods, and foods high in refined carbohydrates like white bread and pasta.",
            "Can I still have snacks?",
            "Yes, but they should also be low in carbohydrates. Some examples are sliced cucumber with hummus or celery with peanut butter.",
            "Thank you for the advice. Do you have any other tips for managing my diabetes?"
        ],
        "knowledge": "Diabetes Diabetes  According to the ADA, 'reducing overall carbohydrate intake for individuals with diabetes has demonstrated the most evidence for improving glycemia', and for individuals with type 2 diabetes who cannot meet the glycemic targets or where reducing anti-glycemic medications is a priority, low or very-low carbohydrate diets are a viable approach.  For overweight people with type 2 diabetes, any diet that achieves weight loss is effective. Most medications used to treat diabetes act by lowering blood sugar levels through different mechanisms.  There is broad consensus that when people with diabetes maintain tight glucose control – keeping the glucose levels in their blood within normal ranges – they experience fewer complications, such as kidney problems or eye problems. Diabetes Diabetes",
        "response": "Yes, you should also monitor your blood sugar levels regularly, aim for regular physical activity, and take your medication as prescribed. "
    },
    {
        "dialog": [
            "Hello Medi, I recently had a medical procedure and I'm not sure what I should eat now.",
            "What procedure did you have?",
            "I had a stent put in my heart",
            "After a stent procedure, it's important to eat a heart-healthy diet that's low in saturated fats and cholesterol. Some examples include fruits, vegetables, whole grains, lean protein sources like fish and chicken, and low-fat dairy products.",
            "Are there any foods that I should avoid?",
            "Yes, you should avoid foods high in sodium, trans fats, and added sugars. Some examples are processed foods, fried foods, and sugary drinks.",
            "Do I need to make any other lifestyle changes?",
            "Yes, you should aim for regular physical activity, quit smoking if you smoke, and take your medication as prescribed.",
            "Thank you for the advice. What kind of physical activity is best for me?"
        ],
        "knowledge": "Stent Procedure Heart Stent  After a stent procedure, it is important to lower your cholesterol by eating a heart-healthy diet that's low in saturated fats and cholesterol.  Some examples include fruits, vegetables, whole grains, lean protein sources like fish and chicken, and low-fat dairy products.  You should also aim for regular physical activity to help manage your cholesterol.  Quitting smoking is also important, and your doctor may prescribe medication to help manage your cholesterol and prevent blood clots.  After a stent procedure, it is important to take your medication as prescribed, and to avoid caffeine, alcohol, and other stimulants. Stent Procedure Heart Stent",
        "response": "Some good options for physical activity after a stent procedure are brisk walking, swimming, and cycling. However, you should consult with your doctor first before starting any exercise program. "
    },
    {
        "dialog": [
            "Hi Medi, I have been diagnosed with type 2 diabetes, what should I do?",
            "You should make some lifestyle changes and follow a low-carbohydrate diet.",
            "Can you recommend some foods I should avoid?",
            "Yes, you should avoid sugary drinks, processed snacks, and foods high in carbohydrates.",
            "Are there any physical exercises that I should do?",
            "Yes, aerobic exercises and resistance training can improve blood sugar control.",
            "What other tips do you have to manage type 2 diabetes?",
            "You should monitor your blood sugar regularly and take medications as prescribed by your doctor.",
            "Thank you. What are the side effects of these medications?"
        ],
        "knowledge": "Diabetes Diabetes  Most medications used to treat diabetes act by lowering blood sugar levels through different mechanisms.  Common side effects of diabetes medications include hypoglycemia, weight gain, and gastrointestinal symptoms.  Some medications may also increase the risk of cardiovascular events or kidney problems.  It is important to talk to your doctor about the benefits and risks of each medication and to monitor for any side effects. Diabetes Diabetes",
        "response": "The most common side effects of diabetes medications include hypoglycemia, weight gain, and gastrointestinal symptoms. Some medications may also increase the risk of cardiovascular events or kidney problems."
    },
    {
        "dialog": [
            "Hi Medi, I have some questions about non-nutritive sweeteners.",
            "Sure, what do you want to know?",
            "What are non-nutritive sweeteners and are they safe?",
            "Non-nutritive sweeteners are sugar substitutes that are lower in calories than sugar. They are generally safe for consumption.",
            "Are there any side effects of consuming non-nutritive sweeteners?",
            "The studies on the effects of non-nutritive sweeteners on health are unclear and more research is needed.",
            "Should I replace sugar with non-nutritive sweeteners in my diet to manage diabetes?",
            "It is not necessary to replace sugar with non-nutritive sweeteners, but they can be used in moderation as a part of a balanced diet.",
            "Thanks. Is there anything else I should be aware of when managing diabetes?"
        ],
        "knowledge": "Diabetes Diabetes  According to the ADA, \"reducing overall carbohydrate intake for individuals with diabetes has demonstrated the most evidence for improving glycemia\", and for individuals with type 2 diabetes who cannot meet the glycemic targets or where reducing anti-glycemic medications is a priority, low or very-low carbohydrate diets are a viable approach.  For overweight people with type 2 diabetes, any diet that achieves weight loss is effective. A 2020 Cochrane systematic review compared several non-nutritive sweeteners to sugar, placebo and a nutritive low-calorie sweetener , but the results were unclear for effects on HbA1c, body weight and adverse events.  The studies included were mainly of very low-certainty and did not report on health-related quality of life, diabetes complications, all-cause mortality or socioeconomic effects. Most medications used to treat diabetes act by lowering blood sugar levels through different mechanisms.  There is broad consensus that when people with diabetes maintain tight glucose control – keeping the glucose levels in their blood within normal ranges – they experience fewer complications, such as kidney problems or eye problems.  There is however debate as to whether this is appropriate and cost effective for people later in life in whom the risk of hypoglycemia may be more significant Diabetes Diabetes",
        "response": "When managing diabetes, it is important to monitor your blood sugar regularly and keep it within normal ranges to prevent complications such as kidney problems or eye problems."
    },
    {
        "dialog": [
            "Hi Medi, I had a medical procedure recently and I am not sure what kind of foods I should eat now.",
            "What kind of procedure did you have?",
            "I had a gastric bypass surgery.",
            "After gastric bypass surgery, you should eat a diet high in protein and low in carbohydrates.",
            "What kind of foods are high in protein?",
            "Foods such as lean meats, eggs, and beans are good sources of protein.",
            "Are there any foods I should avoid?",
            "You should avoid foods high in fat, sugar, and carbohydrates, as well as carbonated beverages and alcohol.",
            "Thanks for your help. What else can I do to maintain my health after the surgery?"
        ],
        "knowledge": "Gastric Bypass Surgery Gastric Bypass Surgery  After gastric bypass surgery, it is important to follow a strict diet to ensure proper healing and to avoid complications. The diet typically progresses from clear liquids to full liquids to soft foods to regular foods.   The diet should be high in protein and low in carbohydrates and fat.  Carbonated beverages and alcohol should be avoided.  Patients should take vitamin and mineral supplements as prescribed by their doctor.  Patients should also engage in regular physical activity to maintain weight loss and improve overall health. Gastric Bypass Surgery Gastric Bypass Surgery",
        "response": "After gastric bypass surgery, it is important to follow a strict diet high in protein and low in carbohydrates and fat, avoid carbonated beverages and alcohol, and take vitamin and mineral supplements as prescribed by your doctor."
    }
]