[
    {
        "dialog": [
            "Hello Medi, I have been experiencing high blood pressure for a few days.",
            "I see. Can you tell me more about your symptoms?",
            "I feel a headache and dizziness most of the time. I also feel tired and short of breath sometimes.",
            "Based on your symptoms, you may have hypertension. You should get your blood pressure checked by a doctor.",
            "Is hypertension common?",
            "Yes, it affects 46% of people in the United States. African-American adults have among the highest rates of hypertension at 44%.",
            "What can I do to prevent hypertension?",
            "You can maintain a healthy lifestyle, eat a balanced diet, exercise regularly and avoid smoking.",
            "Thank you for your advice, Medi. Can you give me more information about hypertension?"
        ],
        "knowledge": "Hypertension Hypertension In 2017, with the change in definitions for hypertension, 46% of people in the United States are affected. African-American adults in the United States have among the highest rates of hypertension in the world at 44%. It is also more common in Filipino Americans and less common in US whites and Mexican Americans. Differences in hypertension rates are multifactorial and under study. Rates of high blood pressure in children and adolescents have increased in the last 20 years in the United States. Childhood hypertension, particularly in pre-adolescents, is more often secondary to an underlying disorder than in adults. Kidney disease is the most common secondary cause of hypertension in children and adolescents Hypertension Hypertension",
        "response": "Hypertension is a common condition that affects many people. It can be prevented by maintaining a healthy lifestyle and regular check-ups with your doctor."
    },
    {
        "dialog": [
            "Hello Medi, can you tell me more about hypertension?",
            "Sure, I can help you with that. What would you like to know?",
            "How is hypertension diagnosed?",
            "Hypertension is diagnosed by measuring blood pressure. A healthy blood pressure reading is below 120/80 mmHg.",
            "What are the symptoms of hypertension?",
            "Many people with hypertension have no symptoms, so it's important to get your blood pressure checked regularly.",
            "How is hypertension treated?",
            "Hypertension can be treated in many ways, including lifestyle changes, medication, and regular check-ups with your doctor.",
            "Thank you, Medi. How can I manage hypertension with lifestyle changes?"
        ],
        "knowledge": "Hypertension Hypertension In 2017, with the change in definitions for hypertension, 46% of people in the United States are affected. African-American adults in the United States have among the highest rates of hypertension in the world at 44%. It is also more common in Filipino Americans and less common in US whites and Mexican Americans. Differences in hypertension rates are multifactorial and under study. Rates of high blood pressure in children and adolescents have increased in the last 20 years in the United States. Childhood hypertension, particularly in pre-adolescents, is more often secondary to an underlying disorder than in adults. Kidney disease is the most common secondary cause of hypertension in children and adolescents Hypertension Hypertension",
        "response": "Lifestyle changes that can help manage hypertension include maintaining a healthy weight, following a balanced diet, exercising regularly, managing stress, and avoiding smoking and alcohol."
    },
    {
        "dialog": [
            "Hi Medi, I recently got back from the hospital after undergoing a kidney biopsy.",
            "I hope everything went well. Do you have any questions or concerns?",
            "Yes, I'm not sure what kind of lifestyle changes I should make after the procedure.",
            "After a kidney biopsy, it's important to rest for a few days and avoid strenuous activities. You should also drink plenty of fluids and avoid heavy lifting.",
            "Are there any specific foods I should be eating?",
            "Yes, it's important to have a balanced diet that is low in sodium and protein to help your kidneys recover.",
            "How can I prevent future kidney problems?",
            "You can prevent future kidney problems by maintaining a healthy lifestyle, managing your blood pressure and blood sugar levels, and avoiding medications that can harm your kidneys.",
            "Thank you for your help, Medi. How often should I get my kidneys checked?"
        ],
        "knowledge": "Kidney Biopsy Kidney Biopsy A kidney biopsy is a medical procedure that involves taking a small sample of kidney tissue to examine it for signs of disease or damage. It is typically done to diagnose or monitor kidney problems, such as kidney disease or kidney cancer. After a kidney biopsy, it's important to rest and avoid strenuous activities for a few days. You may also need to drink plenty of fluids and avoid heavy lifting. Complications from a kidney biopsy are rare but can include bleeding, infection, and damage to surrounding organs. Kidney Biopsy Kidney Biopsy",
        "response": "You should discuss with your doctor to determine how often you should get your kidneys checked based on your condition and medical history."
    },
    {
        "dialog": [
            "Hello Medi, I have been feeling uneasy lately.",
            "I'm here to help you. Can you tell me what symptoms you have?",
            "I have been feeling dizzy and my heart has been racing.",
            "How long have you been experiencing these symptoms?",
            "It started a few days ago and it's getting worse.",
            "Do you have a history of high blood pressure?",
            "Yes, I was diagnosed with hypertension a few years ago.",
            "I think you should make an appointment with your doctor as soon as possible.",
            "What should I expect from the doctor, Medi?"
        ],
        "knowledge": "Hypertension Hypertension  In 2017, with the change in definitions for hypertension, 46% of people in the United States are affected.  African-American adults in the United States have among the highest rates of hypertension in the world at 44%.  It is also more common in Filipino Americans and less common in US whites and Mexican Americans.  Differences in hypertension rates are multifactorial and under study. Rates of high blood pressure in children and adolescents have increased in the last 20 years in the United States.  Childhood hypertension, particularly in pre-adolescents, is more often secondary to an underlying disorder than in adults.  Kidney disease is the most common secondary cause of hypertension in children and adolescents Hypertension Hypertension",
        "response": "Your doctor may prescribe medication or suggest lifestyle changes to help manage your blood pressure more effectively."
    },
    {
        "dialog": [
            "Hello Medi, I have been diagnosed with hypertension. Can you give me some advice?",
            "Of course. What is your current blood pressure reading, if you don't mind me asking?",
            "It's 140/90 mmHg.",
            "That's considered high. One thing you can do is to reduce your salt intake.",
            "How much salt should I consume in a day?",
            "You should consume no more than 1,500 milligrams of sodium per day.",
            "What kind of food should I avoid?",
            "You should avoid processed foods, canned soups and vegetables, and fast food. ",
            "Thanks for the advice, Medi. How often should I monitor my blood pressure? "
        ],
        "knowledge": "Hypertension Hypertension  In 2017, with the change in definitions for hypertension, 46% of people in the United States are affected.  African-American adults in the United States have among the highest rates of hypertension in the world at 44%.  It is also more common in Filipino Americans and less common in US whites and Mexican Americans.  Differences in hypertension rates are multifactorial and under study. Rates of high blood pressure in children and adolescents have increased in the last 20 years in the United States.  Childhood hypertension, particularly in pre-adolescents, is more often secondary to an underlying disorder than in adults.  Kidney disease is the most common secondary cause of hypertension in children and adolescents Hypertension Hypertension",
        "response": "You should monitor your blood pressure at home at least once a day and keep records to share with your doctor during your regular visits."
    },
    {
        "dialog": [
            "Hello Medi, I have recently been diagnosed with hypertension. ",
            "I'm sorry to hear that, what questions do you have?",
            "I've heard that exercise can help lower my blood pressure. Is that true?",
            "Yes, exercise can be very effective. ",
            "What kind of exercise do you recommend?",
            "You should aim for at least 30 minutes of moderate exercise, such as brisk walking, cycling or swimming, on most days of the week.",
            "What about my diet?",
            "You should eat a healthy, balanced diet that's low in salt, saturated fat and sugar.",
            "Thanks for the advice, Medi. How long will it take to see results? "
        ],
        "knowledge": "Hypertension Hypertension  In 2017, with the change in definitions for hypertension, 46% of people in the United States are affected.  African-American adults in the United States have among the highest rates of hypertension in the world at 44%.  It is also more common in Filipino Americans and less common in US whites and Mexican Americans.  Differences in hypertension rates are multifactorial and under study. Rates of high blood pressure in children and adolescents have increased in the last 20 years in the United States.  Childhood hypertension, particularly in pre-adolescents, is more often secondary to an underlying disorder than in adults.  Kidney disease is the most common secondary cause of hypertension in children and adolescents Hypertension Hypertension",
        "response": "By making these lifestyle changes and following your doctor's advice, you should begin to see results within a few weeks to months."
    },
    {
        "dialog": [
            "Hi Medi, I think I have hypertension. What should I do?",
            "Hello, I can help. What are your symptoms?",
            "I'm having headaches and blurred vision",
            "It sounds like high blood pressure. You should visit a doctor soon.",
            "What are some lifestyle changes for hypertension?",
            "Reduce your salt intake, exercise regularly, and avoid smoking and drinking",
            "What are the medications for hypertension?",
            "Medications such as ACE inhibitors, beta-blockers, and diuretics can lower blood pressure.",
            "What are the common secondary causes of hypertension?"
        ],
        "knowledge": "Hypertension Hypertension In 2017, with the change in definitions for hypertension, 46% of people in the United States are affected. African-American adults in the United States have among the highest rates of hypertension in the world at 44%. It is also more common in Filipino Americans and less common in US whites and Mexican Americans. Differences in hypertension rates are multifactorial and under study. Rates of high blood pressure in children and adolescents have increased in the last 20 years in the United States. Childhood hypertension, particularly in pre-adolescents, is more often secondary to an underlying disorder than in adults. Kidney disease is the most common secondary cause of hypertension in children and adolescents Hypertension Hypertension",
        "response": "Kidney disease is the most common secondary cause of hypertension in children and adolescents."
    },
    {
        "dialog": [
            "Hello Medi, I recently had a procedure done. What should I do now?",
            "Hi, what procedure did you have?",
            "I had a heart procedure done.",
            "It's important to rest and avoid strenuous activities for a few days. You should also follow a heart-healthy diet.",
            "What is a heart-healthy diet?",
            "A diet rich in fruits, vegetables, lean protein, and whole grains is considered heart-healthy.",
            "What kind of exercise is good for heart health?",
            "Light to moderate aerobic exercise like walking or cycling can improve heart health.",
            "When should I schedule a follow-up appointment?"
        ],
        "knowledge": "Heart disease Heart disease is a leading cause of death in the United States. The most common type of heart disease is coronary artery disease, which is caused by a buildup of plaque in the arteries that supply blood to the heart. Risk factors include high blood pressure, smoking, high cholesterol, diabetes, and a family history of heart disease. To reduce the risk of heart disease, it's important to maintain a healthy weight, exercise regularly, eat a heart-healthy diet, and avoid smoking. Regular check-ups with a doctor are also important for early detection and treatment of heart disease.",
        "response": "You should schedule a follow-up appointment with your doctor after a week or two."
    },
    {
        "dialog": [
            "Hi Medi, I have some questions about hypertension.",
            "Sure, what would you like to know?",
            "Is hypertension genetic?",
            "Yes, there is a genetic component to hypertension.",
            "Is it possible to lower blood pressure without medication?",
            "Yes, lifestyle changes like reducing salt intake, exercising regularly, and maintaining a healthy weight can help lower blood pressure.",
            "Can stress cause hypertension?",
            "Yes, stress can contribute to hypertension.",
            "What kind of doctor should I see for hypertension?"
        ],
        "knowledge": "Hypertension Hypertension In 2017, with the change in definitions for hypertension, 46% of people in the United States are affected. African-American adults in the United States have among the highest rates of hypertension in the world at 44%. It is also more common in Filipino Americans and less common in US whites and Mexican Americans. Differences in hypertension rates are multifactorial and under study. Rates of high blood pressure in children and adolescents have increased in the last 20 years in the United States. Childhood hypertension, particularly in pre-adolescents, is more often secondary to an underlying disorder than in adults. Kidney disease is the most common secondary cause of hypertension in children and adolescents Hypertension Hypertension",
        "response": "You should see a primary care physician or a cardiologist for hypertension."
    },
    {
        "dialog": [
            "Hi Medi, I am concerned about hypertension.",
            "Hello! I am here to help. What is your concern?",
            "I have been feeling headaches and dizzy recently.",
            "Are you under a lot of stress lately?",
            "Yes, I am.",
            "Stress can bring up your blood pressure. You should try to manage your stress.",
            "How do I manage my stress?",
            "You can try meditating, yoga, or deep breathing exercises. Do you have any other concerns?",
            "No, that's all for now. Thank you, Medi."
        ],
        "knowledge": "Hypertension Hypertension  In 2017, with the change in definitions for hypertension, 46% of people in the United States are affected.  African-American adults in the United States have among the highest rates of hypertension in the world at 44%.  It is also more common in Filipino Americans and less common in US whites and Mexican Americans.  Differences in hypertension rates are multifactorial and under study. Rates of high blood pressure in children and adolescents have increased in the last 20 years in the United States.  Childhood hypertension, particularly in pre-adolescents, is more often secondary to an underlying disorder than in adults.  Kidney disease is the most common secondary cause of hypertension in children and adolescents Hypertension Hypertension",
        "response": "Your headaches and dizziness may be due to stress, which can raise your blood pressure. You should try to manage your stress by meditating, practicing yoga, or doing deep breathing exercises."
    },
    {
        "dialog": [
            "Hi Medi, I have a question about hypertension.",
            "Hi! What do you want to know?",
            "What is the difference between hypertension and high blood pressure?",
            "Hypertension and high blood pressure are the same thing. Hypertension is just the medical term.",
            "Oh, I see. Thank you. Can you tell me more about hypertension?",
            "Hypertension is a condition where the force of the blood against the artery walls is too high. It can lead to serious health problems like heart attack or stroke if it is not managed properly.",
            "How can I manage my hypertension?",
            "You can manage your hypertension by making lifestyle changes like eating a healthy diet, exercising regularly, and quitting smoking. You may also need to take medication prescribed by your doctor.",
            "Thank you, Medi. That's very helpful."
        ],
        "knowledge": "Hypertension Hypertension  In 2017, with the change in definitions for hypertension, 46% of people in the United States are affected.  African-American adults in the United States have among the highest rates of hypertension in the world at 44%.  It is also more common in Filipino Americans and less common in US whites and Mexican Americans.  Differences in hypertension rates are multifactorial and under study. Rates of high blood pressure in children and adolescents have increased in the last 20 years in the United States.  Childhood hypertension, particularly in pre-adolescents, is more often secondary to an underlying disorder than in adults.  Kidney disease is the most common secondary cause of hypertension in children and adolescents Hypertension Hypertension",
        "response": "Hypertension and high blood pressure are the same thing. You can manage your hypertension by making lifestyle changes like eating a healthy diet, exercising regularly, and quitting smoking. You may also need to take medication prescribed by your doctor."
    },
    {
        "dialog": [
            "Hi Medi, I just had a medical procedure related to hypertension and I am not sure what to do next.",
            "Hi! What kind of procedure did you have?",
            "I had a stent placed in one of my blood vessels.",
            "After a stent is placed, it is important to take certain precautions to prevent complications like restenosis or blood clots. Your doctor will probably recommend that you take certain medications and make lifestyle changes like quitting smoking and eating a heart-healthy diet.",
            "Will I need to take medication for the rest of my life?",
            "You may need to take medication for hypertension or to prevent blood clots for the rest of your life. It's important to follow your doctor's recommendations.",
            "Thank you for your help, Medi.",
            "You're welcome. Take care of yourself."
        ],
        "knowledge": "Hypertension Hypertension  In 2017, with the change in definitions for hypertension, 46% of people in the United States are affected.  African-American adults in the United States have among the highest rates of hypertension in the world at 44%.  It is also more common in Filipino Americans and less common in US whites and Mexican Americans.  Differences in hypertension rates are multifactorial and under study. Rates of high blood pressure in children and adolescents have increased in the last 20 years in the United States.  Childhood hypertension, particularly in pre-adolescents, is more often secondary to an underlying disorder than in adults.  Kidney disease is the most common secondary cause of hypertension in children and adolescents Hypertension Hypertension",
        "response": "After a stent is placed, it is important to take certain precautions to prevent complications like restenosis or blood clots. You may need to take medication for hypertension or to prevent blood clots for the rest of your life. It's important to follow your doctor's recommendations."
    },
    {
        "dialog": [
            "Hello Medi, I have been experiencing headaches and dizziness lately.",
            "I see. How long have you been experiencing these symptoms?",
            "It's been going on for a week now.",
            "Have you checked your blood pressure?",
            "No, I haven't.",
            "I suggest you check it. High blood pressure can cause these symptoms.",
            "Okay, I will check it. Thank you, Medi.",
            "You're welcome. Let me know if you need anything else.",
            "Sure, I will. Bye."
        ],
        "knowledge": "Hypertension Hypertension  In 2017, with the change in definitions for hypertension, 46% of people in the United States are affected. African-American adults in the United States have among the highest rates of hypertension in the world at 44%. It is also more common in Filipino Americans and less common in US whites and Mexican Americans. Differences in hypertension rates are multifactorial and under study. Rates of high blood pressure in children and adolescents have increased in the last 20 years in the United States. Childhood hypertension, particularly in pre-adolescents, is more often secondary to an underlying disorder than in adults. Kidney disease is the most common secondary cause of hypertension in children and adolescents Hypertension Hypertension",
        "response": "You should check your blood pressure. High blood pressure can cause headaches and dizziness."
    },
    {
        "dialog": [
            "Hello Medi, I have a question about hypertension.",
            "Sure, I'll try my best to answer it.",
            "What causes hypertension?",
            "Hypertension can be caused by a variety of factors such as genetics, lifestyle, and underlying medical conditions.",
            "Is it preventable?",
            "Yes, it is. You can prevent hypertension by following a healthy lifestyle such as eating a balanced diet, exercising regularly, and avoiding smoking and excessive alcohol consumption.",
            "Are there any symptoms of hypertension?",
            "Hypertension is usually asymptomatic. That's why it's important to get your blood pressure checked regularly.",
            "I see. Thank you, Medi."
        ],
        "knowledge": "Hypertension Hypertension  In 2017, with the change in definitions for hypertension, 46% of people in the United States are affected. African-American adults in the United States have among the highest rates of hypertension in the world at 44%. It is also more common in Filipino Americans and less common in US whites and Mexican Americans. Differences in hypertension rates are multifactorial and under study. Rates of high blood pressure in children and adolescents have increased in the last 20 years in the United States. Childhood hypertension, particularly in pre-adolescents, is more often secondary to an underlying disorder than in adults. Kidney disease is the most common secondary cause of hypertension in children and adolescents Hypertension Hypertension",
        "response": "Hypertension can be caused by a variety of factors such as genetics, lifestyle, and underlying medical conditions. It is preventable by following a healthy lifestyle such as eating a balanced diet, exercising regularly, and avoiding smoking and excessive alcohol consumption. Hypertension is usually asymptomatic."
    },
    {
        "dialog": [
            "Hi Medi, I just had a medical procedure and I'm wondering what I should do now.",
            "Sure, I'll be happy to help. What kind of procedure did you have?",
            "I had a biopsy to check for cancer.",
            "I see. It's important to take some precautions after a biopsy. You should avoid any heavy lifting or strenuous activity for at least 24 hours.",
            "What about my diet?",
            "You should avoid spicy or acidic foods for a few days to give your body time to heal.",
            "Should I take any medication?",
            "It depends on your condition and what your doctor prescribed. Make sure to follow their instructions carefully.",
            "Okay, thank you for your help, Medi."
        ],
        "knowledge": "Hypertension Hypertension  In 2017, with the change in definitions for hypertension, 46% of people in the United States are affected. African-American adults in the United States have among the highest rates of hypertension in the world at 44%. It is also more common in Filipino Americans and less common in US whites and Mexican Americans. Differences in hypertension rates are multifactorial and under study. Rates of high blood pressure in children and adolescents have increased in the last 20 years in the United States. Childhood hypertension, particularly in pre-adolescents, is more often secondary to an underlying disorder than in adults. Kidney disease is the most common secondary cause of hypertension in children and adolescents Hypertension Hypertension",
        "response": "After a biopsy, you should avoid any heavy lifting or strenuous activity for at least 24 hours. You should also avoid spicy or acidic foods for a few days. Make sure to follow your doctor's instructions regarding medication."
    },
    {
        "dialog": [
            "Hello Medi, I think I have hypertension. Can you help me?",
            "Sure, I am happy to help. What are your symptoms?",
            "I have headaches and difficulty breathing sometimes.",
            "Do you have any other symptoms like chest pain or vision problems?",
            "No, just the ones I mentioned.",
            "Okay, I recommend you to measure your blood pressure and consult your doctor",
            "What can I do to prevent hypertension?",
            "You can maintain a healthy weight and lifestyle. Reduce salt and alcohol intake.",
            "That's helpful. How can I lower my blood pressure?"
        ],
        "knowledge": "Hypertension Hypertension  In 2017, with the change in definitions for hypertension, 46% of people in the United States are affected.  African-American adults in the United States have among the highest rates of hypertension in the world at 44%.  It is also more common in Filipino Americans and less common in US whites and Mexican Americans.  Differences in hypertension rates are multifactorial and under study. Rates of high blood pressure in children and adolescents have increased in the last 20 years in the United States.  Childhood hypertension, particularly in pre-adolescents, is more often secondary to an underlying disorder than in adults.  Kidney disease is the most common secondary cause of hypertension in children and adolescents Hypertension Hypertension",
        "response": "You can lower your blood pressure by reducing salt and alcohol intake and having a healthy lifestyle."
    },
    {
        "dialog": [
            "Hello Medi, I recently had a medical procedure. What should I do now?",
            "I would need more information about your medical procedure to give specific advice.",
            "I had a surgery for my high blood pressure.",
            "After surgery, it is important to follow your doctor's post-operative instructions. Rest and take any prescribed medications.",
            "What kind of diet should I follow?",
            "You should have a balanced diet with healthy food choices with less salt and sugar.",
            "What kind of physical activity can I do?",
            "You should start with light physical activity, such as walking, and gradually increase the intensity and duration as advised by your doctor.",
            "Okay, that's helpful. How long should I wait before returning to work?"
        ],
        "knowledge": "Hypertension Hypertension  In 2017, with the change in definitions for hypertension, 46% of people in the United States are affected.  African-American adults in the United States have among the highest rates of hypertension in the world at 44%.  It is also more common in Filipino Americans and less common in US whites and Mexican Americans.  Differences in hypertension rates are multifactorial and under study. Rates of high blood pressure in children and adolescents have increased in the last 20 years in the United States.  Childhood hypertension, particularly in pre-adolescents, is more often secondary to an underlying disorder than in adults.  Kidney disease is the most common secondary cause of hypertension in children and adolescents Hypertension Hypertension",
        "response": "You should wait until you fully recover and your doctor gives the green light before returning to work."
    },
    {
        "dialog": [
            "Hi Medi, I have some questions about hypertension.",
            "Sure, I'll do my best to answer them.",
            "What is hypertension exactly?",
            "It's high blood pressure, where the blood pressure in your arteries is consistently too high.",
            "What are the causes of hypertension?",
            "The causes can be multifactorial, but some common causes include unhealthy lifestyle choices, like diet and lack of exercise, obesity, smoking, stress and genetics.",
            "What are the complications of hypertension?",
            "Complications include heart attack, stroke, kidney disease, vision loss and sexual dysfunction.",
            "How can I prevent hypertension?"
        ],
        "knowledge": "Hypertension Hypertension  In 2017, with the change in definitions for hypertension, 46% of people in the United States are affected.  African-American adults in the United States have among the highest rates of hypertension in the world at 44%.  It is also more common in Filipino Americans and less common in US whites and Mexican Americans.  Differences in hypertension rates are multifactorial and under study. Rates of high blood pressure in children and adolescents have increased in the last 20 years in the United States.  Childhood hypertension, particularly in pre-adolescents, is more often secondary to an underlying disorder than in adults.  Kidney disease is the most common secondary cause of hypertension in children and adolescents Hypertension Hypertension",
        "response": "You can prevent hypertension by maintaining healthy lifestyle choices, such as eating a balanced diet, exercising regularly, losing weight if needed, reducing alcohol intake and quitting smoking."
    },
    {
        "dialog": [
            "Hi there, how can I assist you today?",
            "I think I have hypertension. Can you help me diagnose it?",
            "Sure, what are your symptoms?",
            "I've been experiencing headaches and dizziness lately.",
            "Have you measured your blood pressure?",
            "Yes, it was 140/90 mmHg.",
            "Hmm, based on your symptoms and blood pressure reading, you might have hypertension.",
            "What should I do to manage it?",
            "You should make some lifestyle changes such as reducing salt and alcohol intake, increasing physical activity, and maintaining a healthy weight. You may also need medication."
        ],
        "knowledge": "Hypertension Hypertension  In 2017, with the change in definitions for hypertension, 46% of people in the United States are affected.  African-American adults in the United States have among the highest rates of hypertension in the world at 44%.  It is also more common in Filipino Americans and less common in US whites and Mexican Americans.  Differences in hypertension rates are multifactorial and under study. Rates of high blood pressure in children and adolescents have increased in the last 20 years in the United States.  Childhood hypertension, particularly in pre-adolescents, is more often secondary to an underlying disorder than in adults.  Kidney disease is the most common secondary cause of hypertension in children and adolescents Hypertension Hypertension",
        "response": "Hypertension is a common condition that affects many Americans, especially African-Americans and Filipino Americans. It can be caused by multiple factors and can lead to serious health problems."
    },
    {
        "dialog": [
            "Hello, Medi. Can you explain more about hypertension?",
            "Of course, hypertension is also known as high blood pressure. It occurs when the force of blood against the walls of your arteries is consistently too high.",
            "What are the causes of hypertension?",
            "There are many factors that can contribute to hypertension such as age, family history, smoking, stress, lack of physical activity, and a poor diet.",
            "What are the symptoms of hypertension?",
            "Most of the time there are no symptoms, that's why it's called the silent killer. But some people can experience headaches, shortness of breath, or nosebleeds.",
            "How can we prevent hypertension?",
            "You can reduce your risk of developing hypertension by exercising regularly, maintaining a healthy weight, reducing salt and alcohol intake, quitting smoking, and managing stress.",
            "Thank you, Medi. How often should I check my blood pressure?"
        ],
        "knowledge": "Hypertension Hypertension  In 2017, with the change in definitions for hypertension, 46% of people in the United States are affected.  African-American adults in the United States have among the highest rates of hypertension in the world at 44%.  It is also more common in Filipino Americans and less common in US whites and Mexican Americans.  Differences in hypertension rates are multifactorial and under study. Rates of high blood pressure in children and adolescents have increased in the last 20 years in the United States.  Childhood hypertension, particularly in pre-adolescents, is more often secondary to an underlying disorder than in adults.  Kidney disease is the most common secondary cause of hypertension in children and adolescents Hypertension Hypertension",
        "response": "Hypertension is a condition where the force of blood against the arteries is consistently too high. It can be caused by various factors and can lead to serious health problems if left untreated. However, it can be prevented by adopting a healthy lifestyle."
    },
    {
        "dialog": [
            "Hi, Medi. I just got a medical procedure done, do you have any advice for me?",
            "Sure, what kind of procedure did you have?",
            "I had a cardiac catheterization.",
            "After a cardiac catheterization, it's important to take it easy for a few days and avoid any strenuous activity. You should also drink plenty of fluids and avoid caffeine and alcohol.",
            "Is there a specific diet I should follow?",
            "You should follow a heart-healthy diet which includes plenty of fruits and vegetables, whole grains, lean protein, and low-fat dairy products. You should also avoid foods that are high in saturated and trans fats.",
            "Thanks, Medi. What about physical activity?",
            "You should avoid any strenuous activity for at least a week after the procedure, but light exercise such as walking is encouraged.",
            "I appreciate your help, Medi. Thank you."
        ],
        "knowledge": "Cardiac Catheterization Cardiac Catheterization  Cardiac catheterization is a medical procedure used to diagnose and treat certain heart conditions. During the procedure, a long, thin tube called a catheter is inserted into a blood vessel in your arm, neck, or groin and threaded to your heart. Once in your heart, your doctor can perform a variety of tests and treatments, such as measuring blood pressure, looking for blockages, taking samples of heart tissue or blood, or performing angioplasty or stenting. After the procedure, it's important to take it easy for a few days and avoid any strenuous activity. You should also drink plenty of fluids and avoid caffeine and alcohol. Cardiac Catheterization Cardiac Catheterization",
        "response": "After a cardiac catheterization, it's important to rest and avoid strenuous activity for a few days, follow a heart-healthy diet, and avoid caffeine and alcohol. Light exercise such as walking is encouraged."
    },
    {
        "dialog": [
            "Hello Medi, I am having some symptoms lately and I'm worried",
            "Don't worry. Please tell me about your symptoms so we can see what's going on",
            "I've been feeling dizzy and lightheaded, and my heart seems to be beating very fast",
            "Okay, based on your symptoms, it is possible that you have hypertension",
            "What is hypertension, Medi?",
            "Hypertension is high blood pressure. It can lead to serious health problems if not treated",
            "Is it common?",
            "Yes, in fact, 46% of people in the US are affected by hypertension",
            "What should I do next, Medi?"
        ],
        "knowledge": "Hypertension Hypertension  In 2017, with the change in definitions for hypertension, 46% of people in the United States are affected.  African-American adults in the United States have among the highest rates of hypertension in the world at 44%.  It is also more common in Filipino Americans and less common in US whites and Mexican Americans.  Differences in hypertension rates are multifactorial and under study. Rates of high blood pressure in children and adolescents have increased in the last 20 years in the United States.  Childhood hypertension, particularly in pre-adolescents, is more often secondary to an underlying disorder than in adults.  Kidney disease is the most common secondary cause of hypertension in children and adolescents Hypertension Hypertension",
        "response": "You should visit your doctor to have your blood pressure checked and discuss treatment options"
    },
    {
        "dialog": [
            "Hi, Medi. I was just diagnosed with hypertension. What should I do?",
            "Hello. The first step is to make some lifestyle changes",
            "Like what?",
            "You should eat a healthy diet, exercise regularly, and avoid smoking and excessive alcohol intake",
            "Is there anything else I can do?",
            "Yes, stress management techniques like meditation or yoga can also help lower your blood pressure",
            "What about medication?",
            "Your doctor may prescribe medication if lifestyle changes are not enough to control your blood pressure",
            "Can hypertension be cured?"
        ],
        "knowledge": "Hypertension Hypertension  In 2017, with the change in definitions for hypertension, 46% of people in the United States are affected.  African-American adults in the United States have among the highest rates of hypertension in the world at 44%.  It is also more common in Filipino Americans and less common in US whites and Mexican Americans.  Differences in hypertension rates are multifactorial and under study. Rates of high blood pressure in children and adolescents have increased in the last 20 years in the United States.  Childhood hypertension, particularly in pre-adolescents, is more often secondary to an underlying disorder than in adults.  Kidney disease is the most common secondary cause of hypertension in children and adolescents Hypertension Hypertension",
        "response": "Hypertension cannot be cured, but it can be managed through lifestyle changes and medication"
    },
    {
        "dialog": [
            "Hi, Medi. I just had a medical procedure and I'm not sure what I should do now",
            "Hello. What kind of procedure did you have?",
            "I had a stent put in my heart",
            "Okay, after a stent procedure, it's important to take it easy for a few days",
            "What else should I do?",
            "You should avoid any heavy lifting or strenuous activity for at least a week",
            "What about my diet?",
            "You should follow a heart-healthy diet and avoid foods that are high in saturated and trans fats",
            "Are there any specific foods I should eat?"
        ],
        "knowledge": "Stent Stent  A stent is a small metal or plastic tube inserted into a narrowed or blocked blood vessel.  The stent is placed in the artery during a procedure called angioplasty.  The stent helps to keep the artery open and improve blood flow to the heart.  After a stent procedure, it is important to take it easy for a few days and avoid any heavy lifting or strenuous activity for at least a week.  You should also follow a heart-healthy diet and take any medications prescribed by your doctor.  Follow-up appointments with your doctor are important to monitor your progress and make any necessary adjustments to your treatment plan Stent Stent",
        "response": "What are some examples of heart-healthy foods?"
    },
    {
        "dialog": [
            "Hi Medi, I think I have high blood pressure. What should I do?",
            "Hello, let's check your blood pressure first. Please measure it, and I will wait.",
            "It's 150/95. What does it mean?",
            "It means you have hypertension. Don't worry, we can manage it.",
            "How can I manage it?",
            "You can start with lifestyle changes, such as reducing salt intake, exercising, and losing weight.",
            "Should I take medication?",
            "It depends on how high your blood pressure is and what your doctor suggests.",
            "Thank you, Medi. What should I do if my blood pressure keeps increasing?"
        ],
        "knowledge": "Hypertension Hypertension  In 2017, with the change in definitions for hypertension, 46% of people in the United States are affected.  African-American adults in the United States have among the highest rates of hypertension in the world at 44%.  It is also more common in Filipino Americans and less common in US whites and Mexican Americans.  Differences in hypertension rates are multifactorial and under study. Rates of high blood pressure in children and adolescents have increased in the last 20 years in the United States.  Childhood hypertension, particularly in pre-adolescents, is more often secondary to an underlying disorder than in adults.  Kidney disease is the most common secondary cause of hypertension in children and adolescents Hypertension Hypertension ",
        "response": "Keep monitoring your blood pressure regularly and contact your doctor if it keeps increasing."
    },
    {
        "dialog": [
            "Hello Medi, can you tell me more about hypertension?",
            "Hi, hypertension is also known as high blood pressure, which can cause serious health problems like heart attack and stroke.",
            "Who is at risk of hypertension?",
            "Several factors can increase your risk of hypertension, including age, family history, obesity, and lack of physical activity.",
            "How can I prevent hypertension?",
            "You can reduce your risk of developing hypertension by maintaining a healthy weight, regular exercise, a healthy diet, and limiting alcohol consumption.",
            "Can hypertension be cured?",
            "Unfortunately, hypertension cannot be cured, but it can be managed with a combination of lifestyle changes and medication.",
            "I see. Thank you, Medi. How often should I check my blood pressure?"
        ],
        "knowledge": "Hypertension Hypertension  In 2017, with the change in definitions for hypertension, 46% of people in the United States are affected.  African-American adults in the United States have among the highest rates of hypertension in the world at 44%.  It is also more common in Filipino Americans and less common in US whites and Mexican Americans.  Differences in hypertension rates are multifactorial and under study. Rates of high blood pressure in children and adolescents have increased in the last 20 years in the United States.  Childhood hypertension, particularly in pre-adolescents, is more often secondary to an underlying disorder than in adults.  Kidney disease is the most common secondary cause of hypertension in children and adolescents Hypertension Hypertension ",
        "response": "You should check your blood pressure regularly, at least once a year, or more often if your doctor suggests it."
    },
    {
        "dialog": [
            "Hi Medi, I just had a medical procedure. What should I do now?",
            "Hello, you should take care of your wound, follow the instructions from your doctor, and get enough rest.",
            "Is there anything else I can do for a quicker recovery?",
            "Yes, you can follow a healthy diet, do gentle exercises, and avoid smoking and alcohol.",
            "What kind of exercises can I do?",
            "You should start with simple exercises like walking and stretching, and gradually increase the intensity and duration.",
            "What should I eat?",
            "You should eat a well-balanced diet with plenty of fruits, vegetables, whole grains, lean protein, and healthy fats.",
            "Thank you, Medi. How long will it take for me to recover fully?"
        ],
        "knowledge": "Medical Procedure Medical Procedure After a medical procedure, it's essential to follow the instructions of your doctor to promote healing and reduce the risk of complications.  You should take care of your wound, get enough rest, eat a healthy diet, do gentle exercises, and avoid smoking and alcohol.  The length of time it takes to recover fully depends on the type of procedure and your overall health, but most people can resume their normal activities within a few days to a few weeks.  If you have any concerns about your recovery, you should contact your doctor.",
        "response": "The length of time it takes to recover fully depends on the type of procedure and your overall health, but most people can resume their normal activities within a few days to a few weeks. If you have any concerns about your recovery, you should contact your doctor."
    },
    {
        "dialog": [
            "Hi Medi, I have been experiencing some headaches and fatigue.",
            "Hello, I am here to help. Can you tell me more about your symptoms?",
            "I feel tired all the time and I get frequent headaches.",
            "How is your diet and lifestyle?",
            "I don't really have the time to exercise and my diet isn't that great either.",
            "I see. Based on your symptoms, you may have hypertension. It is important to make lifestyle changes and monitor your blood pressure regularly.",
            "What kind of lifestyle changes should I make?",
            "You should aim for a balanced diet with less salt and saturated fats. Also, regular exercise can help to lower your blood pressure.",
            "Thanks Medi! How often should I monitor my blood pressure?"
        ],
        "knowledge": "Hypertension Hypertension  In 2017, with the change in definitions for hypertension, 46% of people in the United States are affected.  African-American adults in the United States have among the highest rates of hypertension in the world at 44%.  It is also more common in Filipino Americans and less common in US whites and Mexican Americans.  Differences in hypertension rates are multifactorial and under study. Rates of high blood pressure in children and adolescents have increased in the last 20 years in the United States.  Childhood hypertension, particularly in pre-adolescents, is more often secondary to an underlying disorder than in adults.  Kidney disease is the most common secondary cause of hypertension in children and adolescents Hypertension Hypertension",
        "response": "You should monitor your blood pressure regularly, once every few weeks or as advised by your doctor."
    },
    {
        "dialog": [
            "Hi Medi, I have a few questions about hypertension.",
            "Sure, I'm here to help with any questions you may have.",
            "What exactly is hypertension?",
            "It is a condition where the blood pressure in your arteries is consistently high.",
            "How can I tell if I have hypertension?",
            "You may not have any symptoms at first, so it is important to have your blood pressure checked regularly.",
            "What are some of the risk factors for hypertension?",
            "Factors such as age, family history, being overweight, and a lack of physical activity can increase your risk for hypertension.",
            "Thanks for the information, Medi. Is hypertension treatable?"
        ],
        "knowledge": "Hypertension Hypertension  In 2017, with the change in definitions for hypertension, 46% of people in the United States are affected.  African-American adults in the United States have among the highest rates of hypertension in the world at 44%.  It is also more common in Filipino Americans and less common in US whites and Mexican Americans.  Differences in hypertension rates are multifactorial and under study. Rates of high blood pressure in children and adolescents have increased in the last 20 years in the United States.  Childhood hypertension, particularly in pre-adolescents, is more often secondary to an underlying disorder than in adults.  Kidney disease is the most common secondary cause of hypertension in children and adolescents Hypertension Hypertension",
        "response": "Yes, hypertension can be treated with lifestyle changes and medication."
    },
    {
        "dialog": [
            "Hi Medi, I recently had a medical procedure and I am not sure what kind of physical activity I can do.",
            "Hello! It's important to take it easy after a medical procedure.",
            "I understand that, but I don't want to be completely inactive. What kind of physical activity can I do?",
            "It depends on the type of procedure you had, but light exercise such as walking or yoga can be beneficial.",
            "How long should I wait before engaging in physical activity again?",
            "You should wait until your doctor gives you the green light to resume physical activity.",
            "What kind of diet should I have after a medical procedure?",
            "A balanced diet with plenty of fruits, vegetables, and lean proteins can help with the healing process.",
            "Thanks for the advice, Medi. Is there anything else I should keep in mind?"
        ],
        "knowledge": "Medical Procedure Medical Procedure  A medical procedure is a course of action intended to achieve a result in the delivery of healthcare. A medical procedure with the intention of determining, measuring, or diagnosing a patient condition or parameter is also called a medical test.  A medical procedure with the intention of preventing, impeding, or treating a disease or pathological condition is also called a medical intervention. Medical procedures are often categorized by their complexity, invasiveness, and urgency. Medical Procedure Medical Procedure",
        "response": "It's important to follow your doctor's instructions and to rest as much as possible after a medical procedure."
    }
]