[
    {
        "dialog": [
            "Hello Medi, I have a symptom that I'm worried about.",
            "Sure, please tell me about the symptoms you are experiencing.",
            "I feel thirsty all the time, even when I drink a lot of water.",
            "Do you also feel the need to urinate frequently?",
            "Yes, I do. Why is that happening?",
            "These symptoms may indicate that you have high blood sugar. I advise you to see a doctor immediately to run some tests.",
            "What can I do to lower my blood sugar?",
            "This depends on the cause of your high blood sugar. A doctor will give you a specific treatment plan based on your individual case.",
            "I see. Thank you for your advice, Medi. I will see a doctor soon."
        ],
        "knowledge": "Diabetes Diabetes Insulin can inhibit the breakdown of glycogen or the process of gluconeogenesis, it can stimulate the transport of glucose into fat and muscle cells, and it can stimulate the storage of glucose in the form of glycogen. Insulin is released into the blood by beta cells, found in the islets of Langerhans in the pancreas, in response to rising levels of blood glucose, typically after eating. Insulin is used by about two-thirds of the body's cells to absorb glucose from the blood for use as fuel, for conversion to other needed molecules, or for storage. Lower glucose levels result in decreased insulin release from the beta cells and in the breakdown of glycogen to glucose. This process is mainly controlled by the hormone glucagon, which acts in the opposite manner to insulin. If the amount of insulin available is insufficient, or if cells respond poorly to the effects of insulin, or if the insulin itself is defective, then glucose is not absorbed properly by the body cells that require it, and is not stored appropriately in the liver and muscles. The net effect is persistently high levels of blood glucose, poor protein synthesis, and other metabolic derangements, such as metabolic acidosis in cases of complete insulin deficiency Diabetes Diabetes",
        "response": "You should definitely see a doctor as soon as possible to get a diagnosis and treatment plan."
    },
    {
        "dialog": [
            "Hi Medi, I have a question about diabetes.",
            "Sure, I'm happy to answer any questions you may have.",
            "I've heard that people with diabetes need to be careful about their diet. What should they avoid?",
            "People with diabetes should avoid sugary foods and drinks, as well as highly processed foods.",
            "What foods are good for people with diabetes?",
            "Foods that are high in fiber, such as vegetables, fruits, and whole grains, are good for people with diabetes. They can also eat lean proteins and healthy fats.",
            "What about carbohydrates?",
            "Carbohydrates should be consumed in moderation, especially simple carbohydrates like those found in white bread, pasta, and rice.",
            "I see. Thank you for answering my questions, Medi."
        ],
        "knowledge": "Diabetes Diabetes Insulin can inhibit the breakdown of glycogen or the process of gluconeogenesis, it can stimulate the transport of glucose into fat and muscle cells, and it can stimulate the storage of glucose in the form of glycogen. Insulin is released into the blood by beta cells, found in the islets of Langerhans in the pancreas, in response to rising levels of blood glucose, typically after eating. Insulin is used by about two-thirds of the body's cells to absorb glucose from the blood for use as fuel, for conversion to other needed molecules, or for storage. Lower glucose levels result in decreased insulin release from the beta cells and in the breakdown of glycogen to glucose. This process is mainly controlled by the hormone glucagon, which acts in the opposite manner to insulin. If the amount of insulin available is insufficient, or if cells respond poorly to the effects of insulin, or if the insulin itself is defective, then glucose is not absorbed properly by the body cells that require it, and is not stored appropriately in the liver and muscles. The net effect is persistently high levels of blood glucose, poor protein synthesis, and other metabolic derangements, such as metabolic acidosis in cases of complete insulin deficiency Diabetes Diabetes",
        "response": "You're welcome. I'm always happy to help with any questions you have."
    },
    {
        "dialog": [
            "Hi Medi, I just had a medical procedure. What should I do to recover?",
            "Congratulations! After any medical procedure, it's important to follow your doctor's advice to ensure proper recovery.",
            "Is there anything I can do to help speed up the recovery process?",
            "You should make sure you get plenty of rest and follow any physical therapy or exercise plans your doctor gives you. Eating a healthy diet and staying hydrated will also help your body recover.",
            "What kind of foods should I be eating?",
            "You should eat foods that are high in protein, vitamins, and minerals. This will help your body rebuild tissue and regain strength.",
            "What about exercise?",
            "You should follow the exercise plan your doctor gives you. This may include light exercise like walking or stretching, or more intense physical therapy exercises.",
            "I see. Thank you for your advice, Medi."
        ],
        "knowledge": "Diabetes Diabetes Insulin can inhibit the breakdown of glycogen or the process of gluconeogenesis, it can stimulate the transport of glucose into fat and muscle cells, and it can stimulate the storage of glucose in the form of glycogen. Insulin is released into the blood by beta cells, found in the islets of Langerhans in the pancreas, in response to rising levels of blood glucose, typically after eating. Insulin is used by about two-thirds of the body's cells to absorb glucose from the blood for use as fuel, for conversion to other needed molecules, or for storage. Lower glucose levels result in decreased insulin release from the beta cells and in the breakdown of glycogen to glucose. This process is mainly controlled by the hormone glucagon, which acts in the opposite manner to insulin. If the amount of insulin available is insufficient, or if cells respond poorly to the effects of insulin, or if the insulin itself is defective, then glucose is not absorbed properly by the body cells that require it, and is not stored appropriately in the liver and muscles. The net effect is persistently high levels of blood glucose, poor protein synthesis, and other metabolic derangements, such as metabolic acidosis in cases of complete insulin deficiency Diabetes Diabetes",
        "response": "You're welcome. I hope your recovery goes well."
    },
    {
        "dialog": [
            "Hi Medi, I have a high blood sugar level. What should I do?",
            "Hello, you should consult with a doctor about your condition.",
            "I am scared. Can you tell me more about high blood sugar level?",
            "High blood sugar level is a condition where the blood glucose level is higher than the normal range, which could cause complications.",
            "What kind of complications?",
            "Complications could include nerve damage, cardiovascular disease, kidney damage, and vision problems.",
            "That sounds very serious. Do you have any advice to prevent high blood sugar level?",
            "Maintaining a healthy diet and regular physical activity could help prevent high blood sugar levels.",
            "Okay. Thank you for your advice. I will try my best to follow it. Bye."
        ],
        "knowledge": "Diabetes Diabetes  Insulin can inhibit the breakdown of glycogen or the process of gluconeogenesis, it can stimulate the transport of glucose into fat and muscle cells, and it can stimulate the storage of glucose in the form of glycogen. Insulin is released into the blood by beta cells, found in the islets of Langerhans in the pancreas, in response to rising levels of blood glucose, typically after eating.  Insulin is used by about two-thirds of the body's cells to absorb glucose from the blood for use as fuel, for conversion to other needed molecules, or for storage.  Lower glucose levels result in decreased insulin release from the beta cells and in the breakdown of glycogen to glucose.  This process is mainly controlled by the hormone glucagon, which acts in the opposite manner to insulin. If the amount of insulin available is insufficient, or if cells respond poorly to the effects of insulin, or if the insulin itself is defective, then glucose is not absorbed properly by the body cells that require it, and is not stored appropriately in the liver and muscles.  The net effect is persistently high levels of blood glucose, poor protein synthesis, and other metabolic derangements, such as metabolic acidosis in cases of complete insulin deficiency Diabetes Diabetes",
        "response": "You're welcome. Good luck with your health."
    },
    {
        "dialog": [
            "Hi Medi, I want to know more about insulin.",
            "Hi. Do you have a specific question or just want a general explanation?",
            "Can you tell me how insulin works in the body?",
            "Insulin lowers blood glucose levels by stimulating cells in the liver, muscle, and fat tissues to take up glucose from the blood and store it as glycogen. When glucose levels are low, insulin secretion decreases.",
            "What happens if insulin is insufficient?",
            "If insulin is insufficient, glucose is not absorbed properly by body cells that require it. This leads to persistently high levels of blood glucose.",
            "Thanks for your explanation. One more question, what can cause insulin deficiency?",
            "Insulin deficiency can be caused by various factors, including autoimmune destruction of the beta cells in the pancreas, surgical removal of the pancreas, or genetic defects in insulin processing or secretion.",
            "I see. Thanks for the information. Have a nice day."
        ],
        "knowledge": "Diabetes Diabetes  Insulin can inhibit the breakdown of glycogen or the process of gluconeogenesis, it can stimulate the transport of glucose into fat and muscle cells, and it can stimulate the storage of glucose in the form of glycogen. Insulin is released into the blood by beta cells , found in the islets of Langerhans in the pancreas, in response to rising levels of blood glucose, typically after eating.  Insulin is used by about two-thirds of the body's cells to absorb glucose from the blood for use as fuel, for conversion to other needed molecules, or for storage.  Lower glucose levels result in decreased insulin release from the beta cells and in the breakdown of glycogen to glucose.  This process is mainly controlled by the hormone glucagon, which acts in the opposite manner to insulin. If the amount of insulin available is insufficient, or if cells respond poorly to the effects of insulin , or if the insulin itself is defective, then glucose is not absorbed properly by the body cells that require it, and is not stored appropriately in the liver and muscles.  The net effect is persistently high levels of blood glucose, poor protein synthesis, and other metabolic derangements, such as metabolic acidosis in cases of complete insulin deficiency Diabetes Diabetes",
        "response": "You're welcome. Have a nice day too."
    },
    {
        "dialog": [
            "Hi Medi, I just had a surgery. Can you give me some advice on my recovery?",
            "Hello. Sure, what kind of surgery did you have?",
            "I had a gastric bypass surgery for my obesity.",
            "In that case, you should follow a strict dietary plan to ensure proper recovery and weight loss.",
            "What kind of diet should I follow?",
            "You should eat small frequent meals with lean proteins, non-starchy vegetables, and avoid high-calorie foods.",
            "What about physical activity?",
            "You should start with light aerobic exercise and gradually increase intensity as you recover.",
            "Thanks for your advice. One more question, what kind of complications could happen after gastric bypass surgery?"
        ],
        "knowledge": "Obesity Obesity Obesity is a complex public health and policy problem because of its prevalence, costs, and health effects.  As such, managing it requires changes in the wider societal context and effort by communities, local authorities, and governments.  Public health efforts seek to understand and correct the environmental factors responsible for the increasing prevalence of obesity in the population.  Solutions look at changing the factors that cause excess food energy consumption and inhibit physical activity.  Efforts include federally reimbursed meal programs in schools, limiting direct junk food marketing to children, and decreasing access to sugar-sweetened beverages in schools.  The World Health Organization recommends the taxing of sugary drinks.  When constructing urban environments, efforts have been made to increase access to parks and to develop pedestrian routes Obesity Obesity",
        "response": "You're welcome. Good luck with your recovery."
    },
    {
        "dialog": [
            "Hello Medi, what is diabetes exactly?",
            "Diabetes is a chronic disease that affects your body's ability to process glucose.",
            "What are the symptoms of diabetes?",
            "The symptoms include excessive thirst, frequent urination, hunger, fatigue, and blurred vision.",
            "How can we prevent diabetes?",
            "We can prevent diabetes by maintaining a healthy weight, eating a balanced diet, exercising regularly, and avoiding tobacco.",
            "Can diabetes be cured by medication?",
            "Diabetes is a chronic condition that cannot be cured, but it can be managed with medication and lifestyle changes.",
            "Is it true that diabetes can lead to blindness and amputations? "
        ],
        "knowledge": "Diabetes Diabetes  Insulin can inhibit the breakdown of glycogen or the process of gluconeogenesis, it can stimulate the transport of glucose into fat and muscle cells, and it can stimulate the storage of glucose in the form of glycogen. Insulin is released into the blood by beta cells , found in the islets of Langerhans in the pancreas, in response to rising levels of blood glucose, typically after eating.  Insulin is used by about two-thirds of the body's cells to absorb glucose from the blood for use as fuel, for conversion to other needed molecules, or for storage.  Lower glucose levels result in decreased insulin release from the beta cells and in the breakdown of glycogen to glucose.  This process is mainly controlled by the hormone glucagon, which acts in the opposite manner to insulin. If the amount of insulin available is insufficient, or if cells respond poorly to the effects of insulin , or if the insulin itself is defective, then glucose is not absorbed properly by the body cells that require it, and is not stored appropriately in the liver and muscles.  The net effect is persistently high levels of blood glucose, poor protein synthesis, and other metabolic derangements, such as metabolic acidosis in cases of complete insulin deficiency Diabetes Diabetes",
        "response": "Yes, diabetes can lead to complications such as blindness and amputations if not managed properly."
    },
    {
        "dialog": [
            "Hi Medi, I have just been diagnosed with type 2 diabetes. What should I do?",
            "First, you should monitor your blood sugar regularly and maintain a healthy weight.",
            "What should I eat?",
            "You should eat a balanced diet that includes healthy carbs, such as fruits, vegetables, and whole grains, and avoid sugary drinks and processed foods.",
            "Can I still exercise?",
            "Yes, physical activity is important for managing diabetes. You should aim for 30 minutes of exercise most days of the week.",
            "Can I still enjoy sweets?",
            "You can still enjoy sweets, but in moderation. It's important to control the portion size and eat them as part of a balanced meal.",
            "What about medication?"
        ],
        "knowledge": "Diabetes Diabetes  Insulin can inhibit the breakdown of glycogen or the process of gluconeogenesis, it can stimulate the transport of glucose into fat and muscle cells, and it can stimulate the storage of glucose in the form of glycogen. Insulin is released into the blood by beta cells , found in the islets of Langerhans in the pancreas, in response to rising levels of blood glucose, typically after eating.  Insulin is used by about two-thirds of the body's cells to absorb glucose from the blood for use as fuel, for conversion to other needed molecules, or for storage.  Lower glucose levels result in decreased insulin release from the beta cells and in the breakdown of glycogen to glucose.  This process is mainly controlled by the hormone glucagon, which acts in the opposite manner to insulin. If the amount of insulin available is insufficient, or if cells respond poorly to the effects of insulin , or if the insulin itself is defective, then glucose is not absorbed properly by the body cells that require it, and is not stored appropriately in the liver and muscles.  The net effect is persistently high levels of blood glucose, poor protein synthesis, and other metabolic derangements, such as metabolic acidosis in cases of complete insulin deficiency Diabetes Diabetes",
        "response": "Your doctor may prescribe medication to help manage your blood sugar levels if necessary."
    },
    {
        "dialog": [
            "Hi Medi, I just had a medical procedure to remove a tumor. What should I do now?",
            "It's important to take care of yourself after a medical procedure. Rest and avoid strenuous physical activity for a few days.",
            "What should I eat?",
            "You should eat a healthy diet that includes plenty of fruits, vegetables, and lean protein.",
            "Can I drink alcohol?",
            "It's best to avoid alcohol for a few days after the procedure.",
            "What about medication?",
            "Make sure to follow your doctor's instructions for any medication prescribed after the procedure.",
            "Can I go back to work?"
        ],
        "knowledge": "Diabetes Diabetes  Insulin can inhibit the breakdown of glycogen or the process of gluconeogenesis, it can stimulate the transport of glucose into fat and muscle cells, and it can stimulate the storage of glucose in the form of glycogen. Insulin is released into the blood by beta cells , found in the islets of Langerhans in the pancreas, in response to rising levels of blood glucose, typically after eating.  Insulin is used by about two-thirds of the body's cells to absorb glucose from the blood for use as fuel, for conversion to other needed molecules, or for storage.  Lower glucose levels result in decreased insulin release from the beta cells and in the breakdown of glycogen to glucose.  This process is mainly controlled by the hormone glucagon, which acts in the opposite manner to insulin. If the amount of insulin available is insufficient, or if cells respond poorly to the effects of insulin , or if the insulin itself is defective, then glucose is not absorbed properly by the body cells that require it, and is not stored appropriately in the liver and muscles.  The net effect is persistently high levels of blood glucose, poor protein synthesis, and other metabolic derangements, such as metabolic acidosis in cases of complete insulin deficiency Diabetes Diabetes",
        "response": "Your doctor will give you instructions on when it's safe to return to work after the procedure."
    },
    {
        "dialog": [
            "Hello Medi, I have a high level of blood glucose.",
            "I see. How high is your blood glucose level?",
            "It's 230 mg/dL, and it makes me worried.",
            "First, you should know the normal level of blood glucose 70-99 mg/dL, and your glucose level is higher.",
            "Okay, what should I do to lower it?",
            "You should take less carbohydrate and sugar, and increase the amount of fiber and water you consume.",
            "I understand, but what about insulin?",
            "Insulin could be a good option, but you should ask your doctor to be sure",
            "Thank you for your advice, Medi. What are the other ways I can manage my blood glucose level?"
        ],
        "knowledge": "Diabetes Diabetes  Insulin can inhibit the breakdown of glycogen or the process of gluconeogenesis, it can stimulate the transport of glucose into fat and muscle cells, and it can stimulate the storage of glucose in the form of glycogen. Insulin is released into the blood by beta cells , found in the islets of Langerhans in the pancreas, in response to rising levels of blood glucose, typically after eating.  Insulin is used by about two-thirds of the body's cells to absorb glucose from the blood for use as fuel, for conversion to other needed molecules, or for storage.  Lower glucose levels result in decreased insulin release from the beta cells and in the breakdown of glycogen to glucose.  This process is mainly controlled by the hormone glucagon, which acts in the opposite manner to insulin. If the amount of insulin available is insufficient, or if cells respond poorly to the effects of insulin , or if the insulin itself is defective, then glucose is not absorbed properly by the body cells that require it, and is not stored appropriately in the liver and muscles.  The net effect is persistently high levels of blood glucose, poor protein synthesis, and other metabolic derangements, such as metabolic acidosis in cases of complete insulin deficiency Diabetes Diabetes",
        "response": "To manage your blood glucose level, you can try to have a balanced diet, increase physical activity and reduce stress. You can also take medication if necessary."
    },
    {
        "dialog": [
            "Hello Medi, I want to know how insulin works in the body",
            "Insulin is a hormone that regulates the level of glucose in the blood.",
            "How does insulin regulate the level of glucose in the blood?",
            "Insulin stimulates cells in the liver, muscles and fat to absorb glucose from the blood and use it for energy or storage.",
            "What happens if there is not enough insulin in the body?",
            "If there is not enough insulin, the glucose level in the blood will increase and cause damage to the organs in the body.",
            "What is the opposite hormone of insulin and how does it work?",
            "The opposite hormone of insulin is glucagon, which stimulates the liver to release glucose into the blood when the glucose level is low.",
            "Thanks for your explanation, Medi. Can you tell me more about type 1 and type 2 diabetes?"
        ],
        "knowledge": "Diabetes Diabetes  The defective responsiveness of body tissues to insulin is believed to involve the insulin receptor.  However, the specific defects are not known.  Diabetes mellitus cases due to a known defect are classified separately.  Type 2 diabetes is the most common type of diabetes mellitus accounting for 95% of diabetes.  Many people with type 2 diabetes have evidence of prediabetes  before meeting the criteria for type 2 diabetes.  The progression of prediabetes to overt type 2 diabetes can be slowed or reversed by lifestyle changes or medications that improve insulin sensitivity or reduce the liver's glucose production. Type 2 diabetes is primarily due to lifestyle factors and genetics Diabetes Diabetes",
        "response": "Type 1 diabetes is an autoimmune disease that destroys the beta cells in the pancreas, leading to a lack of insulin production. Type 2 diabetes is primarily due to lifestyle factors and genetics. It is characterized by insulin resistance and a reduced response to insulin secretion."
    },
    {
        "dialog": [
            "Hi Medi, I just had a surgery for my appendicitis.",
            "How are you feeling after the surgery?",
            "I feel okay but a little bit weak and tired.",
            "After surgery, it's important to rest and take care of yourself. Do you have any questions?",
            "Yes, I want to know what kind of food I should eat after the surgery.",
            "You should eat foods that are easy to digest and promote healing, such as lean protein, whole grains, fruits and vegetables.",
            "What about physical activity after the surgery?",
            "You should avoid strenuous physical activity and lifting heavy objects for several weeks after the surgery. Walking is a good exercise to promote healing.",
            "Thanks for your advice, Medi. What are the possible complications after the surgery?"
        ],
        "knowledge": "Appendicitis Appendicitis  The complications of appendicitis can be severe and include perforation, abscess, peritonitis, and sepsis.  Inflammation of the appendix is usually treated with antibiotics and surgical removal of the appendix.  The surgery is typically successful and carries a low risk of complications.  After the surgery, patients may experience mild pain or discomfort and may require pain management.  They should also take care to avoid strenuous physical activity and lifting heavy objects to promote healing.  Walking is a good exercise to promote healing after surgery. Appendicitis Appendicitis",
        "response": "Possible complications after the surgery include infection, bleeding, and damage to nearby organs. If you experience fever, severe pain or bleeding, you should contact your doctor immediately."
    },
    {
        "dialog": [
            "Hello Medi, can you explain to me what insulin is?",
            "Of course, insulin is a hormone that helps regulate blood sugar levels in the body",
            "How does it work?",
            "Insulin stimulates the uptake of glucose by cells in the body such as fat and muscle cells",
            "What happens if we don't have enough insulin?",
            "If we don't have enough insulin, glucose cannot be taken up by the cells and stays in the bloodstream",
            "What are the symptoms of not having enough insulin?",
            "Symptoms of not having enough insulin include increased thirst, frequent urination, and blurred vision",
            "Does insulin have any other functions? "
        ],
        "knowledge": "Diabetes Diabetes  Insulin can inhibit the breakdown of glycogen or the process of gluconeogenesis, it can stimulate the transport of glucose into fat and muscle cells, and it can stimulate the storage of glucose in the form of glycogen. Insulin is released into the blood by beta cells , found in the islets of Langerhans in the pancreas, in response to rising levels of blood glucose, typically after eating.  Insulin is used by about two-thirds of the body's cells to absorb glucose from the blood for use as fuel, for conversion to other needed molecules, or for storage.  Lower glucose levels result in decreased insulin release from the beta cells and in the breakdown of glycogen to glucose.  This process is mainly controlled by the hormone glucagon, which acts in the opposite manner to insulin. If the amount of insulin available is insufficient, or if cells respond poorly to the effects of insulin , or if the insulin itself is defective, then glucose is not absorbed properly by the body cells that require it, and is not stored appropriately in the liver and muscles.  The net effect is persistently high levels of blood glucose, poor protein synthesis, and other metabolic derangements, such as metabolic acidosis in cases of complete insulin deficiency Diabetes Diabetes",
        "response": "Yes, insulin can also inhibit the breakdown of glycogen or the process of gluconeogenesis, it can stimulate the storage of glucose in the form of glycogen and is used by about two-thirds of the body's cells to absorb glucose from the blood for use as fuel, for conversion to other needed molecules, or for storage."
    },
    {
        "dialog": [
            "Hello Medi, I have diabetes type 2 and I want to know more about it.",
            "I am here to help. Diabetes type 2 is a condition where the body doesn't use insulin properly",
            "What are the symptoms of diabetes type 2?",
            "Symptoms include increased thirst, frequent urination, and unexplained weight loss",
            "How can I manage my diabetes?",
            "You can manage your diabetes by monitoring your blood sugar levels, eating a healthy diet, and getting regular exercise",
            "Can medication help with diabetes type 2?",
            "Yes, medication such as oral medication and insulin injections can be used to manage diabetes type 2",
            "What are the long-term effects of diabetes type 2?"
        ],
        "knowledge": "Diabetes Diabetes  The defective responsiveness of body tissues to insulin is believed to involve the insulin receptor.  However, the specific defects are not known.  Diabetes mellitus cases due to a known defect are classified separately.  Type 2 diabetes is the most common type of diabetes mellitus accounting for 95% of diabetes.  Many people with type 2 diabetes have evidence of prediabetes  before meeting the criteria for type 2 diabetes.  The progression of prediabetes to overt type 2 diabetes can be slowed or reversed by lifestyle changes or medications that improve insulin sensitivity or reduce the liver's glucose production. Type 2 diabetes is primarily due to lifestyle factors and genetics Diabetes Diabetes",
        "response": "Long-term effects of diabetes type 2 include damage to the eyes, kidneys, and nerves, as well as an increased risk of heart disease and stroke."
    },
    {
        "dialog": [
            "Hello Medi, I just had a medical procedure and I want to know how to recover.",
            "Of course. Can you tell me more about your medical procedure?",
            "I just had surgery for my knee and it's still painful",
            "It's normal to experience pain after surgery. You should rest and keep your knee elevated to reduce swelling",
            "Can I exercise to help with my recovery?",
            "Yes, you can start with light exercises such as walking and gradually increase the intensity over time",
            "How can I prevent complications?",
            "You can prevent complications by following your doctor's instructions, taking any prescribed medication, and monitoring your progress",
            "When can I return to my normal activities?"
        ],
        "knowledge": "Knee surgery Knee surgery  Recovery from knee surgery can take several weeks to several months.  During this time, it's important to follow your doctor's instructions for care and rehabilitation.  You may need to use crutches or a walker for a few days or weeks after surgery.  Physical therapy is often recommended to help strengthen the muscles around the knee and improve flexibility.  After surgery, it's important to gradually return to your normal activities to avoid reinjury.  Your doctor will give you specific instructions on when you can return to work, exercise, and other activities.  In some cases, additional surgery may be needed if complications arise. Knee surgery Knee surgery",
        "response": "You can return to your normal activities when your doctor gives you permission and you feel comfortable doing so. It's important to gradually increase your activity level to avoid reinjury."
    },
    {
        "dialog": [
            "Hi Medi, can you help me? I think I have some symptoms of diabetes.",
            "Hello! Sure, I am here to help you. What are your symptoms?",
            "I feel very thirsty all the time, and I need to urinate frequently. I also feel very tired and hungry even after eating.",
            "I see. Based on your symptoms, you may have diabetes. You should see a doctor to get a definitive diagnosis and treatment plan.",
            "Is there anything I can do to manage my symptoms?",
            "Yes, you can make some lifestyle changes like reducing your sugar intake and increasing physical activity. This can help manage your symptoms and prevent further complications.",
            "Thank you for your advice, Medi. I will see a doctor and make some lifestyle changes.",
            "You're welcome. Take care!"
        ],
        "knowledge": "Diabetes Diabetes  Insulin can inhibit the breakdown of glycogen or the process of gluconeogenesis, it can stimulate the transport of glucose into fat and muscle cells, and it can stimulate the storage of glucose in the form of glycogen. Insulin is released into the blood by beta cells , found in the islets of Langerhans in the pancreas, in response to rising levels of blood glucose, typically after eating.  Insulin is used by about two-thirds of the body's cells to absorb glucose from the blood for use as fuel, for conversion to other needed molecules, or for storage.  Lower glucose levels result in decreased insulin release from the beta cells and in the breakdown of glycogen to glucose.  This process is mainly controlled by the hormone glucagon, which acts in the opposite manner to insulin. If the amount of insulin available is insufficient, or if cells respond poorly to the effects of insulin , or if the insulin itself is defective, then glucose is not absorbed properly by the body cells that require it, and is not stored appropriately in the liver and muscles.  The net effect is persistently high levels of blood glucose, poor protein synthesis, and other metabolic derangements, such as metabolic acidosis in cases of complete insulin deficiency Diabetes Diabetes",
        "response": "You should see a doctor to get a definitive diagnosis and treatment plan"
    },
    {
        "dialog": [
            "Hi Medi, I have a question about insulin. What does it do?",
            "Hello! Insulin is a hormone produced by the pancreas that helps regulate blood sugar levels in the body.",
            "How does it do that?",
            "Insulin can stimulate the transport of glucose into fat and muscle cells, and it can stimulate the storage of glucose in the form of glycogen. It is used by about two-thirds of the body's cells to absorb glucose from the blood for use as fuel, for conversion to other needed molecules, or for storage.",
            "What happens if there is not enough insulin in the body?",
            "If the amount of insulin available is insufficient, or if cells respond poorly to the effects of insulin, then glucose is not absorbed properly by the body cells that require it, and is not stored appropriately in the liver and muscles. The net effect is persistently high levels of blood glucose, poor protein synthesis, and other metabolic derangements, such as metabolic acidosis in cases of complete insulin deficiency",
            "Thank you for your explanation, Medi. I understand more about insulin now.",
            "You're welcome. Feel free to ask if you have any more questions!"
        ],
        "knowledge": "Diabetes Diabetes  Insulin can inhibit the breakdown of glycogen or the process of gluconeogenesis, it can stimulate the transport of glucose into fat and muscle cells, and it can stimulate the storage of glucose in the form of glycogen. Insulin is released into the blood by beta cells , found in the islets of Langerhans in the pancreas, in response to rising levels of blood glucose, typically after eating.  Insulin is used by about two-thirds of the body's cells to absorb glucose from the blood for use as fuel, for conversion to other needed molecules, or for storage.  Lower glucose levels result in decreased insulin release from the beta cells and in the breakdown of glycogen to glucose.  This process is mainly controlled by the hormone glucagon, which acts in the opposite manner to insulin. If the amount of insulin available is insufficient, or if cells respond poorly to the effects of insulin , or if the insulin itself is defective, then glucose is not absorbed properly by the body cells that require it, and is not stored appropriately in the liver and muscles.  The net effect is persistently high levels of blood glucose, poor protein synthesis, and other metabolic derangements, such as metabolic acidosis in cases of complete insulin deficiency Diabetes Diabetes",
        "response": "Insulin helps regulate blood sugar levels in the body by stimulating the transport of glucose into fat and muscle cells, and it can stimulate the storage of glucose in the form of glycogen"
    },
    {
        "dialog": [
            "Hi Medi, I just had a medical procedure. Do you have any advice for me?",
            "Hello! Sure, I am here to help you. What kind of procedure did you have?",
            "I had surgery to remove a tumor from my pancreas.",
            "Wow, that sounds like a serious procedure. How are you feeling?",
            "I am feeling okay, but I want to make sure I am doing everything I can to recover quickly.",
            "That's understandable. It's important to follow your doctor's instructions and take it easy for a while. Make sure you get plenty of rest and eat a healthy diet. You may also want to consider doing some light exercise as your body allows.",
            "Thank you for your advice, Medi. I will make sure to follow it.",
            "You're welcome. Take care and don't hesitate to reach out if you need any more assistance!"
        ],
        "knowledge": "Diabetes Diabetes  Insulin can inhibit the breakdown of glycogen or the process of gluconeogenesis, it can stimulate the transport of glucose into fat and muscle cells, and it can stimulate the storage of glucose in the form of glycogen. Insulin is released into the blood by beta cells , found in the islets of Langerhans in the pancreas, in response to rising levels of blood glucose, typically after eating.  Insulin is used by about two-thirds of the body's cells to absorb glucose from the blood for use as fuel, for conversion to other needed molecules, or for storage.  Lower glucose levels result in decreased insulin release from the beta cells and in the breakdown of glycogen to glucose.  This process is mainly controlled by the hormone glucagon, which acts in the opposite manner to insulin. If the amount of insulin available is insufficient, or if cells respond poorly to the effects of insulin , or if the insulin itself is defective, then glucose is not absorbed properly by the body cells that require it, and is not stored appropriately in the liver and muscles.  The net effect is persistently high levels of blood glucose, poor protein synthesis, and other metabolic derangements, such as metabolic acidosis in cases of complete insulin deficiency Diabetes Diabetes",
        "response": "It's important to follow your doctor's instructions and take it easy for a while. Make sure you get plenty of rest and eat a healthy diet. You may also want to consider doing some light exercise as your body allows."
    },
    {
        "dialog": [
            "Hi Medi, I'm feeling thirsty all the time.",
            "Hello, it can be a sign of high blood sugar levels. Have you had your blood sugar checked?",
            "No, I haven't. What can I do to lower my blood sugar levels?",
            "You can try eating low-carb meals and incorporating exercise into your daily routine. Have you considered speaking with a doctor or nutritionist?",
            "Yes, I have. They suggested I take insulin injections. Is that necessary?",
            "It depends on the severity of your condition. Insulin injections are typically reserved for patients with persistently high blood sugar levels despite lifestyle changes and oral medication, as they can help improve insulin sensitivity.",
            "I see. I'll keep that in mind. So, how does insulin work?",
            "Insulin helps the body's cells absorb glucose from the bloodstream for use as fuel, storage, or conversion to other needed molecules. It can also stimulate the storage of glucose in the form of glycogen and inhibit the breakdown of glycogen. Insulin is released by the pancreas in response to rising blood glucose levels.",
            "Thanks for explaining, Medi. Can diabetes affect other parts of my body?"
        ],
        "knowledge": "Diabetes Diabetes  High blood sugar levels can cause damage to the heart, blood vessels, kidneys, eyes, and nerves. Individuals with diabetes are at a higher risk for heart disease, stroke, and kidney failure. They may also experience vision loss, foot ulcers, and neuropathy. Poorly controlled diabetes can lead to complications such as ketoacidosis or hyperosmolar hyperglycemic state, which are medical emergencies. Diabetes Diabetes",
        "response": "Yes, diabetes can cause damage to the heart, blood vessels, kidneys, eyes, and nerves. It's important to maintain good blood sugar control to prevent these complications."
    },
    {
        "dialog": [
            "Hi Medi, I had a glucose tolerance test yesterday.",
            "Hi there, how did it go?",
            "It was very uncomfortable. I had to drink a really sugary drink and wait for hours.",
            "Yes, that's how the test works. It's used to diagnose gestational diabetes or prediabetes. What were your results?",
            "They said I have prediabetes. What can I do to prevent it from progressing to type 2 diabetes?",
            "Lifestyle changes are the first line of treatment for prediabetes. You can try incorporating more physical activity into your day and eating a balanced diet with less sugar and refined carbohydrates. You can also consider seeing a nutritionist for personalized advice. Some medications can also help prevent the progression of prediabetes to diabetes.",
            "I see. I'll try to make some changes to my diet and exercise routine. What are some common complications of diabetes?",
            "Complications of diabetes include heart disease, stroke, kidney failure, vision loss, foot ulcers, neuropathy, and more. It's important to maintain good blood sugar control and monitor for these complications.",
            "Thanks for the advice, Medi. Do you have any tips for managing my blood sugar levels?"
        ],
        "knowledge": "Diabetes Diabetes  Lifestyle changes such as eating a balanced diet, exercising, and losing weight can help control blood sugar levels in prediabetes and type 2 diabetes. Oral medications such as metformin and sulfonylureas can also help. Blood sugar monitoring and regular check-ups with a doctor are important to prevent complications. Diabetes Diabetes",
        "response": "Yes, some tips for managing blood sugar levels include eating a balanced diet, exercising regularly, monitoring blood sugar levels, and taking medications as prescribed by a doctor. It's important to work with your healthcare team to find a plan that works for you."
    },
    {
        "dialog": [
            "Hi Medi, I just had surgery for my diabetes-related foot ulcer.",
            "Hi there, how are you feeling?",
            "I'm feeling okay, but my doctor said I need to make some lifestyle changes to prevent another ulcer from forming. What changes should I make?",
            "You can try checking your feet daily for any injuries or changes, wearing comfortable shoes and socks, maintaining good hygiene, and controlling your blood sugar levels through diet and medication. You may also benefit from seeing a podiatrist for specialized care.",
            "Thanks for the advice. What are some common complications of diabetic foot ulcers?",
            "Complications of diabetic foot ulcers include infection, gangrene, and amputation. It's important to monitor your feet and seek medical attention if you notice any changes or injuries.",
            "I didn't know it could be so serious. How can I prevent other complications of diabetes?",
            "Maintaining good blood sugar control through lifestyle changes and medication is key to preventing complications such as heart disease, stroke, kidney failure, and neuropathy. Regular check-ups with a doctor are also important to monitor for these complications.",
            "Thanks for all your help, Medi. You've been very informative."
        ],
        "knowledge": "Diabetes Diabetes  Foot ulcers are a common complication of diabetes that can lead to serious infection, gangrene, and amputation. They can be prevented by maintaining good blood sugar control, checking feet daily, wearing comfortable shoes and socks, and seeking specialized care from a podiatrist if necessary. Other complications of diabetes include heart disease, stroke, kidney failure, and neuropathy. Regular check-ups with a doctor are important to monitor for these complications. Diabetes Diabetes",
        "response": "No, that's all for now. Thanks for all your help, Medi."
    },
    {
        "dialog": [
            "Hello Medi, I have some symptoms like thirst and frequent urination",
            "Hi, I can help you with that. Can you tell me more about your symptoms?",
            "I feel very thirsty all the time and I have to go to the bathroom to urinate frequently",
            "I see, those are common symptoms of diabetes. Have you had your blood sugar checked?",
            "No, I haven't. Is it necessary?",
            "Yes, it is important to know your blood sugar level to determine if you have diabetes or not.",
            "I understand. If I have diabetes, what can I do to manage it?",
            "If you have diabetes, you will need to manage your blood sugar level through diet, exercise, and possibly medication. I can give you some guidelines and refer you to a specialist if necessary.",
            "Thank you, Medi. I will get my blood sugar checked."
        ],
        "knowledge": "Diabetes Diabetes Insulin can inhibit the breakdown of glycogen or the process of gluconeogenesis, it can stimulate the transport of glucose into fat and muscle cells, and it can stimulate the storage of glucose in the form of glycogen. Insulin is released into the blood by beta cells, found in the islets of Langerhans in the pancreas, in response to rising levels of blood glucose, typically after eating. Insulin is used by about two-thirds of the body's cells to absorb glucose from the blood for use as fuel, for conversion to other needed molecules, or for storage. Lower glucose levels result in decreased insulin release from the beta cells and in the breakdown of glycogen to glucose. This process is mainly controlled by the hormone glucagon, which acts in the opposite manner to insulin. If the amount of insulin available is insufficient, or if cells respond poorly to the effects of insulin, or if the insulin itself is defective, then glucose is not absorbed properly by the body cells that require it, and is not stored appropriately in the liver and muscles. The net effect is persistently high levels of blood glucose, poor protein synthesis, and other metabolic derangements, such as metabolic acidosis in cases of complete insulin deficiency Diabetes Diabetes",
        "response": "It is always a good idea to get your blood sugar checked if you have symptoms like thirst and frequent urination related to diabetes. If you have diabetes, managing your blood sugar level through diet, exercise, and medication is the key."
    },
    {
        "dialog": [
            "Hi Medi, I have been diagnosed with diabetes and I am struggling to manage it",
            "I am sorry to hear that. Managing diabetes can be challenging, but I am here to help you. What are your main concerns?",
            "I find it difficult to stick to a healthy diet and I am not sure which foods are good for me",
            "I understand. A healthy diet is crucial for people with diabetes. I can provide you with a meal plan and some guidelines on what to eat and what to avoid.",
            "That would be great. I also have trouble exercising regularly and I am not sure which exercises are safe for me",
            "Exercise is important for managing diabetes. I can give you some tips on how to exercise safely and refer you to a specialist if necessary.",
            "Thank you, Medi. I am also concerned about the long-term complications of diabetes",
            "The long-term complications of diabetes can be prevented or delayed by managing your blood sugar level and following your treatment plan. I can give you some information on the complications and how to prevent them.",
            "That would be very helpful. Thank you, Medi."
        ],
        "knowledge": "Diabetes Diabetes Insulin can inhibit the breakdown of glycogen or the process of gluconeogenesis, it can stimulate the transport of glucose into fat and muscle cells, and it can stimulate the storage of glucose in the form of glycogen. Insulin is released into the blood by beta cells, found in the islets of Langerhans in the pancreas, in response to rising levels of blood glucose, typically after eating. Insulin is used by about two-thirds of the body's cells to absorb glucose from the blood for use as fuel, for conversion to other needed molecules, or for storage. Lower glucose levels result in decreased insulin release from the beta cells and in the breakdown of glycogen to glucose. This process is mainly controlled by the hormone glucagon, which acts in the opposite manner to insulin. If the amount of insulin available is insufficient, or if cells respond poorly to the effects of insulin, or if the insulin itself is defective, then glucose is not absorbed properly by the body cells that require it, and is not stored appropriately in the liver and muscles. The net effect is persistently high levels of blood glucose, poor protein synthesis, and other metabolic derangements, such as metabolic acidosis in cases of complete insulin deficiency Diabetes Diabetes",
        "response": "Managing a healthy diet and regular exercise are important in managing diabetes, as well as being aware of the long-term complications of the disease. Together, we can work on strategies to help you manage your diabetes."
    },
    {
        "dialog": [
            "Hi Medi, I have just had a medical procedure to treat my diabetes",
            "Hi, how are you feeling after the procedure? What kind of procedure did you have?",
            "I am feeling a little tired, but overall, I am doing well. I had a procedure to insert an insulin pump",
            "An insulin pump is a device that delivers insulin directly into your body. It can help you manage your blood sugar level more effectively. Do you have any questions about how to use the insulin pump?",
            "Yes, I am not sure how to adjust the settings and how often I need to check my blood sugar level",
            "I can give you some instructions on how to use the insulin pump and how to adjust the settings. You will also need to check your blood sugar level regularly to make sure that the pump is working correctly.",
            "Thank you, Medi. I am also not sure about what foods I can eat with the insulin pump",
            "You can still eat a healthy diet with the insulin pump, but you will need to adjust your insulin dosage according to the amount of carbohydrates you eat. I can provide you with a meal plan and some guidelines on how to count carbohydrates.",
            "That would be very helpful. Thank you, Medi."
        ],
        "knowledge": "Diabetes Diabetes Insulin can inhibit the breakdown of glycogen or the process of gluconeogenesis, it can stimulate the transport of glucose into fat and muscle cells, and it can stimulate the storage of glucose in the form of glycogen. Insulin is released into the blood by beta cells, found in the islets of Langerhans in the pancreas, in response to rising levels of blood glucose, typically after eating. Insulin is used by about two-thirds of the body's cells to absorb glucose from the blood for use as fuel, for conversion to other needed molecules, or for storage. Lower glucose levels result in decreased insulin release from the beta cells and in the breakdown of glycogen to glucose. This process is mainly controlled by the hormone glucagon, which acts in the opposite manner to insulin. If the amount of insulin available is insufficient, or if cells respond poorly to the effects of insulin, or if the insulin itself is defective, then glucose is not absorbed properly by the body cells that require it, and is not stored appropriately in the liver and muscles. The net effect is persistently high levels of blood glucose, poor protein synthesis, and other metabolic derangements, such as metabolic acidosis in cases of complete insulin deficiency Diabetes Diabetes",
        "response": "An insulin pump can be an effective way to manage diabetes, but it is important to understand how to use it correctly and to adjust the settings according to your needs. I can provide you with instructions on how to use the pump and how to manage your diet with it."
    },
    {
        "dialog": [
            "Hi Medi, I have been feeling thirsty and tired lately.",
            "I see. Have you noticed any other symptoms?",
            "Yes, I have also been urinating more frequently.",
            "Based on your symptoms, it's possible that you have diabetes. I suggest you get your blood sugar levels checked.",
            "Oh no! I hope it's not serious. Can I prevent it with a healthy lifestyle?",
            "Yes, lifestyle changes like a balanced diet, regular exercise, and maintaining a healthy weight can help prevent type 2 diabetes.",
            "Thank you for your advice, Medi. Do you have any tips for a healthy diet?",
            "Sure, focus on whole grains, lean protein, fruits, and vegetables. Avoid sugary drinks and processed foods.",
            "Great, thank you. I will make sure to get my blood sugar levels checked."
        ],
        "knowledge": "Diabetes Diabetes  Insulin can inhibit the breakdown of glycogen or the process of gluconeogenesis, it can stimulate the transport of glucose into fat and muscle cells, and it can stimulate the storage of glucose in the form of glycogen. Insulin is released into the blood by beta cells , found in the islets of Langerhans in the pancreas, in response to rising levels of blood glucose, typically after eating.  Insulin is used by about two-thirds of the body's cells to absorb glucose from the blood for use as fuel, for conversion to other needed molecules, or for storage.  Lower glucose levels result in decreased insulin release from the beta cells and in the breakdown of glycogen to glucose.  This process is mainly controlled by the hormone glucagon, which acts in the opposite manner to insulin. If the amount of insulin available is insufficient, or if cells respond poorly to the effects of insulin , or if the insulin itself is defective, then glucose is not absorbed properly by the body cells that require it, and is not stored appropriately in the liver and muscles.  The net effect is persistently high levels of blood glucose, poor protein synthesis, and other metabolic derangements, such as metabolic acidosis in cases of complete insulin deficiency Diabetes Diabetes",
        "response": "Getting your blood sugar levels checked is a good idea to rule out diabetes. Lifestyle changes can help prevent type 2 diabetes."
    },
    {
        "dialog": [
            "Hi Medi, can you explain what insulin is and what it does in the body?",
            "Of course. Insulin is a hormone that regulates blood sugar levels. It helps the body use glucose for energy or store it for later.",
            "How does it do that?",
            "Insulin signals cells in the body to absorb glucose from the blood. It also inhibits the breakdown of glycogen and stimulates the storage of glucose in the form of glycogen.",
            "What if there is too much glucose in the blood?",
            "If there is too much glucose in the blood, insulin helps transport it into fat and muscle cells for storage or use as fuel. This helps lower blood sugar levels.",
            "What if there isn't enough insulin?",
            "If there isn't enough insulin or the body can't use it effectively, glucose can't be absorbed properly by the cells and remains in the blood, leading to high blood sugar levels. This can lead to diabetes.",
            "Thank you for explaining, Medi. That was very helpful"
        ],
        "knowledge": "Diabetes Diabetes  Insulin can inhibit the breakdown of glycogen or the process of gluconeogenesis, it can stimulate the transport of glucose into fat and muscle cells, and it can stimulate the storage of glucose in the form of glycogen. Insulin is released into the blood by beta cells , found in the islets of Langerhans in the pancreas, in response to rising levels of blood glucose, typically after eating.  Insulin is used by about two-thirds of the body's cells to absorb glucose from the blood for use as fuel, for conversion to other needed molecules, or for storage.  Lower glucose levels result in decreased insulin release from the beta cells and in the breakdown of glycogen to glucose.  This process is mainly controlled by the hormone glucagon, which acts in the opposite manner to insulin. If the amount of insulin available is insufficient, or if cells respond poorly to the effects of insulin , or if the insulin itself is defective, then glucose is not absorbed properly by the body cells that require it, and is not stored appropriately in the liver and muscles.  The net effect is persistently high levels of blood glucose, poor protein synthesis, and other metabolic derangements, such as metabolic acidosis in cases of complete insulin deficiency Diabetes Diabetes",
        "response": "Insulin is a hormone that regulates blood sugar levels. It signals cells to absorb glucose from the blood and inhibits the breakdown of glycogen. It can stimulate the transport of glucose into fat and muscle cells and stimulate the storage of glucose in the form of glycogen. If there isn't enough insulin, glucose can't be absorbed properly by the cells, leading to high blood sugar levels and diabetes."
    },
    {
        "dialog": [
            "Hi Medi, I recently had a medical procedure and was wondering if there are any lifestyle changes I should make.",
            "It depends on the procedure you had. Can you tell me more about it?",
            "I had a cardiac catheterization.",
            "After a cardiac catheterization, it's important to avoid strenuous activity for a few days. You should also avoid lifting heavy objects or doing any activity that causes strain.",
            "What about my diet?",
            "A heart-healthy diet is important after a cardiac catheterization. This includes foods that are low in saturated and trans fats, salt, and added sugars. You should also aim to eat more fruits, vegetables, whole grains, and lean protein.",
            "That makes sense. What about physical activity?",
            "Gradually increasing physical activity is important after a cardiac catheterization. Starting with light activities like walking and gradually increasing duration and intensity over time is recommended.",
            "Thank you for the advice, Medi."
        ],
        "knowledge": "Cardiac catheterization Cardiac catheterization  Cardiac catheterization is a medical procedure used to diagnose and treat cardiovascular conditions. During the procedure, a thin, flexible tube is threaded through a blood vessel in the arm, groin or neck and guided to the heart. Cardiac catheterization can help diagnose coronary artery disease, heart valve problems, heart defects, and other conditions. It can also be used to treat some conditions, such as opening blocked arteries or repairing heart defects. After the procedure, it's important to rest and follow your doctor's instructions to avoid complications and promote healing. Cardiac catheterization Cardiac catheterization",
        "response": "After a cardiac catheterization, it's important to avoid strenuous activity, eat a heart-healthy diet, and gradually increase physical activity over time."
    },
    {
        "dialog": [
            "Hi Medi, I've been feeling thirsty and tired lately.",
            "Hi there, have you noticed any changes in your appetite or weight?",
            "Not really, but I've been using the bathroom more frequently.",
            "Based on your symptoms, it's possible that you have high blood sugar. You should schedule an appointment with your doctor as soon as possible.",
            "What can I do in the meantime?",
            "You should try to limit your sugar and carbohydrate intake and increase your physical activity.",
            "Okay, I'll do that. Thanks, Medi!",
            "You're welcome. Take care!"
        ],
        "knowledge": "Diabetes Diabetes  Insulin can inhibit the breakdown of glycogen or the process of gluconeogenesis, it can stimulate the transport of glucose into fat and muscle cells, and it can stimulate the storage of glucose in the form of glycogen. Insulin is released into the blood by beta cells , found in the islets of Langerhans in the pancreas, in response to rising levels of blood glucose, typically after eating.  Insulin is used by about two-thirds of the body's cells to absorb glucose from the blood for use as fuel, for conversion to other needed molecules, or for storage.  Lower glucose levels result in decreased insulin release from the beta cells and in the breakdown of glycogen to glucose.  This process is mainly controlled by the hormone glucagon, which acts in the opposite manner to insulin. If the amount of insulin available is insufficient, or if cells respond poorly to the effects of insulin , or if the insulin itself is defective, then glucose is not absorbed properly by the body cells that require it, and is not stored appropriately in the liver and muscles.  The net effect is persistently high levels of blood glucose, poor protein synthesis, and other metabolic derangements, such as metabolic acidosis in cases of complete insulin deficiency Diabetes Diabetes",
        "response": "Possible high blood sugar. Limit sugar and carbohydrate intake and increase physical activity. Schedule an appointment with a doctor."
    },
    {
        "dialog": [
            "Hi Medi, can you explain what diabetes is?",
            "Of course, diabetes is a disease that affects how your body uses glucose, a type of sugar. Your body needs glucose to function properly, but too much glucose in your blood can be harmful.",
            "How does it affect the body?",
            "When you have diabetes, your body either doesn't produce enough insulin or can't use its own insulin as well as it should. This causes sugar to build up in your blood, which can lead to various health problems.",
            "Can it be prevented?",
            "While type 1 diabetes cannot be prevented, type 2 diabetes can be prevented or delayed through a healthy lifestyle, including a balanced diet, regular exercise, and maintaining a healthy weight.",
            "Thanks, Medi. That was helpful.",
            "You're welcome. Let me know if you have any other questions!"
        ],
        "knowledge": "Diabetes Diabetes  The defective responsiveness of body tissues to insulin is believed to involve the insulin receptor.  However, the specific defects are not known.  Diabetes mellitus cases due to a known defect are classified separately.  Type 2 diabetes is the most common type of diabetes mellitus accounting for 95% of diabetes.  Many people with type 2 diabetes have evidence of prediabetes  before meeting the criteria for type 2 diabetes.  The progression of prediabetes to overt type 2 diabetes can be slowed or reversed by lifestyle changes or medications that improve insulin sensitivity or reduce the liver's glucose production. Type 2 diabetes is primarily due to lifestyle factors and genetics Diabetes Diabetes",
        "response": "Diabetes is a disease that affects how your body uses glucose. It can be prevented or delayed through a healthy lifestyle."
    },
    {
        "dialog": [
            "Hi Medi, I just had surgery and I'm not sure what I can eat.",
            "Hi there, it's important to follow your doctor's instructions on post-surgery nutrition. Generally, you should start with clear liquids and gradually move to solid foods as your body tolerates them.",
            "Are there any foods I should avoid?",
            "You should avoid foods that are high in fat, sugar, and salt, as well as spicy and acidic foods. Eating a balanced diet with plenty of fruits and vegetables can help with the healing process.",
            "What about physical activity?",
            "You should avoid strenuous physical activity for a while after surgery, but light exercise like walking can be beneficial.",
            "Okay, I'll keep that in mind. Thanks, Medi!",
            "You're welcome. Take care and let me know if you have any other questions!"
        ],
        "knowledge": "Diabetes Diabetes  Insulin can inhibit the breakdown of glycogen or the process of gluconeogenesis, it can stimulate the transport of glucose into fat and muscle cells, and it can stimulate the storage of glucose in the form of glycogen. Insulin is released into the blood by beta cells , found in the islets of Langerhans in the pancreas, in response to rising levels of blood glucose, typically after eating.  Insulin is used by about two-thirds of the body's cells to absorb glucose from the blood for use as fuel, for conversion to other needed molecules, or for storage.  Lower glucose levels result in decreased insulin release from the beta cells and in the breakdown of glycogen to glucose.  This process is mainly controlled by the hormone glucagon, which acts in the opposite manner to insulin. If the amount of insulin available is insufficient, or if cells respond poorly to the effects of insulin , or if the insulin itself is defective, then glucose is not absorbed properly by the body cells that require it, and is not stored appropriately in the liver and muscles.  The net effect is persistently high levels of blood glucose, poor protein synthesis, and other metabolic derangements, such as metabolic acidosis in cases of complete insulin deficiency Diabetes Diabetes",
        "response": "Follow your doctor's instructions on post-surgery nutrition. Avoid high-fat, high-sugar, and high-salt foods. Light exercise like walking can be beneficial."
    }
]