[
    {
        "dialog": [
            "Hello Medi, I have some symptoms and I think it might be related to diabetes.",
            "Sure, I can help you. Can you please tell me about your symptoms?",
            "I am experiencing increased thirst, hunger and urination.",
            "Based on your symptoms, it's possible that you have diabetes. Have you checked your blood sugar level?",
            "Yes, I did and it's higher than normal.",
            "In that case, you should consult a doctor immediately. Diabetes is a serious condition.",
            "Is diabetes treatable?",
            "Yes, it is treatable. Treatment involves lifestyle changes, such as diet and exercise, and medications to manage your blood sugar levels.",
            "Thank you, Medi. I will consult a doctor soon."
        ],
        "knowledge": "Diabetes Diabetes  Many are able to maintain normal blood sugar levels with little or no medications following surgery and long-term mortality is decreased.  There is, however, a short-term mortality risk of less than 1% from the surgery.  The body mass index cutoffs for when surgery is appropriate are not yet clear.  It is recommended that this option be considered in those who are unable to get both their weight and blood sugar under control. A pancreas transplant is occasionally considered for people with type 1 diabetes who have severe complications of their disease, including end stage kidney disease requiring kidney transplantation. In countries using a general practitioner system, such as the United Kingdom, care may take place mainly outside hospitals, with hospital-based specialist care used only in case of complications, difficult blood sugar control, or research projects.  In other circumstances, general practitioners and specialists share care in a team approach Diabetes Diabetes",
        "response": "It is treatable with lifestyle changes and medications. You should consult a doctor immediately."
    },
    {
        "dialog": [
            "Hi, Medi. I want to know more about pancreas transplant for diabetes.",
            "Hi! Sure, I can provide you with the information you need. What specifically do you want to know?",
            "I want to know the eligibility criteria.",
            "The eligibility criteria for pancreas transplant varies depending on the country and the institution. However, in general, it is recommended for people with type 1 diabetes who have severe complications of their disease, including end stage kidney disease requiring kidney transplantation. ",
            "Is it a common procedure?",
            "No, it's not very common. Other treatments, such as insulin therapy and lifestyle changes, are usually recommended first.",
            "What are the risks associated with pancreas transplant?",
            "There are risks associated with any surgery, including the risk of infection, bleeding, and complications related to anesthesia. In the long-term, there is also a risk of rejection.",
            "I see. Thank you for the information, Medi."
        ],
        "knowledge": "Diabetes Diabetes  Many are able to maintain normal blood sugar levels with little or no medications following surgery and long-term mortality is decreased.  There is, however, a short-term mortality risk of less than 1% from the surgery.  The body mass index cutoffs for when surgery is appropriate are not yet clear.  It is recommended that this option be considered in those who are unable to get both their weight and blood sugar under control. A pancreas transplant is occasionally considered for people with type 1 diabetes who have severe complications of their disease, including end stage kidney disease requiring kidney transplantation. In countries using a general practitioner system, such as the United Kingdom, care may take place mainly outside hospitals, with hospital-based specialist care used only in case of complications, difficult blood sugar control, or research projects.  In other circumstances, general practitioners and specialists share care in a team approach Diabetes Diabetes",
        "response": "The eligibility criteria for a pancreas transplant varies depending on the country and the institution. It is not very common and other treatments are usually recommended first. There are risks associated with any surgery, including the risk of infection, bleeding, and complications related to anesthesia. There is also a risk of rejection in the long-term."
    },
    {
        "dialog": [
            "Hi Medi. I had a surgery for diabetes recently. Do you have any advice for my lifestyle?",
            "Hi! Yes, I can give you some advice. How are you feeling now?",
            "I feel great, but I'm worried about maintaining the results of my surgery.",
            "That's understandable. In order to maintain normal blood sugar levels, you should focus on your diet and exercise. Try to avoid sugary foods and drinks, and eat more fruits, vegetables, and whole grains. You should also try to exercise regularly.",
            "How much exercise should I do?",
            "Try to get at least 30 minutes of moderate exercise, such as brisk walking or cycling, most days of the week. Consult your doctor to determine the best exercise plan for you.",
            "What about medications?",
            "Some people may still need medications to manage their blood sugar levels after surgery. Consult your doctor to determine the best treatment plan for you.",
            "Thank you, Medi. That's very helpful."
        ],
        "knowledge": "Diabetes Diabetes  Many are able to maintain normal blood sugar levels with little or no medications following surgery and long-term mortality is decreased.  There is, however, a short-term mortality risk of less than 1% from the surgery.  The body mass index cutoffs for when surgery is appropriate are not yet clear.  It is recommended that this option be considered in those who are unable to get both their weight and blood sugar under control. A pancreas transplant is occasionally considered for people with type 1 diabetes who have severe complications of their disease, including end stage kidney disease requiring kidney transplantation. In countries using a general practitioner system, such as the United Kingdom, care may take place mainly outside hospitals, with hospital-based specialist care used only in case of complications, difficult blood sugar control, or research projects.  In other circumstances, general practitioners and specialists share care in a team approach Diabetes Diabetes",
        "response": "You should focus on your diet and exercise to maintain normal blood sugar levels. Some people may still need medications to manage their blood sugar levels after surgery. Consult your doctor to determine the best treatment plan for you."
    },
    {
        "dialog": [
            "Hello Medi, I have some questions about diabetes",
            "Sure, I am here to help you with any questions about the disease",
            "What is the difference between type 1 and type 2 diabetes?",
            "In type 1 diabetes, the body's immune system attacks and destroys the cells that produce insulin, while in type 2 diabetes, the body becomes resistant to insulin or doesn't produce enough insulin.",
            "What are the symptoms of diabetes?",
            "The symptoms of diabetes include increased thirst, frequent urination, hunger, fatigue, blurred vision, slow healing wounds, and tingling sensations in the hands and feet.",
            "How can diabetes be treated?",
            "The treatment for diabetes includes lifestyle changes such as a healthy diet, exercise, and maintaining a healthy weight, as well as medications like insulin and oral medications to lower blood sugar levels.",
            "Can diabetes be cured?"
        ],
        "knowledge": "Diabetes Diabetes Diabetes is a metabolic disorder that affects how the body uses blood glucose, also known as blood sugar.  Diabetes occurs when the pancreas fails to produce enough insulin or the body becomes resistant to insulin, causing blood glucose levels to rise.  There are two main types of diabetes: type 1 diabetes, which occurs when the body's immune system attacks and destroys the cells that produce insulin, and type 2 diabetes, which occurs when the body becomes resistant to insulin or doesn't produce enough insulin. Type 2 diabetes is the most common type of diabetes, accounting for around 90% of cases. Diabetes can be managed through lifestyle changes and medications, but there is no cure for the disease.",
        "response": "There is currently no known cure for diabetes, but it can be managed through lifestyle changes and medications."
    },
    {
        "dialog": [
            "Hi Medi, I just had surgery for my diabetes. What should I do now?",
            "Congratulations on your surgery. After surgery, it's important to follow a healthy diet, exercise regularly, and take any medications prescribed by your doctor.",
            "Will I need to take insulin after my surgery?",
            "It depends on your individual situation. Some people are able to maintain normal blood sugar levels with little or no medications following surgery, while others may need to continue taking insulin or other medications.",
            "Are there any risks associated with diabetes surgery?",
            "There is a short-term mortality risk of less than 1% from the surgery, but long-term mortality is decreased. The body mass index cutoffs for when surgery is appropriate are not yet clear",
            "What is a pancreas transplant?",
            "A pancreas transplant is occasionally considered for people with type 1 diabetes who have severe complications of their disease, including end stage kidney disease requiring kidney transplantation.",
            "Do I need to see a specialist for my diabetes treatment?"
        ],
        "knowledge": "Diabetes Diabetes  Many are able to maintain normal blood sugar levels with little or no medications following surgery and long-term mortality is decreased.  There is, however, a short-term mortality risk of less than 1% from the surgery.  The body mass index cutoffs for when surgery is appropriate are not yet clear.  It is recommended that this option be considered in those who are unable to get both their weight and blood sugar under control. A pancreas transplant is occasionally considered for people with type 1 diabetes who have severe complications of their disease, including end stage kidney disease requiring kidney transplantation. In countries using a general practitioner system, such as the United Kingdom, care may take place mainly outside hospitals, with hospital-based specialist care used only in case of complications, difficult blood sugar control, or research projects.  In other circumstances, general practitioners and specialists share care in a team approach Diabetes Diabetes",
        "response": "It depends on your individual situation and whether or not your general practitioner is able to manage your diabetes treatment. In some cases, specialist care may be necessary if you experience complications or have difficulty controlling your blood sugar levels."
    },
    {
        "dialog": [
            "Hi Medi, I have diabetes and I am wondering if I can still eat my favorite foods.",
            "Yes, you can still enjoy your favorite foods in moderation. The key to managing diabetes is to maintain a healthy and balanced diet.",
            "What types of foods should I avoid?",
            "You should avoid foods that are high in sugar, saturated fats, and carbohydrates. Instead, focus on eating a variety of fruits, vegetables, lean proteins, and whole grains.",
            "Can I still enjoy desserts?",
            "Yes, you can still enjoy desserts, but in moderation and as part of a balanced meal. Opt for desserts that are low in sugar and high in fiber, such as fresh fruit or homemade baked goods made with whole grain flour.",
            "What about alcohol?",
            "Alcohol can affect blood sugar levels, so it's important to drink in moderation and always with food. Stick to no more than one drink per day for women and two drinks per day for men, and avoid sugary mixed drinks and cocktails.",
            "Is it okay to skip meals?"
        ],
        "knowledge": "Diabetes Diabetes  Diabetes is a metabolic disorder that affects how the body uses blood glucose, also known as blood sugar.  Diabetes occurs when the pancreas fails to produce enough insulin or the body becomes resistant to insulin, causing blood glucose levels to rise.  There are two main types of diabetes: type 1 diabetes, which occurs when the body's immune system attacks and destroys the cells that produce insulin, and type 2 diabetes, which occurs when the body becomes resistant to insulin or doesn't produce enough insulin. Type 2 diabetes is the most common type of diabetes, accounting for around 90% of cases. Diabetes can be managed through lifestyle changes and medications, but there is no cure for the disease.",
        "response": "You're welcome. Remember to always maintain a balanced and healthy diet, and to enjoy your favorite foods in moderation."
    },
    {
        "dialog": [
            "Hello Medi, I have symptoms of diabetes.",
            "Hi there, can you tell me your symptoms?",
            "I feel thirsty frequently, have a dry mouth, need to pee a lot, and feel tired.",
            "Based on your symptoms, it's possible you have diabetes.",
            "What should I do?",
            "I suggest you see a doctor and have some tests done to confirm the diagnosis.",
            "Is there anything I can do to prevent diabetes?",
            "Yes, maintaining a healthy lifestyle and weight can reduce the risk of developing diabetes.",
            "Thank you, Medi. What kind of lifestyle changes should I make?"
        ],
        "knowledge": "Diabetes Diabetes Many people with type 2 diabetes have evidence of prediabetes before meeting the criteria for type 2 diabetes. The progression of prediabetes to overt type 2 diabetes can be slowed or reversed by lifestyle changes or medications that improve insulin sensitivity or reduce the liver's glucose production. Type 2 diabetes is primarily due to lifestyle factors and genetics Diabetes Diabetes",
        "response": "You should modify your lifestyle by maintaining a healthy weight through exercise and diet, and reducing sugar and processed food intake."
    },
    {
        "dialog": [
            "Hello Medi, I had surgery for my diabetes.",
            "Hi there, how can I assist you?",
            "I recently had surgery for my diabetes and want to know what I should do after the surgery.",
            "After surgery, it's important to follow your doctor's advice on recovery and medication.",
            "What kind of medication should I be taking?",
            "Many people are able to maintain normal blood sugar levels with little or no medications following surgery.",
            "What should I do about my diet?",
            "It's important to eat a healthy, balanced diet and avoid sugary and processed foods.",
            "Thank you, Medi. Should I be concerned about any risks?"
        ],
        "knowledge": "Diabetes Diabetes Many are able to maintain normal blood sugar levels with little or no medications following surgery and long-term mortality is decreased. There is, however, a short-term mortality risk of less than 1% from the surgery. The body mass index cutoffs for when surgery is appropriate are not yet clear. It is recommended that this option be considered in those who are unable to get both their weight and blood sugar under control Diabetes Diabetes",
        "response": "It's important to follow your doctor's advice and attend follow-up appointments after surgery to ensure a successful recovery."
    },
    {
        "dialog": [
            "Hello Medi, can you explain about pancreas transplant for diabetes?",
            "Hi there, of course. What do you want to know?",
            "I heard that a pancreas transplant is occasionally considered for people with type 1 diabetes who have severe complications of their disease. Can you tell me more?",
            "A pancreas transplant is a surgical procedure in which a healthy pancreas from a donor is transplanted into a person with diabetes. It's occasionally considered for people with type 1 diabetes who have severe complications of their disease, including end-stage kidney disease requiring kidney transplantation.",
            "What are the benefits of a pancreas transplant?",
            "A pancreas transplant can eliminate the need for insulin therapy and improve blood sugar control. It can also help prevent or treat secondary complications of diabetes.",
            "Are there any risks involved?",
            "Yes, like any surgery, there are risks involved with a pancreas transplant, including rejection, infection, and side effects from immunosuppressant medication. Your doctor can advise you on the potential risks and benefits.",
            "Thank you, Medi. I appreciate your help."
        ],
        "knowledge": "Diabetes Diabetes A pancreas transplant is occasionally considered for people with type 1 diabetes who have severe complications of their disease, including end stage kidney disease requiring kidney transplantation Diabetes Diabetes",
        "response": "A pancreas transplant can eliminate the need for insulin therapy and improve blood sugar control, but it also has risks involved, including rejection, infection, and side effects from immunosuppressant medication."
    },
    {
        "dialog": [
            "Hello Medi, I have some questions about diabetes surgery.",
            "Of course, I am here to explain everything about that. What do you want to know?",
            "What risks can I face with diabetes surgery?",
            "There is a short-term mortality risk of less than 1% from the surgery, but long-term mortality is decreased.",
            "How can I know if diabetes surgery is appropriate for me?",
            "It is recommended that this option be considered in those who are unable to get both their weight and blood sugar under control with lifestyle changes or medications.",
            "What happens if surgery is not suitable for me?",
            "Your doctor may suggest other alternatives such as medications or pancreas transplant if you have severe complications of type 1 diabetes.",
            "Thanks, Medi. One more question. How will my diabetes care be managed after surgery?"
        ],
        "knowledge": "Diabetes Diabetes  Many are able to maintain normal blood sugar levels with little or no medications following surgery and long-term mortality is decreased.  There is, however, a short-term mortality risk of less than 1% from the surgery.  The body mass index cutoffs for when surgery is appropriate are not yet clear.  It is recommended that this option be considered in those who are unable to get both their weight and blood sugar under control. A pancreas transplant is occasionally considered for people with type 1 diabetes who have severe complications of their disease, including end stage kidney disease requiring kidney transplantation. In countries using a general practitioner system, such as the United Kingdom, care may take place mainly outside hospitals, with hospital-based specialist care used only in case of complications, difficult blood sugar control, or research projects.  In other circumstances, general practitioners and specialists share care in a team approach Diabetes Diabetes",
        "response": "After surgery, many people are able to maintain normal blood sugar levels with little or no medications, and your care may take place mainly outside hospitals with hospital-based specialist care used only in case of complications, difficult blood sugar control, or research projects. "
    },
    {
        "dialog": [
            "Medi, I want to ask you about diabetes pancreas transplant.",
            "Sure, what do you want to know about that?",
            "Is it a common procedure for people with type 1 diabetes?",
            "No, it's not common. A pancreas transplant is occasionally considered for people with type 1 diabetes who have severe complications of their disease, including end-stage kidney disease requiring kidney transplantation.",
            "So, how does the pancreas transplant help improve the condition of type 1 diabetes?",
            "A pancreas transplant replaces the diseased pancreas with a healthy one.",
            "Is it a safe procedure?",
            "Like any transplant surgery, a pancreas transplant has some risks and complications. However, the risks and complications can be managed with proper medical care and follow-up.",
            "Thanks, Medi. I have one more question. Can diabetes patients with other complications get a pancreas transplant?"
        ],
        "knowledge": "Diabetes Diabetes  Many are able to maintain normal blood sugar levels with little or no medications following surgery and long-term mortality is decreased.  There is, however, a short-term mortality risk of less than 1% from the surgery.  The body mass index cutoffs for when surgery is appropriate are not yet clear.  It is recommended that this option be considered in those who are unable to get both their weight and blood sugar under control. A pancreas transplant is occasionally considered for people with type 1 diabetes who have severe complications of their disease, including end stage kidney disease requiring kidney transplantation. In countries using a general practitioner system, such as the United Kingdom, care may take place mainly outside hospitals, with hospital-based specialist care used only in case of complications, difficult blood sugar control, or research projects.  In other circumstances, general practitioners and specialists share care in a team approach Diabetes Diabetes",
        "response": "No, only people with type 1 diabetes who have severe complications of their disease, including end-stage kidney disease requiring kidney transplantation, can qualify for a pancreas transplant."
    },
    {
        "dialog": [
            "Hello Medi, I need advice for managing diabetes through lifestyle changes.",
            "Sure, I am here to help you. What do you want to know?",
            "Can you give me some tips for managing my diabetes through lifestyle changes?",
            "Of course, you should try to eat a balanced diet, including more vitamins and vegetables and less sugar. Also, you should do more physical exercises regularly to help control your blood sugar levels.",
            "How much should I exercise per day?",
            "At least 30 minutes of moderate exercise per day is recommended for people with diabetes.",
            "What are some foods I should avoid?",
            "You should try to avoid foods that contain high amounts of sugar and carbohydrates, such as candy, baked goods, and sugary drinks.",
            "Thanks, Medi. Can you tell me what kind of drinks I should take to manage my diabetes?"
        ],
        "knowledge": "Diabetes Diabetes  Many are able to maintain normal blood sugar levels with little or no medications following surgery and long-term mortality is decreased.  There is, however, a short-term mortality risk of less than 1% from the surgery.  The body mass index cutoffs for when surgery is appropriate are not yet clear.  It is recommended that this option be considered in those who are unable to get both their weight and blood sugar under control. A pancreas transplant is occasionally considered for people with type 1 diabetes who have severe complications of their disease, including end stage kidney disease requiring kidney transplantation. In countries using a general practitioner system, such as the United Kingdom, care may take place mainly outside hospitals, with hospital-based specialist care used only in case of complications, difficult blood sugar control, or research projects.  In other circumstances, general practitioners and specialists share care in a team approach Diabetes Diabetes",
        "response": "You should drink water, unsweetened tea, or low-fat milk. Avoid sugary drinks like soda, energy drinks, and sports drinks."
    },
    {
        "dialog": [
            "Hi, Medi. I have type 1 diabetes and I have end-stage kidney disease. What are my options?",
            "There are a few options available. One option is kidney transplantation. Another option is a pancreas transplant.",
            "What are the risks associated with a pancreas transplant?",
            "There are risks associated with any surgery. There is a small short-term mortality rate of less than 1%. However, many are able to maintain normal blood sugar levels and long-term mortality is decreased.",
            "That's helpful. What if I'm unable to get both my weight and blood sugar under control?",
            "In that case, surgery may be an option for you. The body mass index cutoffs for when surgery is appropriate are not yet clear.",
            "Thank you for your help, Medi.",
            "You're welcome. Do you have any other questions regarding your condition?"
        ],
        "knowledge": "Diabetes Diabetes  Many are able to maintain normal blood sugar levels with little or no medications following surgery and long-term mortality is decreased.  There is, however, a short-term mortality risk of less than 1% from the surgery.  The body mass index cutoffs for when surgery is appropriate are not yet clear.  It is recommended that this option be considered in those who are unable to get both their weight and blood sugar under control. A pancreas transplant is occasionally considered for people with type 1 diabetes who have severe complications of their disease, including end stage kidney disease requiring kidney transplantation. In countries using a general practitioner system, such as the United Kingdom, care may take place mainly outside hospitals, with hospital-based specialist care used only in case of complications, difficult blood sugar control, or research projects.  In other circumstances, general practitioners and specialists share care in a team approach Diabetes Diabetes",
        "response": "No, that's all for now. Thank you!"
    },
    {
        "dialog": [
            "Hi, Medi. I have a question about type 2 diabetes.",
            "Sure, I'm here to help. What's your question?",
            "What causes type 2 diabetes?",
            "The defective responsiveness of body tissues to insulin is believed to involve the insulin receptor. However, the specific defects are not known. Type 2 diabetes is primarily due to lifestyle factors and genetics. Many people with type 2 diabetes have evidence of prediabetes before meeting the criteria for type 2 diabetes.",
            "What are some ways to prevent the progression from prediabetes to type 2 diabetes?",
            "Lifestyle changes or medications that improve insulin sensitivity or reduce the liver's glucose production can help prevent the progression from prediabetes to type 2 diabetes.",
            "Thank you for your help, Medi.",
            "You're welcome. Do you have any other questions?",
            "No, that's all for now. Thank you again!"
        ],
        "knowledge": "Diabetes Diabetes  The defective responsiveness of body tissues to insulin is believed to involve the insulin receptor.  However, the specific defects are not known.  Diabetes mellitus cases due to a known defect are classified separately.  Type 2 diabetes is the most common type of diabetes mellitus accounting for 95% of diabetes.  Many people with type 2 diabetes have evidence of prediabetes  before meeting the criteria for type 2 diabetes.  The progression of prediabetes to overt type 2 diabetes can be slowed or reversed by lifestyle changes or medications that improve insulin sensitivity or reduce the liver's glucose production. Type 2 diabetes is primarily due to lifestyle factors and genetics Diabetes Diabetes",
        "response": "Thank you as well. Take care!"
    },
    {
        "dialog": [
            "Hi, Medi. I had weight loss surgery recently. What should I do now?",
            "Congratulations on your surgery. It's important to make some lifestyle changes to maintain your weight loss. ",
            "What kind of lifestyle changes should I make?",
            "You should make changes to your diet, do more physical exercise, and eat more vitamins and vegetables. This will help you maintain your weight loss.",
            "That's helpful. How common is obesity?",
            "There are more than 1 billion people who have obesity, which is a very large amount.",
            "What are some actions the government or society is taking to prevent the increase of obesity?",
            "Public health efforts seek to understand and correct the environmental factors responsible for the increasing prevalence of obesity in the population. Solutions look at changing the factors that cause excess food energy consumption and inhibit physical activity. There are federally reimbursed meal programs in schools, limiting direct junk food marketing to children, and decreasing access to sugar-sweetened beverages in schools. The World Health Organization recommends the taxing of sugary drinks. When constructing urban environments, efforts have been made to increase access to parks and to develop pedestrian routes.",
            "Thank you for your help, Medi."
        ],
        "knowledge": "Obesity Obesity Obesity is a complex public health and policy problem because of its prevalence, costs, and health effects.  As such, managing it requires changes in the wider societal context and effort by communities, local authorities, and governments.  Public health efforts seek to understand and correct the environmental factors responsible for the increasing prevalence of obesity in the population.  Solutions look at changing the factors that cause excess food energy consumption and inhibit physical activity.  Efforts include federally reimbursed meal programs in schools, limiting direct junk food marketing to children, and decreasing access to sugar-sweetened beverages in schools.  The World Health Organization recommends the taxing of sugary drinks.  When constructing urban environments, efforts have been made to increase access to parks and to develop pedestrian routes Obesity Obesity",
        "response": "No, I think that's everything I needed to know. Thank you for your help!"
    },
    {
        "dialog": [
            "Hello Medi, I have been diagnosed with type 1 diabetes. What should I do?",
            "I suggest you to consult with a doctor and follow his/her recommendations.",
            "What are the common treatment options for type 1 diabetes?",
            "The common treatment options are insulin therapy, carbohydrate counting, and continuous glucose monitoring.",
            "How often do I need to monitor my blood sugar level?",
            "It depends on the treatment plan prescribed by your doctor but usually several times a day.",
            "What should I do if my blood sugar level gets too high or too low?",
            "If your blood sugar level gets too high, you should take insulin. If it gets too low, you should eat or drink something that contains sugar.",
            "What should I do to prevent complications of type 1 diabetes?"
        ],
        "knowledge": "Type 1 DiabetesType 1 diabetes is a chronic autoimmune disease in which the immune system attacks and destroys the insulin-producing cells of the pancreas. This results in the body's inability to produce insulin, a hormone that regulates blood sugar levels. The exact cause of type 1 diabetes is not known, but it is believed to be a combination of genetic and environmental factors. Treatment involves insulin therapy, carbohydrate counting, and continuous glucose monitoring. Complications of type 1 diabetes include heart disease, nerve damage, kidney damage, eye damage, and foot damage.",
        "response": "You should follow your doctor's instructions and monitor your blood sugar level several times a day. If it gets too high or low, take insulin or eat/drink something with sugar."
    },
    {
        "dialog": [
            "Hi Medi, I recently had a surgery for my type 2 diabetes. What should I do to make a quick recovery?",
            "Congratulations on completing the surgery. I recommend you to follow your doctor's post-operative instructions and take any prescribed medications.",
            "What kind of lifestyle changes should I make after the surgery?",
            "You should maintain a healthy diet, exercise regularly, and monitor your blood sugar levels frequently.",
            "How long will it take to recover from the surgery?",
            "It depends on the type and extent of the surgery. Your doctor can provide you with a better estimate.",
            "What are the possible complications of the surgery?",
            "The possible complications of the surgery include infection, bleeding, and damage to nearby organs. You should contact your doctor immediately if you experience any unusual symptoms.",
            "What should I do if my blood sugar level gets too high or too low after the surgery?"
        ],
        "knowledge": "Diabetes Diabetes Many are able to maintain normal blood sugar levels with little or no medications following surgery and long-term mortality is decreased. There is, however, a short-term mortality risk of less than 1% from the surgery. The body mass index cutoffs for when surgery is appropriate are not yet clear. It is recommended that this option be considered in those who are unable to get both their weight and blood sugar under control. A pancreas transplant is occasionally considered for people with type 1 diabetes who have severe complications of their disease, including end stage kidney disease requiring kidney transplantation. In countries using a general practitioner system, such as the United Kingdom, care may take place mainly outside hospitals, with hospital-based specialist care used only in case of complications, difficult blood sugar control, or research projects. In other circumstances, general practitioners and specialists share care in a team approach Diabetes Diabetes",
        "response": "You should monitor your blood sugar levels frequently after the surgery and contact your doctor immediately if you experience any unusual symptoms."
    },
    {
        "dialog": [
            "Hey Medi, can type 2 diabetes be reversed?",
            "Type 2 diabetes can be managed and controlled with a healthy lifestyle, but it cannot be completely reversed.",
            "What are the risk factors for type 2 diabetes?",
            "The risk factors include obesity, physical inactivity, family history, age, and certain medical conditions.",
            "How can I prevent type 2 diabetes?",
            "You can prevent type 2 diabetes by maintaining a healthy weight, exercising regularly, and eating a healthy diet.",
            "What can happen if type 2 diabetes is left untreated?",
            "If left untreated, type 2 diabetes can lead to serious complications such as heart disease, stroke, kidney disease, nerve damage, and vision loss.",
            "What should I do if I suspect that I have type 2 diabetes?"
        ],
        "knowledge": "Diabetes Diabetes The defective responsiveness of body tissues to insulin is believed to involve the insulin receptor. However, the specific defects are not known. Diabetes mellitus cases due to a known defect are classified separately. Type 2 diabetes is the most common type of diabetes mellitus accounting for 95% of diabetes. Many people with type 2 diabetes have evidence of prediabetes before meeting the criteria for type 2 diabetes. The progression of prediabetes to overt type 2 diabetes can be slowed or reversed by lifestyle changes or medications that improve insulin sensitivity or reduce the liver's glucose production. Type 2 diabetes is primarily due to lifestyle factors and genetics Diabetes Diabetes",
        "response": "You should visit a doctor and undergo a glucose tolerance test to confirm the diagnosis of type 2 diabetes."
    },
    {
        "dialog": [
            "Hi Medi, I'm worried about my blood sugar level.",
            "Hi! Please tell me more about your symptoms",
            "I feel thirsty frequently and have a dry mouth. Also, I urinate more than usual",
            "I see. You may have high blood sugar level. I suggest you to get your blood sugar checked",
            "What should I do if my blood sugar level is high?",
            "You should modify your lifestyle, exercise regularly, and eat a balanced diet with fewer carbohydrates",
            "Will I need medication?",
            "It depends on how high your blood sugar level is and your doctor's advice. Please consult your doctor for medical advice",
            "Thank you for your advice, Medi. How can I prevent high blood sugar level?"
        ],
        "knowledge": "Diabetes Diabetes  Many are able to maintain normal blood sugar levels with little or no medications following surgery and long-term mortality is decreased.  There is, however, a short-term mortality risk of less than 1% from the surgery.  The body mass index cutoffs for when surgery is appropriate are not yet clear.  It is recommended that this option be considered in those who are unable to get both their weight and blood sugar under control. A pancreas transplant is occasionally considered for people with type 1 diabetes who have severe complications of their disease, including end stage kidney disease requiring kidney transplantation. In countries using a general practitioner system, such as the United Kingdom, care may take place mainly outside hospitals, with hospital-based specialist care used only in case of complications, difficult blood sugar control, or research projects.  In other circumstances, general practitioners and specialists share care in a team approach Diabetes Diabetes",
        "response": "You can prevent high blood sugar level by modifying your lifestyle, exercising regularly, and eating a balanced diet with fewer carbohydrates"
    },
    {
        "dialog": [
            "Hi Medi, I have just recovered from a pancreas transplant. What should I do now?",
            "Hi! Congratulations on your successful transplant. You should follow a healthy lifestyle, take your medication regularly, and regularly monitor your blood sugar level",
            "What kind of lifestyle should I follow?",
            "You should maintain a balanced diet, exercise regularly, and avoid smoking and drinking alcohol",
            "What happens if I miss my medication?",
            "It can increase your risk of rejection. Please take your medication as prescribed by your doctor",
            "When should I monitor my blood sugar level?",
            "You should monitor your blood sugar level regularly at home, and also have it checked during routine checkups with your doctor",
            "Thank you for your advice, Medi. What are the risks of the transplant?"
        ],
        "knowledge": "Diabetes Diabetes  Many are able to maintain normal blood sugar levels with little or no medications following surgery and long-term mortality is decreased.  There is, however, a short-term mortality risk of less than 1% from the surgery.  The body mass index cutoffs for when surgery is appropriate are not yet clear.  It is recommended that this option be considered in those who are unable to get both their weight and blood sugar under control. A pancreas transplant is occasionally considered for people with type 1 diabetes who have severe complications of their disease, including end stage kidney disease requiring kidney transplantation. In countries using a general practitioner system, such as the United Kingdom, care may take place mainly outside hospitals, with hospital-based specialist care used only in case of complications, difficult blood sugar control, or research projects.  In other circumstances, general practitioners and specialists share care in a team approach Diabetes Diabetes",
        "response": "The risks of transplant include rejection, infection, bleeding, and damage to nearby organs"
    },
    {
        "dialog": [
            "Hi Medi, I have been diagnosed with type 2 diabetes. What should I do?",
            "Hi! Sorry to hear that. You should modify your lifestyle, eat a healthy diet, exercise regularly, and take your medication as prescribed by your doctor",
            "What kind of healthy diet should I follow?",
            "You should eat more fruits, vegetables, whole grains, lean protein, and healthy fats. And, avoid sugary and processed foods",
            "What kind of exercise should I do?",
            "You should do moderate exercise for at least 30 minutes a day, such as brisk walking, jogging, cycling, or swimming",
            "What kind of medication will I need to take?",
            "It depends on how high your blood sugar level is and your doctor's advice. Your doctor may prescribe medications to lower your blood sugar level",
            "Thank you for your advice, Medi. Can type 2 diabetes be cured?"
        ],
        "knowledge": "Diabetes Diabetes  The defective responsiveness of body tissues to insulin is believed to involve the insulin receptor.  However, the specific defects are not known.  Diabetes mellitus cases due to a known defect are classified separately.  Type 2 diabetes is the most common type of diabetes mellitus accounting for 95% of diabetes.  Many people with type 2 diabetes have evidence of prediabetes  before meeting the criteria for type 2 diabetes.  The progression of prediabetes to overt type 2 diabetes can be slowed or reversed by lifestyle changes or medications that improve insulin sensitivity or reduce the liver's glucose production. Type 2 diabetes is primarily due to lifestyle factors and genetics Diabetes Diabetes",
        "response": "Type 2 diabetes can be managed and controlled with a healthy lifestyle and medication, but cannot be cured completely"
    }
]