[
    {
        "dialog": [
            "Hi, Medi. I've been feeling dizzy and had headaches lately.",
            "Hello, let me help you. Can you tell me more about your symptoms?",
            "I usually feel dizzy when I stand up after sitting for a while. And headaches occur frequently.",
            "Okay, this could be a sign of hypertension. Have you checked your blood pressure?",
            "No, I haven't. What is hypertension?",
            "It's a condition where your blood pressure is higher than normal. It can cause severe health problems if left untreated.",
            "What can I do to lower my blood pressure?",
            "You can try to eat healthy, exercise regularly, avoid alcohol and smoking. And if needed, take medication prescribed by your doctor.",
            "Thank you, Medi. How often should I monitor my blood pressure?"
        ],
        "knowledge": "Hypertension Hypertension 8%  in rural India and as high as 68. 9%  and 72. 5%  in Poland.  Rates in Africa were about 45% in 2016. In Europe hypertension occurs in about 30–45% of people as of 2013.  In 1995 it was estimated that 43 million people  in the United States had hypertension or were taking antihypertensive medication.  By 2004 this had increased to 29% and further to 32%  by 2017 Hypertension Hypertension",
        "response": "You should monitor your blood pressure regularly, especially if you have a family history of hypertension."
    },
    {
        "dialog": [
            "Hey, Medi. Can you tell me about hypertension?",
            "Of course! Hypertension is a condition where your blood pressure is consistently high.",
            "What are the symptoms of hypertension?",
            "Most of the time, there are no symptoms. That's why it's often called a silent killer. But sometimes people may experience headaches or dizziness.",
            "What causes hypertension?",
            "There are many factors that can contribute to hypertension, such as genetics, unhealthy lifestyle, and medical issues.",
            "Can I prevent hypertension?",
            "Yes, you can lower your risk by maintaining a healthy diet, exercising regularly, reducing your salt intake, and avoiding smoking and alcohol.",
            "Thank you, that was helpful. Is hypertension common?"
        ],
        "knowledge": "Hypertension Hypertension 8%  in rural India and as high as 68. 9%  and 72. 5%  in Poland.  Rates in Africa were about 45% in 2016. In Europe hypertension occurs in about 30–45% of people as of 2013.  In 1995 it was estimated that 43 million people  in the United States had hypertension or were taking antihypertensive medication.  By 2004 this had increased to 29% and further to 32%  by 2017 Hypertension Hypertension",
        "response": "Yes, hypertension is a very common condition. It affects millions of people all over the world."
    },
    {
        "dialog": [
            "Hi, Medi. I just had a medical procedure. What should I do now?",
            "Hello, it depends on what kind of procedure you had. Can you give me more details?",
            "I had surgery for my hypertension.",
            "Oh, I see. You should rest for a few days and follow the instructions provided by your doctor. You may also need to take medication to control your blood pressure.",
            "Will I need to change my lifestyle?",
            "Yes, after surgery, it's important to maintain a healthy lifestyle to prevent the recurrence of hypertension. You should eat a healthy diet, exercise regularly, and avoid smoking and alcohol.",
            "What kind of exercises should I do?",
            "You can start with simple exercises such as walking, jogging, or swimming. But it's important to consult with your doctor before starting any exercise program.",
            "Okay, Thank you, Medi. I will follow your advice. Do you have any other suggestions?"
        ],
        "knowledge": "Hypertension Hypertension 8%  in rural India and as high as 68. 9%  and 72. 5%  in Poland.  Rates in Africa were about 45% in 2016. In Europe hypertension occurs in about 30–45% of people as of 2013.  In 1995 it was estimated that 43 million people  in the United States had hypertension or were taking antihypertensive medication.  By 2004 this had increased to 29% and further to 32%  by 2017 Hypertension Hypertension",
        "response": "Yes, make sure to schedule regular check-ups with your doctor to monitor your blood pressure and overall health."
    },
    {
        "dialog": [
            "Hi Medi, I have been feeling a lot of stress lately.",
            "I see. Can you tell me more about your stress?",
            "I have been having trouble sleeping and have felt very anxious lately.",
            "I understand. Have you tried any relaxation techniques?",
            "No, I haven't. What would you suggest?",
            "Breathing techniques, meditation, and yoga can all be helpful in reducing stress.",
            "That sounds great. I will try those out. Thanks, Medi.",
            "You're welcome. Let me know if you need anything else.",
            "Sure, I will. By the way, what is the main contributor to stress? "
        ],
        "knowledge": "Stress Stress  Stress is a normal psychological and physical reaction to the demands of life.  A small amount of stress can be good, motivating you to perform well.  However, multiple challenges in life, such as work, relationships, and finances can lead to chronic stress, which can affect your health.  Chronic stress can lead to headaches, fatigue, stomach problems, and insomnia.  It can also weaken your immune system, making it harder for your body to fight off disease. Causes of stress include major life changes, work or school, relationship difficulties, financial problems, and being too busy. Stress Stress",
        "response": "The main contributors to stress are major life changes, work or school, relationship difficulties, financial problems, and being too busy."
    },
    {
        "dialog": [
            "Hello Medi, I have been experiencing some chest pain lately.",
            "I'm sorry to hear that. Can you describe your chest pain for me?",
            "It's a sharp pain that comes and goes throughout the day.",
            "I understand. Have you been experiencing any shortness of breath or dizziness?",
            "Yes, I have been feeling short of breath.",
            "I recommend that you see a doctor as soon as possible. These symptoms could be related to a heart condition.",
            "Really? That sounds serious.",
            "It could be, but it's best to get it checked out by a medical professional.",
            "Okay, thanks for your advice, Medi."
        ],
        "knowledge": "Chest pain Chest pain  Chest pain can be caused by a variety of factors, including heart-related issues, lung problems, gastrointestinal issues, and musculoskeletal problems.  Heart-related causes of chest pain include angina (chest pain caused by reduced blood flow to the heart), a heart attack, and pericarditis (inflammation of the sac around the heart).  Chest pain can also be caused by lung problems such as pneumonia or a collapsed lung, gastrointestinal issues such as acid reflux or gallbladder disease, and musculoskeletal problems such as muscle strain or rib injuries. Chest pain Chest pain",
        "response": "Yes, chest pain can be a serious symptom and could be related to a heart condition. You should see a doctor as soon as possible."
    },
    {
        "dialog": [
            "Hi Medi, I recently had surgery on my knee. Can you give me any advice on how to recover?",
            "Of course. What kind of surgery did you have?",
            "I had a knee replacement surgery.",
            "I see. It's important to rest your knee and keep it elevated to reduce swelling.",
            "Got it. How about exercise?",
            "Physical therapy and exercise are also important to help strengthen the muscles around your knee and improve your range of motion.",
            "Okay, thanks for the advice. Are there any exercises that I should avoid?",
            "You should avoid exercises that put too much strain on your knee, such as running or jumping.",
            "Okay, I will keep that in mind. Thanks, Medi."
        ],
        "knowledge": "Knee replacement Knee replacement  Knee replacement surgery is a procedure that replaces damaged or diseased knee joint with an artificial joint.  After surgery, it's important to rest your knee and keep it elevated to reduce swelling.  Physical therapy and exercise are also important to help strengthen the muscles around your knee and improve your range of motion.  Exercises that are low-impact and put minimal stress on your knee, such as walking or swimming, are recommended.  High-impact exercises, such as running or jumping, should be avoided. Knee replacement Knee replacement",
        "response": "You should avoid exercises that put too much strain on your knee, such as running or jumping. Low-impact exercises such as walking or swimming are recommended."
    },
    {
        "dialog": [
            "Hi Medi, I'm worried about high blood pressure.",
            "Hello, tell me about your symptoms?",
            "I feel headaches, fatigue and chest pain sometimes",
            "Those are serious symptoms, I suggest you see a doctor immediately",
            "Okay, but what should I do in the meantime?",
            "You can monitor your blood pressure daily and avoid salty foods and drinks",
            "That's helpful, how common is high blood pressure?",
            "It's a very common condition affecting a large percentage of adults worldwide",
            "What are the long-term effects of high blood pressure if left untreated?"
        ],
        "knowledge": "Hypertension Hypertension 8%  in rural India and as high as 68. 9%  and 72. 5%  in Poland.  Rates in Africa were about 45% in 2016. In Europe hypertension occurs in about 30–45% of people as of 2013.  In 1995 it was estimated that 43 million people  in the United States had hypertension or were taking antihypertensive medication.  By 2004 this had increased to 29% and further to 32%  by 2017 Hypertension Hypertension",
        "response": "High blood pressure can lead to serious complications such as heart disease, stroke, and kidney damage if left untreated"
    },
    {
        "dialog": [
            "Hi Medi, I have a question about hypertension.",
            "Sure, what's your question?",
            "What lifestyle changes can help reduce high blood pressure?",
            "Regular exercise, maintaining a healthy weight, reducing salt intake and avoiding alcohol and tobacco can help",
            "Can stress cause high blood pressure?",
            "Stress can cause temporary spikes in blood pressure, but it's not a long-term cause of hypertension",
            "That's good to know. How does high blood pressure affect the body?",
            "High blood pressure can damage the arteries and cause the heart to work harder than normal",
            "How can I prevent hypertension?"
        ],
        "knowledge": "Hypertension Hypertension 8%  in rural India and as high as 68. 9%  and 72. 5%  in Poland.  Rates in Africa were about 45% in 2016. In Europe hypertension occurs in about 30–45% of people as of 2013.  In 1995 it was estimated that 43 million people  in the United States had hypertension or were taking antihypertensive medication.  By 2004 this had increased to 29% and further to 32%  by 2017 Hypertension Hypertension",
        "response": "You can prevent hypertension by maintaining a healthy weight, exercising regularly, reducing salt intake, avoiding alcohol and tobacco, and managing stress"
    },
    {
        "dialog": [
            "Hi Medi, I recently had a medical procedure for hypertension",
            "That's great, how are you feeling?",
            "I feel much better now but I want to know what lifestyle changes I should make",
            "You should continue to monitor your blood pressure regularly and maintain a healthy lifestyle",
            "Can you give me some examples of a healthy lifestyle?",
            "Eating a well-balanced diet, getting regular exercise, reducing salt intake and avoiding smoking and alcohol",
            "What are some common side effects of antihypertensive medication?",
            "Common side effects include dizziness, headache, fatigue and nausea, but these usually go away quickly",
            "How long do I need to take medication for hypertension?"
        ],
        "knowledge": "Hypertension Hypertension 8%  in rural India and as high as 68. 9%  and 72. 5%  in Poland.  Rates in Africa were about 45% in 2016. In Europe hypertension occurs in about 30–45% of people as of 2013.  In 1995 it was estimated that 43 million people  in the United States had hypertension or were taking antihypertensive medication.  By 2004 this had increased to 29% and further to 32%  by 2017 Hypertension Hypertension",
        "response": "You may need to take medication for hypertension for the rest of your life, but this will depend on your individual condition and the advice of your doctor"
    },
    {
        "dialog": [
            "Hello Medi, I've been feeling very uneasy lately.",
            "Hi! What kind of symptoms have you been experiencing?",
            "I've been feeling dizzy, with a headache and my heart is pounding fast.",
            "Okay, I understand. How long have you been experiencing these symptoms?",
            "It's been going on for a few days now.",
            "You might be experiencing hypertension. May I know what you've been eating lately?",
            "I've been eating a lot of salty foods and junk food.",
            "That could be a possible cause. I suggest you avoid or minimize eating salty foods and start exercising regularly.",
            "What kind of exercises do you recommend?"
        ],
        "knowledge": "Hypertension Hypertension 8%  in rural India and as high as 68. 9%  and 72. 5%  in Poland.  Rates in Africa were about 45% in 2016. In Europe hypertension occurs in about 30–45% of people as of 2013.  In 1995 it was estimated that 43 million people  in the United States had hypertension or were taking antihypertensive medication.  By 2004 this had increased to 29% and further to 32% by 2017 Hypertension Hypertension",
        "response": "I recommend doing cardio exercises such as brisk walking, jogging, or cycling."
    },
    {
        "dialog": [
            "Hi Medi, I have some questions about hypertension.",
            "Sure, ask away!",
            "What is hypertension exactly?",
            "Hypertension is also known as high blood pressure, where the force of blood against the artery walls is consistently too high.",
            "What causes hypertension?",
            "There are various factors that can contribute to high blood pressure such as age, genetics, obesity, tobacco use, lack of physical activity, stress, and unhealthy diet.",
            "What are the symptoms of hypertension?",
            "Most of the time, people with hypertension don't experience any symptoms, that's why it's called the silent killer. However, some people may experience headache, dizziness, shortness of breath, and nosebleeds.",
            "How can hypertension be treated?"
        ],
        "knowledge": "Hypertension Hypertension 8%  in rural India and as high as 68. 9%  and 72. 5%  in Poland.  Rates in Africa were about 45% in 2016. In Europe hypertension occurs in about 30–45% of people as of 2013.  In 1995 it was estimated that 43 million people  in the United States had hypertension or were taking antihypertensive medication.  By 2004 this had increased to 29% and further to 32%  by 2017 Hypertension Hypertension",
        "response": "You're welcome!"
    },
    {
        "dialog": [
            "Hello Medi, I just had a medical procedure, what should I do now?",
            "Hi! You should rest and follow your doctor's instructions.",
            "Are there any guidelines on what I should eat?",
            "Yes, you should avoid eating greasy and spicy foods, and eat more fruits and vegetables.",
            "What about exercise?",
            "You should avoid strenuous physical activity for a few days and gradually increase your physical activity as you feel better.",
            "What about medication?",
            "You should take your medication as prescribed by your doctor and make sure that you finish the entire course of medication.",
            "Thanks for the advice, Medi!"
        ],
        "knowledge": "Hypertension Hypertension 8%  in rural India and as high as 68. 9%  and 72. 5%  in Poland.  Rates in Africa were about 45% in 2016. In Europe hypertension occurs in about 30–45% of people as of 2013.  In 1995 it was estimated that 43 million people  in the United States had hypertension or were taking antihypertensive medication.  By 2004 this had increased to 29% and further to 32%  by 2017 Hypertension Hypertension",
        "response": "You're welcome!"
    },
    {
        "dialog": [
            "Hi Medi, I feel like I have high blood pressure. What should I do?",
            "Hello, let's check the symptoms. How do you feel?",
            "I often feel dizzy and have a headache",
            "These symptoms may indicate high blood pressure. You should get a checkup from a healthcare professional.",
            "What can I do to prevent high blood pressure?",
            "You can reduce salt intake, exercise regularly, and maintain a healthy weight.",
            "Is there any medication to treat high blood pressure?",
            "Yes, there are many types of medication depending on your specific condition. You should consult a healthcare professional.",
            "Thank you, Medi. How common is high blood pressure? Is it curable? "
        ],
        "knowledge": "Hypertension Hypertension 8%  in rural India and as high as 68. 9%  and 72. 5%  in Poland.  Rates in Africa were about 45% in 2016. In Europe hypertension occurs in about 30–45% of people as of 2013.  In 1995 it was estimated that 43 million people  in the United States had hypertension or were taking antihypertensive medication.  By 2004 this had increased to 29% and further to 32%  by 2017 Hypertension Hypertension",
        "response": "Hypertension is quite common, affecting many people worldwide. While it is not curable, it can be managed with medication and lifestyle changes."
    },
    {
        "dialog": [
            "Hello Medi, I am curious about the causes of high blood pressure",
            "Hi, there are many factors that can cause high blood pressure, such as obesity, smoking, and genetics.",
            "Can stress also cause high blood pressure?",
            "Yes, stress is one of the factors that can cause high blood pressure. It is important to manage your stress levels.",
            "Are there any other risk factors I should be aware of?",
            "Yes, other risk factors include a sedentary lifestyle, high alcohol intake, and a diet high in sodium.",
            "Thank you, Medi. What are the complications of high blood pressure?",
            "High blood pressure can lead to heart disease, stroke, and kidney damage, among other complications. That's why it's important to manage it.",
            "I see. Can I live a normal life with high blood pressure? "
        ],
        "knowledge": "Hypertension Hypertension 8%  in rural India and as high as 68. 9%  and 72. 5%  in Poland.  Rates in Africa were about 45% in 2016. In Europe hypertension occurs in about 30–45% of people as of 2013.  In 1995 it was estimated that 43 million people  in the United States had hypertension or were taking antihypertensive medication.  By 2004 this had increased to 29% and further to 32%  by 2017 Hypertension Hypertension",
        "response": "Yes, with proper management and lifestyle changes, you can live a normal life with high blood pressure."
    },
    {
        "dialog": [
            "Hey Medi, I recently had a medical procedure to treat high blood pressure. What should I do now?",
            "Hello, after a medical procedure, it's important to follow the instructions of your healthcare professional. You should also maintain a healthy lifestyle, such as exercising regularly and maintaining a healthy diet.",
            "Are there any specific exercises I should do?",
            "Yes, low-impact exercises like swimming and walking are good choices. Make sure to consult your healthcare professional before starting any new exercises.",
            "What kind of diet should I follow?",
            "You should follow a diet rich in fruits and vegetables, whole grains, lean proteins, and low-fat dairy. It's also important to limit your salt and alcohol intake.",
            "Thank you, Medi. What else can I do to manage my high blood pressure?",
            "In addition to exercise and diet, you should also monitor your blood pressure regularly and take medication as prescribed by your healthcare professional. It's also important to manage your stress levels.",
            "I see. Thank you for your advice, Medi. "
        ],
        "knowledge": "Hypertension Hypertension 8%  in rural India and as high as 68. 9%  and 72. 5%  in Poland.  Rates in Africa were about 45% in 2016. In Europe hypertension occurs in about 30–45% of people as of 2013.  In 1995 it was estimated that 43 million people  in the United States had hypertension or were taking antihypertensive medication.  By 2004 this had increased to 29% and further to 32%  by 2017 Hypertension Hypertension",
        "response": "You're welcome. Following a healthy lifestyle, monitoring your blood pressure, taking medication, and managing your stress levels are all important steps to manage your high blood pressure."
    },
    {
        "dialog": [
            "Hi Medi, I have been experiencing some unusual changes in my blood pressure.",
            "Hello, what kind of changes have you been experiencing?",
            "My blood pressure has been fluctuating a lot lately, and I feel dizzy sometimes.",
            "Okay, have you been monitoring your blood pressure recently?",
            "Yes, I have been monitoring it daily and the readings have been high at times.",
            "Based on your description, it seems you might have hypertension.",
            "What can I do to manage hypertension?",
            "You can manage hypertension by maintaining a healthy lifestyle, avoiding high-sodium foods, and taking medication as prescribed by your doctor.",
            "Can hypertension be cured permanently?"
        ],
        "knowledge": "Hypertension Hypertension 8%  in rural India and as high as 68. 9%  and 72. 5%  in Poland.  Rates in Africa were about 45% in 2016. In Europe hypertension occurs in about 30–45% of people as of 2013.  In 1995 it was estimated that 43 million people  in the United States had hypertension or were taking antihypertensive medication.  By 2004 this had increased to 29% and further to 32%  by 2017 Hypertension Hypertension",
        "response": "There is no cure for hypertension but it can be managed through lifestyle changes and medication."
    },
    {
        "dialog": [
            "Hi Medi, I have a question about hypertension.",
            "Sure, go ahead and ask your question.",
            "What are the symptoms of hypertension?",
            "In most cases, hypertension does not have any noticeable symptoms, which is why it is often referred to as the 'silent killer'. However, in some cases, people may experience headaches, dizziness, or nosebleeds.",
            "Can I have hypertension even if I don't have any symptoms?",
            "Yes, you can have hypertension even without showing any symptoms. That's why it's important to monitor your blood pressure regularly.",
            "What is the risk of having hypertension?",
            "Hypertension can increase your risk of developing serious health problems such as heart disease, stroke, and kidney disease.",
            "How can I prevent hypertension?"
        ],
        "knowledge": "Hypertension Hypertension 8%  in rural India and as high as 68. 9%  and 72. 5%  in Poland.  Rates in Africa were about 45% in 2016. In Europe hypertension occurs in about 30–45% of people as of 2013.  In 1995 it was estimated that 43 million people  in the United States had hypertension or were taking antihypertensive medication.  By 2004 this had increased to 29% and further to 32%  by 2017 Hypertension Hypertension",
        "response": "You can prevent hypertension by maintaining a healthy lifestyle, such as eating a balanced diet, exercising regularly, avoiding excessive alcohol consumption, and not smoking."
    },
    {
        "dialog": [
            "Hi Medi, I had a medical procedure done recently.",
            "Okay, how are you feeling?",
            "I am feeling much better now, but I am not sure if there are any specific things I should do after the procedure to help with my recovery.",
            "It's important to follow the instructions given by your doctor to ensure a smooth recovery. In general, you should get plenty of rest, avoid strenuous activities, and eat a healthy and balanced diet.",
            "What kind of foods should I eat to aid in my recovery?",
            "You should eat foods that are rich in protein, vitamins, and minerals such as lean meats, fish, fruits, and vegetables. It's also important to stay hydrated by drinking plenty of water.",
            "When can I start exercising again?",
            "It depends on the type of procedure you had done and your doctor's instructions. It's important to avoid strenuous activities until you are cleared by your doctor to do so.",
            "What kind of physical activities can I do?"
        ],
        "knowledge": "Hypertension Hypertension 8%  in rural India and as high as 68. 9%  and 72. 5%  in Poland.  Rates in Africa were about 45% in 2016. In Europe hypertension occurs in about 30–45% of people as of 2013.  In 1995 it was estimated that 43 million people  in the United States had hypertension or were taking antihypertensive medication.  By 2004 this had increased to 29% and further to 32%  by 2017 Hypertension Hypertension",
        "response": "You should stick to low-impact activities such as walking or light yoga until you are cleared by your doctor to engage in more strenuous physical activities."
    },
    {
        "dialog": [
            "Hello Medi, I feel a pain in my chest.",
            "I'm sorry to hear that. Can you describe the pain for me?",
            "It feels like a tightness or pressure in the center of my chest.",
            "How long have you been experiencing this pain?",
            "It started about an hour ago and hasn't gone away.",
            "Based on your symptoms, you may be experiencing a heart attack. You should seek medical attention immediately.",
            "Okay, I'll go to the hospital. Thank you for your help, Medi.",
            "You're welcome. Please take care of yourself.",
            "Can you tell me what causes a heart attack, Medi?"
        ],
        "knowledge": "Heart Attack Heart Attack A heart attack occurs when the flow of blood to the heart is blocked, most often by a build-up of fat, cholesterol and other substances, which form a plaque in the arteries that feed the heart (coronary arteries). The interrupted blood flow can damage or destroy part of the heart muscle.  The most common symptom of a heart attack is chest pain, usually described as crushing, squeezing, pressing, heavy, or full. The pain may spread to the shoulders, neck, arms, jaw, or back, and may also feel like indigestion. Other possible symptoms include shortness of breath, nausea, vomiting, dizziness, lightheadedness, sweating, and anxiety.  Risk factors for heart attacks include smoking, high blood pressure, high cholesterol, diabetes, obesity, lack of physical activity, and family history of heart disease. Heart Attack Heart Attack  ",
        "response": "A heart attack occurs when the flow of blood to the heart is blocked by a build-up of fat, cholesterol and other substances, which form a plaque in the arteries that feed the heart (coronary arteries)."
    },
    {
        "dialog": [
            "Hello Medi, I'm concerned about my blood pressure.",
            "What's your current blood pressure reading?",
            "I'm not sure, but I have a family history of high blood pressure.",
            "It's important to monitor your blood pressure regularly, especially if there's a family history of high blood pressure. You may want to schedule an appointment with your doctor.",
            "Okay, I will. Thanks for the advice, Medi.",
            "You're welcome. Is there anything else I can help you with?",
            "Yes, can you tell me the causes of high blood pressure?",
            "There are many factors that can contribute to high blood pressure, including a family history of high blood pressure, unhealthy diet, lack of physical activity, stress, and smoking.",
            "I see. Thank you for the information, Medi."
        ],
        "knowledge": "Hypertension Hypertension 8%  in rural India and as high as 68. 9%  and 72. 5%  in Poland.  Rates in Africa were about 45% in 2016. In Europe hypertension occurs in about 30–45% of people as of 2013.  In 1995 it was estimated that 43 million people  in the United States had hypertension or were taking antihypertensive medication.  By 2004 this had increased to 29% and further to 32%  by 2017 Hypertension Hypertension",
        "response": "High blood pressure can be caused by a family history of high blood pressure, unhealthy diet, lack of physical activity, stress, and smoking."
    },
    {
        "dialog": [
            "Hello Medi, I just had surgery on my knee.",
            "I hope your surgery went well. How can I assist you?",
            "I want to know what kind of physical activity I can do to help with my recovery.",
            "It's important to follow your doctor's recommendations for physical activity after surgery. In general, low-impact exercises like walking, swimming, and cycling can be helpful for recovery.",
            "What about strength training exercises?",
            "It's best to wait until you're fully healed and cleared by your doctor before beginning any strength training exercises.",
            "What about my diet?",
            "A balanced diet with plenty of fruits, vegetables, lean proteins, and whole grains can help with your recovery.",
            "I see. Thank you for the information, Medi."
        ],
        "knowledge": "Knee Surgery Knee Surgery Recovery after knee surgery typically involves physical therapy and exercise to regain strength and mobility in the knee. Low-impact exercises like walking, swimming, and cycling can be helpful for recovery. Strength training exercises should be avoided until fully healed and cleared by a doctor. A balanced diet with plenty of fruits, vegetables, lean proteins, and whole grains can also aid in recovery. Pain and swelling can be managed with medication and rest. Knee Surgery Knee Surgery",
        "response": "Thank you for the information, Medi."
    },
    {
        "dialog": [
            "Hello Medi, I have a question about hypertension.",
            "Sure thing! What would you like to know?",
            "What are some common symptoms of hypertension?",
            "Some of the most common symptoms include headaches, dizziness, and shortness of breath.",
            "I see. And how is hypertension typically diagnosed?",
            "Hypertension is typically diagnosed by measuring your blood pressure. A reading of 140/90 mmHg or higher is considered high blood pressure.",
            "Okay, thanks for the information. What are some lifestyle changes I can make to manage hypertension?",
            "Some lifestyle changes that can help manage hypertension include reducing salt intake, maintaining a healthy weight, and increasing physical activity.",
            "Great, thank you! Is there anything else I should know about hypertension?"
        ],
        "knowledge": "Hypertension Hypertension 8%  in rural India and as high as 68. 9%  and 72. 5%  in Poland.  Rates in Africa were about 45% in 2016. In Europe hypertension occurs in about 30–45% of people as of 2013.  In 1995 it was estimated that 43 million people  in the United States had hypertension or were taking antihypertensive medication.  By 2004 this had increased to 29% and further to 32%  by 2017 Hypertension Hypertension",
        "response": "Just remember to take any medication your doctor prescribes and monitor your blood pressure regularly."
    },
    {
        "dialog": [
            "Hi Medi, I recently had a medical procedure and I'm not sure what I should be eating.",
            "Of course! What procedure did you have?",
            "I had surgery on my gallbladder.",
            "After gallbladder surgery, it's important to adjust your diet to help your body adjust. I recommend focusing on low-fat, high-fiber foods and avoiding greasy or fried foods.",
            "Got it. Can you give me some examples of foods I should be eating?",
            "Sure, some examples of foods you can eat include lean protein sources like chicken or fish, whole grains like brown rice or quinoa, and plenty of fruits and vegetables.",
            "That sounds doable. Should I be avoiding anything in particular?",
            "Definitely avoid high-fat or fried foods, as well as anything spicy or acidic that might irritate your digestive system.",
            "Thanks for the advice, Medi! Is there anything else I should be doing to help my recovery?"
        ],
        "knowledge": "Gallbladder Surgery Gallbladder Surgery After gallbladder surgery, it's important to adjust your diet to help your body adjust. Focus on low-fat, high-fiber foods and avoid greasy or fried foods. Lean protein sources like chicken or fish, whole grains like brown rice or quinoa, and plenty of fruits and vegetables are great choices. Avoid high-fat or fried foods, as well as anything spicy or acidic that might irritate your digestive system.",
        "response": "Make sure to stay hydrated and get plenty of rest to help your body recover."
    },
    {
        "dialog": [
            "Hi there, Medi. I'm concerned about my risk for hypertension.",
            "I'm here to help! What's going on?",
            "I have a family history of hypertension, and I'm worried I might develop it too.",
            "Family history is definitely a risk factor for hypertension. What other risk factors do you have?",
            "Well, I'm overweight and I don't exercise as much as I should.",
            "Those are definitely things that can increase your risk. I recommend focusing on weight loss and exercise to help manage your risk.",
            "That makes sense. What kind of exercise should I be doing?",
            "Anything that gets your heart rate up, like brisk walking, swimming, or cycling. Aim for at least 30 minutes a day, most days of the week.",
            "Got it. And what about my diet?"
        ],
        "knowledge": "Hypertension Hypertension 8%  in rural India and as high as 68. 9%  and 72. 5%  in Poland.  Rates in Africa were about 45% in 2016. In Europe hypertension occurs in about 30–45% of people as of 2013.  In 1995 it was estimated that 43 million people  in the United States had hypertension or were taking antihypertensive medication.  By 2004 this had increased to 29% and further to 32%  by 2017 Hypertension Hypertension",
        "response": "Just remember to monitor your blood pressure regularly and talk to your doctor about any concerns you have."
    },
    {
        "dialog": [
            "Hi Medi, I have been experiencing headaches and dizziness.",
            "I see. Can you provide more context about your symptoms?",
            "I have been experiencing these symptoms for the past few days, and they have been getting worse.",
            "Based on your symptoms, it is possible that you have high blood pressure. I recommend monitoring your blood pressure and seeing a doctor.",
            "What can I do to manage high blood pressure?",
            "You can manage high blood pressure by exercising regularly, eating a healthy diet, reducing sodium intake, and avoiding alcohol and tobacco.",
            "What are the long-term effects of high blood pressure?",
            "High blood pressure can lead to heart disease, stroke, and kidney failure if left untreated.",
            "Thank you for your advice, Medi. I will seek medical attention."
        ],
        "knowledge": "Hypertension Hypertension 8%  in rural India and as high as 68. 9%  and 72. 5%  in Poland.  Rates in Africa were about 45% in 2016. In Europe hypertension occurs in about 30–45% of people as of 2013.  In 1995 it was estimated that 43 million people  in the United States had hypertension or were taking antihypertensive medication.  By 2004 this had increased to 29% and further to 32%  by 2017 Hypertension Hypertension",
        "response": "You're welcome. It's important to monitor your blood pressure and seek medical attention if necessary."
    },
    {
        "dialog": [
            "Hey Medi, I have a question about hypertension.",
            "Sure, I'd be happy to help. What's your question?",
            "What are the risk factors for hypertension?",
            "There are several risk factors for hypertension, including obesity, smoking, stress, and a family history of hypertension.",
            "Can hypertension be prevented?",
            "Yes, hypertension can be prevented by maintaining a healthy weight, exercising regularly, eating a healthy diet, and avoiding tobacco and excessive alcohol consumption.",
            "What are some of the complications of hypertension?",
            "Hypertension can lead to several complications, including heart disease, stroke, kidney failure, and vision loss.",
            "Thank you for the information, Medi. It's very helpful."
        ],
        "knowledge": "Hypertension Hypertension 8%  in rural India and as high as 68. 9%  and 72. 5%  in Poland.  Rates in Africa were about 45% in 2016. In Europe hypertension occurs in about 30–45% of people as of 2013.  In 1995 it was estimated that 43 million people  in the United States had hypertension or were taking antihypertensive medication.  By 2004 this had increased to 29% and further to 32%  by 2017 Hypertension Hypertension",
        "response": "You're welcome. It's important to understand the risk factors and complications of hypertension to prevent it and manage it effectively."
    },
    {
        "dialog": [
            "Hi Medi, I recently had a medical procedure done and I'm not sure what to do next",
            "I understand. Can you provide more context about your medical procedure?",
            "I had a heart bypass surgery a week ago and I'm not sure what I should be doing for my recovery.",
            "After heart bypass surgery, it is important to rest and avoid strenuous activities. Your doctor may recommend physical therapy to help you regain strength.",
            "What can I do to help my recovery?",
            "You can help your recovery by eating a healthy diet, avoiding tobacco and excessive alcohol consumption, and following your doctor's instructions for post-op care and medications.",
            "What are some things I should avoid during my recovery?",
            "You should avoid lifting heavy objects, driving, and sexual activity until your doctor clears you to do so.",
            "Thank you for the information, Medi. I appreciate your help."
        ],
        "knowledge": "Heart Bypass Surgery Heart Bypass Surgery  The procedure involves grafting arteries or veins from elsewhere in the patient's body to bypass the blocked or narrowed arteries.  The surgeon may use a bypass machine to perform the surgery.  Recovery time varies from several weeks to several months.  After surgery, patients are usually monitored in the hospital for a few days and then sent home to recover.  It is important to rest and avoid strenuous activities during this time.  Your doctor may recommend physical therapy to help you regain strength.  You should also follow your doctor's instructions for post-op care and medications. Heart Bypass Surgery Heart Bypass Surgery",
        "response": "You're welcome. It's important to follow your doctor's instructions for post-op care and take care of yourself during your recovery."
    },
    {
        "dialog": [
            "Hello Medi, I'm feeling dizzy and my head hurts.",
            "I understand, can you tell me more about your symptoms?",
            "My head feels heavy and I'm having trouble concentrating.",
            "I see, have you been drinking water regularly?",
            "I haven't been drinking much water lately.",
            "You should drink more water and get some rest.",
            "Thank you Medi, should I take any medicine?",
            "No, you should try to rest and if the symptoms persist, see a doctor.",
            "Okay, I'll do that. Thank you."
        ],
        "knowledge": "Dehydration Dehydration Symptoms of dehydration include thirst, dark yellow urine, dry skin, fatigue, light-headedness, dizziness, confusion, dry mouth and throat, and dry eyes.  Severe dehydration can cause fever, rapid heartbeat, rapid breathing, sunken eyes, and confusion. Dehydration can be caused by sweating, vomiting, diarrhea, fever, and not drinking enough fluids. Dehydration Dehydration",
        "response": "You should drink more water and get some rest. If the symptoms persist, see a doctor."
    },
    {
        "dialog": [
            "Hi Medi, I've been diagnosed with hypertension. What should I do?",
            "Good day, you need to take medication prescribed by a doctor.",
            "I am already taking medication. Is there anything else I can do?",
            "You can also manage your diet and exercise regularly.",
            "What kind of food should I eat?",
            "You should avoid processed foods and reduce your salt intake.",
            "What about exercise?",
            "Regular exercise can help lower your blood pressure, try doing 30 minutes of moderate exercise a day.",
            "Thank you Medi, any other advice you can give me?"
        ],
        "knowledge": "Hypertension Hypertension 8% in rural India and as high as 68.9% and 72.5% in Poland. Rates in Africa were about 45% in 2016. In Europe hypertension occurs in about 30–45% of people as of 2013. In 1995 it was estimated that 43 million people in the United States had hypertension or were taking antihypertensive medication. By 2004 this had increased to 29% and further to 32% by 2017 Hypertension Hypertension",
        "response": "Make sure to monitor your blood pressure regularly and report any changes to your doctor."
    },
    {
        "dialog": [
            "Hi Medi, I just had surgery on my knee. What can I do to help with the recovery process?",
            "Hello, you should rest and avoid putting weight on the knee for a few days.",
            "What about diet?",
            "A healthy and balanced diet can help with the healing process. Make sure to eat enough protein.",
            "Can I do any exercises?",
            "You can do some gentle exercises as recommended by your doctor or physical therapist.",
            "Are there any physical activities I should avoid?",
            "Avoid any high-impact activities such as running or jumping until your knee is fully healed.",
            "Thanks for the advice Medi, when can I expect to fully recover?"
        ],
        "knowledge": "Knee surgery Knee surgery is a medical procedure where a surgeon repairs or replaces a damaged knee joint. Recovery time can vary depending on the type of surgery and the patient's overall health. Patients may need to rest and avoid putting weight on the knee for a few days after surgery. Physical therapy and gentle exercises can help with the healing process. Patients should avoid high-impact activities such as running or jumping until the knee is fully healed. Knee surgery Knee surgery",
        "response": "It depends on the type of surgery and your body's healing process. Your doctor will give you a timeline for recovery."
    }
]