[
    {
        "dialog": [
            "Hi Medi, I have been diagnosed with type 2 diabetes.",
            "Hello. I'm here to help. Would you like more information about this type of diabetes?",
            "Yes, please.",
            "Type 2 diabetes is a common form of diabetes that affects how your body processes blood sugar. It's known to be caused by lifestyle factors and genetics.",
            "I see. What can I do to manage my diabetes?",
            "There are many ways to manage diabetes, including lifestyle changes and medication. Regular exercise, a healthy diet, and monitoring blood sugar levels are great places to start.",
            "What about home telehealth support?",
            "Home telehealth support can be very effective for managing diabetes. It includes computer-based self-management interventions to collect tailored responses to facilitate self-management.",
            "That's great to know. What are some things I should avoid eating?"
        ],
        "knowledge": "Diabetes Diabetes  Home telehealth support can be an effective management technique. The use of technology to deliver educational programs for adults with type 2 diabetes includes computer-based self-management interventions to collect for tailored responses to facilitate self-management.  There is no adequate evidence to support effects on cholesterol, blood pressure, behavioral change , depression, weight and health-related quality of life, nor in other biological, cognitive or emotional outcomes. In 2017, 425 million people had diabetes worldwide, up from an estimated 382 million people in 2013 and from 108 million in 1980.  Accounting for the shifting age structure of the global population, the prevalence of diabetes is 8. 8% among adults, nearly double the rate of 4. 7% in 1980 Diabetes Diabetes",
        "response": "You should avoid eating sugary foods and drinks as well as processed foods that are high in saturated fats."
    },
    {
        "dialog": [
            "Hi, Medi. I'm not sure if I have diabetes. Can you help me?",
            "Of course, I can. What are some symptoms you have been experiencing?",
            "I'm always feeling thirsty, and I have to use the bathroom frequently.",
            "Those are common symptoms of diabetes. Do you have any other symptoms?",
            "Sometimes, I feel like I'm always hungry, and I'm losing weight without trying.",
            "Hmm, those are also symptoms of diabetes. It would be best for you to get tested as soon as possible.",
            "Okay, thank you. What kind of test should I get?",
            "You should get a blood glucose test. That will help diagnose whether or not you have diabetes.",
            "Okay, I will do that. Thanks for your help, Medi."
        ],
        "knowledge": "Diabetes Diabetes  Home telehealth support can be an effective management technique. The use of technology to deliver educational programs for adults with type 2 diabetes includes computer-based self-management interventions to collect for tailored responses to facilitate self-management.  There is no adequate evidence to support effects on cholesterol, blood pressure, behavioral change , depression, weight and health-related quality of life, nor in other biological, cognitive or emotional outcomes. In 2017, 425 million people had diabetes worldwide, up from an estimated 382 million people in 2013 and from 108 million in 1980.  Accounting for the shifting age structure of the global population, the prevalence of diabetes is 8. 8% among adults, nearly double the rate of 4. 7% in 1980 Diabetes Diabetes",
        "response": "You're welcome. I hope the test goes well for you. If you do have diabetes, we can talk about a management plan."
    },
    {
        "dialog": [
            "Hi, Medi. I've recently been diagnosed with diabetes. Can you give me some tips on managing my diet?",
            "Of course, I can. The key to managing diabetes is a healthy diet. You should avoid sugary drinks and foods.",
            "What should I be eating more of?",
            "You should focus on eating more vegetables, fruits, lean meat, and whole grains. You should also try to avoid processed foods.",
            "Okay. What about physical exercise?",
            "Physical exercise is also important for managing diabetes. You should aim to get at least 30 minutes of exercise per day, five days a week.",
            "That sounds challenging. Do you have any tips on how to stay motivated?",
            "Sure, setting goals for yourself and finding a workout buddy can help keep you motivated. And remember, every little bit counts, so try to find ways to be active throughout the day, like taking the stairs instead of the elevator.",
            "Okay, thank you for your help, Medi."
        ],
        "knowledge": "Diabetes Diabetes  Home telehealth support can be an effective management technique. The use of technology to deliver educational programs for adults with type 2 diabetes includes computer-based self-management interventions to collect for tailored responses to facilitate self-management.  There is no adequate evidence to support effects on cholesterol, blood pressure, behavioral change , depression, weight and health-related quality of life, nor in other biological, cognitive or emotional outcomes. In 2017, 425 million people had diabetes worldwide, up from an estimated 382 million people in 2013 and from 108 million in 1980.  Accounting for the shifting age structure of the global population, the prevalence of diabetes is 8. 8% among adults, nearly double the rate of 4. 7% in 1980 Diabetes Diabetes",
        "response": "You're welcome. Remember, managing diabetes is a journey, so don't be too hard on yourself. Celebrate your progress and take it one day at a time."
    },
    {
        "dialog": [
            "Hi Medi, I am worried about my blood sugar levels.",
            "Hello, I am here to help. What symptoms are you experiencing?",
            "I feel thirsty and tired all the time, and I urinate frequently.",
            "Hmm, those are common symptoms of high blood sugar levels. Have you been monitoring your blood glucose?",
            "Yes, I have. My levels have been consistently high.",
            "I see. It's important to manage your blood sugar levels. You should consider making some lifestyle changes and taking medication if necessary.",
            "What kind of lifestyle changes should I make?",
            "You should follow a healthy diet, exercise regularly, and monitor your blood sugar levels regularly.",
            "Thanks for the advice, Medi. Is there anything else I should know about type 2 diabetes?"
        ],
        "knowledge": "Diabetes Diabetes Home telehealth support can be an effective management technique. The use of technology to deliver educational programs for adults with type 2 diabetes includes computer-based self-management interventions to collect for tailored responses to facilitate self-management.  There is no adequate evidence to support effects on cholesterol, blood pressure, behavioral change , depression, weight and health-related quality of life, nor in other biological, cognitive or emotional outcomes. In 2017, 425 million people had diabetes worldwide, up from an estimated 382 million people in 2013 and from 108 million in 1980.  Accounting for the shifting age structure of the global population, the prevalence of diabetes is 8. 8% among adults, nearly double the rate of 4. 7% in 1980 Diabetes Diabetes",
        "response": "There's a lot to know about type 2 diabetes, but for now, focus on monitoring your blood sugar levels and making lifestyle changes."
    },
    {
        "dialog": [
            "Hi Medi, I have a question about diabetes.",
            "Sure. I'll do my best to answer your question.",
            "I've heard that type 2 diabetes is caused by lifestyle factors and genetics. Is this true?",
            "Yes, that's correct. Type 2 diabetes is primarily caused by lifestyle factors such as lack of physical activity, unhealthy diet, and obesity. Genetics can also play a role.",
            "Is it possible to prevent type 2 diabetes?",
            "Yes, it is possible to prevent or delay type 2 diabetes by making lifestyle changes such as eating a healthy diet, exercising regularly, and maintaining a healthy weight.",
            "That's good to know. What are some common symptoms of type 2 diabetes?",
            "Some common symptoms include frequent urination, excessive thirst, fatigue, blurred vision, and slow healing wounds.",
            "Thanks for the information, Medi. It's very helpful."
        ],
        "knowledge": "Diabetes Diabetes The defective responsiveness of body tissues to insulin is believed to involve the insulin receptor.  However, the specific defects are not known.  Diabetes mellitus cases due to a known defect are classified separately.  Type 2 diabetes is the most common type of diabetes mellitus accounting for 95% of diabetes.  Many people with type 2 diabetes have evidence of prediabetes before meeting the criteria for type 2 diabetes.  The progression of prediabetes to overt type 2 diabetes can be slowed or reversed by lifestyle changes or medications that improve insulin sensitivity or reduce the liver's glucose production. Type 2 diabetes is primarily due to lifestyle factors and genetics Diabetes Diabetes",
        "response": "You're welcome. I'm glad I could help. Do you have any other questions about diabetes?"
    },
    {
        "dialog": [
            "Hi Medi, I just had a medical procedure done and I want to know how I can improve my health.",
            "Of course. What kind of procedure did you have done?",
            "I had gastric bypass surgery to help me lose weight.",
            "After a gastric bypass surgery, it's important to follow a strict diet and exercise plan to maintain your weight loss and improve your overall health. You should also take any medication prescribed by your doctor.",
            "What kind of diet should I follow?",
            "You should follow a high protein diet and avoid sugary and fried foods. Eat small, frequent meals throughout the day and drink plenty of water.",
            "What about exercise?",
            "You should aim to exercise for at least 30 minutes a day, 5 days a week. Start with low-impact exercises such as walking or swimming and gradually increase your intensity and duration.",
            "Thanks for the advice, Medi. I'll make sure to follow it."
        ],
        "knowledge": "Obesity Obesity Obesity is a complex public health and policy problem because of its prevalence, costs, and health effects.  As such, managing it requires changes in the wider societal context and effort by communities, local authorities, and governments.  Public health efforts seek to understand and correct the environmental factors responsible for the increasing prevalence of obesity in the population.  Solutions look at changing the factors that cause excess food energy consumption and inhibit physical activity.  Efforts include federally reimbursed meal programs in schools, limiting direct junk food marketing to children, and decreasing access to sugar-sweetened beverages in schools.  The World Health Organization recommends the taxing of sugary drinks.  When constructing urban environments, efforts have been made to increase access to parks and to develop pedestrian routes Obesity Obesity",
        "response": "You're welcome. Remember to follow up with your doctor regularly to monitor your progress."
    },
    {
        "dialog": [
            "Hi Medi, I have a concern about my diabetes type 2.",
            "Sure, I can help you. What is your concern?",
            "I have difficulty controlling my blood sugar levels.",
            "Have you been checking your blood sugar regularly?",
            "Yes, I have been doing it regularly but still I can not control it.",
            "One way to control it is to adjust your diet and lifestyle.",
            "I see, so what kind of food should I eat and what should I avoid?",
            "You should have a balanced diet and avoid sugary and processed foods.",
            "Okay, I will do that. Thank you Medi."
        ],
        "knowledge": "Diabetes Diabetes  Home telehealth support can be an effective management technique. The use of technology to deliver educational programs for adults with type 2 diabetes includes computer-based self-management interventions to collect for tailored responses to facilitate self-management.  There is no adequate evidence to support effects on cholesterol, blood pressure, behavioral change , depression, weight and health-related quality of life, nor in other biological, cognitive or emotional outcomes. In 2017, 425 million people had diabetes worldwide, up from an estimated 382 million people in 2013 and from 108 million in 1980.  Accounting for the shifting age structure of the global population, the prevalence of diabetes is 8. 8% among adults, nearly double the rate of 4. 7% in 1980 Diabetes Diabetes",
        "response": "You're welcome. Don't hesitate to consult me for further inquiries or concerns."
    },
    {
        "dialog": [
            "Hi Medi, can you tell me more about diabetes type 2?",
            "Of course, I would love to help. What do you want to know specifically?",
            "I want to know how it affects my health and what are the risks?",
            "Diabetes type 2 can affect your eyes, heart, kidneys, and nerves over time.",
            "That sounds serious, how can I prevent it?",
            "You can prevent it by maintaining a healthy diet, exercising regularly, and avoiding smoking and excessive alcohol intake.",
            "I see, thanks for the information Medi. Do you have any advice on what kind of exercises I should do?",
            "Yes, aerobic exercises like brisk walking, cycling, and swimming are good for people with diabetes type 2.",
            "Okay, I will try to do those exercises regularly. Thank you Medi."
        ],
        "knowledge": "Diabetes Diabetes  Home telehealth support can be an effective management technique. The use of technology to deliver educational programs for adults with type 2 diabetes includes computer-based self-management interventions to collect for tailored responses to facilitate self-management.  There is no adequate evidence to support effects on cholesterol, blood pressure, behavioral change , depression, weight and health-related quality of life, nor in other biological, cognitive or emotional outcomes. In 2017, 425 million people had diabetes worldwide, up from an estimated 382 million people in 2013 and from 108 million in 1980.  Accounting for the shifting age structure of the global population, the prevalence of diabetes is 8. 8% among adults, nearly double the rate of 4. 7% in 1980 Diabetes Diabetes",
        "response": "You're welcome. I'm glad to be of help. Keep up the good work in maintaining your health!"
    },
    {
        "dialog": [
            "Hi Medi, I have just been diagnosed with diabetes type 2. Can you give me some advice on how to manage it?",
            "Of course, managing diabetes type 2 can be done by adjusting your diet and lifestyle.",
            "Yes, I heard about that. But what specifically should I do to manage it?",
            "You should avoid sugary and processed foods, eat more vegetables and fruits, and do physical exercises regularly.",
            "That sounds good. But how do I know if my blood sugar level is under control?",
            "You can regularly check your blood sugar level and make sure it stays within the normal range.",
            "I see. But is it okay to take medication to control my blood sugar level?",
            "Yes, medication can help control your blood sugar level if it is not within normal range even after you adjust your diet and lifestyle.",
            "Okay, I will keep that in mind. Thank you for your advice Medi."
        ],
        "knowledge": "Diabetes Diabetes  Home telehealth support can be an effective management technique. The use of technology to deliver educational programs for adults with type 2 diabetes includes computer-based self-management interventions to collect for tailored responses to facilitate self-management.  There is no adequate evidence to support effects on cholesterol, blood pressure, behavioral change , depression, weight and health-related quality of life, nor in other biological, cognitive or emotional outcomes. In 2017, 425 million people had diabetes worldwide, up from an estimated 382 million people in 2013 and from 108 million in 1980.  Accounting for the shifting age structure of the global population, the prevalence of diabetes is 8. 8% among adults, nearly double the rate of 4. 7% in 1980 Diabetes Diabetes",
        "response": "You're welcome. Remember to also consult with your doctor for further advice and treatment."
    },
    {
        "dialog": [
            "Hi Medi, I have been diagnosed with type 2 diabetes. What should I do now?",
            "Hello. I would advise you to modify your lifestyle and try to improve your diet. ",
            "What about sugar intake?",
            "You should limit your sugar intake to avoid the progression of the disease. ",
            "What about physical exercise?",
            "Physical exercise is very important for managing your disease. ",
            "How about medication?",
            "If lifestyle changes aren't enough, medication can be prescribed by your doctor. ",
            "What kind of medication is it?"
        ],
        "knowledge": "Diabetes Diabetes Home telehealth support can be an effective management technique. The use of technology to deliver educational programs for adults with type 2 diabetes includes computer-based self-management interventions to collect for tailored responses to facilitate self-management.  There is no adequate evidence to support effects on cholesterol, blood pressure, behavioral change , depression, weight and health-related quality of life, nor in other biological, cognitive or emotional outcomes. In 2017, 425 million people had diabetes worldwide, up from an estimated 382 million people in 2013 and from 108 million in 1980.  Accounting for the shifting age structure of the global population, the prevalence of diabetes is 8. 8% among adults, nearly double the rate of 4. 7% in 1980 Diabetes Diabetes",
        "response": "The medication can be insulin or oral medication that improves insulin sensitivity."
    },
    {
        "dialog": [
            "Medi, I have type 2 diabetes, but I love to eat sweet food. What can I do?",
            "There are many sugar substitutes on the market that you can use instead of sugar.",
            "Are they healthy?",
            "They are generally safe, but you should consult your doctor before using them.",
            "What about fruit?",
            "Fruit is a great way to satisfy your sweet tooth without consuming too much sugar.",
            "Any other advice?",
            "Try to eat a balanced diet that includes a variety of nutrients to help manage your disease.",
            "What should I avoid?"
        ],
        "knowledge": "Diabetes Diabetes Home telehealth support can be an effective management technique. The use of technology to deliver educational programs for adults with type 2 diabetes includes computer-based self-management interventions to collect for tailored responses to facilitate self-management.  There is no adequate evidence to support effects on cholesterol, blood pressure, behavioral change , depression, weight and health-related quality of life, nor in other biological, cognitive or emotional outcomes. In 2017, 425 million people had diabetes worldwide, up from an estimated 382 million people in 2013 and from 108 million in 1980.  Accounting for the shifting age structure of the global population, the prevalence of diabetes is 8. 8% among adults, nearly double the rate of 4. 7% in 1980 Diabetes Diabetes",
        "response": "You should avoid sugary drinks, processed foods, and high-carb foods."
    },
    {
        "dialog": [
            "Hi Medi, I have recently had a medical procedure. What should I do now?",
            "It's important to rest and to follow the instructions provided by your doctor.",
            "What about diet?",
            "You should eat a well-balanced diet and avoid foods that can interfere with your healing process.",
            "What about physical activities?",
            "You should avoid strenuous activities and exercises until your doctor gives you clearance to do so.",
            "What about medications?",
            "You should take any prescribed medications as directed by your doctor.",
            "What if I experience pain?"
        ],
        "knowledge": "Diabetes Diabetes Home telehealth support can be an effective management technique. The use of technology to deliver educational programs for adults with type 2 diabetes includes computer-based self-management interventions to collect for tailored responses to facilitate self-management.  There is no adequate evidence to support effects on cholesterol, blood pressure, behavioral change , depression, weight and health-related quality of life, nor in other biological, cognitive or emotional outcomes. In 2017, 425 million people had diabetes worldwide, up from an estimated 382 million people in 2013 and from 108 million in 1980.  Accounting for the shifting age structure of the global population, the prevalence of diabetes is 8. 8% among adults, nearly double the rate of 4. 7% in 1980 Diabetes Diabetes",
        "response": "You should contact your doctor if you experience any pain or discomfort after the procedure."
    },
    {
        "dialog": [
            "Hi Medi, I have recently been diagnosed with type 2 diabetes.",
            "I'm sorry to hear that. How can I help you?",
            "Is there anything I can do to reduce the impact of diabetes on my life?",
            "Yes, lifestyle changes can be very effective. You can exercise regularly and eat a balanced diet to control your blood sugar levels.",
            "What should be included in my diet?",
            "A healthy diet should include whole-grain foods, fruits, vegetables, and lean protein sources.",
            "What else can I do to manage the disease?",
            "It's important to monitor your blood sugar levels and take medications as prescribed by your doctor.",
            "Thanks for the advice, Medi. Can you tell me more about the prevalence of diabetes?"
        ],
        "knowledge": "Diabetes Diabetes  Home telehealth support can be an effective management technique. The use of technology to deliver educational programs for adults with type 2 diabetes includes computer-based self-management interventions to collect for tailored responses to facilitate self-management.  There is no adequate evidence to support effects on cholesterol, blood pressure, behavioral change , depression, weight and health-related quality of life, nor in other biological, cognitive or emotional outcomes. In 2017, 425 million people had diabetes worldwide, up from an estimated 382 million people in 2013 and from 108 million in 1980.  Accounting for the shifting age structure of the global population, the prevalence of diabetes is 8. 8% among adults, nearly double the rate of 4. 7% in 1980 Diabetes Diabetes",
        "response": "Yes, the prevalence of diabetes is increasing globally, and it's important to manage it effectively."
    },
    {
        "dialog": [
            "Hi Medi, I've been experiencing some symptoms lately and I'm concerned that it might be diabetes.",
            "I'm here to help. What symptoms are you experiencing?",
            "I have been feeling more thirsty than usual and have been urinating more frequently. I'm also feeling more fatigued than usual.",
            "Those could be symptoms of diabetes, but there are other conditions that could cause similar symptoms. I recommend that you see a doctor for a proper diagnosis.",
            "Is there anything I can do in the meantime to manage my symptoms?",
            "You can try to eat a healthy diet and exercise regularly. This can help control your blood sugar levels and improve your overall health.",
            "Thank you, Medi. Can you tell me more about the causes of diabetes?",
            "Type 1 diabetes is caused by a lack of insulin, while type 2 diabetes is caused by insulin resistance. Both types may have a genetic component.",
            "I see. Is diabetes a curable disease?"
        ],
        "knowledge": "Diabetes Diabetes  Home telehealth support can be an effective management technique. The use of technology to deliver educational programs for adults with type 2 diabetes includes computer-based self-management interventions to collect for tailored responses to facilitate self-management.  There is no adequate evidence to support effects on cholesterol, blood pressure, behavioral change , depression, weight and health-related quality of life, nor in other biological, cognitive or emotional outcomes. In 2017, 425 million people had diabetes worldwide, up from an estimated 382 million people in 2013 and from 108 million in 1980.  Accounting for the shifting age structure of the global population, the prevalence of diabetes is 8. 8% among adults, nearly double the rate of 4. 7% in 1980 Diabetes Diabetes",
        "response": "Currently, there is no cure for diabetes, but it can be managed effectively with the right treatment and lifestyle changes."
    },
    {
        "dialog": [
            "Hi Medi, I recently underwent surgery for my diabetes. What can I do to speed up my recovery and manage my condition better?",
            "I'm here to help. What type of surgery did you have?",
            "I had gastric bypass surgery to help me lose weight and manage my diabetes.",
            "That's a major surgery, and it's important that you follow your doctor's instructions for a speedy recovery. In terms of managing your diabetes, it's important to monitor your blood sugar levels and take your medications as prescribed.",
            "Are there any lifestyle changes I can make to help manage my diabetes?",
            "Yes, you can try to eat a healthy diet, exercise regularly, and quit smoking if you smoke. These changes can help you manage your diabetes and improve your overall health.",
            "Thank you, Medi. Can you tell me more about the long-term effects of diabetes?",
            "Diabetes can lead to a variety of long-term complications, including nerve damage, kidney damage, and eye damage. It's important to manage your diabetes effectively to prevent these complications from occurring.",
            "I see. What steps can I take to prevent these complications from occurring?"
        ],
        "knowledge": "Diabetes Diabetes  Home telehealth support can be an effective management technique. The use of technology to deliver educational programs for adults with type 2 diabetes includes computer-based self-management interventions to collect for tailored responses to facilitate self-management.  There is no adequate evidence to support effects on cholesterol, blood pressure, behavioral change , depression, weight and health-related quality of life, nor in other biological, cognitive or emotional outcomes. In 2017, 425 million people had diabetes worldwide, up from an estimated 382 million people in 2013 and from 108 million in 1980.  Accounting for the shifting age structure of the global population, the prevalence of diabetes is 8. 8% among adults, nearly double the rate of 4. 7% in 1980 Diabetes Diabetes",
        "response": "You can manage your diabetes effectively by monitoring your blood sugar levels and taking your medications as prescribed. You can also make lifestyle changes such as eating a healthy diet, exercising regularly, and quitting smoking if you smoke."
    },
    {
        "dialog": [
            "Hi Medi, I have been diagnosed with type 2 diabetes. What should I do now?",
            "Hello! To manage type 2 diabetes, you may need to control your diet and increase physical activity.",
            "What kind of diet should I be following?",
            "You can try a low-calorie diet that is low in saturated and trans fats and high in fiber-rich fruits, vegetables, whole grains, lean protein, and healthy fats.",
            "Is there any specific physical activity that can help me?",
            "You can try aerobic exercise, such as brisk walking, for at least 30 minutes a day, five days a week. Strength training can also be helpful.",
            "Can I still eat sweets and have a snack?",
            "It is best to limit your sugar intake, but you can have a small snack with a little sugar or sweetener as long as you account for it in your overall daily diet.",
            "What if I have any other questions or complications in the future?"
        ],
        "knowledge": "Diabetes Diabetes  Home telehealth support can be an effective management technique. The use of technology to deliver educational programs for adults with type 2 diabetes includes computer-based self-management interventions to collect for tailored responses to facilitate self-management.  There is no adequate evidence to support effects on cholesterol, blood pressure, behavioral change, depression, weight and health-related quality of life, nor in other biological, cognitive or emotional outcomes. In 2017, 425 million people had diabetes worldwide, up from an estimated 382 million people in 2013 and from 108 million in 1980.  Accounting for the shifting age structure of the global population, the prevalence of diabetes is 8.8% among adults, nearly double the rate of 4.7% in 1980 Diabetes Diabetes",
        "response": "If you have any complications or questions in the future, it is advisable to consult your doctor or healthcare provider."
    },
    {
        "dialog": [
            "Hi Medi, I read that some people with diabetes develop foot problems. What can I do to prevent that?",
            "Hello! Foot problems are a common complication of diabetes. To prevent them, you should wash and dry your feet every day, check them for cuts, blisters, or sores, and wear comfortable shoes that fit well.",
            "What should I do if I notice a cut or blister on my foot?",
            "You should clean it gently with soap and water, apply an antibiotic ointment and cover it with a sterile bandage. If it doesn't heal or gets worse, you should see a doctor.",
            "Are there any signs that I should look out for?",
            "You should watch out for any changes in the color, temperature, or sensation in your feet, as well as any swelling, pain, or numbness.",
            "Is there anything else I can do to prevent foot problems?",
            "You can also try to control your blood sugar levels, quit smoking, and avoid walking barefoot or wearing high heels or tight shoes.",
            "What if I have any other questions or complications in the future?"
        ],
        "knowledge": "Diabetes Diabetes  Home telehealth support can be an effective management technique. The use of technology to deliver educational programs for adults with type 2 diabetes includes computer-based self-management interventions to collect for tailored responses to facilitate self-management.  There is no adequate evidence to support effects on cholesterol, blood pressure, behavioral change, depression, weight and health-related quality of life, nor in other biological, cognitive or emotional outcomes. In 2017, 425 million people had diabetes worldwide, up from an estimated 382 million people in 2013 and from 108 million in 1980.  Accounting for the shifting age structure of the global population, the prevalence of diabetes is 8.8% among adults, nearly double the rate of 4.7% in 1980 Diabetes Diabetes",
        "response": "If you have any complications or questions in the future, it is advisable to consult your doctor or healthcare provider."
    },
    {
        "dialog": [
            "Hi Medi, I recently had a medical procedure. What kind of physical activity can I do?",
            "Hello! It depends on the type of procedure you had, but generally, you should avoid strenuous activity and heavy lifting for a few days or even weeks.",
            "How about light exercise, like walking or stretching?",
            "Light exercise, like walking or stretching, is usually fine as long as you don't overdo it and listen to your body. It can even help with your recovery.",
            "What kind of diet should I be following?",
            "You should follow a balanced, healthy diet that is rich in nutrients and vitamins to support your recovery. It's also important to stay hydrated.",
            "Are there any other lifestyle changes I should make?",
            "You should also make sure to get enough sleep and rest, avoid smoking and excessive alcohol consumption, and follow any other specific advice your doctor gave you.",
            "What if I have any other questions or complications in the future?"
        ],
        "knowledge": "Diabetes Diabetes  Home telehealth support can be an effective management technique. The use of technology to deliver educational programs for adults with type 2 diabetes includes computer-based self-management interventions to collect for tailored responses to facilitate self-management.  There is no adequate evidence to support effects on cholesterol, blood pressure, behavioral change, depression, weight and health-related quality of life, nor in other biological, cognitive or emotional outcomes. In 2017, 425 million people had diabetes worldwide, up from an estimated 382 million people in 2013 and from 108 million in 1980.  Accounting for the shifting age structure of the global population, the prevalence of diabetes is 8.8% among adults, nearly double the rate of 4.7% in 1980 Diabetes Diabetes",
        "response": "If you have any complications or questions in the future, it is advisable to consult your doctor or healthcare provider."
    },
    {
        "dialog": [
            "Hi Medi, I am having some symptoms and I am worried if it's related to diabetes.",
            "Hi there, I can help you with that. What symptoms are you experiencing?",
            "I feel thirsty all the time, and I have to go to the bathroom frequently.",
            "I see. These are some common symptoms of diabetes. I suggest you get your blood sugar level checked.",
            "What can I do in the meantime while waiting for my test result?",
            "You can try to minimize your sugar intake and eat more fiber-rich foods to help regulate your blood sugar levels.",
            "Thank you for your advice. How do I manage my diabetes if I am diagnosed with it?",
            "You can manage your diabetes by maintaining a healthy diet, staying active, taking medication as prescribed, and monitoring your blood sugar levels regularly.",
            "Can diabetes lead to other health problems?"
        ],
        "knowledge": "Diabetes Diabetes Home telehealth support can be an effective management technique. The use of technology to deliver educational programs for adults with type 2 diabetes includes computer-based self-management interventions to collect for tailored responses to facilitate self-management. There is no adequate evidence to support effects on cholesterol, blood pressure, behavioral change, depression, weight, and health-related quality of life, nor in other biological, cognitive or emotional outcomes. In 2017, 425 million people had diabetes worldwide, up from an estimated 382 million people in 2013 and from 108 million in 1980. Accounting for the shifting age structure of the global population, the prevalence of diabetes is 8.8% among adults, nearly double the rate of 4.7% in 1980 Diabetes Diabetes",
        "response": "Yes, diabetes can lead to other health problems such as heart disease, nerve damage, kidney damage, and eye damage."
    },
    {
        "dialog": [
            "Hi Medi, I just had a medical procedure done related to my diabetes and I need some advice about my diet.",
            "Hello! I would be happy to help. What kind of procedure did you have done?",
            "I just had a foot amputation due to complications from diabetes.",
            "I'm sorry to hear that. After an amputation, it is important to eat a well-balanced diet that includes plenty of protein, vitamins, and minerals to promote healing.",
            "Are there any specific foods I should avoid or eat more of?",
            "It is best to avoid processed foods, sugary drinks, and high-fat foods. Instead, focus on eating whole grains, lean proteins, fruits, and vegetables.",
            "Thank you for the advice. Do you have any suggestions for physical activity after my surgery?",
            "It is important to talk to your doctor about what kind of physical activity is appropriate for you after surgery. Some good options include low-impact exercises such as swimming or cycling.",
            "Okay, thank you for your help. One more question - is there anything else I should be aware of after my surgery?"
        ],
        "knowledge": "Diabetes Diabetes Home telehealth support can be an effective management technique. The use of technology to deliver educational programs for adults with type 2 diabetes includes computer-based self-management interventions to collect for tailored responses to facilitate self-management. There is no adequate evidence to support effects on cholesterol, blood pressure, behavioral change, depression, weight, and health-related quality of life, nor in other biological, cognitive or emotional outcomes. In 2017, 425 million people had diabetes worldwide, up from an estimated 382 million people in 2013 and from 108 million in 1980. Accounting for the shifting age structure of the global population, the prevalence of diabetes is 8.8% among adults, nearly double the rate of 4.7% in 1980 Diabetes Diabetes",
        "response": "It is important to keep the wound clean and dry, and to monitor it for any signs of infection such as redness, swelling, or discharge. It is also important to follow your doctor's instructions for managing your diabetes to prevent further complications."
    },
    {
        "dialog": [
            "Hi Medi, I have been diagnosed with diabetes and I am feeling overwhelmed and unsure of what to do.",
            "Hi there, I'm sorry to hear that. Managing diabetes can be challenging, but there are many resources available to help you.",
            "What can I do to manage my diabetes?",
            "You can start by making lifestyle changes such as eating a healthy diet, getting regular exercise, and monitoring your blood sugar levels regularly. You should also work with your doctor to develop a treatment plan that may include medication or insulin therapy.",
            "What kind of foods should I eat and avoid?",
            "It is important to eat a balanced diet that includes plenty of whole grains, lean proteins, fruits, and vegetables. It is also best to avoid processed foods, sugary drinks, and high-fat foods.",
            "What kind of exercise is best for diabetes?",
            "Low-impact exercises such as walking, cycling, or swimming are good options for people with diabetes. It is important to talk to your doctor before starting any new exercise program.",
            "Okay, thank you for your help. One more question - is diabetes curable?"
        ],
        "knowledge": "Diabetes Diabetes Home telehealth support can be an effective management technique. The use of technology to deliver educational programs for adults with type 2 diabetes includes computer-based self-management interventions to collect for tailored responses to facilitate self-management. There is no adequate evidence to support effects on cholesterol, blood pressure, behavioral change, depression, weight, and health-related quality of life, nor in other biological, cognitive or emotional outcomes. In 2017, 425 million people had diabetes worldwide, up from an estimated 382 million people in 2013 and from 108 million in 1980. Accounting for the shifting age structure of the global population, the prevalence of diabetes is 8.8% among adults, nearly double the rate of 4.7% in 1980 Diabetes Diabetes",
        "response": "There is currently no cure for diabetes, but it can be managed effectively with the right treatment plan and lifestyle changes."
    },
    {
        "dialog": [
            "Hi Medi, I have been diagnosed with type 2 diabetes. What should I do?",
            "Hello! The first thing you should do is start making changes to your lifestyle.",
            "Can you give me some examples of the lifestyle changes I should make?",
            "Sure, you can start by eating a balanced diet, doing regular physical activity, and monitoring your blood sugar levels.",
            "What about medications? Should I take insulin?",
            "It depends on how high your blood sugar is and what your doctor suggests. But lifestyle changes should be your first priority.",
            "Got it. Thanks, Medi. What are some common diabetic complications?",
            "Common complications include nerve damage, kidney damage, eye damage, and cardiovascular disease.",
            "How can I prevent these complications?"
        ],
        "knowledge": "Diabetes Diabetes  Home telehealth support can be an effective management technique. The use of technology to deliver educational programs for adults with type 2 diabetes includes computer-based self-management interventions to collect for tailored responses to facilitate self-management.  There is no adequate evidence to support effects on cholesterol, blood pressure, behavioral change , depression, weight and health-related quality of life, nor in other biological, cognitive or emotional outcomes. In 2017, 425 million people had diabetes worldwide, up from an estimated 382 million people in 2013 and from 108 million in 1980.  Accounting for the shifting age structure of the global population, the prevalence of diabetes is 8. 8% among adults, nearly double the rate of 4. 7% in 1980 Diabetes Diabetes",
        "response": "You can prevent these complications by managing your blood sugar levels, controlling your blood pressure and cholesterol, not smoking, and getting regular check-ups with your doctor."
    },
    {
        "dialog": [
            "Hello Medi, I have some symptoms that worry me.",
            "Hi there! What are your symptoms?",
            "I have been feeling very thirsty and hungry lately, and I have to go to the bathroom very frequently.",
            "Based on your symptoms, it's possible that you have diabetes. You should get a blood test to be sure.",
            "Oh no! What should I do if I do have diabetes?",
            "If you do have diabetes, you should make changes to your lifestyle, monitor your blood sugar levels, and take any medications your doctor prescribes.",
            "What are some common diabetic complications?",
            "Common complications include nerve damage, kidney damage, eye damage, and cardiovascular disease.",
            "How can I prevent these complications?"
        ],
        "knowledge": "Diabetes Diabetes  Home telehealth support can be an effective management technique. The use of technology to deliver educational programs for adults with type 2 diabetes includes computer-based self-management interventions to collect for tailored responses to facilitate self-management.  There is no adequate evidence to support effects on cholesterol, blood pressure, behavioral change , depression, weight and health-related quality of life, nor in other biological, cognitive or emotional outcomes. In 2017, 425 million people had diabetes worldwide, up from an estimated 382 million people in 2013 and from 108 million in 1980.  Accounting for the shifting age structure of the global population, the prevalence of diabetes is 8. 8% among adults, nearly double the rate of 4. 7% in 1980 Diabetes Diabetes",
        "response": "You can prevent these complications by managing your blood sugar levels, controlling your blood pressure and cholesterol, not smoking, and getting regular check-ups with your doctor."
    },
    {
        "dialog": [
            "Hi Medi, I just had bariatric surgery. What should I do now?",
            "Hello! After your surgery, you should focus on healthy eating and regular exercise.",
            "What should I be eating?",
            "You should eat small meals throughout the day that are high in protein and low in carbs and sugar.",
            "What types of exercise should I be doing?",
            "You should start with low-impact exercises like walking, and gradually increase your intensity and duration over time.",
            "What about supplements or medications?",
            "You should talk to your doctor about any supplements or medications that may be helpful for you.",
            "Got it. Thanks, Medi. How long will it take for me to recover?"
        ],
        "knowledge": "Bariatric Surgery Bariatric Surgery Bariatric surgery can be an effective weight loss solution for people who are morbidly obese.  After the surgery, patients must make significant lifestyle changes to ensure long-term success.  These changes include healthy eating, regular exercise, and taking any necessary supplements or medications.  Recovery times vary depending on the type of surgery and individual factors, but most patients can return to work and normal activities within a few weeks to a few months.",
        "response": "Recovery times vary depending on the type of surgery and individual factors, but most patients can return to work and normal activities within a few weeks to a few months."
    },
    {
        "dialog": [
            "Hi Medi, I have been diagnosed with type 2 diabetes. What should I do?",
            "Hello. Don't worry. I am here to help. The best way to manage your diabetes is to maintain a healthy lifestyle, a balanced diet, and regular exercise.",
            "What kind of food should I avoid?",
            "Try to avoid sugary drinks, processed foods, and high-carb foods. Instead, eat more vegetables, fruits, and whole grains.",
            "Okay, what about exercise?",
            "You should aim for at least 30 minutes of moderate-intensity exercise every day. It can be as simple as taking a brisk walk or dancing to your favorite tunes.",
            "Got it. What happens if I don't manage my diabetes properly?",
            "If left unmanaged, diabetes can lead to serious complications such as heart disease, nerve damage, kidney failure, and blindness.",
            "Thanks for your advice Medi. I will take care of myself."
        ],
        "knowledge": "Diabetes Diabetes  Home telehealth support can be an effective management technique. The use of technology to deliver educational programs for adults with type 2 diabetes includes computer-based self-management interventions to collect for tailored responses to facilitate self-management.  There is no adequate evidence to support effects on cholesterol, blood pressure, behavioral change, depression, weight, and health-related quality of life, nor in other biological, cognitive, or emotional outcomes. In 2017, 425 million people had diabetes worldwide, up from an estimated 382 million people in 2013 and from 108 million in 1980.  Accounting for the shifting age structure of the global population, the prevalence of diabetes is 8.8% among adults, nearly double the rate of 4.7% in 1980 Diabetes Diabetes",
        "response": "You're welcome. Remember to keep a healthy lifestyle, and don't hesitate to ask me if you have any further questions."
    },
    {
        "dialog": [
            "Hi Medi, can you explain to me what diabetes is?",
            "Sure. Diabetes is a chronic disease that affects the way your body processes blood sugar or glucose. There are two types of diabetes - type 1 and type 2.",
            "What is the difference between type 1 and type 2 diabetes?",
            "Type 1 diabetes occurs when your immune system attacks and destroys the cells in your pancreas that produce insulin, a hormone that regulates blood sugar. Type 2 diabetes, on the other hand, occurs when your body becomes resistant to insulin or doesn't produce enough insulin.",
            "What are the symptoms of diabetes?",
            "Some common symptoms of diabetes include thirst, frequent urination, hunger, fatigue, blurred vision, and slow healing of wounds.",
            "How is diabetes diagnosed?",
            "Diabetes is usually diagnosed with a blood test that measures your blood sugar levels. Your doctor may also perform other tests such as an A1C test or a glucose tolerance test.",
            "Thanks for your explanation Medi. Now I know more about diabetes."
        ],
        "knowledge": "Diabetes Diabetes  The defective responsiveness of body tissues to insulin is believed to involve the insulin receptor.  However, the specific defects are not known.  Diabetes mellitus cases due to a known defect are classified separately.  Type 2 diabetes is the most common type of diabetes mellitus accounting for 95% of diabetes.  Many people with type 2 diabetes have evidence of prediabetes before meeting the criteria for type 2 diabetes.  The progression of prediabetes to overt type 2 diabetes can be slowed or reversed by lifestyle changes or medications that improve insulin sensitivity or reduce the liver's glucose production. Type 2 diabetes is primarily due to lifestyle factors and genetics Diabetes Diabetes",
        "response": "I'm glad I could help. Diabetes can be a confusing topic, so feel free to ask me anything."
    },
    {
        "dialog": [
            "Hi Medi, I just had a medical procedure to remove a cyst. What can I do to speed up my recovery?",
            "Hi. Congratulations on completing your procedure. The best way to speed up your recovery is to take care of yourself and follow your doctor's instructions.",
            "Is there anything I should avoid doing?",
            "Yes. You should avoid heavy lifting or strenuous physical activity for a few weeks after your procedure. You should also avoid smoking and alcohol, as they can slow down your recovery.",
            "What kind of food should I eat?",
            "Try to eat a healthy, balanced diet with plenty of protein, fruits, vegetables, and whole grains. Drinking plenty of water can also help flush out any toxins and speed up your recovery.",
            "Got it. Anything else I should know?",
            "Yes. Make sure to get plenty of rest and take any medication prescribed by your doctor as directed. And don't hesitate to contact your doctor if you experience any unusual symptoms or complications.",
            "Thanks for your advice Medi. I will take care of myself."
        ],
        "knowledge": "Diabetes Diabetes  Home telehealth support can be an effective management technique. The use of technology to deliver educational programs for adults with type 2 diabetes includes computer-based self-management interventions to collect for tailored responses to facilitate self-management.  There is no adequate evidence to support effects on cholesterol, blood pressure, behavioral change, depression, weight, and health-related quality of life, nor in other biological, cognitive, or emotional outcomes. In 2017, 425 million people had diabetes worldwide, up from an estimated 382 million people in 2013 and from 108 million in 1980.  Accounting for the shifting age structure of the global population, the prevalence of diabetes is 8.8% among adults, nearly double the rate of 4.7% in 1980 Diabetes Diabetes",
        "response": "You're welcome. I'm here to help you anytime you need me, so feel free to ask me any questions."
    },
    {
        "dialog": [
            "Hello Medi, can you help me with my symptoms?",
            "Of course, what symptoms are you experiencing right now?",
            "I have been feeling dizzy and thirsty all the time, and I also have to urinate frequently",
            "I see, based on your symptoms, you might have diabetes. You should check your blood sugar level",
            "What should I do next?",
            "You need to see a doctor and get a proper diagnosis and treatment. You may need to make some lifestyle changes as well.",
            "Thank you, Medi. Can you tell me more about the lifestyle changes that I need to make?",
            "Sure, you can start by reducing your consumption of sugary and processed foods, exercising regularly, and maintaining a healthy weight.",
            "Thank you, Medi. I will follow your advice."
        ],
        "knowledge": "Diabetes Diabetes  Home telehealth support can be an effective management technique. The use of technology to deliver educational programs for adults with type 2 diabetes includes computer-based self-management interventions to collect for tailored responses to facilitate self-management.  There is no adequate evidence to support effects on cholesterol, blood pressure, behavioral change , depression, weight and health-related quality of life, nor in other biological, cognitive or emotional outcomes. In 2017, 425 million people had diabetes worldwide, up from an estimated 382 million people in 2013 and from 108 million in 1980.  Accounting for the shifting age structure of the global population, the prevalence of diabetes is 8. 8% among adults, nearly double the rate of 4. 7% in 1980 Diabetes Diabetes",
        "response": "You're welcome. I'm glad I could help. Do you have any other questions about diabetes?"
    },
    {
        "dialog": [
            "Hello Medi, I have a question about diabetes.",
            "Sure, I'm here to help. What would you like to know?",
            "Can you explain the difference between type 1 and type 2 diabetes?",
            "Type 1 diabetes is an autoimmune disease that occurs when the body's immune system attacks the beta cells in the pancreas, which produce insulin. Type 2 diabetes, on the other hand, occurs when the body becomes resistant to insulin or doesn't produce enough insulin.",
            "What causes type 2 diabetes?",
            "The exact cause of type 2 diabetes is unknown, but it is believed to be caused by a combination of genetic and lifestyle factors, such as obesity and lack of physical activity.",
            "Is type 2 diabetes curable?",
            "There is no cure for type 2 diabetes, but it can be managed with proper treatment and lifestyle changes.",
            "Thank you, Medi. That was very helpful."
        ],
        "knowledge": "Diabetes Diabetes  The defective responsiveness of body tissues to insulin is believed to involve the insulin receptor.  However, the specific defects are not known.  Diabetes mellitus cases due to a known defect are classified separately.  Type 2 diabetes is the most common type of diabetes mellitus accounting for 95% of diabetes.  Many people with type 2 diabetes have evidence of prediabetes  before meeting the criteria for type 2 diabetes.  The progression of prediabetes to overt type 2 diabetes can be slowed or reversed by lifestyle changes or medications that improve insulin sensitivity or reduce the liver's glucose production. Type 2 diabetes is primarily due to lifestyle factors and genetics Diabetes Diabetes",
        "response": "You're welcome. Do you have any other questions about diabetes?"
    },
    {
        "dialog": [
            "Hello Medi, I recently had a medical procedure related to diabetes. Can you give me some advice?",
            "Sure, I'm here to help. What kind of advice do you need?",
            "After my procedure, I want to make sure I am taking care of myself properly. What kind of lifestyle changes should I make to help manage my diabetes?",
            "It's important to maintain a healthy weight and eat a balanced diet that is low in sugar and carbohydrates. You should also exercise regularly and monitor your blood sugar levels regularly.",
            "What kind of exercises do you recommend?",
            "Any form of physical activity is helpful, but it's important to find something that you enjoy and can stick to, such as walking, swimming, or cycling.",
            "What should I do if my blood sugar levels are too high or too low?",
            "If your blood sugar levels are too high, you may need to adjust your insulin or medication dosage. If your blood sugar levels are too low, you should consume something high in sugar, such as fruit juice or candy.",
            "Thank you, Medi. That was very helpful."
        ],
        "knowledge": "Diabetes Diabetes  Home telehealth support can be an effective management technique. The use of technology to deliver educational programs for adults with type 2 diabetes includes computer-based self-management interventions to collect for tailored responses to facilitate self-management.  There is no adequate evidence to support effects on cholesterol, blood pressure, behavioral change , depression, weight and health-related quality of life, nor in other biological, cognitive or emotional outcomes. In 2017, 425 million people had diabetes worldwide, up from an estimated 382 million people in 2013 and from 108 million in 1980.  Accounting for the shifting age structure of the global population, the prevalence of diabetes is 8. 8% among adults, nearly double the rate of 4. 7% in 1980 Diabetes Diabetes",
        "response": "You're welcome. Let me know if you have any other questions or concerns."
    }
]