[
    {
        "dialog": [
            "Hello Medi, I'm having a headache and a runny nose.",
            "I see. How long have you had these symptoms?",
            "It started yesterday morning and it's been bothering me since then.",
            "I think it's possible that you have flu symptoms. You should rest and stay hydrated.",
            "What else should I do beside rest and hydration?",
            "You should also avoid contact with others to prevent spreading the flu. If your symptoms persist, seek medical attention.",
            "Thank you, Medi. Is there any medication I should take?",
            "There are some over-the-counter medications that can help relieve your symptoms like fever and pain. It's best to consult your doctor before taking any medications.",
            "Okay, I will. Thank you for your help!"
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "Based on your symptoms, I think it's possible that you have flu symptoms. You should rest and stay hydrated and avoid contact with others to prevent spreading the flu. If your symptoms persist, seek medical attention."
    },
    {
        "dialog": [
            "Hello Medi, I have some questions about the avian influenza virus.",
            "Sure. I'll do my best to answer your questions.",
            "What exactly is avian influenza and how does it spread?",
            "Avian influenza is a type of influenza virus that primarily infects birds. It can spread to humans through contact with infected birds or their droppings. The virus can also spread from person to person through close contact.",
            "What are the symptoms of avian influenza in humans?",
            "The symptoms of avian influenza in humans are similar to those of the flu, including fever, cough, sore throat, and muscle aches. In more severe cases, it can cause respiratory failure and even death.",
            "How can I protect myself from avian influenza?",
            "You can protect yourself by avoiding contact with infected birds and their droppings. It's also important to practice good hygiene, like washing your hands regularly and avoiding touching your face.",
            "Thank you, Medi. That was very helpful!"
        ],
        "knowledge": "Influenza Influenza Aquatic birds such as ducks, geese, shorebirds, and gulls are the primary reservoir of IAVs.  In birds, AIVs may be either low pathogenic avian influenza  viruses that produce little to no symptoms or highly pathogenic avian influenza  viruses that cause severe illness.  Symptoms of HPAI infection include lack of energy and appetite, decreased egg production, soft-shelled or misshapen eggs, swelling of the head, comb, wattles, and hocks, purple discoloration of wattles, combs, and legs, nasal discharge, coughing, sneezing, incoordination, and diarrhea.  Birds infected with an HPAI virus may also die suddenly without any signs of infection. The distinction between LPAI and HPAI can generally be made based on how lethal an AIV is to chickens.  At the genetic level, an AIV can be usually be identified as an HPAI virus if it has a multibasic cleavage site in the HA protein, which contains additional residues in the HA gene.  Most AIVs are LPAI Influenza Influenza",
        "response": "Avian influenza is a type of influenza virus that primarily infects birds. It can spread to humans through contact with infected birds or their droppings. The virus can also spread from person to person through close contact. The symptoms of avian influenza in humans are similar to those of the flu, including fever, cough, sore throat, and muscle aches. To protect yourself, avoid contact with infected birds and their droppings, and practice good hygiene."
    },
    {
        "dialog": [
            "Hi Medi, I just had surgery last week and I'm not sure what kind of exercise I can do.",
            "Hello! It's important to consult your doctor before starting any new exercise program after surgery.",
            "I understand, but are there any exercises that are generally safe to do after surgery?",
            "Yes, light exercises like walking and stretching can be very beneficial after surgery. Just be sure to start slowly and listen to your body.",
            "How long should I wait before I start more intense exercise like running or weight lifting?",
            "It's best to wait at least six weeks before starting more intense exercise like running or weight lifting. Again, it's important to consult your doctor before starting any new exercise program.",
            "Thank you, Medi. I appreciate your help!",
            "You're welcome! Is there anything else I can assist you with?"
        ],
        "knowledge": "Influenza Influenza Aquatic birds such as ducks, geese, shorebirds, and gulls are the primary reservoir of IAVs.  In birds, AIVs may be either low pathogenic avian influenza  viruses that produce little to no symptoms or highly pathogenic avian influenza  viruses that cause severe illness.  Symptoms of HPAI infection include lack of energy and appetite, decreased egg production, soft-shelled or misshapen eggs, swelling of the head, comb, wattles, and hocks, purple discoloration of wattles, combs, and legs, nasal discharge, coughing, sneezing, incoordination, and diarrhea.  Birds infected with an HPAI virus may also die suddenly without any signs of infection. The distinction between LPAI and HPAI can generally be made based on how lethal an AIV is to chickens.  At the genetic level, an AIV can be usually be identified as an HPAI virus if it has a multibasic cleavage site in the HA protein, which contains additional residues in the HA gene.  Most AIVs are LPAI Influenza Influenza",
        "response": "Consult your doctor before starting any new exercise program after surgery. Light exercises like walking and stretching can be very beneficial after surgery. It's best to wait at least six weeks before starting more intense exercise like running or weight lifting."
    },
    {
        "dialog": [
            "Hello Medi, I have been experiencing coughing and sneezing lately.",
            "I see, have you had a fever lately?",
            "No, I haven't had a fever. But I have a runny nose and a sore throat.",
            "Based on your symptoms, it is possible that you have contracted Influenza.",
            "What should I do?",
            "You should rest and drink plenty of fluids. If your symptoms persist or worsen, consult a doctor.",
            "Thank you for your advice. How is Influenza transmitted?",
            "It is transmitted through the air when an infected person coughs or sneezes. It can also spread by touching a surface contaminated with the virus.",
            "I see. How can I avoid getting Influenza in the future?"
        ],
        "knowledge": "Influenza Influenza: The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion. These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose. Coughing is the most common symptom. Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children. The standard influenza symptoms typically last for 2 - 8 days. A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common.",
        "response": "You can avoid getting Influenza by washing your hands frequently, avoiding close contact with people who are sick, and getting vaccinated."
    },
    {
        "dialog": [
            "Hello Medi, I have a question about Avian Influenza.",
            "Sure thing. What would you like to know?",
            "How do birds get infected with Avian Influenza?",
            "Aquatic birds such as ducks, geese, shorebirds, and gulls are the primary reservoir of IAVs. In birds, AIVs may be either low pathogenic avian influenza viruses that produce little to no symptoms or highly pathogenic avian influenza viruses that cause severe illness.",
            "What are the symptoms of HPAI infection in birds?",
            "Symptoms of HPAI infection include lack of energy and appetite, decreased egg production, soft-shelled or misshapen eggs, swelling of the head, comb, wattles, and hocks, purple discoloration of wattles, combs, and legs, nasal discharge, coughing, sneezing, incoordination, and diarrhea. Birds infected with an HPAI virus may also die suddenly without any signs of infection.",
            "What is the difference between LPAI and HPAI?",
            "The distinction between LPAI and HPAI can generally be made based on how lethal an AIV is to chickens. At the genetic level, an AIV can usually be identified as an HPAI virus if it has a multibasic cleavage site in the HA protein, which contains additional residues in the HA gene. Most AIVs are LPAI.",
            "Thanks for explaining that. Is Avian Influenza contagious to humans?"
        ],
        "knowledge": "Influenza Influenza: Aquatic birds such as ducks, geese, shorebirds, and gulls are the primary reservoir of IAVs. In birds, AIVs may be either low pathogenic avian influenza viruses that produce little to no symptoms or highly pathogenic avian influenza viruses that cause severe illness. Symptoms of HPAI infection include lack of energy and appetite, decreased egg production, soft-shelled or misshapen eggs, swelling of the head, comb, wattles, and hocks, purple discoloration of wattles, combs, and legs, nasal discharge, coughing, sneezing, incoordination, and diarrhea. Birds infected with an HPAI virus may also die suddenly without any signs of infection. The distinction between LPAI and HPAI can generally be made based on how lethal an AIV is to chickens. At the genetic level, an AIV can usually be identified as an HPAI virus if it has a multibasic cleavage site in the HA protein, which contains additional residues in the HA gene. Most AIVs are LPAI.",
        "response": "Yes, it is possible for humans to contract Avian Influenza, but it is rare and usually spread through contact with infected birds or their droppings."
    },
    {
        "dialog": [
            "Hello Medi, I recently had a physical procedure done and I am wondering what kind of physical activity I can do now.",
            "What kind of procedure did you have done?",
            "I had a minor surgery on my leg.",
            "For the first few days after your procedure, it is best to avoid any strenuous activity that puts too much pressure on the affected area. After that, you can gradually increase your activity level as long as you feel comfortable.",
            "What kind of physical activity can I do?",
            "Some good low-impact options include walking, swimming, or cycling. You can also try light weightlifting or yoga.",
            "What about my diet? Is there anything I should avoid?",
            "Try to avoid foods that are high in saturated fat, salt, and sugar. Focus on eating a balanced diet with plenty of fruits, vegetables, and lean protein.",
            "Thanks for the advice. How long will it take for me to fully recover?"
        ],
        "knowledge": "Influenza Influenza: Aquatic birds such as ducks, geese, shorebirds, and gulls are the primary reservoir of IAVs. In birds, AIVs may be either low pathogenic avian influenza viruses that produce little to no symptoms or highly pathogenic avian influenza viruses that cause severe illness. Symptoms of HPAI infection include lack of energy and appetite, decreased egg production, soft-shelled or misshapen eggs, swelling of the head, comb, wattles, and hocks, purple discoloration of wattles, combs, and legs, nasal discharge, coughing, sneezing, incoordination, and diarrhea. Birds infected with an HPAI virus may also die suddenly without any signs of infection. The distinction between LPAI and HPAI can generally be made based on how lethal an AIV is to chickens. At the genetic level, an AIV can usually be identified as an HPAI virus if it has a multibasic cleavage site in the HA protein, which contains additional residues in the HA gene. Most AIVs are LPAI.",
        "response": "Recovery time varies depending on the type of procedure you had and how well you take care of yourself during the recovery period. Follow your doctor's instructions closely and don't hesitate to ask questions if you have any concerns."
    },
    {
        "dialog": [
            "Hi Medi, I have a high fever and a sore throat.",
            "Hello, sorry to hear that. Have you been in contact with anyone who has been sick?",
            "Yes, a friend of mine was recently diagnosed with the flu.",
            "Based on your symptoms and exposure, it's very likely that you have the flu. I recommend getting tested and taking it easy.",
            "What else can I do to help recover?",
            "Get plenty of rest, drink lots of fluids, and consider taking over-the-counter medication for fever and pain relief.",
            "Thank you for your help, Medi.",
            "Of course, feel better soon!",
            "Is it possible to catch the flu from birds?"
        ],
        "knowledge": "Influenza Influenza Aquatic birds such as ducks, geese, shorebirds, and gulls are the primary reservoir of IAVs.  In birds, AIVs may be either low pathogenic avian influenza  viruses that produce little to no symptoms or highly pathogenic avian influenza  viruses that cause severe illness.  Symptoms of HPAI infection include lack of energy and appetite, decreased egg production, soft-shelled or misshapen eggs, swelling of the head, comb, wattles, and hocks, purple discoloration of wattles, combs, and legs, nasal discharge, coughing, sneezing, incoordination, and diarrhea.  Birds infected with an HPAI virus may also die suddenly without any signs of infection. The distinction between LPAI and HPAI can generally be made based on how lethal an AIV is to chickens.  At the genetic level, an AIV can be usually be identified as an HPAI virus if it has a multibasic cleavage site in the HA protein, which contains additional residues in the HA gene.  Most AIVs are LPAI Influenza Influenza",
        "response": "It is possible to catch the flu from birds, but it is rare and usually only occurs in people who have close contact with infected birds."
    },
    {
        "dialog": [
            "Hi Medi, I'm concerned about avian influenza in birds.",
            "Sure thing, what would you like to know?",
            "Can birds with avian influenza infect humans?",
            "It's possible for humans to get avian influenza from birds, but it's rare. Most cases have occurred in people who have had close contact with infected birds, such as poultry farmers.",
            "What are the symptoms of avian influenza in birds?",
            "Symptoms can vary depending on the type of virus, but can include lack of energy and appetite, decreased egg production, soft-shelled or misshapen eggs, swelling of the head, comb, wattles, and hocks, purple discoloration of wattles, combs, and legs, nasal discharge, coughing, sneezing, incoordination, and diarrhea. Birds infected with an HPAI virus may also die suddenly without any signs of infection.",
            "Thank you for the information, Medi.",
            "You're welcome. Let me know if you have any other questions.",
            "How can birds be treated for avian influenza?"
        ],
        "knowledge": "Influenza Influenza Aquatic birds such as ducks, geese, shorebirds, and gulls are the primary reservoir of IAVs.  In birds, AIVs may be either low pathogenic avian influenza  viruses that produce little to no symptoms or highly pathogenic avian influenza  viruses that cause severe illness.  Symptoms of HPAI infection include lack of energy and appetite, decreased egg production, soft-shelled or misshapen eggs, swelling of the head, comb, wattles, and hocks, purple discoloration of wattles, combs, and legs, nasal discharge, coughing, sneezing, incoordination, and diarrhea.  Birds infected with an HPAI virus may also die suddenly without any signs of infection. The distinction between LPAI and HPAI can generally be made based on how lethal an AIV is to chickens.  At the genetic level, an AIV can be usually be identified as an HPAI virus if it has a multibasic cleavage site in the HA protein, which contains additional residues in the HA gene.  Most AIVs are LPAI Influenza Influenza",
        "response": "There is no specific treatment for avian influenza in birds, but vaccines are available for some strains. Infected birds are often culled to prevent the spread of the virus."
    },
    {
        "dialog": [
            "Hi Medi, I just recovered from avian influenza. What should I do to prevent it from recurring?",
            "It's important to take care of your health and practice good hygiene. You should also avoid close contact with sick birds.",
            "What lifestyle changes can I make to reduce my risk of getting avian influenza again?",
            "Eating a healthy and balanced diet, getting regular exercise, and getting enough sleep can all help boost your immune system and reduce your risk of getting sick. You should also avoid contact with sick birds and wash your hands frequently.",
            "Thank you for the advice, Medi.",
            "You're welcome. Let me know if there's anything else I can help you with.",
            "Are there any vaccines available for avian influenza in humans?"
        ],
        "knowledge": "Influenza Influenza Aquatic birds such as ducks, geese, shorebirds, and gulls are the primary reservoir of IAVs.  In birds, AIVs may be either low pathogenic avian influenza  viruses that produce little to no symptoms or highly pathogenic avian influenza  viruses that cause severe illness.  Symptoms of HPAI infection include lack of energy and appetite, decreased egg production, soft-shelled or misshapen eggs, swelling of the head, comb, wattles, and hocks, purple discoloration of wattles, combs, and legs, nasal discharge, coughing, sneezing, incoordination, and diarrhea.  Birds infected with an HPAI virus may also die suddenly without any signs of infection. The distinction between LPAI and HPAI can generally be made based on how lethal an AIV is to chickens.  At the genetic level, an AIV can be usually be identified as an HPAI virus if it has a multibasic cleavage site in the HA protein, which contains additional residues in the HA gene.  Most AIVs are LPAI Influenza Influenza",
        "response": "There is currently no vaccine available for avian influenza in humans, but research is ongoing."
    },
    {
        "dialog": [
            "Hello Medi, I'm feeling unwell",
            "I'm sorry to hear that. What are your symptoms?",
            "I have a headache, sore throat, and feel fatigue.",
            "Based on your symptoms, you might have the flu.",
            "What should I do to feel better?",
            "You should rest, drink plenty of fluids, and take pain relievers.",
            "Thanks, Medi. How long will it last?",
            "The flu usually lasts about a week.",
            "What about the flu shot? Will it help me?"
        ],
        "knowledge": "Influenza Influenza The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "The flu shot is recommended every year, but it won't help you now. It's more effective if you get it before flu season starts."
    },
    {
        "dialog": [
            "Hello Medi, I'm confused about the difference between LPAI and HPAI.",
            "LPAI and HPAI refer to the pathogenicity of the virus.",
            "Can you explain what that means?",
            "LPAI stands for low pathogenic avian influenza, which causes little to no symptoms in birds.",
            "What about HPAI?",
            "HPAI stands for highly pathogenic avian influenza, which causes severe illness and high mortality rates in birds.",
            "How can we tell the difference between the two?",
            "The distinction between LPAI and HPAI can generally be made based on how lethal an AIV is to chickens.",
            "What about at the genetic level?"
        ],
        "knowledge": "Influenza Influenza Aquatic birds such as ducks, geese, shorebirds, and gulls are the primary reservoir of IAVs.  In birds, AIVs may be either low pathogenic avian influenza  viruses that produce little to no symptoms or highly pathogenic avian influenza  viruses that cause severe illness.  Symptoms of HPAI infection include lack of energy and appetite, decreased egg production, soft-shelled or misshapen eggs, swelling of the head, comb, wattles, and hocks, purple discoloration of wattles, combs, and legs, nasal discharge, coughing, sneezing, incoordination, and diarrhea.  Birds infected with an HPAI virus may also die suddenly without any signs of infection. The distinction between LPAI and HPAI can generally be made based on how lethal an AIV is to chickens.  At the genetic level, an AIV can be usually be identified as an HPAI virus if it has a multibasic cleavage site in the HA protein, which contains additional residues in the HA gene.  Most AIVs are LPAI Influenza Influenza",
        "response": "At the genetic level, an AIV can usually be identified as an HPAI virus if it has a multibasic cleavage site in the HA protein, which contains additional residues in the HA gene."
    },
    {
        "dialog": [
            "Hello Medi, I had the flu a few months ago. What can I do to avoid getting it again?",
            "Good question. The best way to prevent the flu is to get vaccinated every year.",
            "What if I don't want to get vaccinated?",
            "You can also prevent the spread of the flu by washing your hands frequently and avoiding close contact with sick people.",
            "Is there anything else I can do?",
            "You can also boost your immune system by eating a healthy diet, getting enough rest, and exercising regularly.",
            "Thanks for the advice, Medi. I'll try to take better care of myself.",
            "You're welcome. Do you have any other questions?",
            "No, that's all for now. Thanks again, Medi."
        ],
        "knowledge": "Influenza Influenza The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "You're welcome. Stay healthy and take care."
    },
    {
        "dialog": [
            "Hello Medi, I have symptoms of cough and sneezing.",
            "Hi, Based on your symptoms you might have a cold, but let's check further to be sure.",
            "What other symptoms should I be looking for?",
            "If you have a cold, you might experience headaches and body aches, fever, or sore throat",
            "I did not have a fever, but my nose is running. What should I do?",
            "You should rest and drink plenty of fluids and take over-the-counter medication such as acetaminophen or ibuprofen to relieve your headaches and body aches.",
            "Should I take antibiotics?",
            "Antibiotics do not help for colds caused by a virus. They only work for bacterial infections. So you should not take antibiotics in this case.",
            "Thanks Medi, but how long will it take until I recover?"
        ],
        "knowledge": "Cold Cold A cold is a common viral infection that infects your nose and throat. It is caused by several types of viruses; rhinoviruses are the most common cause of a cold.  The symptoms of a cold usually begin 1-3 days after exposure to the virus and usually include a sore throat, runny nose, coughing, sneezing, mild headache, and body aches.  Fever is uncommon in adults but is possible.  Most people recover within 7 to 10 days, but some people may experience symptoms for up to 2 weeks.  Antibiotics do not work for colds caused by a virus. Cold Cold",
        "response": "It usually takes 7 to 10 days to recover from a cold, but some people may experience symptoms for up to 2 weeks."
    },
    {
        "dialog": [
            "Hello Medi, I went swimming and got water in my ear. Can you help me?",
            "Sure, let me help you. Did you try to remove the water from your ear yourself?",
            "Yes, I tried to shake my head, but the water is still in my ear.",
            "Okay, you can try using a gravity technique by tilting your head to the side with the affected ear facing down.",
            "What should I do next?",
            "After tilting your head, gently pull your earlobe down and let the water drain out. You can also use a hair dryer on the low setting to blow warm air into your ear canal. This can help dry out any remaining water.",
            "What if these techniques do not work?",
            "If the water does not come out after using these techniques, it is important to see a doctor. The doctor can remove the water using special tools.",
            "Okay. Thank you very much."
        ],
        "knowledge": "Swimmer's ear Swimmer's ear Swimmer's ear is a common condition that occurs when water gets trapped in the ear canal, leading to an infection.  Swimmer's ear is caused by bacteria that grow in warm and moist environments.  Symptoms of swimmer's ear include itching, redness, and pain in the ear canal, discharge of fluid or pus, and a feeling of fullness in the ear.  To prevent swimmer's ear, it is important to keep your ears dry by using earplugs or a swim cap.  After swimming or showering, use a towel to dry your ears thoroughly.  You can also use ear drops to help dry out the ear canal. Swimmer's ear Swimmer's ear",
        "response": "If the water does not come out after using the gravity technique or hair dryer, it is important to see a doctor, who can remove the water using special tools."
    },
    {
        "dialog": [
            "Hello Medi, I have just finished my chemotherapy. What should I do to cope with the side effects?",
            "Hi, congratulations on finishing your chemotherapy. Side effects can be managed with certain lifestyle changes.",
            "What should I do to help with fatigue?",
            "You can try to rest more and do exercises such as walking or yoga, which can help you build up your strength and energy. You can also eat a balanced diet with plenty of protein, fruits, and vegetables.",
            "What about nausea and vomiting?",
            "To help with these symptoms, you should drink water and other fluids to stay hydrated. Eat small meals throughout the day and avoid spicy or fatty foods. You can also ask your doctor for anti-nausea medication.",
            "What about hair loss?",
            "Unfortunately, hair loss is a common side effect of chemotherapy. You can wear a wig or scarf to help cover your hair loss, or you can shave your hair off.",
            "Okay, thank you. And how often should I see my doctor after finishing chemotherapy?"
        ],
        "knowledge": "Chemotherapy Chemotherapy Chemotherapy is a treatment for cancer that uses drugs to kill cancer cells. Chemotherapy can cause side effects because it also affects normal cells in your body. Common side effects include fatigue, nausea, vomiting, hair loss, and increased risk of infection.  To manage the side effects of chemotherapy, it is important to rest more, exercise, eat a balanced diet, drink plenty of fluids, and take anti-nausea medication. Chemotherapy Chemotherapy",
        "response": "After chemotherapy, it is important to see your doctor regularly, usually every 3 to 6 months for the first few years."
    },
    {
        "dialog": [
            "Hey Medi, I have been experiencing some symptoms lately. Can you help?",
            "Of course, tell me about your symptoms?",
            "I have been feeling quite weak, nauseous, and dizzy lately. I also have occasional coughing.",
            "Okay, based on your symptoms, it's likely that you have contracted influenza.",
            "Oh no, what do I do now?",
            "Make sure to rest and stay hydrated. You can also take over-the-counter medications like paracetamol for fever and pain. But it's important to consult a doctor if your symptoms worsen.",
            "Okay, thank you. I will do just that.",
            "You're welcome. Take care!",
            "Bye."
        ],
        "knowledge": "Influenza Influenza Aquatic birds such as ducks, geese, shorebirds, and gulls are the primary reservoir of IAVs.  In birds, AIVs may be either low pathogenic avian influenza  viruses that produce little to no symptoms or highly pathogenic avian influenza  viruses that cause severe illness.  Symptoms of HPAI infection include lack of energy and appetite, decreased egg production, soft-shelled or misshapen eggs, swelling of the head, comb, wattles, and hocks, purple discoloration of wattles, combs, and legs, nasal discharge, coughing, sneezing, incoordination, and diarrhea.  Birds infected with an HPAI virus may also die suddenly without any signs of infection. The distinction between LPAI and HPAI can generally be made based on how lethal an AIV is to chickens.  At the genetic level, an AIV can be usually be identified as an HPAI virus if it has a multibasic cleavage site in the HA protein, which contains additional residues in the HA gene.  Most AIVs are LPAI Influenza Influenza",
        "response": "You should rest and stay hydrated. You can also take over-the-counter medications like paracetamol for fever and pain. But it's important to consult a doctor if your symptoms worsen."
    },
    {
        "dialog": [
            "Hello Medi, can you tell me more about avian influenza?",
            "Sure, what would you like to know?",
            "What are the symptoms?",
            "Symptoms of HPAI infection include lack of energy and appetite, decreased egg production, soft-shelled or misshapen eggs, swelling of the head, comb, wattles, and hocks, purple discoloration of wattles, combs, and legs, nasal discharge, coughing, sneezing, incoordination, and diarrhea. Birds infected with an HPAI virus may also die suddenly without any signs of infection. The distinction between LPAI and HPAI can generally be made based on how lethal an AIV is to chickens.",
            "What causes avian influenza?",
            "Aquatic birds such as ducks, geese, shorebirds, and gulls are the primary reservoir of IAVs. In birds, AIVs may be either low pathogenic avian influenza viruses that produce little to no symptoms or highly pathogenic avian influenza viruses that cause severe illness.",
            "Is it contagious to humans?",
            "While avian influenza primarily affects birds, there have been cases where it has been transmitted to humans. However, the risk is relatively low.",
            "I see. Thanks for the information, Medi."
        ],
        "knowledge": "Influenza Influenza Aquatic birds such as ducks, geese, shorebirds, and gulls are the primary reservoir of IAVs.  In birds, AIVs may be either low pathogenic avian influenza  viruses that produce little to no symptoms or highly pathogenic avian influenza  viruses that cause severe illness.  Symptoms of HPAI infection include lack of energy and appetite, decreased egg production, soft-shelled or misshapen eggs, swelling of the head, comb, wattles, and hocks, purple discoloration of wattles, combs, and legs, nasal discharge, coughing, sneezing, incoordination, and diarrhea.  Birds infected with an HPAI virus may also die suddenly without any signs of infection. The distinction between LPAI and HPAI can generally be made based on how lethal an AIV is to chickens.  At the genetic level, an AIV can be usually be identified as an HPAI virus if it has a multibasic cleavage site in the HA protein, which contains additional residues in the HA gene.  Most AIVs are LPAI Influenza Influenza",
        "response": "While avian influenza primarily affects birds, there have been cases where it has been transmitted to humans. However, the risk is relatively low."
    },
    {
        "dialog": [
            "Hey Medi, I just had a medical procedure. What should I do now?",
            "It depends on the procedure. Can you tell me what procedure you had?",
            "I just had a surgery, and I'm worried about the recovery process.",
            "Make sure to follow your doctor's instructions, especially regarding rest, medication, and wound care. You should also make sure to maintain a healthy diet and get enough exercise.",
            "What type of exercise should I do?",
            "It's best to consult your doctor regarding the type and intensity of exercise you can do after surgery. It's important to start slow and gradually increase your activity level.",
            "What about my diet?",
            "You should aim to eat a balanced diet with plenty of fruits, vegetables, lean protein, and whole grains. It's also important to stay hydrated.",
            "I see. Thank you for the advice, Medi."
        ],
        "knowledge": "Influenza Influenza Aquatic birds such as ducks, geese, shorebirds, and gulls are the primary reservoir of IAVs.  In birds, AIVs may be either low pathogenic avian influenza  viruses that produce little to no symptoms or highly pathogenic avian influenza  viruses that cause severe illness.  Symptoms of HPAI infection include lack of energy and appetite, decreased egg production, soft-shelled or misshapen eggs, swelling of the head, comb, wattles, and hocks, purple discoloration of wattles, combs, and legs, nasal discharge, coughing, sneezing, incoordination, and diarrhea.  Birds infected with an HPAI virus may also die suddenly without any signs of infection. The distinction between LPAI and HPAI can generally be made based on how lethal an AIV is to chickens.  At the genetic level, an AIV can be usually be identified as an HPAI virus if it has a multibasic cleavage site in the HA protein, which contains additional residues in the HA gene.  Most AIVs are LPAI Influenza Influenza",
        "response": "You should aim to eat a balanced diet with plenty of fruits, vegetables, lean protein, and whole grains. It's also important to stay hydrated."
    },
    {
        "dialog": [
            "Hi Medi, I have a cough and a runny nose.",
            "Hello! Based on your symptoms, it may be a common cold",
            "What can I do to treat it?",
            "You can treat it with plenty of rest and fluids, and over-the-counter medication for fever, cough, and congestion. Also, avoid crowded places.",
            "What if it lasts for too long?",
            "If it lasts more than a week, you should see a doctor",
            "Alright, thanks for your help Medi.",
            "You're welcome. Take care!",
            "Bye"
        ],
        "knowledge": "Common Cold Common Cold The common cold is a viral infection that affects the upper respiratory tract, including the nose, throat, and sinuses.  It is caused by a large group of viruses, most commonly the rhinovirus. The symptoms of a cold usually appear one to three days after exposure to a cold-causing virus.  Symptoms usually include cough, sore throat, runny nose, nasal congestion, headache, and fever.  Symptoms typically resolve on their own within 7 to 10 days, although a cough can linger for up to three weeks.  Over-the-counter medications can help relieve symptoms, but there is no cure for the common cold. Common Cold",
        "response": "You're welcome. Don't hesitate to contact me if you have any further questions."
    },
    {
        "dialog": [
            "Hi Medi, I want to know about avian influenza.",
            "Hello, what do you want to know about it?",
            "What are the primary reservoirs for avian influenza viruses?",
            "Aquatic birds such as ducks, geese, shorebirds, and gulls are the primary reservoir of IAVs.",
            "What are the symptoms of HPAI infection?",
            "Symptoms of HPAI infection include lack of energy and appetite, decreased egg production, soft-shelled or misshapen eggs, swelling of the head, comb, wattles, and hocks, purple discoloration of wattles, combs, and legs, nasal discharge, coughing, sneezing, incoordination, and diarrhea. Birds infected with an HPAI virus may also die suddenly without any signs of infection.",
            "How can we distinguish between LPAI and HPAI?",
            "The distinction between LPAI and HPAI can generally be made based on how lethal an AIV is to chickens. At the genetic level, an AIV can usually be identified as an HPAI virus if it has a multibasic cleavage site in the HA protein, which contains additional residues in the HA gene. Most AIVs are LPAI.",
            "Thanks for the information, Medi. Goodbye."
        ],
        "knowledge": "Influenza Influenza Aquatic birds such as ducks, geese, shorebirds, and gulls are the primary reservoir of IAVs.  In birds, AIVs may be either low pathogenic avian influenza  viruses that produce little to no symptoms or highly pathogenic avian influenza  viruses that cause severe illness.  Symptoms of HPAI infection include lack of energy and appetite, decreased egg production, soft-shelled or misshapen eggs, swelling of the head, comb, wattles, and hocks, purple discoloration of wattles, combs, and legs, nasal discharge, coughing, sneezing, incoordination, and diarrhea.  Birds infected with an HPAI virus may also die suddenly without any signs of infection. The distinction between LPAI and HPAI can generally be made based on how lethal an AIV is to chickens.  At the genetic level, an AIV can be usually be identified as an HPAI virus if it has a multibasic cleavage site in the HA protein, which contains additional residues in the HA gene.  Most AIVs are LPAI Influenza Influenza",
        "response": "You're welcome. Don't hesitate to contact me if you have any further questions."
    },
    {
        "dialog": [
            "Hi Medi, I just had a medical procedure. What can I do to recover?",
            "Hello, congratulations on your successful medical procedure. What type of procedure was it?",
            "It was a surgery on my leg.",
            "After surgery, it's important to rest and avoid strenuous activity for a while. You should also follow your doctor's instructions on dressing changes and medication.",
            "What kind of diet should I follow?",
            "You should eat a healthy and balanced diet that includes plenty of fruits, vegetables, whole grains, and lean protein. Also, avoid smoking and alcohol consumption.",
            "When can I resume physical activities?",
            "You should wait until your doctor gives you clearance to do so. It may take several weeks or even months depending on the type of surgery you underwent.",
            "Thank you for the advice, Medi."
        ],
        "knowledge": "Medical Procedure Recovery Medical Procedure Recovery Recovering from a medical procedure can take time and patience. After the procedure, it's important to rest and follow your doctor's orders on dressing changes and medication. You should also eat a healthy and balanced diet that includes plenty of fruits, vegetables, whole grains, and lean protein. Additionally, avoid smoking and alcohol consumption. The amount of time it takes to recover depends on the type of procedure and personal factors, so it's important to follow your doctor's instructions for resuming normal activities. Medical Procedure Recovery",
        "response": "You're welcome. Don't hesitate to contact me if you have any further questions."
    },
    {
        "dialog": [
            "Hello Medi, I have a cough and a runny nose.",
            "Hi, based on your symptoms, you may have a mild respiratory infection.",
            "What should I do to ease the symptoms?",
            "You can rest, drink plenty of fluids, and take over-the-counter medications such as acetaminophen for fever and pain. If the symptoms persist, consult your doctor.",
            "Can you tell me more about respiratory infections?",
            "Respiratory infections are caused by viruses or bacteria and can affect the sinuses, throat, or lungs. Symptoms include cough, runny nose, fever, headache, and body aches.",
            "Can respiratory infections be prevented?",
            "Yes, you can prevent respiratory infections by washing your hands frequently, avoiding close contact with sick people, and covering your mouth and nose when you cough or sneeze.",
            "Thank you, Medi. Is there anything else I should know?"
        ],
        "knowledge": "Respiratory infections Respiratory infections Respiratory infections are caused by viruses or bacteria and can affect the sinuses, throat, or lungs.  Symptoms include cough, runny nose, fever, headache, and body aches.  Respiratory infections are contagious and can be spread through the air, by touching contaminated surfaces, or by close contact with an infected person.  Most respiratory infections are mild and can be treated at home with rest, fluids, and over-the-counter medications.  However, some infections can be severe and require medical attention. Respiratory infections can be prevented by washing your hands frequently, avoiding close contact with sick people, and covering your mouth and nose when you cough or sneeze.",
        "response": "You're welcome! That's all for now. Don't hesitate to ask if you have more questions."
    },
    {
        "dialog": [
            "Hello Medi, I heard about avian influenza. Can you tell me more about it?",
            "Sure. Avian influenza is a viral disease that primarily affects birds, but it can also infect humans and other animals.",
            "What are the symptoms?",
            "The symptoms of avian influenza in birds include lack of energy and appetite, decreased egg production, soft-shelled or misshapen eggs, swelling of the head, comb, wattles, and hocks, purple discoloration of wattles, combs, and legs, nasal discharge, coughing, sneezing, incoordination, and diarrhea. In humans, the symptoms can range from mild to severe respiratory illness.",
            "Is there a vaccine for avian influenza?",
            "There is a vaccine for birds, but not for humans.",
            "How can I prevent avian influenza?",
            "To prevent avian influenza, avoid contact with sick birds and their droppings, cook poultry and eggs thoroughly, wash your hands regularly, and wear protective clothing when handling birds.",
            "Thanks for the information, Medi. Can avian influenza be transmitted from human to human?"
        ],
        "knowledge": "Influenza Influenza Aquatic birds such as ducks, geese, shorebirds, and gulls are the primary reservoir of IAVs.  In birds, AIVs may be either low pathogenic avian influenza  viruses that produce little to no symptoms or highly pathogenic avian influenza  viruses that cause severe illness.  Symptoms of HPAI infection include lack of energy and appetite, decreased egg production, soft-shelled or misshapen eggs, swelling of the head, comb, wattles, and hocks, purple discoloration of wattles, combs, and legs, nasal discharge, coughing, sneezing, incoordination, and diarrhea.  Birds infected with an HPAI virus may also die suddenly without any signs of infection. The distinction between LPAI and HPAI can generally be made based on how lethal an AIV is to chickens.  At the genetic level, an AIV can be usually be identified as an HPAI virus if it has a multibasic cleavage site in the HA protein, which contains additional residues in the HA gene.  Most AIVs are LPAI Influenza Influenza",
        "response": "You're welcome. Let me know if you have any other questions."
    },
    {
        "dialog": [
            "Hello Medi, I just had surgery and I'm not sure what I can eat.",
            "Hi, after surgery, it's important to follow a healthy diet to help your body heal.",
            "What kind of foods should I eat?",
            "Foods that are rich in protein, vitamins, and minerals can help your body heal. Examples include lean meats, fish, poultry, eggs, beans, nuts, whole grains, fruits, and vegetables.",
            "Are there any foods I should avoid?",
            "It's best to avoid foods that are high in sugar, salt, and unhealthy fats, as well as processed foods. Also, consult with your doctor if you have any dietary restrictions or allergies.",
            "What about hydration?",
            "It's important to stay hydrated after surgery. Drink plenty of water and other liquids like juices and broths.",
            "Thank you for the advice, Medi. Is there anything else I should know?"
        ],
        "knowledge": "Post-surgery diet Post-surgery diet After surgery, it's important to follow a healthy diet to help your body heal.  Foods that are rich in protein, vitamins, and minerals can help your body heal. Examples include lean meats, fish, poultry, eggs, beans, nuts, whole grains, fruits, and vegetables. It's best to avoid foods that are high in sugar, salt, and unhealthy fats, as well as processed foods. Also, consult with your doctor if you have any dietary restrictions or allergies. It's important to stay hydrated after surgery. Drink plenty of water and other liquids like juices and broths.",
        "response": "You're welcome. I hope you have a speedy recovery."
    },
    {
        "dialog": [
            "Hello Medi, I have a cough and runny nose. What should I do?",
            "Hello, based on your symptoms, you may have a cold. You can try steam and drink more fluids",
            "Okay, thank you. What about medications?",
            "You can use over-the-counter cold medications like acetaminophen or ibuprofen",
            "Thank you, Medi. How long does a cold usually last?",
            "A cold usually lasts for about a week, but symptoms can last up to two weeks.",
            "I see. If my symptoms persist for more than two weeks, what should I do?",
            "If your symptoms persist, you should contact a healthcare provider.",
            "Alright, thank you for the advice."
        ],
        "knowledge": "Common Cold The common cold is a viral infection of the upper respiratory tract that affects the nose, throat, sinuses, and larynx. It is a contagious disease that is spread through the air, typically through coughing or sneezing. Symptoms include coughing, a runny nose, a sore throat, and sneezing. Common colds are usually self-limiting, and symptoms usually go away within a week. Over-the-counter medications can help relieve symptoms, but there is no cure for the common cold. If symptoms persist or worsen, you should see a healthcare provider.",
        "response": "You're welcome. Remember, if your symptoms persist for more than two weeks, you should contact a healthcare provider."
    },
    {
        "dialog": [
            "Hello Medi, I'm concerned about avian influenza. What should I know about it?",
            "Hello, avian influenza is a viral disease that primarily affects birds. It can be transmitted to humans, but this is rare.",
            "What symptoms does avian influenza cause in humans?",
            "In humans, avian influenza can cause respiratory illness and, in some cases, death.",
            "How is avian influenza transmitted to humans?",
            "Avian influenza is transmitted to humans through contact with infected birds or contaminated environments.",
            "How can I prevent getting infected with avian influenza?",
            "To prevent infection, you should avoid contact with infected birds and avoid exposure to contaminated environments. Proper hand hygiene is also essential.",
            "Thank you, Medi. What should I do if I think I have been exposed to avian influenza?"
        ],
        "knowledge": "Avian Influenza Avian influenza is a viral disease that primarily affects birds, including domesticated birds such as chickens and turkeys, as well as wild birds. It can be transmitted to humans, but this is rare. Symptoms in humans can range from mild respiratory illness to severe respiratory illness, including pneumonia, and, in some cases, death. Avian influenza is transmitted to humans through contact with infected birds or contaminated environments. To prevent infection, you should avoid contact with infected birds and avoid exposure to contaminated environments. Proper hand hygiene is also essential. If you think you have been exposed to avian influenza, you should contact a healthcare provider.",
        "response": "You're welcome. Remember, if you think you have been exposed to avian influenza, you should contact a healthcare provider."
    },
    {
        "dialog": [
            "Hello Medi, I recently had a surgical procedure. What should I do to aid my recovery?",
            "Hello, after a surgical procedure, it is important to follow your doctor's instructions regarding rest and activity.",
            "Are there any foods I should avoid or eat more of during my recovery?",
            "You should eat a healthy, balanced diet with plenty of fruits, vegetables, and protein. Avoid foods that are high in fat, sugar, or sodium.",
            "What about physical activity? Should I engage in exercise?",
            "You should avoid strenuous physical activity for a period of time after your procedure. Your doctor will advise you when it is safe to resume exercise.",
            "Okay, thank you. What about medications?",
            "You should take any prescribed medications as directed by your doctor, and do not stop taking them without consulting your doctor.",
            "Thank you, Medi. What should I do if I experience any complications during my recovery?"
        ],
        "knowledge": "Post-Surgical Recovery After a surgical procedure, it is important to follow your doctor's instructions regarding rest and activity. You should eat a healthy, balanced diet with plenty of fruits, vegetables, and protein. Avoid foods that are high in fat, sugar, or sodium. You should avoid strenuous physical activity for a period of time after your procedure. Your doctor will advise you when it is safe to resume exercise. You should take any prescribed medications as directed by your doctor, and do not stop taking them without consulting your doctor. If you experience any complications, such as excessive bleeding or infection, you should contact your doctor immediately.",
        "response": "You're welcome. Remember, if you experience any complications during your recovery, you should contact your doctor immediately."
    },
    {
        "dialog": [
            "Hello Medi, I'm feeling unwell. I have a headache and a sore throat",
            "I'm sorry to hear that. Have you been experiencing any other symptoms?",
            "Yes, I feel tired and have a fever",
            "Based on your symptoms, you might have the flu. Please rest and drink plenty of fluids",
            "What should I do to relieve my symptoms?",
            "You can take over-the-counter pain relievers and fever reducers, such as acetaminophen or ibuprofen",
            "Thanks for your advice, Medi",
            "You're welcome. Please take care of yourself",
            "Are there any other precautions I should take in case it's the flu?"
        ],
        "knowledge": "Influenza Influenza The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion. These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose. Coughing is the most common symptom. Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children. The standard influenza symptoms typically last for 2 - 8 days. A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "Yes. You should stay home and avoid contact with others to prevent the spread of the flu."
    },
    {
        "dialog": [
            "Hi Medi, I have some questions about avian influenza",
            "Sure, I'm here to help. What would you like to know?",
            "Can humans get avian influenza?",
            "Yes, humans can get avian influenza if they come into contact with infected birds or surfaces contaminated with the virus",
            "What are the symptoms of avian influenza in humans?",
            "The symptoms can range from mild to severe and include fever, cough, sore throat, muscle aches, and eye infections. In severe cases, it can lead to pneumonia and death.",
            "How is avian influenza treated in humans?",
            "There are antiviral medications that can be used to treat avian influenza, but they are most effective if given within 48 hours of symptom onset. Vaccines are also being developed",
            "Thank you for clarifying, Medi"
        ],
        "knowledge": "Influenza Influenza Aquatic birds such as ducks, geese, shorebirds, and gulls are the primary reservoir of IAVs. In birds, AIVs may be either low pathogenic avian influenza viruses that produce little to no symptoms or highly pathogenic avian influenza viruses that cause severe illness. Symptoms of HPAI infection include lack of energy and appetite, decreased egg production, soft-shelled or misshapen eggs, swelling of the head, comb, wattles, and hocks, purple discoloration of wattles, combs, and legs, nasal discharge, coughing, sneezing, incoordination, and diarrhea. Birds infected with an HPAI virus may also die suddenly without any signs of infection. The distinction between LPAI and HPAI can generally be made based on how lethal an AIV is to chickens. At the genetic level, an AIV can be usually be identified as an HPAI virus if it has a multibasic cleavage site in the HA protein, which contains additional residues in the HA gene. Most AIVs are LPAI Influenza Influenza",
        "response": "You're welcome. If you have any other questions, don't hesitate to ask."
    },
    {
        "dialog": [
            "Hello Medi, I just had surgery and I'm not sure what I should eat",
            "Congratulations on your surgery. A healthy diet is important for recovery. What kind of surgery did you have?",
            "I had a gastric bypass surgery for obesity",
            "Ah, in that case, you'll want to start with a liquid diet and then gradually move on to pureed and soft foods. Your doctor or a dietitian can provide you with a specific meal plan",
            "What kind of foods should I avoid?",
            "You'll want to avoid foods that are high in sugar, fat, and salt. Carbonated drinks and alcohol should also be avoided",
            "Thank you for the advice, Medi",
            "You're welcome. Don't hesitate to contact me if you have any other questions",
            "What kind of physical activity can I do after surgery?"
        ],
        "knowledge": "Obesity Obesity Obesity is a complex public health and policy problem because of its prevalence, costs, and health effects. As such, managing it requires changes in the wider societal context and effort by communities, local authorities, and governments. Public health efforts seek to understand and correct the environmental factors responsible for the increasing prevalence of obesity in the population. Solutions look at changing the factors that cause excess food energy consumption and inhibit physical activity. Efforts include federally reimbursed meal programs in schools, limiting direct junk food marketing to children, and decreasing access to sugar-sweetened beverages in schools. The World Health Organization recommends the taxing of sugary drinks. When constructing urban environments, efforts have been made to increase access to parks and to develop pedestrian routes Obesity Obesity",
        "response": "It's important to start with light physical activity, such as walking, and gradually increase the intensity and duration as you recover. Your doctor or a physical therapist can help you create an exercise plan that's right for you."
    }
]