[
    {
        "dialog": [
            "Hello Medi, can you give me some information about diabetes?",
            "Of course, what do you want to know?",
            "How common is diabetes?",
            "Diabetes occurs throughout the world but is more common in developed countries.",
            "What are the reasons for the increase in diabetes?",
            "The increase in rates in developing countries follows the trend of urbanization and lifestyle changes such as less physical work and poor nutrition.",
            "How can I prevent diabetes?",
            "You can prevent diabetes by leading a healthy lifestyle, including regular exercise and balanced nutrition.",
            "Thank you for the helpful advice, Medi. Goodbye!"
        ],
        "knowledge": "Diabetes Diabetes 0 million deaths worldwide, using modeling to estimate the total number of deaths that could be directly or indirectly attributed to diabetes. Diabetes occurs throughout the world but is more common  in more developed countries.  The greatest increase in rates has however been seen in low- and middle-income countries, where more than 80% of diabetic deaths occur.  The fastest prevalence increase is expected to occur in Asia and Africa, where most people with diabetes will probably live in 2030.  The increase in rates in developing countries follows the trend of urbanization and lifestyle changes, including increasingly sedentary lifestyles, less physically demanding work and the global nutrition transition, marked by increased intake of foods that are high energy-dense but nutrient-poor .  The global number of diabetes cases might increase by 48% between 2017 and 2045. As of 2020, 38% of all US adults had prediabetes Diabetes Diabetes",
        "response": "You're welcome! Goodbye."
    },
    {
        "dialog": [
            "Hello Medi, I think I have diabetes, what should I do?",
            "First, you should confirm with a doctor. What are the symptoms you are experiencing?",
            "I have been excessively thirsty and urinating more frequently.",
            "Those could be signs of diabetes, but it's important to confirm with a doctor. In the meantime, try to avoid sugary drinks and foods.",
            "Is there anything else I can do to manage my symptoms?",
            "You can also try to increase your daily physical activity and eat a healthy and balanced diet.",
            "Thanks for your help, Medi!",
            "You're welcome, take care!"
        ],
        "knowledge": "Diabetes Diabetes 0 million deaths worldwide, using modeling to estimate the total number of deaths that could be directly or indirectly attributed to diabetes. Diabetes occurs throughout the world but is more common  in more developed countries.  The greatest increase in rates has however been seen in low- and middle-income countries, where more than 80% of diabetic deaths occur.  The fastest prevalence increase is expected to occur in Asia and Africa, where most people with diabetes will probably live in 2030.  The increase in rates in developing countries follows the trend of urbanization and lifestyle changes, including increasingly sedentary lifestyles, less physically demanding work and the global nutrition transition, marked by increased intake of foods that are high energy-dense but nutrient-poor .  The global number of diabetes cases might increase by 48% between 2017 and 2045. As of 2020, 38% of all US adults had prediabetes Diabetes Diabetes",
        "response": "You're welcome, take care!"
    },
    {
        "dialog": [
            "Hello Medi, I have diabetes and just had a medical procedure. What should I do to ensure a good recovery?",
            "Congratulations on taking care of yourself! It's important to follow your doctor's instructions and take any prescribed medications.",
            "Is there anything else I can do to help my recovery?",
            "Yes, you should also maintain a healthy and balanced diet, engage in regular physical activity, and monitor your blood sugar levels.",
            "What kinds of exercise are best for me?",
            "Low-impact exercises such as walking, swimming, and biking are great options. Make sure to check with your doctor before starting any new exercise routine.",
            "Thank you, Medi.",
            "You're welcome, take care!"
        ],
        "knowledge": "Diabetes Diabetes 0 million deaths worldwide, using modeling to estimate the total number of deaths that could be directly or indirectly attributed to diabetes. Diabetes occurs throughout the world but is more common  in more developed countries.  The greatest increase in rates has however been seen in low- and middle-income countries, where more than 80% of diabetic deaths occur.  The fastest prevalence increase is expected to occur in Asia and Africa, where most people with diabetes will probably live in 2030.  The increase in rates in developing countries follows the trend of urbanization and lifestyle changes, including increasingly sedentary lifestyles, less physically demanding work and the global nutrition transition, marked by increased intake of foods that are high energy-dense but nutrient-poor .  The global number of diabetes cases might increase by 48% between 2017 and 2045. As of 2020, 38% of all US adults had prediabetes Diabetes Diabetes",
        "response": "You're welcome, take care!"
    },
    {
        "dialog": [
            "Hello Medi, can you explain what diabetes is?",
            "Yes, of course. Diabetes occurs when your blood glucose, also called blood sugar, is too high.",
            "What are the symptoms of diabetes?",
            "The symptoms of diabetes include frequent urination, excessive thirst, unexplained weight loss, and increased hunger.",
            "Is diabetes a common disease?",
            "Yes, diabetes is a very common disease. In fact, over 400 million people worldwide have diabetes.",
            "Can diabetes be prevented?",
            "Yes, it can be prevented by engaging in regular physical activity, maintaining a healthy diet, and maintaining a healthy weight.",
            "What lifestyle changes should I make to prevent diabetes?"
        ],
        "knowledge": "Diabetes Diabetes  0 million deaths worldwide, using modeling to estimate the total number of deaths that could be directly or indirectly attributed to diabetes. Diabetes occurs throughout the world but is more common  in more developed countries.  The greatest increase in rates has however been seen in low- and middle-income countries, where more than 80% of diabetic deaths occur.  The fastest prevalence increase is expected to occur in Asia and Africa, where most people with diabetes will probably live in 2030.  The increase in rates in developing countries follows the trend of urbanization and lifestyle changes, including increasingly sedentary lifestyles, less physically demanding work and the global nutrition transition, marked by increased intake of foods that are high energy-dense but nutrient-poor .  The global number of diabetes cases might increase by 48% between 2017 and 2045. As of 2020, 38% of all US adults had prediabetes Diabetes Diabetes",
        "response": "You should make lifestyle changes such as engaging in regular physical activity, maintaining a healthy diet, and maintaining a healthy weight."
    },
    {
        "dialog": [
            "Hello Medi, I feel like I might have diabetes. What should I do?",
            "First, let's check your symptoms. What symptoms are you experiencing?",
            "I feel thirsty all the time, I urinate frequently, and I feel tired a lot.",
            "Okay, those are common symptoms of diabetes. You should see a doctor to get a blood test to confirm.",
            "If I do have diabetes, what can I do to manage it?",
            "If you have diabetes, you can manage it by monitoring your blood sugar levels, taking medication prescribed by your doctor, and making lifestyle changes such as maintaining a healthy diet and engaging in regular physical activity.",
            "Is diabetes a serious disease?",
            "Yes, diabetes can be a very serious disease if not properly managed. It can lead to complications such as nerve damage, kidney damage, and blindness.",
            "What should I do if I am diagnosed with diabetes?"
        ],
        "knowledge": "Diabetes Diabetes  0 million deaths worldwide, using modeling to estimate the total number of deaths that could be directly or indirectly attributed to diabetes. Diabetes occurs throughout the world but is more common  in more developed countries.  The greatest increase in rates has however been seen in low- and middle-income countries, where more than 80% of diabetic deaths occur.  The fastest prevalence increase is expected to occur in Asia and Africa, where most people with diabetes will probably live in 2030.  The increase in rates in developing countries follows the trend of urbanization and lifestyle changes, including increasingly sedentary lifestyles, less physically demanding work and the global nutrition transition, marked by increased intake of foods that are high energy-dense but nutrient-poor .  The global number of diabetes cases might increase by 48% between 2017 and 2045. As of 2020, 38% of all US adults had prediabetes Diabetes Diabetes",
        "response": "If you are diagnosed with diabetes, you should monitor your blood sugar levels, take medication prescribed by your doctor, and make lifestyle changes such as maintaining a healthy diet and engaging in regular physical activity."
    },
    {
        "dialog": [
            "Hello Medi, I was diagnosed with diabetes recently. What should I eat?",
            "You should eat a healthy diet that focuses on fruits, vegetables, whole grains, and lean protein.",
            "What should I avoid eating?",
            "You should avoid foods that are high in sugar, saturated and trans fats, and salt.",
            "Is it okay to eat sweets sometimes?",
            "Yes, it is okay to eat sweets sometimes in moderation as part of a healthy diet.",
            "Can I still eat bread and pasta?",
            "Yes, you can still eat bread and pasta as long as they are whole grain.",
            "What about alcohol? Is it okay to drink?"
        ],
        "knowledge": "Diabetes Diabetes  0 million deaths worldwide, using modeling to estimate the total number of deaths that could be directly or indirectly attributed to diabetes. Diabetes occurs throughout the world but is more common  in more developed countries.  The greatest increase in rates has however been seen in low- and middle-income countries, where more than 80% of diabetic deaths occur.  The fastest prevalence increase is expected to occur in Asia and Africa, where most people with diabetes will probably live in 2030.  The increase in rates in developing countries follows the trend of urbanization and lifestyle changes, including increasingly sedentary lifestyles, less physically demanding work and the global nutrition transition, marked by increased intake of foods that are high energy-dense but nutrient-poor .  The global number of diabetes cases might increase by 48% between 2017 and 2045. As of 2020, 38% of all US adults had prediabetes Diabetes Diabetes",
        "response": "You should eat a healthy diet that focuses on fruits, vegetables, whole grains, and lean protein. You should avoid foods that are high in sugar, saturated and trans fats, and salt. It's okay to eat sweets sometimes in moderation as part of a healthy diet. You can still eat bread and pasta as long as they are whole grain. You should limit your alcohol intake to one drink per day for women and two drinks per day for men."
    },
    {
        "dialog": [
            "Hello Medi, can you give me some info on diabetes?",
            "Sure, diabetes is a disease where the body has high blood sugar levels.",
            "How do people get it?",
            "It can be genetic or due to poor lifestyle choices.",
            "What are the symptoms?",
            "Common symptoms include thirstiness, hunger, and frequent urination.",
            "So how is it treated?",
            "Treatment options include medication, lifestyle changes, and monitoring blood sugar levels.",
            "What are some lifestyle changes that can help?"
        ],
        "knowledge": "Diabetes Diabetes 0 million deaths worldwide, using modeling to estimate the total number of deaths that could be directly or indirectly attributed to diabetes. Diabetes occurs throughout the world but is more common  in more developed countries.  The greatest increase in rates has however been seen in low- and middle-income countries, where more than 80% of diabetic deaths occur.  The fastest prevalence increase is expected to occur in Asia and Africa, where most people with diabetes will probably live in 2030.  The increase in rates in developing countries follows the trend of urbanization and lifestyle changes, including increasingly sedentary lifestyles, less physically demanding work and the global nutrition transition, marked by increased intake of foods that are high energy-dense but nutrient-poor .  The global number of diabetes cases might increase by 48% between 2017 and 2045. As of 2020, 38% of all US adults had prediabetes Diabetes Diabetes",
        "response": "Some lifestyle changes that can help include eating a healthy diet, exercising regularly, and maintaining a healthy weight."
    },
    {
        "dialog": [
            "Hi Medi, I was recently diagnosed with diabetes. What should I do?",
            "First, it's important to monitor your blood sugar levels regularly.",
            "How do I do that?",
            "You can use a blood glucose meter to check your sugar levels at different times throughout the day.",
            "What else should I do?",
            "Make sure to take any prescribed medication as directed, and follow a healthy diet and exercise plan.",
            "Can you give me an example of a healthy diet?",
            "A healthy diet for diabetes includes foods that are low in sugar and carbohydrates, and high in fiber and protein.",
            "Thanks Medi. Anything else I should know?"
        ],
        "knowledge": "Diabetes Diabetes 0 million deaths worldwide, using modeling to estimate the total number of deaths that could be directly or indirectly attributed to diabetes. Diabetes occurs throughout the world but is more common  in more developed countries.  The greatest increase in rates has however been seen in low- and middle-income countries, where more than 80% of diabetic deaths occur.  The fastest prevalence increase is expected to occur in Asia and Africa, where most people with diabetes will probably live in 2030.  The increase in rates in developing countries follows the trend of urbanization and lifestyle changes, including increasingly sedentary lifestyles, less physically demanding work and the global nutrition transition, marked by increased intake of foods that are high energy-dense but nutrient-poor .  The global number of diabetes cases might increase by 48% between 2017 and 2045. As of 2020, 38% of all US adults had prediabetes Diabetes Diabetes",
        "response": "It's also important to visit your doctor regularly and to let them know about any potential complications or changes in symptoms."
    },
    {
        "dialog": [
            "Hi Medi, I just had a diabetes screening and I'm worried about the results. What should I do?",
            "First, don't panic. Screening is just a way to identify potential risks.",
            "But what if I have diabetes?",
            "If you do have diabetes, there are many treatment options and lifestyle changes that can help.",
            "What kind of treatment options are there?",
            "Treatment options include medication, insulin therapy, and lifestyle changes like diet and exercise.",
            "What kind of lifestyle changes?",
            "Changes like eating a healthy diet, getting regular exercise, and monitoring your blood sugar levels.",
            "Thanks Medi. Anything else I should know?"
        ],
        "knowledge": "Diabetes Diabetes 0 million deaths worldwide, using modeling to estimate the total number of deaths that could be directly or indirectly attributed to diabetes. Diabetes occurs throughout the world but is more common  in more developed countries.  The greatest increase in rates has however been seen in low- and middle-income countries, where more than 80% of diabetic deaths occur.  The fastest prevalence increase is expected to occur in Asia and Africa, where most people with diabetes will probably live in 2030.  The increase in rates in developing countries follows the trend of urbanization and lifestyle changes, including increasingly sedentary lifestyles, less physically demanding work and the global nutrition transition, marked by increased intake of foods that are high energy-dense but nutrient-poor .  The global number of diabetes cases might increase by 48% between 2017 and 2045. As of 2020, 38% of all US adults had prediabetes Diabetes Diabetes",
        "response": "It's important to work with your doctor and healthcare team to develop a plan that works for you and to stay vigilant about monitoring your symptoms and blood sugar levels."
    },
    {
        "dialog": [
            "Hi Medi, I have some questions about diabetes.",
            "Sure, I am here to help you with your questions.",
            "What is the cause of diabetes?",
            "The cause of diabetes is the body's inability to produce or respond to insulin properly.",
            "What are the symptoms of diabetes?",
            "The symptoms of diabetes include increased thirst and urination, blurred vision, fatigue, and slow-healing wounds.",
            "Is there a cure for diabetes?",
            "Currently, there is no cure for diabetes, but it can be managed with lifestyle changes and medication.",
            "Thanks for your help, Medi. I have a better understanding of diabetes now."
        ],
        "knowledge": "Diabetes Diabetes The defective responsiveness of body tissues to insulin is believed to involve the insulin receptor.  However, the specific defects are not known.  Diabetes mellitus cases due to a known defect are classified separately.  Type 2 diabetes is the most common type of diabetes mellitus accounting for 95% of diabetes.  Many people with type 2 diabetes have evidence of prediabetes  before meeting the criteria for type 2 diabetes.  The progression of prediabetes to overt type 2 diabetes can be slowed or reversed by lifestyle changes or medications that improve insulin sensitivity or reduce the liver's glucose production. Type 2 diabetes is primarily due to lifestyle factors and genetics Diabetes Diabetes",
        "response": "You're welcome. Don't hesitate to ask if you have any other questions."
    },
    {
        "dialog": [
            "Hi Medi, I was just diagnosed with diabetes.",
            "I'm sorry to hear that. How can I help you?",
            "What foods should I avoid?",
            "You should avoid foods that are high in sugar or carbohydrates, such as candy, soda, and bread.",
            "What foods are good for me to eat?",
            "Foods that are high in fiber and protein are good for you to eat, such as fruits, vegetables, and lean meats.",
            "What medications are used to treat diabetes?",
            "There are several types of medications used to treat diabetes, including insulin, metformin, and sulfonylureas.",
            "Thank you for the advice, Medi. I will talk to my doctor about my treatment options."
        ],
        "knowledge": "Diabetes Diabetes The defective responsiveness of body tissues to insulin is believed to involve the insulin receptor.  However, the specific defects are not known.  Diabetes mellitus cases due to a known defect are classified separately.  Type 2 diabetes is the most common type of diabetes mellitus accounting for 95% of diabetes.  Many people with type 2 diabetes have evidence of prediabetes  before meeting the criteria for type 2 diabetes.  The progression of prediabetes to overt type 2 diabetes can be slowed or reversed by lifestyle changes or medications that improve insulin sensitivity or reduce the liver's glucose production. Type 2 diabetes is primarily due to lifestyle factors and genetics Diabetes Diabetes",
        "response": "You're welcome. I hope you find the treatment that works best for you."
    },
    {
        "dialog": [
            "Hi Medi, I was recently diagnosed with diabetes and I'm not sure what to do.",
            "I'm sorry to hear that. What questions do you have?",
            "What type of exercise should I do to manage my diabetes?",
            "Physical activity is very important for managing diabetes. You should do moderate-intensity exercise, such as walking, for at least 30 minutes a day.",
            "What should I do if my blood sugar is too high?",
            "If your blood sugar is too high, you should drink plenty of water, avoid sugary foods, and take your medication as prescribed by your doctor.",
            "How often should I check my blood sugar?",
            "You should check your blood sugar as often as your doctor recommends, usually several times a day.",
            "Thank you for the advice, Medi. I will start incorporating exercise into my daily routine."
        ],
        "knowledge": "Diabetes Diabetes The defective responsiveness of body tissues to insulin is believed to involve the insulin receptor.  However, the specific defects are not known.  Diabetes mellitus cases due to a known defect are classified separately.  Type 2 diabetes is the most common type of diabetes mellitus accounting for 95% of diabetes.  Many people with type 2 diabetes have evidence of prediabetes  before meeting the criteria for type 2 diabetes.  The progression of prediabetes to overt type 2 diabetes can be slowed or reversed by lifestyle changes or medications that improve insulin sensitivity or reduce the liver's glucose production. Type 2 diabetes is primarily due to lifestyle factors and genetics Diabetes Diabetes",
        "response": "You're welcome. I'm glad I could help. Remember to always follow your doctor's advice and take care of yourself."
    },
    {
        "dialog": [
            "Hello Medi, can you help me with my blood sugar level ?",
            "Sure, I'm here to help you. What are your blood sugar readings?",
            "My blood sugar readings are higher than normal level.",
            "How long has your blood sugar level been high?",
            "It has been high for weeks.",
            "Alright, you may have high blood sugar. You should change your diet to low-carb.",
            "What kind of food can I eat?",
            "Foods such as green vegetables, fish, lean meats and low-fat dairy products are good options for you.",
            "I see, thank you for your advice. Anything else I should know about blood sugar? "
        ],
        "knowledge": "Diabetes Diabetes Blood sugar can be controlled through diet, exercise, and medication.  Normal blood sugar levels are between 70-99 mg/dL when fasting and up to 140 mg/dL two hours after eating.  High blood sugar levels are called hyperglycemia.  In people with diabetes, the body either doesn't make enough insulin or doesn't use it effectively, leading to high blood sugar.  Symptoms of high blood sugar include frequent urination, increased thirst, and blurry vision. Diabetes Diabetes",
        "response": "To control blood sugar, you should follow a low-carb diet and eat foods such as green vegetables, fish, lean meats, and low-fat dairy products. Additionally, you should exercise regularly."
    },
    {
        "dialog": [
            "Hello Medi, how can I prevent myself from getting diabetes?",
            "You can prevent diabetes by maintaining a healthy lifestyle and diet.",
            "What kind of healthy lifestyle and diet?",
            "You should exercise regularly and eat healthy foods like fruits, vegetables, and whole grains.",
            "Is there anything else I should be aware of?",
            "Yes, you should avoid sugary drinks and foods high in refined carbohydrates, and maintain a healthy weight.",
            "How do I know if I'm at risk for diabetes?",
            "If you are overweight, have a family history of diabetes, or have high blood pressure, you may be at risk.",
            "Thank you for your advice. Do you have any other tips on how to maintain a healthy lifestyle?"
        ],
        "knowledge": "Diabetes Diabetes You can prevent diabetes by maintaining a healthy lifestyle and diet.  This includes exercising regularly and eating healthy foods like fruits, vegetables, and whole grains.  You should also avoid sugary drinks and foods high in refined carbohydrates, and maintain a healthy weight.  If you are overweight, have a family history of diabetes, or have high blood pressure, you may be at risk.  Diabetes Diabetes",
        "response": "Maintaining a healthy lifestyle includes exercising regularly, eating healthy foods like fruits, vegetables, and whole grains, avoiding sugary drinks and foods high in refined carbohydrates, and maintaining a healthy weight. These actions will help you to prevent diabetes."
    },
    {
        "dialog": [
            "Hello Medi, I have just been diagnosed with diabetes. What should I do?",
            "I'm sorry to hear that. You should start by working with your doctor to develop a treatment plan.",
            "What kind of treatment plan?",
            "Your treatment plan may include monitoring your blood sugar levels, taking medication, and making lifestyle changes like exercising and eating a healthy diet.",
            "What kind of medication should I take?",
            "There are many different types of medication that can help you manage your diabetes, including insulin and oral medications like metformin.",
            "Is there anything else I should be aware of?",
            "Yes, you should also monitor your blood pressure and cholesterol levels, and get regular eye exams.",
            "Thank you for your advice. Do you have any other tips on how to manage diabetes?"
        ],
        "knowledge": "Diabetes Diabetes Treatment for diabetes includes monitoring blood sugar levels, taking medication, and making lifestyle changes like exercising and eating a healthy diet.  Medications for diabetes include insulin and oral medications like metformin.  You should also monitor your blood pressure and cholesterol levels, and get regular eye exams. Diabetes Diabetes",
        "response": "Your treatment plan should include monitoring your blood sugar levels, taking medication, and making lifestyle changes like exercising and eating a healthy diet. You should also monitor your blood pressure and cholesterol levels, and get regular eye exams."
    },
    {
        "dialog": [
            "Hi Medi, I think I might have symptoms of diabetes.",
            "Sorry to hear that. Can you please tell me your symptoms?",
            "I have been feeling very thirsty and tired lately with blurry vision.",
            "Okay, based on your symptoms, you may have hyperglycemia and should see a doctor soon.",
            "What is hyperglycemia?",
            "Hyperglycemia is a condition where your blood sugar levels are too high.",
            "Is there any way to lower my blood sugar levels?",
            "Yes, you can do that by taking medications and following a healthy lifestyle.",
            "What are the healthy lifestyle changes I should make?"
        ],
        "knowledge": "Diabetes Diabetes 0 million deaths worldwide, using modeling to estimate the total number of deaths that could be directly or indirectly attributed to diabetes. Diabetes occurs throughout the world but is more common  in more developed countries.  The greatest increase in rates has however been seen in low- and middle-income countries, where more than 80% of diabetic deaths occur.  The fastest prevalence increase is expected to occur in Asia and Africa, where most people with diabetes will probably live in 2030.  The increase in rates in developing countries follows the trend of urbanization and lifestyle changes, including increasingly sedentary lifestyles, less physically demanding work and the global nutrition transition, marked by increased intake of foods that are high energy-dense but nutrient-poor .  The global number of diabetes cases might increase by 48% between 2017 and 2045. As of 2020, 38% of all US adults had prediabetes Diabetes Diabetes",
        "response": "You should eat a balanced diet, get regular exercise, and avoid sugary and processed foods."
    },
    {
        "dialog": [
            "Hello Medi, I have a question about diabetes.",
            "Hi there! I'm here to help, what's your question?",
            "I'm curious about the difference between type 1 and type 2 diabetes.",
            "Type 1 diabetes is when your immune system attacks and destroys the cells in your pancreas that make insulin. Type 2 diabetes is when your body doesn't use insulin properly.",
            "What are the symptoms of type 1 diabetes?",
            "The symptoms of type 1 diabetes are similar to type 2 diabetes, including increased thirst, hunger, and fatigue, but also include weight loss and blurred vision.",
            "How can I prevent diabetes?",
            "You can lower your risk of developing diabetes by exercising regularly, eating a healthy diet, and maintaining a healthy weight.",
            "Thanks for the information, Medi!"
        ],
        "knowledge": "Diabetes Diabetes 0 million deaths worldwide, using modeling to estimate the total number of deaths that could be directly or indirectly attributed to diabetes. Diabetes occurs throughout the world but is more common  in more developed countries.  The greatest increase in rates has however been seen in low- and middle-income countries, where more than 80% of diabetic deaths occur.  The fastest prevalence increase is expected to occur in Asia and Africa, where most people with diabetes will probably live in 2030.  The increase in rates in developing countries follows the trend of urbanization and lifestyle changes, including increasingly sedentary lifestyles, less physically demanding work and the global nutrition transition, marked by increased intake of foods that are high energy-dense but nutrient-poor .  The global number of diabetes cases might increase by 48% between 2017 and 2045. As of 2020, 38% of all US adults had prediabetes Diabetes Diabetes",
        "response": "You're welcome! If you have any more questions feel free to ask."
    },
    {
        "dialog": [
            "Hi Medi, I just had a diabetes check-up and was diagnosed with type 2 diabetes.",
            "I'm sorry to hear that. How can I help you?",
            "I'm wondering what kind of diet I should follow now.",
            "You should focus on eating foods that are low in sugar and carbohydrates, and high in fiber and protein.",
            "What about exercise?",
            "Exercise is also very important for managing type 2 diabetes. Try to get at least 30 minutes of moderate exercise most days of the week.",
            "Are there any medications I can take?",
            "Yes, there are several medications that can help manage blood sugar levels, including metformin and insulin.",
            "Thanks for the information, Medi."
        ],
        "knowledge": "Diabetes Diabetes 0 million deaths worldwide, using modeling to estimate the total number of deaths that could be directly or indirectly attributed to diabetes. Diabetes occurs throughout the world but is more common  in more developed countries.  The greatest increase in rates has however been seen in low- and middle-income countries, where more than 80% of diabetic deaths occur.  The fastest prevalence increase is expected to occur in Asia and Africa, where most people with diabetes will probably live in 2030.  The increase in rates in developing countries follows the trend of urbanization and lifestyle changes, including increasingly sedentary lifestyles, less physically demanding work and the global nutrition transition, marked by increased intake of foods that are high energy-dense but nutrient-poor .  The global number of diabetes cases might increase by 48% between 2017 and 2045. As of 2020, 38% of all US adults had prediabetes Diabetes Diabetes",
        "response": "You're welcome! If you need any further advice, don't hesitate to ask."
    },
    {
        "dialog": [
            "Hello Medi, I'm worried about my blood sugar levels.",
            "Sure, I'm here to help you. Can you tell me more about your blood sugar levels?",
            "I've been feeling thirsty and fatigued lately, and my vision is blurry sometimes.",
            "I see. Based on your symptoms, it's possible that you have high blood sugar.",
            "What should I do next?",
            "You should see a doctor as soon as possible to get a proper diagnosis and treatment plan.",
            "Is there anything I can do in the meantime?",
            "Yes, you can start by eating a healthy diet and avoiding sugary foods and drinks.",
            "Thank you, Medi. What are some examples of healthy foods I should eat?"
        ],
        "knowledge": "Diabetes Diabetes 0 million deaths worldwide, using modeling to estimate the total number of deaths that could be directly or indirectly attributed to diabetes. Diabetes occurs throughout the world but is more common in more developed countries. The greatest increase in rates has however been seen in low- and middle-income countries, where more than 80% of diabetic deaths occur. The fastest prevalence increase is expected to occur in Asia and Africa, where most people with diabetes will probably live in 2030. The increase in rates in developing countries follows the trend of urbanization and lifestyle changes, including increasingly sedentary lifestyles, less physically demanding work and the global nutrition transition, marked by increased intake of foods that are high energy-dense but nutrient-poor. The global number of diabetes cases might increase by 48% between 2017 and 2045. As of 2020, 38% of all US adults had prediabetes Diabetes Diabetes",
        "response": "Some examples of healthy foods you can eat are vegetables, fruits, whole grains, and lean protein sources."
    },
    {
        "dialog": [
            "Hi Medi, I'm feeling a bit down about having diabetes.",
            "I'm sorry to hear that. Can you tell me more?",
            "It's just hard to deal with the fact that I have a chronic illness that will never go away.",
            "I understand. It can be tough to come to terms with that. But there are ways to manage your diabetes and live a full life.",
            "Can you give me some examples?",
            "Sure, some things you can do are to eat a healthy diet, exercise regularly, and monitor your blood sugar levels.",
            "What about medications?",
            "Yes, medications can also be helpful in managing diabetes. Your doctor can prescribe the right medication for you.",
            "Thanks, Medi. It's nice to know there are things I can do to manage my condition."
        ],
        "knowledge": "Diabetes Diabetes 0 million deaths worldwide, using modeling to estimate the total number of deaths that could be directly or indirectly attributed to diabetes. Diabetes occurs throughout the world but is more common in more developed countries. The greatest increase in rates has however been seen in low- and middle-income countries, where more than 80% of diabetic deaths occur. The fastest prevalence increase is expected to occur in Asia and Africa, where most people with diabetes will probably live in 2030. The increase in rates in developing countries follows the trend of urbanization and lifestyle changes, including increasingly sedentary lifestyles, less physically demanding work and the global nutrition transition, marked by increased intake of foods that are high energy-dense but nutrient-poor. The global number of diabetes cases might increase by 48% between 2017 and 2045. As of 2020, 38% of all US adults had prediabetes Diabetes Diabetes",
        "response": "Yes, there are many things you can do to manage your diabetes and live a full life. You're not alone in this."
    },
    {
        "dialog": [
            "Hi Medi, I recently had a procedure done and I'm not sure what to do next.",
            "I'm here to help. Can you tell me more about the procedure you had?",
            "I had a stent put in to treat a blockage in my heart.",
            "Okay. It's important to take care of yourself after a procedure like that. Did your doctor give you any instructions?",
            "Yes, I need to take some medications and avoid strenuous activity for a while.",
            "That's right. You should also make sure to eat a healthy diet and get plenty of rest.",
            "What about exercise?",
            "You should start with light exercise, like walking, and gradually work your way up to more intense exercise over time.",
            "Thanks, Medi. I want to make sure I'm doing everything I can to stay healthy."
        ],
        "knowledge": "Cardiovascular disease Cardiovascular disease Cardiovascular diseases are the leading cause of death globally and are expected to remain so for the foreseeable future.  Coronary heart disease and stroke constitute the majority of the disease burden. Cardiovascular diseases are a group of disorders of the heart and blood vessels and include coronary heart disease, cerebrovascular disease, peripheral arterial disease, rheumatic heart disease, congenital heart disease, deep vein thrombosis and pulmonary embolism. Cardiovascular disease affects both men and women, and people of all races and ethnicities Influenza Influenza",
        "response": "Yes, taking care of yourself is very important after a procedure like that. Make sure to follow your doctor's instructions and take care of yourself."
    },
    {
        "dialog": [
            "Hi Medi, I have been feeling thirsty and tired lately.",
            "Hello, have you been urinating more frequently than usual?",
            "Yes, I have.",
            "It's possible that you have diabetes. I recommend visiting a doctor for blood tests.",
            "What can I do in the meantime?",
            "You can drink water instead of sugary drinks, eat a healthy diet, and exercise regularly.",
            "Thank you, I will schedule a visit to the doctor.",
            "You're welcome. Good luck with your health!",
            "Can you tell me more about diabetes?"
        ],
        "knowledge": "Diabetes Diabetes 0 million deaths worldwide, using modeling to estimate the total number of deaths that could be directly or indirectly attributed to diabetes. Diabetes occurs throughout the world but is more common  in more developed countries.  The greatest increase in rates has however been seen in low- and middle-income countries, where more than 80% of diabetic deaths occur.  The fastest prevalence increase is expected to occur in Asia and Africa, where most people with diabetes will probably live in 2030.  The increase in rates in developing countries follows the trend of urbanization and lifestyle changes, including increasingly sedentary lifestyles, less physically demanding work and the global nutrition transition, marked by increased intake of foods that are high energy-dense but nutrient-poor .  The global number of diabetes cases might increase by 48% between 2017 and 2045. As of 2020, 38% of all US adults had prediabetes Diabetes Diabetes",
        "response": "Diabetes is a chronic disease that affects the way your body processes glucose. There are two main types of diabetes: Type 1 and Type 2. Type 1 diabetes is an autoimmune disease where the pancreas doesn't produce insulin. Type 2 diabetes is when the body doesn't use insulin properly or doesn't make enough of it."
    },
    {
        "dialog": [
            "Hi Medi, what can I do to prevent diabetes?",
            "Hello! You can reduce your risk by maintaining a healthy weight, eating a balanced diet, and exercising regularly.",
            "What kind of diet should I follow?",
            "You should try to eat more fruits, vegetables, whole grains, and lean proteins. Avoid sugary and processed foods.",
            "What about physical activity?",
            "Physical activity can help you maintain a healthy weight and reduce insulin resistance. I recommend at least 30 minutes of moderate activity per day.",
            "Thank you, I will try to follow these recommendations.",
            "You're welcome! Let me know if you have any other questions.",
            "How common is diabetes in the world?"
        ],
        "knowledge": "Diabetes Diabetes 0 million deaths worldwide, using modeling to estimate the total number of deaths that could be directly or indirectly attributed to diabetes. Diabetes occurs throughout the world but is more common  in more developed countries.  The greatest increase in rates has however been seen in low- and middle-income countries, where more than 80% of diabetic deaths occur.  The fastest prevalence increase is expected to occur in Asia and Africa, where most people with diabetes will probably live in 2030.  The increase in rates in developing countries follows the trend of urbanization and lifestyle changes, including increasingly sedentary lifestyles, less physically demanding work and the global nutrition transition, marked by increased intake of foods that are high energy-dense but nutrient-poor .  The global number of diabetes cases might increase by 48% between 2017 and 2045. As of 2020, 38% of all US adults had prediabetes Diabetes Diabetes",
        "response": "Diabetes is a global issue with increasing prevalence in low- and middle-income countries. It's estimated that the global number of diabetes cases might increase by 48% between 2017 and 2045."
    },
    {
        "dialog": [
            "Hi Medi, I recently had a medical procedure. Can you advise me on my lifestyle?",
            "Of course! What procedure did you have?",
            "I had a heart bypass surgery.",
            "It's important to follow your doctor's orders and take any prescribed medication. You should also eat a heart-healthy diet, exercise regularly, and avoid smoking.",
            "What kind of diet should I follow?",
            "You should eat plenty of fruits, vegetables, whole grains, lean proteins, and healthy fats like olive oil and nuts. Avoid saturated and trans fats, as well as sugary and processed foods.",
            "Thank you for the advice. What kind of exercise do you recommend?",
            "You should aim for at least 30 minutes of moderate exercise per day, such as walking or swimming. You should also talk to your doctor about any specific exercise recommendations.",
            "Thanks for your help, Medi."
        ],
        "knowledge": "Heart Disease Heart Disease  Heart disease is a leading cause of death worldwide. Lifestyle factors such as unhealthy diet, physical inactivity, and smoking contribute significantly to the development of heart disease. A heart-healthy diet includes plenty of fruits, vegetables, whole grains, lean proteins, and healthy fats. Exercise can help reduce the risk of heart disease by improving cardiovascular health and reducing the risk of obesity, high blood pressure, and diabetes. Smoking is a major risk factor for heart disease and should be avoided.",
        "response": "Lifestyle factors such as unhealthy diet, physical inactivity, and smoking contribute significantly to the development of heart disease."
    },
    {
        "dialog": [
            "Hi Medi, I am worried about my risk of getting diabetes.",
            "Don't worry, I'm happy to help. What's your concern?",
            "I have some bad habits like smoking and drinking. Can you advise me?",
            "You should quit smoking and drinking. Exercise regularly and eat healthily",
            "What should I eat then?",
            "You should avoid sugary drinks, processed foods and choose more fresh fruits and veggies",
            "Thanks for the tips. Is there any other way to reduce the risk of diabetes?",
            "Yes, you can check your blood glucose level and weight regularly, and get a healthy amount of sleep",
            "How can I check my blood glucose level?"
        ],
        "knowledge": "Diabetes Diabetes  The greatest increase in rates has been seen in low- and middle-income countries, where more than 80% of diabetic deaths occur.  Type 2 diabetes is primarily due to lifestyle factors and genetics. Diabetes increases the risk of heart disease and stroke.  The number of people with diabetes is expected to increase by 48% between 2017 and 2045. Diabetes Diabetes",
        "response": "You can check your blood glucose level by using a glucose meter or visiting a healthcare professional."
    },
    {
        "dialog": [
            "Hi, Medi. I just had a medical procedure. What should I do now?",
            "I'm here to help. What kind of procedure did you have?",
            "I had a heart surgery. Do you have any advice on my diet?",
            "You should eat more fresh fruits, vegetables, and lean protein. Avoid unhealthy fats and salt",
            "What about physical exercise?",
            "You should start with light exercises like walking and gradually increase the intensity. Don't overdo it",
            "What else should I do?",
            "You need to take the prescribed medicine on time and follow up with your doctor regularly.",
            "What about my work? Can I get back to it immediately?"
        ],
        "knowledge": "Heart Surgery Heart Surgery After surgery, you should follow a healthy diet and get enough sleep. Light exercise like walking can help you recover.  You have to take prescribed medications and attend regular follow-up visits with your healthcare provider. Heart Surgery Heart Surgery",
        "response": "You should consult your doctor before returning to work. It depends on your recovery progress."
    },
    {
        "dialog": [
            "Hi Medi, what are the symptoms of diabetes?",
            "Hi, the symptoms of diabetes include excessive thirst, frequent urination, fatigue, blurred vision, and slow wound healing.",
            "Can you tell me more about the differences in symptoms among types?",
            "Type 1 diabetes symptoms are sudden, while type 2 diabetes symptoms develop gradually. Gestational diabetes symptoms are similar to those of type 2 diabetes.",
            "Is there any way to prevent diabetes?",
            "Yes, you can prevent diabetes by maintaining a healthy lifestyle, eating a balanced diet, exercising regularly, and maintaining a healthy weight.",
            "Are there any treatments available for diabetes?",
            "Yes, there are various treatments, including lifestyle changes, medications, and insulin therapy, depending on the type and severity of diabetes",
            "Thank you. What is the most common type of diabetes?"
        ],
        "knowledge": "Diabetes Diabetes Type 2 diabetes is the most common type of diabetes mellitus accounting for 95% of diabetes.  Many people with type 2 diabetes have evidence of prediabetes  before meeting the criteria for type 2 diabetes.  The defective responsiveness of body tissues to insulin is believed to involve the insulin receptor. However, the specific defects are not known. Diabetes mellitus cases due to a known defect are classified separately. Diabetes Diabetes",
        "response": "Type 2 diabetes is the most common type of diabetes, accounting for 95% of diabetes cases."
    },
    {
        "dialog": [
            "Hi Medi, I'm concerned about my risk of diabetes.",
            "Okay, I can help. What's your family history and lifestyle like?",
            "My grandparents had type 2 diabetes, and I don't get enough exercise.",
            "Got it. You may want to get screened for diabetes and start incorporating more activity into your day.",
            "What can I do to lower my risk?",
            "Eating a healthy diet, maintaining a healthy weight, and getting regular physical activity can all help reduce your risk of type 2 diabetes.",
            "Thank you, Medi. How often should I get screened for diabetes?",
            "It's recommended that adults with no symptoms be screened every three years starting at age 45.",
            "Okay, I'll keep that in mind. Thanks for your help, Medi!"
        ],
        "knowledge": "Diabetes Diabetes 0 million deaths worldwide, using modeling to estimate the total number of deaths that could be directly or indirectly attributed to diabetes. Diabetes occurs throughout the world but is more common in more developed countries. The greatest increase in rates has however been seen in low- and middle-income countries, where more than 80% of diabetic deaths occur. The fastest prevalence increase is expected to occur in Asia and Africa, where most people with diabetes will probably live in 2030. The increase in rates in developing countries follows the trend of urbanization and lifestyle changes, including increasingly sedentary lifestyles, less physically demanding work and the global nutrition transition, marked by increased intake of foods that are high energy-dense but nutrient-poor. The global number of diabetes cases might increase by 48% between 2017 and 2045. As of 2020, 38% of all US adults had prediabetes Diabetes Diabetes",
        "response": "You're welcome! It's important to stay proactive with your health."
    },
    {
        "dialog": [
            "Hi Medi, I was just diagnosed with type 2 diabetes.",
            "I'm sorry to hear that. How can I help?",
            "I'm feeling really overwhelmed and don't know what to do.",
            "That's understandable. We can work together to come up with a plan. Have you spoken with your doctor about treatment options?",
            "Not yet. What are my options?",
            "Depending on the severity of your diabetes, your doctor may recommend lifestyle changes, medication, or insulin therapy.",
            "Okay. What lifestyle changes should I make?",
            "Eating a healthy diet, exercising regularly, and quitting smoking if you smoke can all help manage diabetes.",
            "I see. Thank you, Medi. I'm feeling a bit better now."
        ],
        "knowledge": "Diabetes Diabetes 0 million deaths worldwide, using modeling to estimate the total number of deaths that could be directly or indirectly attributed to diabetes. Diabetes occurs throughout the world but is more common in more developed countries. The greatest increase in rates has however been seen in low- and middle-income countries, where more than 80% of diabetic deaths occur. The fastest prevalence increase is expected to occur in Asia and Africa, where most people with diabetes will probably live in 2030. The increase in rates in developing countries follows the trend of urbanization and lifestyle changes, including increasingly sedentary lifestyles, less physically demanding work and the global nutrition transition, marked by increased intake of foods that are high energy-dense but nutrient-poor. The global number of diabetes cases might increase by 48% between 2017 and 2045. As of 2020, 38% of all US adults had prediabetes Diabetes Diabetes",
        "response": "You're welcome. It's normal to feel overwhelmed, but remember you're not alone in managing diabetes."
    },
    {
        "dialog": [
            "Hello Medi, I recently had bariatric surgery and am looking for advice on my diet.",
            "Of course! What type of diet has your doctor recommended?",
            "My doctor said I need to eat high-protein foods and avoid sugary and fatty foods.",
            "Those are good guidelines. It's also important to eat slowly and in small amounts throughout the day.",
            "What types of high-protein foods do you recommend?",
            "Lean meats, poultry, fish, beans, and legumes are all great sources of protein.",
            "Okay, that makes sense. Are there any foods I should avoid specifically?",
            "You should avoid high-carbohydrate, high-sugar, and high-fat foods. These can cause discomfort and may not be well-tolerated after surgery.",
            "Thank you, Medi! I'll be sure to follow your advice."
        ],
        "knowledge": "Obesity Obesity Obesity is a complex public health and policy problem because of its prevalence, costs, and health effects. As such, managing it requires changes in the wider societal context and effort by communities, local authorities, and governments. Public health efforts seek to understand and correct the environmental factors responsible for the increasing prevalence of obesity in the population. Solutions look at changing the factors that cause excess food energy consumption and inhibit physical activity. Efforts include federally reimbursed meal programs in schools, limiting direct junk food marketing to children, and decreasing access to sugar-sweetened beverages in schools. The World Health Organization recommends the taxing of sugary drinks. When constructing urban environments, efforts have been made to increase access to parks and to develop pedestrian routes Obesity Obesity",
        "response": "You're welcome! It's important to stick to a healthy diet after bariatric surgery to ensure proper healing and weight loss."
    }
]