[
    {
        "dialog": [
            "Hi Medi, I'm feeling sick and I have a runny nose and cough",
            "It sounds like you might have a common cold",
            "What can I do to feel better?",
            "Rest, drink plenty of fluids, and take over-the-counter cold medication",
            "How long does it usually last?",
            "Cold symptoms typically last 7-10 days, but can sometimes last up to 3 weeks",
            "Should I see a doctor?",
            "Most people with a cold don't need to see a doctor, but if you have a fever or other severe symptoms, it's best to get checked out",
            "Okay, thank you for your help"
        ],
        "knowledge": "Common cold Common cold A cold usually begins with fatigue, a feeling of being chilled, sneezing, and a headache, followed in a couple of days by a runny nose and cough.  Symptoms may begin within sixteen hours of exposure and typically peak two to four days after onset.  They usually resolve in seven to ten days, but some can last for up to three weeks.  The average duration of cough is eighteen days and in some cases people develop a post-viral cough which can linger after the infection is gone.  In children, the cough lasts for more than ten days in 35–40% of cases and continues for more than 25 days in 10%. The common cold is an infection of the upper respiratory tract which can be caused by many different viruses.  The most commonly implicated is a rhinovirus , a type of picornavirus with 99 known serotypes Common cold Common cold",
        "response": "You're welcome, feel better soon"
    },
    {
        "dialog": [
            "Hi Medi, I heard that there are different types of colds. What are they?",
            "There are many different viruses that can cause a cold, but the most common are rhinoviruses",
            "Is there a difference between a cold and the flu?",
            "Yes, the flu is caused by a different virus and usually has more severe symptoms like fever and body aches",
            "Can you get a cold from being outside in the cold weather?",
            "No, being cold doesn't actually cause a cold. It's just a myth",
            "What can I do to prevent getting a cold?",
            "Wash your hands frequently, avoid touching your face, and try to avoid close contact with people who are sick",
            "Okay, thanks for the information"
        ],
        "knowledge": "Common cold Common cold A cold usually begins with fatigue, a feeling of being chilled, sneezing, and a headache, followed in a couple of days by a runny nose and cough.  Symptoms may begin within sixteen hours of exposure and typically peak two to four days after onset.  They usually resolve in seven to ten days, but some can last for up to three weeks.  The average duration of cough is eighteen days and in some cases people develop a post-viral cough which can linger after the infection is gone.  In children, the cough lasts for more than ten days in 35–40% of cases and continues for more than 25 days in 10%. The common cold is an infection of the upper respiratory tract which can be caused by many different viruses.  The most commonly implicated is a rhinovirus , a type of picornavirus with 99 known serotypes Common cold Common cold",
        "response": "You're welcome, let me know if you have any more questions"
    },
    {
        "dialog": [
            "Hello Medi, I recently had a cold and I'm feeling better now. What can I do to prevent getting sick again?",
            "There are a few things you can do to boost your immune system and prevent getting sick. Eating a healthy diet with plenty of fruits and vegetables, getting enough sleep, and exercising regularly can all help",
            "What about taking vitamins or supplements?",
            "If you have a balanced diet, you probably don't need to take supplements. However, some people take Vitamin C or Zinc to boost their immune system",
            "Is there anything I should avoid doing?",
            "Try to avoid touching your face, especially your nose and mouth, and avoid close contact with people who are sick",
            "Thank you for the advice, Medi",
            "You're welcome, take care of yourself"
        ],
        "knowledge": "Common cold Common cold A cold usually begins with fatigue, a feeling of being chilled, sneezing, and a headache, followed in a couple of days by a runny nose and cough.  Symptoms may begin within sixteen hours of exposure and typically peak two to four days after onset.  They usually resolve in seven to ten days, but some can last for up to three weeks.  The average duration of cough is eighteen days and in some cases people develop a post-viral cough which can linger after the infection is gone.  In children, the cough lasts for more than ten days in 35–40% of cases and continues for more than 25 days in 10%. The common cold is an infection of the upper respiratory tract which can be caused by many different viruses.  The most commonly implicated is a rhinovirus , a type of picornavirus with 99 known serotypes Common cold Common cold",
        "response": "You're welcome, stay healthy!"
    },
    {
        "dialog": [
            "Hi Medi, I'm not feeling well lately.",
            "Hello, what specific symptoms do you have?",
            "I'm sneezing a lot and my nose is runny.",
            "I see, have you taken any medication?",
            "I haven't taken any medication yet.",
            "Okay, I advise you to take some over-the-counter antihistamines and rest more.",
            "Thank you Medi. How long will it take to recover?",
            "It usually takes 7-10 days to recover from common cold.",
            "Got it, thanks for your help."
        ],
        "knowledge": "Common cold Common cold A cold usually begins with fatigue, a feeling of being chilled, sneezing, and a headache, followed in a couple of days by a runny nose and cough.  Symptoms may begin within sixteen hours of exposure and typically peak two to four days after onset.  They usually resolve in seven to ten days, but some can last for up to three weeks.  The average duration of cough is eighteen days and in some cases people develop a post-viral cough which can linger after the infection is gone.  In children, the cough lasts for more than ten days in 35–40% of cases and continues for more than 25 days in 10%. The common cold is an infection of the upper respiratory tract which can be caused by many different viruses.  The most commonly implicated is a rhinovirus , a type of picornavirus with 99 known serotypes Common cold Common cold",
        "response": "You're welcome. It will take 7-10 days to recover from common cold."
    },
    {
        "dialog": [
            "Hi Medi, can you tell me more about common cold?",
            "Of course! It's a viral infection of the upper respiratory tract.",
            "What are the symptoms of common cold?",
            "The symptoms include fatigue, feeling chilled, sneezing, headache, runny nose and cough.",
            "How long does it take to recover from common cold?",
            "It usually takes 7-10 days, but some cases can last up to three weeks.",
            "So, how can I prevent getting a cold?",
            "You can prevent it by washing your hands regularly, avoiding close contact with sick people, and covering your nose and mouth when you cough or sneeze.",
            "Thanks for your help, Medi."
        ],
        "knowledge": "Common cold Common cold A cold usually begins with fatigue, a feeling of being chilled, sneezing, and a headache, followed in a couple of days by a runny nose and cough.  Symptoms may begin within sixteen hours of exposure and typically peak two to four days after onset.  They usually resolve in seven to ten days, but some can last for up to three weeks.  The average duration of cough is eighteen days and in some cases people develop a post-viral cough which can linger after the infection is gone.  In children, the cough lasts for more than ten days in 35–40% of cases and continues for more than 25 days in 10%. The common cold is an infection of the upper respiratory tract which can be caused by many different viruses.  The most commonly implicated is a rhinovirus , a type of picornavirus with 99 known serotypes Common cold Common cold",
        "response": "You're welcome. Remember to wash your hands regularly and avoid close contact with sick people."
    },
    {
        "dialog": [
            "Hi Medi, I recently got over a cold. What should I do now to stay healthy?",
            "Congratulations! You should maintain a healthy lifestyle by eating a balanced diet and getting regular exercise.",
            "Are there any foods that can help boost my immune system after being sick?",
            "Yes, foods that are rich in vitamin C and zinc can be good for your immune system. Examples include citrus fruits, broccoli, spinach, nuts, and whole grains.",
            "What about physical activity? Should I do more or less?",
            "You should aim to get at least 150 minutes of moderate aerobic exercise per week, such as brisk walking or cycling. This can help boost your immune system and improve overall health.",
            "Thanks, Medi. I'll try my best to follow your advice.",
            "You're welcome. Remember to take care of yourself."
        ],
        "knowledge": "Common cold Common cold A cold usually begins with fatigue, a feeling of being chilled, sneezing, and a headache, followed in a couple of days by a runny nose and cough.  Symptoms may begin within sixteen hours of exposure and typically peak two to four days after onset.  They usually resolve in seven to ten days, but some can last for up to three weeks.  The average duration of cough is eighteen days and in some cases people develop a post-viral cough which can linger after the infection is gone.  In children, the cough lasts for more than ten days in 35–40% of cases and continues for more than 25 days in 10%. The common cold is an infection of the upper respiratory tract which can be caused by many different viruses.  The most commonly implicated is a rhinovirus , a type of picornavirus with 99 known serotypes Common cold Common cold",
        "response": "You're welcome. Remember to eat a balanced diet and get regular exercise to maintain your health."
    },
    {
        "dialog": [
            "Hello Medi, I have a runny nose and a headache.",
            "Hi, based on your symptoms, you might have a common cold.",
            "What should I do to recover from a common cold?",
            "Drinking plenty of fluids and taking rest is enough to feel better. ",
            "Should I take any medication?",
            "Over-the-counter medication can relieve your symptoms",
            "What about natural remedies?",
            "Drinking hot tea with honey or gargling with salt water can soothe your throat.",
            "Thank you, Medi. How long will it take for me to recover?"
        ],
        "knowledge": "Common cold A cold usually begins with fatigue, a feeling of being chilled, sneezing, and a headache, followed in a couple of days by a runny nose and cough.  Symptoms may begin within sixteen hours of exposure and typically peak two to four days after onset.  They usually resolve in seven to ten days, but some can last for up to three weeks.  The average duration of cough is eighteen days and in some cases people develop a post-viral cough which can linger after the infection is gone.  In children, the cough lasts for more than ten days in 35–40% of cases and continues for more than 25 days in 10%. The common cold is an infection of the upper respiratory tract which can be caused by many different viruses.  The most commonly implicated is a rhinovirus , a type of picornavirus with 99 known serotypes Common cold Common cold",
        "response": "Typically, a common cold lasts for 7 to 10 days. But if the symptoms get worse, you should visit your doctor."
    },
    {
        "dialog": [
            "Hello Medi, I have a common cold. Should I go to work?",
            "It's better to stay at home. You can spread your illness to others.",
            "What should I do to avoid catching a cold?",
            "Washing your hands regularly and avoiding close contact with sick people can help.",
            "What should I eat when I have a cold?",
            "Chicken soup, ginger tea, and citrus fruits are all good for a cold.",
            "Can I exercise when I have a cold?",
            "It's better not to exercise when you have a cold because it can make you more tired.",
            "Okay, Medi. Thank you for your advice. "
        ],
        "knowledge": "Common cold A cold usually begins with fatigue, a feeling of being chilled, sneezing, and a headache, followed in a couple of days by a runny nose and cough.  Symptoms may begin within sixteen hours of exposure and typically peak two to four days after onset.  They usually resolve in seven to ten days, but some can last for up to three weeks.  The average duration of cough is eighteen days and in some cases people develop a post-viral cough which can linger after the infection is gone.  In children, the cough lasts for more than ten days in 35–40% of cases and continues for more than 25 days in 10%. The common cold is an infection of the upper respiratory tract which can be caused by many different viruses.  The most commonly implicated is a rhinovirus , a type of picornavirus with 99 known serotypes Common cold Common cold",
        "response": "You're welcome. I hope you feel better soon. "
    },
    {
        "dialog": [
            "Hello Medi, I have a post-viral cough after my cold is gone. What should I do?",
            "It's normal to have a cough after a cold. But if it lasts more than three weeks, you should see a doctor.",
            "What can I do to relieve the cough?",
            "Drinking plenty of fluids, using a humidifier, and avoiding irritants can help.",
            "Can I take cough medicine?",
            "Over-the-counter cough medicine can help relieve your cough, but you should ask your doctor first.",
            "What about natural remedies?",
            "Honey, ginger, and lemon can soothe your throat and relieve the cough.",
            "Thank you, Medi. How can I prevent getting a cold in the future?"
        ],
        "knowledge": "Common cold A cold usually begins with fatigue, a feeling of being chilled, sneezing, and a headache, followed in a couple of days by a runny nose and cough.  Symptoms may begin within sixteen hours of exposure and typically peak two to four days after onset.  They usually resolve in seven to ten days, but some can last for up to three weeks.  The average duration of cough is eighteen days and in some cases people develop a post-viral cough which can linger after the infection is gone.  In children, the cough lasts for more than ten days in 35–40% of cases and continues for more than 25 days in 10%. The common cold is an infection of the upper respiratory tract which can be caused by many different viruses.  The most commonly implicated is a rhinovirus , a type of picornavirus with 99 known serotypes Common cold Common cold",
        "response": "You can prevent getting a cold by washing your hands regularly, avoiding close contact with sick people, and keeping your immune system strong by eating a healthy diet, exercising regularly, and getting enough sleep."
    },
    {
        "dialog": [
            "Hello Medi, I have a runny nose and a cough",
            "It seems like you might have caught a common cold",
            "What should I do to ease my symptoms?",
            "Rest, drink plenty of fluids, and take over-the-counter cold medicines",
            "Is there anything specific for a cough?",
            "A cough suppressant can help relieve coughing, but check with your doctor first",
            "How long does a common cold usually last?",
            "Symptoms can last 7 to 10 days, but some can last up to three weeks",
            "What can I do to prevent catching a cold?"
        ],
        "knowledge": "Common cold Common cold A cold usually begins with fatigue, a feeling of being chilled, sneezing, and a headache, followed in a couple of days by a runny nose and cough.  Symptoms may begin within sixteen hours of exposure and typically peak two to four days after onset.  They usually resolve in seven to ten days, but some can last for up to three weeks.  The average duration of cough is eighteen days and in some cases people develop a post-viral cough which can linger after the infection is gone.  In children, the cough lasts for more than ten days in 35–40% of cases and continues for more than 25 days in 10%. The common cold is an infection of the upper respiratory tract which can be caused by many different viruses.  The most commonly implicated is a rhinovirus , a type of picornavirus with 99 known serotypes Common cold Common cold",
        "response": "You can prevent catching a cold by washing your hands frequently, avoiding close contact with sick people, and avoiding touching your face"
    },
    {
        "dialog": [
            "Hi Medi, I feel a headache and a fever",
            "It sounds like you might have caught the flu",
            "What should I do?",
            "Rest, drink plenty of fluids, and take over-the-counter flu medicines",
            "What are some symptoms of the flu?",
            "Fever, headache, muscle aches, fatigue, cough, sore throat, and runny or stuffy nose",
            "How long does the flu usually last?",
            "Symptoms usually resolve within 2-8 days",
            "How can I prevent the flu from spreading?"
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "You can prevent the flu from spreading by washing your hands frequently, covering your mouth and nose when you cough or sneeze, and avoiding close contact with sick people"
    },
    {
        "dialog": [
            "Hi Medi, I just recovered from a cold, what should I do now?",
            "You should get plenty of rest and continue to drink fluids",
            "Is there anything specific I should eat?",
            "Eating a balanced and healthy diet with plenty of fruits and vegetables can help boost your immune system",
            "Can I exercise?",
            "You should wait until you are fully recovered before doing any strenuous exercise",
            "How long should I wait before returning to work?",
            "You should wait until your symptoms have completely resolved before going back to work",
            "How can I prevent catching another cold?"
        ],
        "knowledge": "Common cold Common cold A cold usually begins with fatigue, a feeling of being chilled, sneezing, and a headache, followed in a couple of days by a runny nose and cough.  Symptoms may begin within sixteen hours of exposure and typically peak two to four days after onset.  They usually resolve in seven to ten days, but some can last for up to three weeks.  The average duration of cough is eighteen days and in some cases people develop a post-viral cough which can linger after the infection is gone.  In children, the cough lasts for more than ten days in 35–40% of cases and continues for more than 25 days in 10%. The common cold is an infection of the upper respiratory tract which can be caused by many different viruses.  The most commonly implicated is a rhinovirus , a type of picornavirus with 99 known serotypes Common cold Common cold",
        "response": "You can prevent catching another cold by washing your hands frequently, avoiding close contact with sick people, and avoiding touching your face"
    },
    {
        "dialog": [
            "Hello Medi, I have a runny nose and headache.",
            "It sounds like you have a cold. Drink fluids and rest.",
            "How long does a cold usually last?",
            "The common cold usually lasts seven to ten days.",
            "What can I do to relieve my symptoms?",
            "You can take over-the-counter cold medication and use a humidifier.",
            "Can I still go to work with a cold?",
            "Rest is best, but if you must go to work, take precautions to avoid spreading germs.",
            "Thank you, Medi. What are some precautions I can take?"
        ],
        "knowledge": "Common cold Common cold A cold usually begins with fatigue, a feeling of being chilled, sneezing, and a headache, followed in a couple of days by a runny nose and cough. Symptoms may begin within sixteen hours of exposure and typically peak two to four days after onset. They usually resolve in seven to ten days, but some can last for up to three weeks. The average duration of cough is eighteen days and in some cases people develop a post-viral cough which can linger after the infection is gone. In children, the cough lasts for more than ten days in 35–40% of cases and continues for more than 25 days in 10%. The common cold is an infection of the upper respiratory tract which can be caused by many different viruses. The most commonly implicated is a rhinovirus , a type of picornavirus with 99 known serotypes Common cold Common cold",
        "response": "You can wear a mask, wash your hands frequently, and avoid close contact with others."
    },
    {
        "dialog": [
            "Hello Medi, what is the common cold?",
            "The common cold is an infection of the upper respiratory tract.",
            "What are the symptoms of a cold?",
            "The symptoms of a cold include fatigue, chills, sneezing, headache, runny nose, and cough.",
            "Is there a cure for the common cold?",
            "There is no cure for the common cold, but there are treatments for relieving symptoms.",
            "What can I do to prevent getting a cold?",
            "Wash your hands frequently, avoid touching your face, and avoid close contact with people who are sick.",
            "Is the common cold contagious?"
        ],
        "knowledge": "Common cold Common cold A cold usually begins with fatigue, a feeling of being chilled, sneezing, and a headache, followed in a couple of days by a runny nose and cough. Symptoms may begin within sixteen hours of exposure and typically peak two to four days after onset. They usually resolve in seven to ten days, but some can last for up to three weeks. The average duration of cough is eighteen days and in some cases people develop a post-viral cough which can linger after the infection is gone. In children, the cough lasts for more than ten days in 35–40% of cases and continues for more than 25 days in 10%. The common cold is an infection of the upper respiratory tract which can be caused by many different viruses. The most commonly implicated is a rhinovirus , a type of picornavirus with 99 known serotypes Common cold Common cold",
        "response": "Yes, the common cold is contagious and can be spread through contact with infected people or surfaces."
    },
    {
        "dialog": [
            "Hello Medi, I just got over a cold. What can I do to prevent getting sick again?",
            "Make sure to wash your hands frequently and avoid close contact with people who are sick.",
            "Are there any vitamins or supplements that can help prevent a cold?",
            "Vitamin C and Zinc supplements may help prevent a cold, but there is not enough evidence to support this claim.",
            "What about natural remedies?",
            "There is not enough evidence to support the effectiveness of natural remedies for preventing a cold.",
            "Can I get a cold from being outside in the cold weather?",
            "No, being outside in cold weather does not cause a cold.",
            "Thank you, Medi. What are some other things I can do to stay healthy?"
        ],
        "knowledge": "Common cold Common cold A cold usually begins with fatigue, a feeling of being chilled, sneezing, and a headache, followed in a couple of days by a runny nose and cough. Symptoms may begin within sixteen hours of exposure and typically peak two to four days after onset. They usually resolve in seven to ten days, but some can last for up to three weeks. The average duration of cough is eighteen days and in some cases people develop a post-viral cough which can linger after the infection is gone. In children, the cough lasts for more than ten days in 35–40% of cases and continues for more than 25 days in 10%. The common cold is an infection of the upper respiratory tract which can be caused by many different viruses. The most commonly implicated is a rhinovirus , a type of picornavirus with 99 known serotypes Common cold Common cold",
        "response": "Eat a healthy diet, exercise regularly, and get plenty of sleep."
    },
    {
        "dialog": [
            "Hello Medi, I am feeling really tired and have a headache today.",
            "I'm sorry to hear that. Have you noticed any other symptoms?",
            "Yes, I've also been sneezing and have a runny nose.",
            "Based on your symptoms, it's possible you have a common cold. Drink plenty of fluids and rest.",
            "How long will it last?",
            "Symptoms usually last for 7-10 days, but can last up to three weeks.",
            "Is there anything else I can do to feel better?",
            "Yes, make sure to wash your hands frequently and cover your mouth and nose when you cough or sneeze.",
            "Thank you for your advice. Is there anything else I should be aware of?"
        ],
        "knowledge": "Common cold Common cold A cold usually begins with fatigue, a feeling of being chilled, sneezing, and a headache, followed in a couple of days by a runny nose and cough.  Symptoms may begin within sixteen hours of exposure and typically peak two to four days after onset.  They usually resolve in seven to ten days, but some can last for up to three weeks.  The average duration of cough is eighteen days and in some cases people develop a post-viral cough which can linger after the infection is gone.  In children, the cough lasts for more than ten days in 35–40% of cases and continues for more than 25 days in 10%. The common cold is an infection of the upper respiratory tract which can be caused by many different viruses.  The most commonly implicated is a rhinovirus , a type of picornavirus with 99 known serotypes Common cold Common cold",
        "response": "Just make sure to stay hydrated and get plenty of rest. Avoid contact with others to prevent spreading the virus."
    },
    {
        "dialog": [
            "Hi Medi, I have a question about the common cold.",
            "Of course! What would you like to know?",
            "What causes the common cold?",
            "The common cold is an infection of the upper respiratory tract which can be caused by many different viruses. The most commonly implicated is a rhinovirus.",
            "How can I prevent getting a cold?",
            "Wash your hands frequently, avoid close contact with others who have a cold, and avoid touching your face.",
            "Is there a cure for the common cold?",
            "No, there is no cure for the common cold. Treatment is usually focused on relieving symptoms.",
            "Okay, thanks for your help. One more thing - how long is someone contagious with a cold?"
        ],
        "knowledge": "Common cold Common cold A cold usually begins with fatigue, a feeling of being chilled, sneezing, and a headache, followed in a couple of days by a runny nose and cough.  Symptoms may begin within sixteen hours of exposure and typically peak two to four days after onset.  They usually resolve in seven to ten days, but some can last for up to three weeks.  The average duration of cough is eighteen days and in some cases people develop a post-viral cough which can linger after the infection is gone.  In children, the cough lasts for more than ten days in 35–40% of cases and continues for more than 25 days in 10%. The common cold is an infection of the upper respiratory tract which can be caused by many different viruses.  The most commonly implicated is a rhinovirus , a type of picornavirus with 99 known serotypes Common cold Common cold",
        "response": "A person with a cold is usually contagious for the first 2-3 days after the onset of symptoms. It's important to take precautions to avoid spreading the virus to others during this time."
    },
    {
        "dialog": [
            "Hi Medi, I recently had a cold and was wondering if there's anything I can do to prevent getting sick again.",
            "Absolutely. Staying healthy overall is your best defense against getting sick. Make sure to practice good hygiene, such as washing your hands frequently and avoiding touching your face.",
            "Are there any foods I should be eating or avoiding to help prevent illness?",
            "Eating a balanced diet rich in vitamins and minerals can help support your immune system. Avoiding processed foods and excess sugar can also be beneficial.",
            "What about physical activity? Can that help prevent illness?",
            "Yes, staying active can help support your immune system and overall health.",
            "Thanks for the advice, Medi. One last question - is it possible to get the same cold twice?",
            "It is possible to get the same cold twice, but it's not very common. Your immune system develops antibodies after you recover from a cold, which can help protect you from that specific virus in the future.",
            "That's good to know. Thanks for your help!"
        ],
        "knowledge": "Common cold Common cold A cold usually begins with fatigue, a feeling of being chilled, sneezing, and a headache, followed in a couple of days by a runny nose and cough.  Symptoms may begin within sixteen hours of exposure and typically peak two to four days after onset.  They usually resolve in seven to ten days, but some can last for up to three weeks.  The average duration of cough is eighteen days and in some cases people develop a post-viral cough which can linger after the infection is gone.  In children, the cough lasts for more than ten days in 35–40% of cases and continues for more than 25 days in 10%. The common cold is an infection of the upper respiratory tract which can be caused by many different viruses.  The most commonly implicated is a rhinovirus , a type of picornavirus with 99 known serotypes Common cold Common cold",
        "response": "You're welcome! Remember to take care of yourself and practice good hygiene to help prevent illness in the future."
    },
    {
        "dialog": [
            "Hi Medi, I have a runny nose and a cough.",
            "Hello! Can you tell me more about your symptoms?",
            "I have a headache and I'm feeling very tired.",
            "Based on your symptoms, it seems like you have a common cold.",
            "How can I treat it?",
            "You can try taking over-the-counter medication or get plenty of rest.",
            "Is it contagious?",
            "Yes, it is. It's spread through the air and by touching infected surfaces.",
            "Okay, thank you, Medi."
        ],
        "knowledge": "Common cold A cold usually begins with fatigue, a feeling of being chilled, sneezing, and a headache, followed in a couple of days by a runny nose and cough.  Symptoms may begin within sixteen hours of exposure and typically peak two to four days after onset.  They usually resolve in seven to ten days, but some can last for up to three weeks.  The average duration of cough is eighteen days and in some cases people develop a post-viral cough which can linger after the infection is gone.  In children, the cough lasts for more than ten days in 35–40% of cases and continues for more than 25 days in 10%. The common cold is an infection of the upper respiratory tract which can be caused by many different viruses.  The most commonly implicated is a rhinovirus , a type of picornavirus with 99 known serotypes Common cold Common cold",
        "response": "You're welcome. Is there anything else I can help you with?"
    },
    {
        "dialog": [
            "Hi Medi, I just recovered from a cold. What should I do now?",
            "Hello! I'm glad to hear that you're feeling better.",
            "Yes, I am. But I'm worried about getting sick again.",
            "There are several things you can do to prevent getting sick again.",
            "What are they?",
            "Wash your hands frequently, avoid touching your face, and stay away from people who are sick.",
            "What about my diet?",
            "Eating healthy foods and getting enough vitamins can help boost your immune system.",
            "Okay, thank you for the advice, Medi."
        ],
        "knowledge": "Common cold A cold usually begins with fatigue, a feeling of being chilled, sneezing, and a headache, followed in a couple of days by a runny nose and cough.  Symptoms may begin within sixteen hours of exposure and typically peak two to four days after onset.  They usually resolve in seven to ten days, but some can last for up to three weeks.  The average duration of cough is eighteen days and in some cases people develop a post-viral cough which can linger after the infection is gone.  In children, the cough lasts for more than ten days in 35–40% of cases and continues for more than 25 days in 10%. The common cold is an infection of the upper respiratory tract which can be caused by many different viruses.  The most commonly implicated is a rhinovirus , a type of picornavirus with 99 known serotypes Common cold Common cold",
        "response": "You're welcome. Is there anything else I can help you with?"
    },
    {
        "dialog": [
            "Hi Medi, I just recovered from a cold. What should I do now?",
            "Hello! I'm glad to hear that you're feeling better.",
            "But I still feel weak and tired. What can I do about it?",
            "Getting enough rest and staying hydrated can help you feel better.",
            "What about exercise?",
            "You can start by taking short walks and gradually increase your activity level.",
            "What about my diet?",
            "Eating a balanced diet with plenty of fruits and vegetables can help improve your energy levels.",
            "Okay, thank you for the advice, Medi."
        ],
        "knowledge": "Common cold A cold usually begins with fatigue, a feeling of being chilled, sneezing, and a headache, followed in a couple of days by a runny nose and cough.  Symptoms may begin within sixteen hours of exposure and typically peak two to four days after onset.  They usually resolve in seven to ten days, but some can last for up to three weeks.  The average duration of cough is eighteen days and in some cases people develop a post-viral cough which can linger after the infection is gone.  In children, the cough lasts for more than ten days in 35–40% of cases and continues for more than 25 days in 10%. The common cold is an infection of the upper respiratory tract which can be caused by many different viruses.  The most commonly implicated is a rhinovirus , a type of picornavirus with 99 known serotypes Common cold Common cold",
        "response": "You're welcome. Is there anything else I can help you with?"
    }
]