[
    {
        "dialog": [
            "Hello Medi, I feel like I might have the flu.",
            "I'm sorry to hear that. What are your symptoms?",
            "I have a fever, chills, body aches, and a cough.",
            "Based on those symptoms, it's likely that you have the flu.",
            "What should I do to feel better?",
            "Rest, stay hydrated, and take over-the-counter pain relievers. If your symptoms get worse or you have trouble breathing, seek medical attention.",
            "Okay, thank you for the advice.",
            "You're welcome. Take care of yourself.",
            "Is there any medicine I can take to help with the flu?"
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "There are antiviral medications that can help with the flu, but they are most effective when taken within the first 48 hours of symptoms. You should talk to your doctor about whether they are appropriate for you."
    },
    {
        "dialog": [
            "Hey Medi, can you tell me more about the flu pandemic in Hong Kong?",
            "Sure, in 1968, a novel strain of the flu called H3N2 emerged in Hong Kong and spread worldwide.",
            "How many deaths did it cause?",
            "It's estimated that it caused 500,000 to 2 million deaths.",
            "Wow, that's a lot. Was it the first pandemic to spread by air travel?",
            "Yes, it was the first pandemic to spread significantly by air travel.",
            "That's very interesting. Thanks for the information.",
            "You're welcome. Is there anything else you'd like to know?",
            "No, that's all for now. Thanks again!"
        ],
        "knowledge": "Influenza Influenza  The novel H3N2 strain emerged in Hong Kong and spread worldwide, causing the Hong Kong flu pandemic, which resulted in 500,000–2,000,000 deaths.  This was the first pandemic to spread significantly by air travel.  H2N2 and H3N2 co-circulated after the pandemic until 1971 when H2N2 waned in prevalence and was completely replaced by H3N2.  In 1977, H1N1 reemerged in humans, possibly after it was released from a freezer in a laboratory accident, and caused a pseudo-pandemic.  Whether the 1977 \"pandemic\" deserves to be included in the natural history of flu pandemics is debatable.  This H1N1 strain was antigenically similar to the H1N1 strains that circulated prior to 1957.  Since 1977, both H1N1 and H3N2 have circulated in humans as part of seasonal influenza Influenza Influenza",
        "response": ""
    },
    {
        "dialog": [
            "Hi Medi, I just recovered from the flu. What should I do to prevent getting sick again?",
            "Congratulations on recovering! One thing you can do is get a flu shot.",
            "What's a flu shot?",
            "It's a vaccine that helps protect against the flu.",
            "How does it work?",
            "It works by causing your body to develop antibodies to the flu virus, so that if you are exposed to the virus in the future, your body will be better able to fight it off.",
            "That sounds like a good idea. When should I get the shot?",
            "The best time to get the flu shot is in the fall before flu season starts, but you can get it anytime during flu season.",
            "Okay, I'll make sure to get the shot. Thanks for the advice!"
        ],
        "knowledge": "Influenza Influenza  The flu shot is a vaccine that helps protect against the flu. It works by causing your body to develop antibodies to the flu virus, so that if you are exposed to the virus in the future, your body will be better able to fight it off. The best time to get the flu shot is in the fall before flu season starts, but you can get it anytime during flu season Influenza Influenza",
        "response": ""
    },
    {
        "dialog": [
            "Hi Medi, I have been experiencing a sore throat and difficulty in breathing.",
            "I am sorry to hear that. Have you checked your body temperature?",
            "Yes, I have. My temperature is 37.5 degrees Celsius.",
            "Okay, based on your symptoms, it is possible that you have contracted the flu.",
            "What should I do to alleviate my condition?",
            "Take plenty of rest, drink lots of fluids, and take over-the-counter medications like acetaminophen for fever and body aches.",
            "Thank you for your advice. Is there a vaccine for the flu?",
            "Yes, there is. It is recommended that you get the flu vaccine every year to prevent the illness.",
            "Okay, I will do that. Thank you, Medi!"
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "You're welcome. Take care of yourself and stay hydrated. Contact your doctor if symptoms persist."
    },
    {
        "dialog": [
            "Hello Medi, I am curious about the prevalence of the flu worldwide.",
            "Hi, the flu is a common infectious disease that affects millions of people worldwide each year.",
            "Has there been any pandemic due to the flu?",
            "Yes, there have been several flu pandemics in history, with the most recent being the H1N1 pandemic in 2009.",
            "How did that pandemic occur?",
            "The H1N1 pandemic occurred when a new strain of the flu virus emerged and spread rapidly around the world.",
            "Is there any way to prevent the outbreak of such pandemics?",
            "There are measures we can take to reduce the risk of flu pandemics, such as monitoring animal populations for new flu strains and developing effective vaccines.",
            "Thank you for the information, Medi."
        ],
        "knowledge": "Influenza Influenza  The novel H3N2 strain emerged in Hong Kong and spread worldwide, causing the Hong Kong flu pandemic, which resulted in 500,000–2,000,000 deaths.  This was the first pandemic to spread significantly by air travel.  H2N2 and H3N2 co-circulated after the pandemic until 1971 when H2N2 waned in prevalence and was completely replaced by H3N2.  In 1977, H1N1 reemerged in humans, possibly after it was released from a freezer in a laboratory accident, and caused a pseudo-pandemic.  Whether the 1977 'pandemic' deserves to be included in the natural history of flu pandemics is debatable.  This H1N1 strain was antigenically similar to the H1N1 strains that circulated prior to 1957.  Since 1977, both H1N1 and H3N2 have circulated in humans as part of seasonal influenza Influenza Influenza",
        "response": "You're welcome. If you have any more questions, feel free to ask."
    },
    {
        "dialog": [
            "Hi Medi, I recently had the flu and am feeling better now. Do you have any tips to help me recover faster?",
            "Hi, I'm glad to hear you're feeling better. After having the flu, it's important to get plenty of rest and stay hydrated.",
            "Is there a recommended diet or certain foods I should eat?",
            "Yes, you should try to eat nutrient-dense foods like fruits and vegetables, and avoid foods that are high in sugar and processed ingredients.",
            "What about physical activity? Should I exercise?",
            "It's best to take it easy for a few days after recovering from the flu and gradually increase your physical activity as you feel more energized.",
            "I see. Thank you for your advice, Medi.",
            "You're welcome. It's important to take care of yourself and allow your body to fully recover from the flu.",
            "Thanks, Medi. Goodbye."
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "You're welcome. Take care and stay healthy."
    },
    {
        "dialog": [
            "Hi Medi, I am feeling unwell and I think I might have the flu.",
            "Hello! I can help you with that. What are your symptoms?",
            "I have a fever, headache, and I feel very fatigued.",
            "Based on your symptoms, it's possible you have the flu. You should rest and drink plenty of fluids.",
            "Is there anything else I can do to feel better?",
            "You can also take over-the-counter pain relievers and fever reducers like ibuprofen or acetaminophen.",
            "How long will it take for me to recover?",
            "It usually takes about a week for the flu to run its course. If your symptoms persist or worsen, please contact your healthcare provider.",
            "Thank you, Medi."
        ],
        "knowledge": "Influenza Influenza The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion. These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose. Coughing is the most common symptom. Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children. The standard influenza symptoms typically last for 2 - 8 days. A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "Rest and drink plenty of fluids. You can also take over-the-counter pain relievers and fever reducers like ibuprofen or acetaminophen."
    },
    {
        "dialog": [
            "Hi Medi, I have a few questions about the flu.",
            "Of course, what would you like to know?",
            "What is the difference between the flu and a cold?",
            "Both the flu and the common cold are respiratory illnesses caused by different viruses. However, the symptoms of the flu are usually more severe than those of the common cold.",
            "What are the best ways to prevent the flu?",
            "The best way to prevent the flu is to get an annual flu vaccine. You should also practice good hygiene, like washing your hands regularly and avoiding close contact with sick people.",
            "Can the flu cause serious complications?",
            "Yes, the flu can sometimes cause serious complications, like pneumonia or dehydration. It's important to take care of yourself and seek medical attention if your symptoms worsen.",
            "Thank you, Medi. That's very helpful."
        ],
        "knowledge": "Influenza Influenza The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion. These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose. Coughing is the most common symptom. Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children. The standard influenza symptoms typically last for 2 - 8 days. A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "Getting an annual flu vaccine is the best way to prevent the flu. You should also practice good hygiene, like washing your hands regularly and avoiding close contact with sick people."
    },
    {
        "dialog": [
            "Hi Medi, I recently recovered from the flu. What can I do to prevent getting it again?",
            "I'm glad to hear you've recovered. To avoid getting the flu again, you should continue to practice good hygiene and take care of your immune system.",
            "What are some things I can do to take care of my immune system?",
            "Eating a healthy diet, staying hydrated, getting enough sleep, and reducing stress can all help support your immune system.",
            "What about getting an annual flu vaccine?",
            "Yes, getting an annual flu vaccine is also a great way to prevent getting the flu again.",
            "Are there any other steps I can take to protect myself from the flu?",
            "Yes, you can also avoid close contact with people who are sick and stay home if you're feeling unwell.",
            "Thank you, Medi. Those are all great suggestions."
        ],
        "knowledge": "Influenza Influenza The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion. These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose. Coughing is the most common symptom. Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children. The standard influenza symptoms typically last for 2 - 8 days. A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "Eating a healthy diet, staying hydrated, getting enough sleep, reducing stress, and getting an annual flu vaccine are all great ways to protect yourself from the flu."
    },
    {
        "dialog": [
            "Hello Medi, I have a fever and cough, what's going on with me?",
            "Based on your symptoms, it's possible you have the flu. ",
            "What should I do, Medi?",
            "You should rest and drink plenty of fluids. I recommend you see a doctor as well.",
            "Will I be okay?",
            "Most people recover from the flu within a week or two. But it's important to take care of yourself.",
            "Do you have any advice on how I can prevent getting the flu in the future?",
            "Yes, getting a flu shot every year is the best way to prevent getting the flu. Also, you can wash your hands often and avoid close contact with people who are sick.",
            "Thanks, Medi. I'll be sure to do that."
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "You're welcome. I hope you feel better soon."
    },
    {
        "dialog": [
            "Hi Medi, I'm curious about the Hong Kong flu pandemic. Can you tell me more about it?",
            "The Hong Kong flu pandemic was caused by the H3N2 strain of the influenza virus and it resulted in 500,000 to 2,000,000 deaths worldwide.",
            "Wow, that's a lot of people. How did it spread so quickly?",
            "It was the first pandemic to spread significantly by air travel.",
            "I see. What other strains of the influenza virus were around during that time?",
            "At that time, H2N2 and H3N2 co-circulated after the pandemic until 1971 when H2N2 waned in prevalence and was completely replaced by H3N2.",
            "What about the H1N1 strain?",
            "In 1977, H1N1 reemerged in humans, possibly after it was released from a freezer in a laboratory accident, and caused a pseudo-pandemic. Whether the 1977 'pandemic' deserves to be included in the natural history of flu pandemics is debatable. This H1N1 strain was antigenically similar to the H1N1 strains that circulated prior to 1957. Since 1977, both H1N1 and H3N2 have circulated in humans as part of seasonal influenza.",
            "That's really interesting. Thank you for explaining all of that to me, Medi."
        ],
        "knowledge": "Influenza Influenza  The novel H3N2 strain emerged in Hong Kong and spread worldwide, causing the Hong Kong flu pandemic, which resulted in 500,000–2,000,000 deaths.  This was the first pandemic to spread significantly by air travel.  H2N2 and H3N2 co-circulated after the pandemic until 1971 when H2N2 waned in prevalence and was completely replaced by H3N2.  In 1977, H1N1 reemerged in humans, possibly after it was released from a freezer in a laboratory accident, and caused a pseudo-pandemic.  Whether the 1977 'pandemic' deserves to be included in the natural history of flu pandemics is debatable.  This H1N1 strain was antigenically similar to the H1N1 strains that circulated prior to 1957.  Since 1977, both H1N1 and H3N2 have circulated in humans as part of seasonal influenza Influenza Influenza",
        "response": "No, that's all for now. Thank you, Medi."
    },
    {
        "dialog": [
            "Hi Medi, I recently had a flu shot, but I'm still worried about getting the flu. What can I do to boost my immune system?",
            "Getting enough sleep, eating a healthy diet, exercising regularly, and reducing stress are all great ways to boost your immune system.",
            "What kinds of foods should I eat?",
            "Foods rich in vitamins and minerals, such as fruits, vegetables, lean protein, and whole grains, are great for your immune system.",
            "What about supplements? Should I take those?",
            "While some supplements can be beneficial, it's always best to get your nutrients from whole foods whenever possible.",
            "Okay, that makes sense. Thank you for your advice, Medi.",
            "You're welcome. Do you have any other questions?",
            "No, that's all for now. Thank you again, Medi."
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "You're welcome. Stay healthy!"
    },
    {
        "dialog": [
            "Hello Medi, I have been feeling unwell for a few days.",
            "Hi, can you tell me about your symptoms?",
            "I have a fever, headache, cough, and my throat is really sore.",
            "It sounds like you might have the flu. You should rest and drink plenty of fluids.",
            "What else can I do to make myself feel better?",
            "You can take over-the-counter pain relievers and cough medicine to ease your symptoms.",
            "Okay, thank you for your advice, Medi.",
            "You're welcome. Take care of yourself."
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion. These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose. Coughing is the most common symptom. Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children. The standard influenza symptoms typically last for 2 - 8 days. A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "You may have the flu based on your symptoms. You should rest and drink plenty of fluids."
    },
    {
        "dialog": [
            "Hello Medi, I have some questions about the flu.",
            "Sure, what would you like to know?",
            "What causes the flu?",
            "The flu is caused by the influenza virus.",
            "How is the flu spread?",
            "The flu is spread through the air when people cough or sneeze, or by touching a surface contaminated with the virus and then touching your nose, mouth, or eyes.",
            "Is there a way to prevent the flu?",
            "Yes, getting a flu vaccine every year can help prevent the flu, as well as washing your hands often and avoiding close contact with people who are sick.",
            "Thank you for the information, Medi."
        ],
        "knowledge": "Influenza Influenza  The novel H3N2 strain emerged in Hong Kong and spread worldwide, causing the Hong Kong flu pandemic, which resulted in 500,000–2,000,000 deaths. This was the first pandemic to spread significantly by air travel. H2N2 and H3N2 co-circulated after the pandemic until 1971 when H2N2 waned in prevalence and was completely replaced by H3N2. In 1977, H1N1 reemerged in humans, possibly after it was released from a freezer in a laboratory accident, and caused a pseudo-pandemic. Whether the 1977 \"pandemic\" deserves to be included in the natural history of flu pandemics is debatable. This H1N1 strain was antigenically similar to the H1N1 strains that circulated prior to 1957. Since 1977, both H1N1 and H3N2 have circulated in humans as part of seasonal influenza Influenza Influenza",
        "response": "The flu is caused by the influenza virus and can be spread through the air or by touching contaminated surfaces. Getting a flu vaccine and practicing good hygiene can help prevent the flu."
    },
    {
        "dialog": [
            "Hello Medi, I recently had the flu and now I want to make sure I'm taking care of myself properly.",
            "Of course, what do you need advice on?",
            "I want to know what I should be eating to make sure I'm getting all the necessary nutrients.",
            "Focus on eating foods that are rich in vitamins and minerals, such as fruits, vegetables, whole grains, and lean protein. Also, make sure you're staying hydrated and drinking plenty of fluids.",
            "Is there anything specific I should avoid?",
            "You should avoid sugary and processed foods, as well as alcohol and caffeine, which can dehydrate you.",
            "What about exercise?",
            "It's important to listen to your body and not push yourself too hard while you're still recovering. But gentle exercise, such as walking or yoga, can help improve your mood and energy levels.",
            "Thanks for the advice, Medi."
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion. These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose. Coughing is the most common symptom. Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children. The standard influenza symptoms typically last for 2 - 8 days. A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "To make sure you're getting the necessary nutrients, focus on eating fruits, vegetables, whole grains, and lean protein. Avoid sugary and processed foods, as well as alcohol and caffeine. Gentle exercise can also help improve your mood and energy levels."
    },
    {
        "dialog": [
            "Hi Medi, I'm feeling unwell. I have a cough and a fever.",
            "Hi there, sorry to hear that! How long have you had these symptoms?",
            "Just for the last couple of days.",
            "Okay, based on those symptoms, you may have the flu. Can you tell me more?",
            "I've also been feeling tired and achy all over.",
            "Those symptoms are common with the flu. You should rest and drink plenty of fluids.",
            "Is there anything else I can do to feel better?",
            "Over-the-counter medication can help relieve symptoms. If you're still feeling unwell, see a doctor.",
            "Thanks, Medi. How long does the flu usually last?"
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "The flu usually lasts for 2-8 days, but it can take longer for some people to fully recover."
    },
    {
        "dialog": [
            "Hi Medi, I've been hearing a lot about the flu pandemic. What is it exactly?",
            "Hi there, the flu pandemic is a global outbreak of a new strain of influenza virus.",
            "When did this happen?",
            "The first flu pandemic was the Hong Kong flu in 1968, which caused 500,000-2,000,000 deaths worldwide.",
            "How did it spread so quickly?",
            "It was the first pandemic to spread significantly by air travel. There have been several flu pandemics since.",
            "Is there anything I can do to protect myself from the flu?",
            "Yes, get vaccinated and practice good hygiene such as washing your hands frequently.",
            "Thanks for the information, Medi. Is the flu pandemic a common occurrence?"
        ],
        "knowledge": "Influenza Influenza  The novel H3N2 strain emerged in Hong Kong and spread worldwide, causing the Hong Kong flu pandemic, which resulted in 500,000–2,000,000 deaths.  This was the first pandemic to spread significantly by air travel.  H2N2 and H3N2 co-circulated after the pandemic until 1971 when H2N2 waned in prevalence and was completely replaced by H3N2.  In 1977, H1N1 reemerged in humans, possibly after it was released from a freezer in a laboratory accident, and caused a pseudo-pandemic.  Whether the 1977 'pandemic' deserves to be included in the natural history of flu pandemics is debatable.  This H1N1 strain was antigenically similar to the H1N1 strains that circulated prior to 1957.  Since 1977, both H1N1 and H3N2 have circulated in humans as part of seasonal influenza Influenza Influenza",
        "response": "Flu pandemics have occurred several times throughout history, but they are not a common occurrence."
    },
    {
        "dialog": [
            "Hi Medi, I recently had surgery and I'm not sure what kind of exercise I can do.",
            "Hi there, it's important to ease back into physical activity after surgery. What kind of surgery did you have?",
            "I had a knee replacement.",
            "You should avoid high-impact exercises for a while. Low-impact exercises like swimming or cycling can be good.",
            "What about strength training?",
            "Yes, strength training can be beneficial for your recovery. Start with light weights and gradually increase the intensity.",
            "Are there any exercises I should avoid completely?",
            "Avoid any exercise that puts too much strain on your knee, like running or jumping.",
            "Thanks for the advice, Medi. How long should I wait before starting to exercise?"
        ],
        "knowledge": "Surgery Surgery  After surgery, it's important to ease back into physical activity. Low-impact exercises like swimming or cycling can be good. Strength training can be beneficial for recovery, but start with light weights and gradually increase the intensity. Avoid any exercise that puts too much strain on the affected area. The length of time to wait before starting exercise varies depending on the type of surgery and your doctor's recommendations Surgery Surgery",
        "response": "The length of time to wait before starting exercise varies depending on the type of surgery and your doctor's recommendations. It's important to follow your doctor's advice."
    },
    {
        "dialog": [
            "Hello Medi, I have some symptoms that bother me.",
            "Sure, tell me about your symptoms and I can help you.",
            "I have been feeling fatigued and have a cough and a fever.",
            "I see, based on your symptoms it could be the flu.",
            "How can I treat it?",
            "Rest and drink plenty of fluids. You can also take over-the-counter medication for fever and cough relief.",
            "What can I do to prevent it?",
            "Wash your hands frequently and get vaccinated every year.",
            "Okay, thank you for your help Medi. "
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "You're welcome. Do you want to know more about the flu?"
    },
    {
        "dialog": [
            "Hello Medi, I have a question about influenza.",
            "Of course, I'm here to help. What would you like to know?",
            "How does the flu spread?",
            "The flu spreads through droplets when an infected person coughs or sneezes, or through contact with a contaminated surface.",
            "Is there a vaccine for the flu?",
            "Yes, there is a flu vaccine that is recommended to be taken every year to prevent the flu.",
            "Can the flu be dangerous?",
            "Yes, for certain groups such as young children, elderly, pregnant women, and those with existing health conditions, the flu can be serious and even life-threatening.",
            "Thank you for answering my questions, Medi."
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "You're welcome. Anything else you would like to know about the flu?"
    },
    {
        "dialog": [
            "Hello Medi, I just had the flu and I am wondering what I can do to prevent getting sick again.",
            "I'm sorry you had the flu. One of the best things you can do to prevent getting sick again is to get vaccinated every year.",
            "Is there anything else I can do to prevent getting sick?",
            "Yes, washing your hands frequently, avoiding close contact with sick people, and avoiding touching your face can also help prevent illness.",
            "What should I do if I do get sick?",
            "Rest and drink plenty of fluids. You can also take over-the-counter medication for fever and cough relief. Make sure to stay home and avoid spreading the illness to others.",
            "Thank you, Medi. I will try to take all the necessary precautions to avoid getting sick again.",
            "You're welcome. Take care."
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "You're welcome. I hope you stay healthy and avoid getting sick again."
    },
    {
        "dialog": [
            "Hello Medi, I think I have a fever.",
            "Sure, can you tell me about the severity of your fever?",
            "I have a temperature of 101℉, and feel tired and weak.",
            "Okay, you may have a viral infection. Please stay hydrated and take rest.",
            "What medication should I take?",
            "You can take acetaminophen or ibuprofen to reduce fever and pain.",
            "What if my fever doesn't go down?",
            "If your fever lasts for more than three days, please see a doctor.",
            "Thank you, Medi. Can you tell me more about viral infections?"
        ],
        "knowledge": "Viral Infections Viral infections are caused by a diverse range of viruses and can affect any organ system in the body.  Common symptoms include fever, cough, sore throat, and congestion.  Treatment is largely supportive and aimed at decreasing symptoms and improving overall well-being, but antiviral medications may be used in some cases.  Common viral infections include the common cold, influenza, and COVID-19.  Good hygiene and vaccination are important in preventing the spread of viral infections. Viral Infections Viral Infections",
        "response": "Viral infections can cause a range of symptoms and can affect any organ system in the body. Treatment is largely supportive and aimed at decreasing symptoms and improving overall well-being, but antiviral medications may be used in some cases. Good hygiene and vaccination are important in preventing the spread of viral infections."
    },
    {
        "dialog": [
            "Hi Medi, I'm curious about the history of influenza.",
            "Influenza has a long history. It caused pandemics in the past.",
            "How many people were affected by influenza pandemics?",
            "The most severe pandemic was the Spanish flu, which affected up to a third of the world's population and caused millions of deaths.",
            "What caused the pandemics?",
            "The pandemics were caused by the spread of new strains of the virus that people did not have immunity to.",
            "How did people respond to the pandemics?",
            "In response to pandemics, public health measures such as quarantine and vaccination campaigns were implemented.",
            "That's really interesting. Thanks, Medi."
        ],
        "knowledge": "Influenza Influenza The novel H3N2 strain emerged in Hong Kong and spread worldwide, causing the Hong Kong flu pandemic, which resulted in 500,000–2,000,000 deaths.  This was the first pandemic to spread significantly by air travel.  H2N2 and H3N2 co-circulated after the pandemic until 1971 when H2N2 waned in prevalence and was completely replaced by H3N2.  In 1977, H1N1 reemerged in humans, possibly after it was released from a freezer in a laboratory accident, and caused a pseudo-pandemic.  Whether the 1977 'pandemic' deserves to be included in the natural history of flu pandemics is debatable.  This H1N1 strain was antigenically similar to the H1N1 strains that circulated prior to 1957.  Since 1977, both H1N1 and H3N2 have circulated in humans as part of seasonal influenza Influenza Influenza",
        "response": "Influenza has a long history and caused pandemics in the past. The most severe pandemic was the Spanish flu, which affected up to a third of the world's population and caused millions of deaths. The pandemics were caused by the spread of new strains of the virus that people did not have immunity to. In response to pandemics, public health measures such as quarantine and vaccination campaigns were implemented."
    },
    {
        "dialog": [
            "Hello Medi, I recently had a flu shot and I want to know how I can prevent getting the flu.",
            "You can take steps to prevent getting the flu, such as washing your hands frequently and avoiding close contact with people who are sick.",
            "What else can I do?",
            "You should also get plenty of rest, exercise regularly, and eat a healthy diet.",
            "Are there any natural remedies to help prevent the flu?",
            "Some natural remedies that may help prevent the flu include drinking green tea, taking echinacea supplements, and using essential oils like eucalyptus and tea tree oil.",
            "Can you tell me more about echinacea supplements?",
            "Echinacea supplements are made from the roots and leaves of the echinacea plant. They are commonly used to boost the immune system and prevent colds and the flu.",
            "Thank you for the information, Medi. What are some foods that can boost my immune system?"
        ],
        "knowledge": "Influenza Influenza The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "Some foods that can help boost your immune system include citrus fruits, red bell peppers, broccoli, garlic, ginger, spinach, yogurt, almonds, and turmeric."
    },
    {
        "dialog": [
            "Hi Medi, I have fever and cough, what should I do?",
            "Based on your symptoms, it might be flu, rest and drink plenty of fluids",
            "Do I need to see a doctor or take some medication?",
            "You can take antiviral medications, and if your symptoms persist for more than a week, you should see a doctor",
            "I will do that, thank you Medi",
            "You're welcome, take care of yourself",
            "One more question, how can I prevent the flu?",
            "Get vaccinated annually, wash your hands frequently, and avoid close contact with sick people",
            "Thanks a lot for your advice, Medi"
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "You can prevent the flu by getting vaccinated annually, washing your hands frequently, and avoiding close contact with sick people"
    },
    {
        "dialog": [
            "Hi Medi, I heard about the flu pandemic in Hong Kong, what was that?",
            "It was in 1968 when the novel H3N2 strain emerged in Hong Kong and spread worldwide causing the Hong Kong flu pandemic",
            "Wow, that sounds serious. Did many people die?",
            "Yes, it resulted in 500,000-2,000,000 deaths and was the first pandemic to spread significantly by air travel",
            "That's really scary. Are there any other types of flu?",
            "Since 1977, both H1N1 and H3N2 have circulated in humans as part of seasonal influenza",
            "So what is the difference between pandemic flu and seasonal flu?",
            "Pandemic flu is a new strain to which most people have no immunity while seasonal flu is a weaker strain that comes every year",
            "I see, thanks for the explanation Medi"
        ],
        "knowledge": "Influenza Influenza  The novel H3N2 strain emerged in Hong Kong and spread worldwide, causing the Hong Kong flu pandemic, which resulted in 500,000-2,000,000 deaths.  This was the first pandemic to spread significantly by air travel.  H2N2 and H3N2 co-circulated after the pandemic until 1971 when H2N2 waned in prevalence and was completely replaced by H3N2.  In 1977, H1N1 reemerged in humans, possibly after it was released from a freezer in a laboratory accident, and caused a pseudo-pandemic.  Whether the 1977 \"pandemic\" deserves to be included in the natural history of flu pandemics is debatable.  This H1N1 strain was antigenically similar to the H1N1 strains that circulated prior to 1957.  Since 1977, both H1N1 and H3N2 have circulated in humans as part of seasonal influenza Influenza Influenza",
        "response": "You're welcome. Pandemic flu is a new strain to which most people have no immunity while seasonal flu is a weaker strain that comes every year"
    },
    {
        "dialog": [
            "Hi Medi, I just had a flu vaccine, what should I do next?",
            "You should rest and avoid any strenuous activity",
            "Are there any side effects that I should be aware of?",
            "Common side effects include soreness, redness, or swelling at the injection site, fever, and body aches",
            "How long do these side effects last?",
            "Usually, they go away on their own within a few days",
            "Thanks for the information, Medi",
            "You're welcome. Is there anything else you want to ask?",
            "Yes, what should I do if I feel sick after vaccination?"
        ],
        "knowledge": "Influenza vaccine Influenza vaccine  The influenza vaccine is a vaccine that is made from inactivated or weakened influenza virus.  It can be produced as a trivalent or a quadrivalent vaccine that contains three or four different influenza virus strains.  The vaccine is administered annually and provides protection against influenza viruses for about six months.  The vaccine is recommended for people who are at high risk of developing serious complications from influenza, such as the elderly, pregnant women, and people with chronic medical conditions.  The vaccine is generally safe, but some people may experience mild side effects, such as soreness at the injection site or a low-grade fever Influenza vaccine Influenza vaccine",
        "response": "You're welcome. If you feel sick after vaccination, you should contact your doctor if you experience severe symptoms or if they persist for more than a few days"
    }
]