[
    {
        "dialog": [
            "Hi Medi, I have symptoms like fever and sneezing. Can you help me?",
            "Hi there, I'd love to help. Tell me more about your symptoms.",
            "I am feeling feverish and my nose is stuffed, and I have a headache.",
            "It sounds like you have a cold, you should take rest and drink plenty of fluids",
            "Should I take any medication? Can you suggest anything?",
            "You can take over-the-counter pain relievers and decongestants to relieve your symptoms",
            "Thanks, Medi. Will these symptoms last long?",
            "Usually, it lasts for a week. If your symptoms worsen, you should visit a doctor",
            "Okay, thank you for the advice!"
        ],
        "knowledge": "Common cold Common cold The economic impact of the common cold is not well understood in much of the world.  In the United States, the common cold leads to 75–100 million physician visits annually at a conservative cost estimate of $7. 7 billion per year.  Americans spend $2. 9 billion on over-the-counter drugs and another $400 million on prescription medicines for symptom relief.  More than one-third of people who saw a doctor received an antibiotic prescription, which has implications for antibiotic resistance.  An estimated 22–189 million school days are missed annually due to a cold Common cold Common cold",
        "response": "You're welcome. If you feel worse, visiting a doctor is recommended."
    },
    {
        "dialog": [
            "Hi Medi, I have a question about the common cold.",
            "Sure, I'd love to help. What do you want to know?",
            "What causes the common cold, and how can I prevent it?",
            "The common cold is usually caused by a viral infection. Prevention methods include washing your hands frequently, avoiding close contact with sick people, and not touching your face.",
            "What should I do if I get the common cold?",
            "You should rest and drink plenty of fluids to help your body fight the virus. You can also take over-the-counter medication to relieve your symptoms.",
            "Thanks, Medi. Is it true that antibiotics can cure the common cold?",
            "No, antibiotics don't work against viruses, which cause the common cold. Antibiotics only work against bacterial infections.",
            "Okay, thank you for the explanation!"
        ],
        "knowledge": "Common cold Common cold The economic impact of the common cold is not well understood in much of the world.  In the United States, the common cold leads to 75–100 million physician visits annually at a conservative cost estimate of $7. 7 billion per year.  Americans spend $2. 9 billion on over-the-counter drugs and another $400 million on prescription medicines for symptom relief.  More than one-third of people who saw a doctor received an antibiotic prescription, which has implications for antibiotic resistance.  An estimated 22–189 million school days are missed annually due to a cold Common cold Common cold",
        "response": "You're welcome. Let me know if you have any more questions."
    },
    {
        "dialog": [
            "Hi Medi, I just had a cold and I am feeling better now.",
            "That's great to hear! How can I help you?",
            "Can you give me some advice on how to prevent getting another cold?",
            "Sure, you can try to avoid close contact with sick people, wash your hands frequently, and avoid touching your face. A healthy lifestyle, including good nutrition and plenty of rest, can also help boost your immune system.",
            "That's helpful. Is there any diet that can help me to strengthen my immune system?",
            "Yes, a diet rich in fruits, vegetables, and whole grains can help. You can also include foods like yogurt, garlic, and leafy greens in your diet.",
            "Thanks, Medi. Do you have any tips on exercises that can help me?",
            "Doing moderate exercise like walking, running, or swimming for at least 30 minutes a day can help improve your immune system.",
            "Thank you, Medi, for your advice!"
        ],
        "knowledge": "Common cold Common cold The economic impact of the common cold is not well understood in much of the world.  In the United States, the common cold leads to 75–100 million physician visits annually at a conservative cost estimate of $7. 7 billion per year.  Americans spend $2. 9 billion on over-the-counter drugs and another $400 million on prescription medicines for symptom relief.  More than one-third of people who saw a doctor received an antibiotic prescription, which has implications for antibiotic resistance.  An estimated 22–189 million school days are missed annually due to a cold Common cold Common cold",
        "response": "You're welcome. Stay healthy and let me know if you have any more questions."
    },
    {
        "dialog": [
            "Hi Medi, I have been coughing a lot lately.",
            "Hi, I'm here to help. Can you tell me more about your cough?",
            "It's a dry cough and I haven't been able to sleep for days.",
            "Have you had a fever or shortness of breath?",
            "No, I don't have a fever, but I do feel short of breath sometimes.",
            "Based on your symptoms, it seems like you have a common cold.",
            "What should I do to feel better?",
            "You can try to get rest, drink plenty of fluids and take over-the-counter cold medication.",
            "Thanks for the advice, Medi."
        ],
        "knowledge": "Common cold Common cold The economic impact of the common cold is not well understood in much of the world.  In the United States, the common cold leads to 75–100 million physician visits annually at a conservative cost estimate of $7. 7 billion per year.  Americans spend $2. 9 billion on over-the-counter drugs and another $400 million on prescription medicines for symptom relief.  More than one-third of people who saw a doctor received an antibiotic prescription, which has implications for antibiotic resistance.  An estimated 22–189 million school days are missed annually due to a cold Common cold Common cold",
        "response": "You're welcome! I hope you feel better soon."
    },
    {
        "dialog": [
            "Hello Medi, I have a question about the common cold.",
            "Of course, I'm here to help. What's your question?",
            "How long does the common cold usually last?",
            "The common cold usually lasts for about 7-10 days.",
            "What about the symptoms, are they the same for everyone?",
            "No, the symptoms can vary from person to person, but common symptoms include coughing, a runny nose, and sore throat.",
            "Is there anything I can do to prevent getting a cold?",
            "Washing your hands frequently and avoiding close contact with people who are sick can reduce your chances of getting a cold.",
            "Thanks for the information, Medi."
        ],
        "knowledge": "Common cold Common cold The economic impact of the common cold is not well understood in much of the world.  In the United States, the common cold leads to 75–100 million physician visits annually at a conservative cost estimate of $7. 7 billion per year.  Americans spend $2. 9 billion on over-the-counter drugs and another $400 million on prescription medicines for symptom relief.  More than one-third of people who saw a doctor received an antibiotic prescription, which has implications for antibiotic resistance.  An estimated 22–189 million school days are missed annually due to a cold Common cold Common cold",
        "response": "You're welcome! Let me know if you have any other questions."
    },
    {
        "dialog": [
            "Hi Medi, I just had a medical procedure done and I'm not sure what to do now.",
            "Hello there, as a chatbot medical supporter, I am here to help you. What kind of procedure did you have done?",
            "I had a colonoscopy done.",
            "After a colonoscopy, it's important to rest and avoid heavy lifting for at least 24 hours.",
            "What about my diet?",
            "For the first 24 hours after the procedure, you should stick to a clear liquid diet like broth or tea. Then you can gradually start eating regular foods.",
            "Is there anything else I should be aware of?",
            "You may experience some cramping or bloating after the procedure, but this should go away within a few hours.",
            "Thank you for your help, Medi."
        ],
        "knowledge": "Common cold Common cold The economic impact of the common cold is not well understood in much of the world.  In the United States, the common cold leads to 75–100 million physician visits annually at a conservative cost estimate of $7. 7 billion per year.  Americans spend $2. 9 billion on over-the-counter drugs and another $400 million on prescription medicines for symptom relief.  More than one-third of people who saw a doctor received an antibiotic prescription, which has implications for antibiotic resistance.  An estimated 22–189 million school days are missed annually due to a cold Common cold Common cold",
        "response": "You're welcome! I hope your recovery goes smoothly."
    },
    {
        "dialog": [
            "Hello Medi, I'm not feeling well. I have a cough, sneezing, and a sore throat.",
            "I'm sorry to hear that. Have you checked your temperature?",
            "Yes, it's 100.4 degrees Fahrenheit.",
            "Okay, it sounds like you have a common cold. You should rest, drink plenty of fluids, and take over-the-counter cold medicine.",
            "What about antibiotics?",
            "Antibiotics are not effective against viral infections like the common cold.",
            "Okay, thank you. How long will it take for me to feel better?",
            "It usually takes about a week for the symptoms to go away, but you should feel better each day.",
            "Thanks, Medi. One more question, is there any way to prevent getting a cold?"
        ],
        "knowledge": "Common cold Common cold The economic impact of the common cold is not well understood in much of the world.  In the United States, the common cold leads to 75–100 million physician visits annually at a conservative cost estimate of $7. 7 billion per year.  Americans spend $2. 9 billion on over-the-counter drugs and another $400 million on prescription medicines for symptom relief.  More than one-third of people who saw a doctor received an antibiotic prescription, which has implications for antibiotic resistance.  An estimated 22–189 million school days are missed annually due to a cold Common cold Common cold",
        "response": "You can prevent getting a cold by washing your hands frequently, avoiding close contact with people who have a cold, and getting enough sleep and exercise."
    },
    {
        "dialog": [
            "Hi Medi, I had a cold last week and it hasn't gone away. What should I do?",
            "I'm sorry to hear that. Are you still experiencing symptoms?",
            "Yes, I still have a cough and congestion.",
            "It's possible that you have a secondary infection like a sinus infection or bronchitis. You should see a doctor.",
            "Okay, I'll make an appointment. Is there anything I can do in the meantime?",
            "You can continue to rest, drink plenty of fluids, and take over-the-counter cold medicine. You can also use a humidifier to help with congestion.",
            "Thank you, Medi. One more question, how can I know if my cold is getting worse?",
            "If you develop a high fever, severe headache, chest pain, or difficulty breathing, you should seek medical attention immediately.",
            "Okay, I will. Thanks, Medi."
        ],
        "knowledge": "Common cold Common cold The economic impact of the common cold is not well understood in much of the world.  In the United States, the common cold leads to 75–100 million physician visits annually at a conservative cost estimate of $7. 7 billion per year.  Americans spend $2. 9 billion on over-the-counter drugs and another $400 million on prescription medicines for symptom relief.  More than one-third of people who saw a doctor received an antibiotic prescription, which has implications for antibiotic resistance.  An estimated 22–189 million school days are missed annually due to a cold Common cold Common cold",
        "response": "You should seek medical attention immediately if you develop a high fever, severe headache, chest pain, or difficulty breathing."
    },
    {
        "dialog": [
            "Hi Medi, I just recovered from a cold. What should I do to prevent getting sick again?",
            "I'm glad to hear you're feeling better. You should continue to practice good hygiene by washing your hands frequently and avoiding close contact with people who are sick.",
            "What about my diet? Is there anything I should eat or avoid?",
            "Eating a balanced diet with plenty of fruits and vegetables can help boost your immune system. You should also limit your intake of processed foods and sugary drinks.",
            "What kind of physical activity should I do to help prevent getting sick?",
            "Moderate exercise like walking or jogging can help boost your immune system. You should aim for at least 30 minutes of physical activity each day.",
            "Thanks, Medi. One last question, should I get a flu shot?",
            "Yes, getting a flu shot can help prevent you from getting the flu. You should talk to your doctor about getting vaccinated.",
            "Okay, thank you for your advice, Medi."
        ],
        "knowledge": "Common cold Common cold The economic impact of the common cold is not well understood in much of the world.  In the United States, the common cold leads to 75–100 million physician visits annually at a conservative cost estimate of $7. 7 billion per year.  Americans spend $2. 9 billion on over-the-counter drugs and another $400 million on prescription medicines for symptom relief.  More than one-third of people who saw a doctor received an antibiotic prescription, which has implications for antibiotic resistance.  An estimated 22–189 million school days are missed annually due to a cold Common cold Common cold",
        "response": "You should talk to your doctor about getting vaccinated for the flu to help prevent getting sick again."
    },
    {
        "dialog": [
            "Hi Medi, I feel like I'm coming down with something.",
            "Hi there! What are your symptoms?",
            "I have a runny nose, cough, and feel weak.",
            "Based on your symptoms, you may have a common cold.",
            "How can I treat it?",
            "You can take over-the-counter medicines and get plenty of rest.",
            "Is there any risk in taking over-the-counter medicines?",
            "Some medicines may interact with other medications you are taking, so be sure to read labels carefully.",
            "Thank you for your help, Medi. What else can I do to feel better?"
        ],
        "knowledge": "Common cold Common cold The economic impact of the common cold is not well understood in much of the world. In the United States, the common cold leads to 75–100 million physician visits annually at a conservative cost estimate of $7.7 billion per year. Americans spend $2.9 billion on over-the-counter drugs and another $400 million on prescription medicines for symptom relief. More than one-third of people who saw a doctor received an antibiotic prescription, which has implications for antibiotic resistance. An estimated 22–189 million school days are missed annually due to a cold Common cold Common cold",
        "response": "Other things you can do include staying hydrated, using a humidifier, and avoiding contact with others to prevent spreading the virus."
    },
    {
        "dialog": [
            "Hi Medi, I read about the economic impact of the common cold. Can you tell me more?",
            "Yes, the impact of the common cold is not well understood in many parts of the world.",
            "What about in the US?",
            "In the US, the common cold leads to 75-100 million physician visits annually, costing an estimated $7.7 billion per year.",
            "Wow, that's a lot of money. What about over-the-counter drugs?",
            "Americans spend $2.9 billion on over-the-counter drugs and another $400 million on prescription medicines for symptom relief.",
            "Why do doctors prescribe antibiotics for the common cold?",
            "More than one-third of people who saw a doctor received an antibiotic prescription, which has implications for antibiotic resistance.",
            "Thanks for explaining, Medi. Do you have any advice for preventing the common cold?"
        ],
        "knowledge": "Common cold Common cold The economic impact of the common cold is not well understood in much of the world. In the United States, the common cold leads to 75–100 million physician visits annually at a conservative cost estimate of $7.7 billion per year. Americans spend $2.9 billion on over-the-counter drugs and another $400 million on prescription medicines for symptom relief. More than one-third of people who saw a doctor received an antibiotic prescription, which has implications for antibiotic resistance. An estimated 22–189 million school days are missed annually due to a cold Common cold Common cold",
        "response": "Yes, some tips include washing your hands frequently, avoiding close contact with people who are sick, and not touching your face with unwashed hands."
    },
    {
        "dialog": [
            "Hi Medi, I just had a medical procedure. What should I be doing to take care of myself?",
            "Hi there! It depends on what kind of procedure you had. Can you tell me more?",
            "I had a dental procedure done.",
            "After a dental procedure, you should avoid eating hard or crunchy foods and stick to soft foods like soup or mashed potatoes.",
            "What about brushing my teeth?",
            "Be sure to brush and floss gently around the procedure site, and avoid using mouthwash that contains alcohol.",
            "How long should I be taking it easy?",
            "You should rest and avoid any strenuous activity for at least the rest of the day after the procedure.",
            "Thanks for your help, Medi. Anything else I should know?"
        ],
        "knowledge": "Common cold Common cold The economic impact of the common cold is not well understood in much of the world. In the United States, the common cold leads to 75–100 million physician visits annually at a conservative cost estimate of $7.7 billion per year. Americans spend $2.9 billion on over-the-counter drugs and another $400 million on prescription medicines for symptom relief. More than one-third of people who saw a doctor received an antibiotic prescription, which has implications for antibiotic resistance. An estimated 22–189 million school days are missed annually due to a cold Common cold Common cold",
        "response": "Be sure to follow any other instructions your dentist gave you, such as taking any prescribed medications or using a special mouthwash."
    },
    {
        "dialog": [
            "Hi Medi, I have a runny nose and a sore throat.",
            "I see. Based on your symptoms, you might have caught a cold.",
            "What should I do in this situation?",
            "Rest, drink lots of fluids, and take over-the-counter medication for symptom relief.",
            "How long does it usually take for the cold to go away?",
            "It can take up to two weeks for the symptoms to disappear completely.",
            "Is there anything I can do to prevent getting a cold?",
            "Wash your hands regularly, avoid close contact with sick people, and keep your immune system strong with a healthy diet and exercise.",
            "Thank you, Medi. I'll make sure to follow your advice."
        ],
        "knowledge": "Common cold Common cold The economic impact of the common cold is not well understood in much of the world.  In the United States, the common cold leads to 75–100 million physician visits annually at a conservative cost estimate of $7. 7 billion per year.  Americans spend $2. 9 billion on over-the-counter drugs and another $400 million on prescription medicines for symptom relief.  More than one-third of people who saw a doctor received an antibiotic prescription, which has implications for antibiotic resistance.  An estimated 22–189 million school days are missed annually due to a cold Common cold Common cold",
        "response": "You're welcome. Remember to rest, drink lots of fluids, and take over-the-counter medication for symptom relief."
    },
    {
        "dialog": [
            "Hello Medi, can you tell me more about the common cold?",
            "Of course. The common cold is a viral infection that affects the upper respiratory tract.",
            "What are the symptoms of a common cold?",
            "The symptoms include a runny nose, sore throat, cough, and congestion.",
            "How is the common cold spread?",
            "The common cold is spread through contact with respiratory secretions from infected individuals.",
            "Is there a cure for the common cold?",
            "There is currently no cure for the common cold, but over-the-counter medication can help alleviate the symptoms.",
            "Thank you for the information, Medi."
        ],
        "knowledge": "Common cold Common cold The economic impact of the common cold is not well understood in much of the world.  In the United States, the common cold leads to 75–100 million physician visits annually at a conservative cost estimate of $7. 7 billion per year.  Americans spend $2. 9 billion on over-the-counter drugs and another $400 million on prescription medicines for symptom relief.  More than one-third of people who saw a doctor received an antibiotic prescription, which has implications for antibiotic resistance.  An estimated 22–189 million school days are missed annually due to a cold Common cold Common cold",
        "response": "You're welcome."
    },
    {
        "dialog": [
            "Hi Medi, I just had a medical procedure done. Do you have any advice for my recovery?",
            "Sure. It depends on what procedure you had done. Can you provide more information?",
            "I had surgery to remove my gallbladder.",
            "In that case, you should avoid fatty and fried foods, eat small, frequent meals, and stay hydrated.",
            "What about physical activity?",
            "You should avoid any strenuous activity for a few weeks and gradually increase your activity level as you feel comfortable.",
            "Are there any lifestyle changes I should make?",
            "You should avoid smoking and limit your alcohol intake.",
            "Thank you for the advice, Medi."
        ],
        "knowledge": "Common cold Common cold The economic impact of the common cold is not well understood in much of the world.  In the United States, the common cold leads to 75–100 million physician visits annually at a conservative cost estimate of $7. 7 billion per year.  Americans spend $2. 9 billion on over-the-counter drugs and another $400 million on prescription medicines for symptom relief.  More than one-third of people who saw a doctor received an antibiotic prescription, which has implications for antibiotic resistance.  An estimated 22–189 million school days are missed annually due to a cold Common cold Common cold",
        "response": "You're welcome. Remember to follow your doctor's instructions and take it easy during your recovery period."
    },
    {
        "dialog": [
            "Hi Medi, I have a runny nose and sore throat. What should I do?",
            "Based on your symptoms, you may have the common cold. Get rest and drink plenty of fluids.",
            "Should I take any medication?",
            "Over-the-counter medications such as decongestants and pain relievers can help relieve symptoms.",
            "How can I prevent getting a cold?",
            "Wash your hands frequently, avoid close contact with people who have colds, and avoid touching your face.",
            "Are antibiotics effective in treating a cold?",
            "Antibiotics are not effective against the common cold since colds are caused by viruses, not bacteria.",
            "Thanks for the information. How long does a cold usually last?"
        ],
        "knowledge": "Common cold Common cold The economic impact of the common cold is not well understood in much of the world.  In the United States, the common cold leads to 75–100 million physician visits annually at a conservative cost estimate of $7. 7 billion per year.  Americans spend $2. 9 billion on over-the-counter drugs and another $400 million on prescription medicines for symptom relief.  More than one-third of people who saw a doctor received an antibiotic prescription, which has implications for antibiotic resistance.  An estimated 22–189 million school days are missed annually due to a cold Common cold Common cold",
        "response": "The common cold usually lasts for 7-10 days, but symptoms can last up to two weeks."
    },
    {
        "dialog": [
            "Hey Medi, I just had a flu shot. What should I expect from it?",
            "You may have some mild side effects such as soreness, swelling, or redness at the injection site.",
            "Is there anything else I should watch out for?",
            "You may also experience a low-grade fever, headache, or muscle aches, but these should go away within a few days.",
            "Can I get the flu from the flu shot?",
            "No, the flu shot contains inactivated viruses that cannot cause the flu.",
            "How effective is the flu shot?",
            "The effectiveness of the flu shot varies from year to year, but it can reduce your risk of getting the flu by up to 60%.",
            "That's good to know. How long does the flu shot protect me?"
        ],
        "knowledge": "Influenza vaccine Influenza vaccine Influenza vaccination is the most effective preventive measure available.  Influenza vaccination is recommended yearly.  The vaccine is effective against three or four influenza viruses depending on the formulation.  The vaccine is usually effective against the predominant strains of influenza for that season.  The effectiveness of the vaccine varies depending on the match between the vaccine strains and the circulating strains each year.  Influenza vaccine reduces the risk of infection and of complications from influenza.  It can also reduce the severity of the illness.  Influenza vaccine is recommended for people who are at high risk of complications from influenza, including the elderly, young children, pregnant women, and people with underlying medical conditions.  Influenza vaccine is also recommended for healthcare workers Influenza vaccine Influenza vaccine",
        "response": "The flu shot usually protects you for the entire flu season, which can last from October to May."
    },
    {
        "dialog": [
            "Hi Medi, I just had surgery. What should I do to help with my recovery?",
            "Make sure to follow your doctor's instructions for post-surgery care, get plenty of rest, and avoid strenuous activity.",
            "How should I take care of my incision site?",
            "Keep the incision site clean and dry, and change the dressing as directed by your doctor.",
            "Are there any foods I should avoid?",
            "You should avoid fatty and greasy foods, as well as alcohol, which can interfere with the healing process.",
            "What kind of physical activity can I do?",
            "You can start with gentle exercises such as walking or stretching, but avoid any activity that puts strain on the incision site.",
            "Good advice. How long will it take for me to recover fully?"
        ],
        "knowledge": "Surgery Surgery Recovery from surgery depends on the type of surgery performed and the general health of the patient.  Patients are usually advised to avoid vigorous physical activity and to rest as much as possible in the days immediately following surgery.  Patients should follow their surgeon's instructions for wound care and should report any signs of infection or other complications.  Patients may also be advised to modify their diet and to take medications as prescribed.  In some cases, patients may need physical therapy or other forms of rehabilitation to aid in their recovery.  The recovery period can vary widely depending on the type of surgery and the patient's overall health. Surgery Surgery",
        "response": "The length of recovery time varies depending on the type of surgery, but it can take several weeks to several months to fully recover."
    },
    {
        "dialog": [
            "Hello Medi, I have been experiencing some symptoms lately.",
            "Sure, what are your symptoms?",
            "I have a runny nose, a sore throat, coughing, and a slight fever.",
            "Based on your symptoms, it seems like you have a common cold.",
            "Is there any medication you could recommend to help ease my symptoms?",
            "You can take over-the-counter drugs for symptom relief.",
            "Are antibiotics necessary for a common cold?",
            "No, antibiotics are not necessary for a common cold as it is caused by a virus.",
            "Thank you, Medi. What else can I do to relieve my symptoms?"
        ],
        "knowledge": "Common cold Common cold The economic impact of the common cold is not well understood in much of the world.  In the United States, the common cold leads to 75–100 million physician visits annually at a conservative cost estimate of $7. 7 billion per year.  Americans spend $2. 9 billion on over-the-counter drugs and another $400 million on prescription medicines for symptom relief.  More than one-third of people who saw a doctor received an antibiotic prescription, which has implications for antibiotic resistance.  An estimated 22–189 million school days are missed annually due to a cold Common cold Common cold",
        "response": "You can also try drinking lots of fluids, getting plenty of rest, and using a humidifier to help ease your symptoms."
    },
    {
        "dialog": [
            "Hi Medi, I have a question about the common cold.",
            "Of course, what is your question?",
            "What causes the common cold?",
            "The common cold is caused by a virus that infects the upper respiratory system.",
            "Can a common cold be prevented?",
            "There is no guaranteed way to prevent a common cold, but you can reduce your risk by frequently washing your hands, avoiding close contact with people who are sick, and avoiding touching your face.",
            "How long does a common cold last?",
            "A common cold typically lasts for 7-10 days.",
            "Thank you, Medi. One more question, can a common cold lead to more serious complications?"
        ],
        "knowledge": "Common cold Common cold The economic impact of the common cold is not well understood in much of the world.  In the United States, the common cold leads to 75–100 million physician visits annually at a conservative cost estimate of $7. 7 billion per year.  Americans spend $2. 9 billion on over-the-counter drugs and another $400 million on prescription medicines for symptom relief.  More than one-third of people who saw a doctor received an antibiotic prescription, which has implications for antibiotic resistance.  An estimated 22–189 million school days are missed annually due to a cold Common cold Common cold",
        "response": "In rare cases, a common cold can lead to more serious complications such as pneumonia, bronchitis, or sinus infections."
    },
    {
        "dialog": [
            "Hi Medi, I recently recovered from a cold and was wondering what I can do to prevent getting sick again.",
            "You can reduce your risk of getting sick again by frequently washing your hands, avoiding close contact with people who are sick, and avoiding touching your face.",
            "Is there anything I can do to boost my immune system?",
            "A healthy lifestyle can help boost your immune system. This includes eating a well-balanced diet, getting enough sleep, and getting regular exercise.",
            "Are there any foods I should eat or avoid to help prevent getting sick?",
            "Eating a diet rich in fruits and vegetables can help strengthen your immune system. It is also important to avoid processed foods and foods high in sugar and unhealthy fats.",
            "Thank you, Medi. What about supplements or vitamins?",
            "While some supplements and vitamins may help boost your immune system, it is best to get your nutrients from a healthy and well-balanced diet.",
            "Got it. One last question, can stress affect your immune system?"
        ],
        "knowledge": "Common cold Common cold The economic impact of the common cold is not well understood in much of the world.  In the United States, the common cold leads to 75–100 million physician visits annually at a conservative cost estimate of $7. 7 billion per year.  Americans spend $2. 9 billion on over-the-counter drugs and another $400 million on prescription medicines for symptom relief.  More than one-third of people who saw a doctor received an antibiotic prescription, which has implications for antibiotic resistance.  An estimated 22–189 million school days are missed annually due to a cold Common cold Common cold",
        "response": "Yes, stress can weaken your immune system and make you more susceptible to getting sick."
    },
    {
        "dialog": [
            "Hi Medi, I think I might have a cold. What should I do?",
            "Hello! You should rest and drink plenty of fluids",
            "What about medicine, do I need to take anything?",
            "Only take medicine if you have a fever or your symptoms are severe. Over-the-counter medication can help relieve symptoms",
            "I see, how long does a cold typically last?",
            "A cold typically lasts between 7 to 10 days",
            "Is there anything else I can do to avoid catching a cold?",
            "You should wash your hands regularly, avoid touching your face, and avoid contact with people who are sick",
            "Thanks for the advice Medi! One more thing, what are the symptoms of a cold?"
        ],
        "knowledge": "Common cold Common cold The economic impact of the common cold is not well understood in much of the world.  In the United States, the common cold leads to 75–100 million physician visits annually at a conservative cost estimate of $7. 7 billion per year.  Americans spend $2. 9 billion on over-the-counter drugs and another $400 million on prescription medicines for symptom relief.  More than one-third of people who saw a doctor received an antibiotic prescription, which has implications for antibiotic resistance.  An estimated 22–189 million school days are missed annually due to a cold Common cold Common cold",
        "response": "The symptoms of a cold usually include a sore throat, runny nose, coughing, sneezing, and fatigue"
    },
    {
        "dialog": [
            "Hi Medi, I had a cold a few weeks ago and I still don't feel quite right. What should I do?",
            "Hello! It's possible that you have developed a secondary infection. You should see a doctor for an evaluation",
            "What kind of secondary infections can develop after a cold?",
            "Secondary infections that can develop include sinusitis and bronchitis",
            "Are there any home remedies I can try to help myself feel better?",
            "Yes, you can try drinking hot liquids, using a humidifier, and getting plenty of rest",
            "I see, one more question. Can a cold turn into pneumonia?",
            "While it's rare, a cold can lead to pneumonia in some cases. It's important to see a doctor if your symptoms worsen or do not improve after a week",
            "Thank you, Medi. I will make an appointment with my doctor."
        ],
        "knowledge": "Common cold Common cold The economic impact of the common cold is not well understood in much of the world.  In the United States, the common cold leads to 75–100 million physician visits annually at a conservative cost estimate of $7. 7 billion per year.  Americans spend $2. 9 billion on over-the-counter drugs and another $400 million on prescription medicines for symptom relief.  More than one-third of people who saw a doctor received an antibiotic prescription, which has implications for antibiotic resistance.  An estimated 22–189 million school days are missed annually due to a cold Common cold Common cold",
        "response": "You're welcome! It's always better to be safe than sorry. Good luck at your appointment"
    },
    {
        "dialog": [
            "Hi Medi, I just recovered from a cold. What should I do to prevent getting sick again?",
            "Hello! You should wash your hands regularly and avoid contact with people who are sick",
            "What about taking vitamins or supplements?",
            "While there is no cure for the common cold, taking Vitamin C supplements can help boost your immune system",
            "I see, thank you. How about getting a flu shot?",
            "Yes, getting a flu shot can also help prevent you from getting sick",
            "Last question, how do I know if I'm contagious after having a cold?",
            "You are most contagious within the first 3 days of a cold. However, you can still be contagious for up to 2 weeks after you recover",
            "Thank you, Medi! I will make sure to take your advice"
        ],
        "knowledge": "Common cold Common cold The economic impact of the common cold is not well understood in much of the world.  In the United States, the common cold leads to 75–100 million physician visits annually at a conservative cost estimate of $7. 7 billion per year.  Americans spend $2. 9 billion on over-the-counter drugs and another $400 million on prescription medicines for symptom relief.  More than one-third of people who saw a doctor received an antibiotic prescription, which has implications for antibiotic resistance.  An estimated 22–189 million school days are missed annually due to a cold Common cold Common cold",
        "response": "You're welcome! It's important to take care of yourself to avoid getting sick again"
    },
    {
        "dialog": [
            "Hi Medi, I'm feeling a bit under the weather today.",
            "Sorry to hear that. Can you tell me your symptoms?",
            "I have a runny nose, coughing, and a sore throat.",
            "Based on your symptoms, it seems like you have a common cold.",
            "What can I do to treat it?",
            "You can take over-the-counter medications for symptom relief and rest. Drink plenty of fluids and get enough sleep.",
            "Thank you, Medi. How long does a common cold usually last?",
            "On average, a common cold lasts for about 7-10 days.",
            "Okay, thanks for your help."
        ],
        "knowledge": "Common cold Common cold The economic impact of the common cold is not well understood in much of the world.  In the United States, the common cold leads to 75–100 million physician visits annually at a conservative cost estimate of $7. 7 billion per year.  Americans spend $2. 9 billion on over-the-counter drugs and another $400 million on prescription medicines for symptom relief.  More than one-third of people who saw a doctor received an antibiotic prescription, which has implications for antibiotic resistance.  An estimated 22–189 million school days are missed annually due to a cold Common cold Common cold.",
        "response": "You're welcome. I'm glad I could help you."
    },
    {
        "dialog": [
            "Hey Medi, I just had a flu shot and my arm is sore.",
            "That's a common side effect of the flu shot. It should go away in a few days.",
            "Is there anything I can do to relieve the pain?",
            "Yes, you can apply a cold compress to the injection site and take over-the-counter pain relievers if necessary.",
            "Okay, thank you. Is it normal to feel a bit sick after the flu shot?",
            "Yes, it's normal to have a mild fever, muscle aches, and fatigue after the flu shot.",
            "How long does it usually last?",
            "Usually, the symptoms go away within a few days. If they persist, you should contact your doctor.",
            "Alright, thank you for the information, Medi."
        ],
        "knowledge": "Influenza vaccine Influenza vaccine The influenza vaccine, also known as a flu shot, is a vaccine specifically for influenza.  The vaccine is usually recommended for anyone six months of age and older who do not have contraindications.  The vaccine provides protection against the influenza viruses that are predicted to be the most common during the upcoming season.  The vaccine is generally well tolerated.  Common side effects include pain at the site of injection and systemic symptoms such as fever, muscle pain, and malaise Influenza vaccine Influenza vaccine.",
        "response": "You're welcome. If you experience any other symptoms or concerns, feel free to ask me anytime."
    },
    {
        "dialog": [
            "Hi Medi, I just got diagnosed with a common cold.",
            "I'm sorry to hear that. Do you have any questions?",
            "Is there any way to prevent catching a cold?",
            "Yes, you can wash your hands frequently, avoid close contact with people who are sick, and avoid touching your face.",
            "What about vitamins or supplements?",
            "While there is no cure for the common cold, taking vitamin C or zinc supplements may help boost your immune system and shorten the duration of your symptoms.",
            "Okay, thank you. Is it safe to exercise while I have a cold?",
            "It's generally safe to exercise with a cold, but you should listen to your body and not push yourself too hard. Rest is also important for recovery.",
            "Alright, thank you for your advice, Medi."
        ],
        "knowledge": "Common cold Common cold The economic impact of the common cold is not well understood in much of the world.  In the United States, the common cold leads to 75–100 million physician visits annually at a conservative cost estimate of $7. 7 billion per year.  Americans spend $2. 9 billion on over-the-counter drugs and another $400 million on prescription medicines for symptom relief.  More than one-third of people who saw a doctor received an antibiotic prescription, which has implications for antibiotic resistance.  An estimated 22–189 million school days are missed annually due to a cold Common cold Common cold.",
        "response": "You're welcome. Let me know if you have any other questions or concerns."
    }
]