[
    {
        "dialog": [
            "Hi Medi, I think I need advice about hepatitis B vaccination for my baby.",
            "Of course, I am here to help you. What do you want to know?",
            "When should I start the vaccination for my baby?",
            "Routine vaccination for hepatitis B starts with the first dose administered as a shot into the muscle before the newborn is discharged from the hospital. ",
            "How many doses should be administered before my baby is 18 months?",
            "An additional two doses should be administered before the child is 18 months. ",
            "What should I do if my baby is born to a mother with hepatitis B surface antigen positivity?",
            "The first dose is unique – in addition to the vaccine, the hepatitis immune globulin should also be administered, both within 12 hours of birth. These newborns should also be regularly tested for infection for at least the first year of life.",
            "Thank you, Medi. Are there any vaccines available in the US for hepatitis C or E?"
        ],
        "knowledge": "Hepatitis Hepatitis Routine vaccination for hepatitis B starts with the first dose administered as a shot into the muscle before the newborn is discharged from the hospital.   An additional two doses should be administered before the child is 18 months. For babies born to a mother with hepatitis B surface antigen positivity, the first dose is unique – in addition to the vaccine, the hepatitis immune globulin should also be administered, both within 12 hours of birth.   These newborns should also be regularly tested for infection for at least the first year of life. There is also a combination formulation that includes both hepatitis A and B vaccines. There are currently no vaccines available in the United States for hepatitis C or E.  In 2015, a group in China published an article regarding the development of a vaccine for hepatitis E Hepatitis Hepatitis",
        "response": "No, there are currently no vaccines available in the United States for hepatitis C or E."
    },
    {
        "dialog": [
            "Hi Medi, I have just had a hepatitis B vaccine. What should I do in terms of lifestyle and diet?",
            "Hello! It's important to maintain a good diet, do physical exercises and avoid alcohol.",
            "Any specific type of food I should eat?",
            "No specific food is necessary, but a balanced diet with more vitamins and vegetables is helpful.",
            "What are the best physical exercises for me to do?",
            "Any exercise that increases your heart rate and maintains it for a period of time, like jogging, cycling, swimming, etc.",
            "What should I avoid doing?",
            "You should avoid smoking, drinking alcohol, and staying up late.",
            "Thank you, Medi. Can I eat fast food sometimes?"
        ],
        "knowledge": "Hepatitis Hepatitis Routine vaccination for hepatitis B starts with the first dose administered as a shot into the muscle before the newborn is discharged from the hospital.   An additional two doses should be administered before the child is 18 months. For babies born to a mother with hepatitis B surface antigen positivity, the first dose is unique – in addition to the vaccine, the hepatitis immune globulin should also be administered, both within 12 hours of birth.   These newborns should also be regularly tested for infection for at least the first year of life. There is also a combination formulation that includes both hepatitis A and B vaccines. There are currently no vaccines available in the United States for hepatitis C or E.  In 2015, a group in China published an article regarding the development of a vaccine for hepatitis E Hepatitis Hepatitis",
        "response": "Occasional fast food is OK, but a balanced diet is always better for your health."
    },
    {
        "dialog": [
            "Hi Medi, I just had a hepatitis B vaccine. Can you give me advice on physical exercise?",
            "Of course! It's important to exercise regularly.",
            "How often should I exercise?",
            "At least 30 minutes of exercise a day is ideal.",
            "What are the best types of exercises?",
            "Any type of exercise that increases your heart rate and maintains it for a period of time, like jogging, cycling, swimming, etc.",
            "What if I don't have time to do all of that?",
            "You can incorporate physical activity into your day-to-day routine, like taking the stairs instead of the elevator or taking a walk during your lunch break. ",
            "Thank you, Medi. Can you give me advice on diet and nutrition?"
        ],
        "knowledge": "Hepatitis Hepatitis Routine vaccination for hepatitis B starts with the first dose administered as a shot into the muscle before the newborn is discharged from the hospital.   An additional two doses should be administered before the child is 18 months. For babies born to a mother with hepatitis B surface antigen positivity, the first dose is unique – in addition to the vaccine, the hepatitis immune globulin should also be administered, both within 12 hours of birth.   These newborns should also be regularly tested for infection for at least the first year of life. There is also a combination formulation that includes both hepatitis A and B vaccines. There are currently no vaccines available in the United States for hepatitis C or E.  In 2015, a group in China published an article regarding the development of a vaccine for hepatitis E Hepatitis Hepatitis",
        "response": "A balanced diet with more vitamins and vegetables is important for healthy living, avoiding fatty and unhealthy foods is critical to maintaining long-term health."
    },
    {
        "dialog": [
            "Hi Medi, I am worried about my newborn baby.",
            "Don't worry, I am here to help. What's the problem?",
            "I am not sure if my baby needs a hepatitis B vaccine",
            "Yes, your baby should receive a hepatitis B vaccination series starting at birth",
            "How many shots are required?",
            "The vaccine is given as a series of three shots. The second dose is given one to two months after the first dose, and the third dose is given six months after the first dose",
            "Is there any difference in the vaccination for babies born to mothers having hepatitis B?",
            "Yes, for babies born to mothers with hepatitis B surface antigen positivity, the first dose should be unique. In addition to the vaccine, the hepatitis immune globulin should be administered within 12 hours of birth",
            "Thank you for your advice, Medi"
        ],
        "knowledge": "Hepatitis Hepatitis Routine vaccination for hepatitis B starts with the first dose administered as a shot into the muscle before the newborn is discharged from the hospital. An additional two doses should be administered before the child is 18 months. For babies born to a mother with hepatitis B surface antigen positivity, the first dose is unique – in addition to the vaccine, the hepatitis immune globulin should also be administered, both within 12 hours of birth. These newborns should also be regularly tested for infection for at least the first year of life. There is also a combination formulation that includes both hepatitis A and B vaccines. There are currently no vaccines available in the United States for hepatitis C or E. In 2015, a group in China published an article regarding the development of a vaccine for hepatitis E Hepatitis Hepatitis",
        "response": "You're welcome. Do you have any other questions about hepatitis B vaccination?"
    },
    {
        "dialog": [
            "Hello Medi, what is hepatitis A and how is it different from hepatitis B?",
            "Hepatitis A is a viral infection that affects the liver. Unlike hepatitis B, it usually doesn't cause long-term liver damage",
            "How is hepatitis A transmitted?",
            "Hepatitis A is spread through contaminated food and water, or from close contact with someone who is infected",
            "Is there any vaccine available for hepatitis A?",
            "Yes, there is a vaccine available for hepatitis A",
            "Is it possible to get both hepatitis A and B at the same time?",
            "Yes, there is a combination formulation that includes both hepatitis A and B vaccines",
            "Thanks, Medi. Your information is really helpful"
        ],
        "knowledge": "Hepatitis Hepatitis Hepatitis A is a viral infection that affects the liver. It does not usually cause long-term liver damage like hepatitis B.  The hepatitis A virus is most commonly transmitted by consuming food or water contaminated by feces from a person infected with hepatitis A.  The virus can also be spread through close contact with an infected person, such as through sex or caring for someone who is ill.  The hepatitis A vaccine is recommended for all children at 12 to 23 months of age, and for adults who may be at increased risk for infection or serious complications. There is also a combination formulation that includes both hepatitis A and B vaccines. There are currently no vaccines available in the United States for hepatitis C or E.  In 2015, a group in China published an article regarding the development of a vaccine for hepatitis E Hepatitis Hepatitis",
        "response": "You're welcome. Let me know if you have any more questions"
    },
    {
        "dialog": [
            "Hi Medi, I had a hepatitis B vaccination series. What should I do next?",
            "It's great that you've been vaccinated. You should continue to get regular check-ups and blood tests to make sure you're still protected",
            "How long does the vaccine protect me?",
            "Studies have shown that the hepatitis B vaccine provides long-term protection for at least 20 years",
            "What should I do if I missed a dose?",
            "If you missed a dose or did not complete the series, you should talk to your healthcare provider about getting caught up",
            "Is there any vaccine available for hepatitis C or E?",
            "No, currently there are no vaccines available in the United States for hepatitis C or E",
            "Thank you for your help, Medi"
        ],
        "knowledge": "Hepatitis Hepatitis Routine vaccination for hepatitis B starts with the first dose administered as a shot into the muscle before the newborn is discharged from the hospital. An additional two doses should be administered before the child is 18 months. For babies born to a mother with hepatitis B surface antigen positivity, the first dose is unique – in addition to the vaccine, the hepatitis immune globulin should also be administered, both within 12 hours of birth. These newborns should also be regularly tested for infection for at least the first year of life. There is also a combination formulation that includes both hepatitis A and B vaccines. There are currently no vaccines available in the United States for hepatitis C or E. In 2015, a group in China published an article regarding the development of a vaccine for hepatitis E Hepatitis Hepatitis",
        "response": "You're welcome. Do you have any other questions about hepatitis? "
    },
    {
        "dialog": [
            "Hello Medi, I have a newborn baby and want to know about hepatitis B vaccination",
            "Hi, I'm happy to help. What do you want to know about hepatitis B vaccination?",
            "When should I start the vaccination for my newborn?",
            "Routine vaccination for hepatitis B starts with the first dose administered as a shot into the muscle before the newborn is discharged from the hospital.",
            "How many doses of the vaccine should my baby have?",
            "An additional two doses should be administered before the child is 18 months.",
            "My wife has hepatitis B surface antigen positivity. What should I do?",
            "The first dose is unique – in addition to the vaccine, the hepatitis immune globulin should also be administered, both within 12 hours of birth. These newborns should also be regularly tested for infection for at least the first year of life.",
            "Are there any vaccines available for hepatitis C or E in the United States?"
        ],
        "knowledge": "Hepatitis Hepatitis Routine vaccination for hepatitis B starts with the first dose administered as  a shot into the muscle before the newborn is discharged from the hospital.   An additional two doses should be administered before the child is 18 months. For babies born to a mother with hepatitis B surface antigen positivity, the first dose is unique – in addition to the vaccine, the hepatitis immune globulin should also be administered, both within 12 hours of birth.   These newborns should also be regularly tested for infection for at least the first year of life. There is also a combination formulation that includes both hepatitis A and B vaccines. There are currently no vaccines available in the United States for hepatitis C or E.  In 2015, a group in China published an article regarding the development of a vaccine for hepatitis E Hepatitis Hepatitis",
        "response": "No, there are currently no vaccines available in the United States for hepatitis C or E."
    },
    {
        "dialog": [
            "Hi Medi, I just had the hepatitis B vaccination. What should I do now?",
            "Hello, that's great news! You should rest and avoid putting pressure on the injection site.",
            "How long does it take for the vaccine to be effective?",
            "It takes about 1 to 2 months for the vaccine to be fully effective.",
            "Is there a combination formulation vaccine for hepatitis A and B?",
            "Yes, there is a combination formulation that includes both hepatitis A and B vaccines.",
            "For how long should I be tested for infection after the vaccination?",
            "There is no need to test for infection after vaccination.",
            "Thanks Medi, what else should I know about hepatitis B vaccination?"
        ],
        "knowledge": "Hepatitis Hepatitis Routine vaccination for hepatitis B starts with the first dose administered as  a shot into the muscle before the newborn is discharged from the hospital.   An additional two doses should be administered before the child is 18 months. For babies born to a mother with hepatitis B surface antigen positivity, the first dose is unique – in addition to the vaccine, the hepatitis immune globulin should also be administered, both within 12 hours of birth.   These newborns should also be regularly tested for infection for at least the first year of life. There is also a combination formulation that includes both hepatitis A and B vaccines. There are currently no vaccines available in the United States for hepatitis C or E.  In 2015, a group in China published an article regarding the development of a vaccine for hepatitis E Hepatitis Hepatitis",
        "response": "There is nothing else you need to do after vaccination, just rest and avoid putting pressure on the injection site. You are protected from hepatitis B now."
    },
    {
        "dialog": [
            "Hello Medi, I just had a medical procedure. What should I do now?",
            "Hi, I hope everything went well. After a medical procedure, it's important to rest and avoid any strenuous activities.",
            "What should I eat after my medical procedure?",
            "You should eat foods that are easy to digest and gentle on your stomach, such as soups, broths, and foods high in protein.",
            "Can I exercise after my medical procedure?",
            "You should avoid any strenuous activities and exercise until your doctor gives you the OK.",
            "Are there any specific physical exercises I should do?",
            "Your doctor may recommend certain physical therapy exercises to help you recover faster.",
            "Thanks Medi, how can I maintain a healthy lifestyle after my medical procedure?"
        ],
        "knowledge": "Hepatitis Hepatitis Routine vaccination for hepatitis B starts with the first dose administered as  a shot into the muscle before the newborn is discharged from the hospital.   An additional two doses should be administered before the child is 18 months. For babies born to a mother with hepatitis B surface antigen positivity, the first dose is unique – in addition to the vaccine, the hepatitis immune globulin should also be administered, both within 12 hours of birth.   These newborns should also be regularly tested for infection for at least the first year of life. There is also a combination formulation that includes both hepatitis A and B vaccines. There are currently no vaccines available in the United States for hepatitis C or E.  In 2015, a group in China published an article regarding the development of a vaccine for hepatitis E Hepatitis Hepatitis",
        "response": "To maintain a healthy lifestyle after your medical procedure, you should follow a balanced diet, do light exercises, and get enough rest. It's also important to follow your doctor's advice and attend any follow-up appointments."
    },
    {
        "dialog": [
            "Hi Medi, I think I need some information about hepatitis B vaccination.",
            "Sure, I can give you some advice. What do you want to know?",
            "When should someone get hepatitis B vaccine?",
            "Routine vaccination for hepatitis B starts with the first dose administered as a shot into the muscle before the newborn is discharged from the hospital.",
            "And what about the following doses?",
            "An additional two doses should be administered before the child is 18 months.",
            "Should there be any special case for newborns born to mothers with hepatitis B surface antigen positivity?",
            "Yes, the first dose is unique. In addition to the vaccine, the hepatitis immune globulin should also be administered, both within 12 hours of birth. These newborns should also be regularly tested for infection for at least the first year of life.",
            "I see. Thank you. Is there a vaccine for hepatitis C and E?"
        ],
        "knowledge": "Hepatitis Hepatitis Routine vaccination for hepatitis B starts with the first dose administered as a shot into the muscle before the newborn is discharged from the hospital.   An additional two doses should be administered before the child is 18 months. For babies born to a mother with hepatitis B surface antigen positivity, the first dose is unique – in addition to the vaccine, the hepatitis immune globulin should also be administered, both within 12 hours of birth.   These newborns should also be regularly tested for infection for at least the first year of life. There is also a combination formulation that includes both hepatitis A and B vaccines. There are currently no vaccines available in the United States for hepatitis C or E.  In 2015, a group in China published an article regarding the development of a vaccine for hepatitis E Hepatitis Hepatitis",
        "response": "No, currently there are no vaccines available in the United States for hepatitis C or E."
    },
    {
        "dialog": [
            "Hi Medi, I have a question about the hepatitis vaccine.",
            "Sure, what's your question?",
            "What is the combination formulation that includes both hepatitis A and B vaccines?",
            "It is a vaccine that can protect against both hepatitis A and B. The vaccine can be given to people who are at least 18 years old and should be administered as a series of three doses over a period of six months.",
            "What are the side effects of the vaccine?",
            "The vaccine is generally safe. Some people may experience mild side effects, such as soreness at the injection site, fever, or fatigue.",
            "Is it true that hepatitis B vaccine only protects against hepatitis B?",
            "Yes, that's correct. Hepatitis B vaccine only protects against hepatitis B and not other types of hepatitis.",
            "I see. Thanks for the information, Medi. Can hepatitis B be treated?"
        ],
        "knowledge": "Hepatitis Hepatitis Routine vaccination for hepatitis B starts with the first dose administered as a shot into the muscle before the newborn is discharged from the hospital.   An additional two doses should be administered before the child is 18 months. For babies born to a mother with hepatitis B surface antigen positivity, the first dose is unique – in addition to the vaccine, the hepatitis immune globulin should also be administered, both within 12 hours of birth.   These newborns should also be regularly tested for infection for at least the first year of life. There is also a combination formulation that includes both hepatitis A and B vaccines. There are currently no vaccines available in the United States for hepatitis C or E.  In 2015, a group in China published an article regarding the development of a vaccine for hepatitis E Hepatitis Hepatitis",
        "response": "Yes, hepatitis B can be treated. Treatment depends on the type of hepatitis, but it usually involves antiviral medications and supportive care."
    },
    {
        "dialog": [
            "Hi Medi, I just had a hepatitis B vaccine and I'm wondering if there are any lifestyle changes I should make.",
            "Yes, there are some things you can do to keep your liver healthy. What questions do you have?",
            "What should I avoid after getting the vaccine?",
            "You don't need to avoid anything after getting the vaccine. However, you should avoid alcohol and drugs that can damage your liver.",
            "What about my diet?",
            "To keep your liver healthy, you should eat a balanced diet that is low in fat, salt, and sugar. You should also eat plenty of fruits, vegetables, and whole grains. ",
            "What about physical exercise?",
            "Regular physical activity is important for liver health. Exercise can help prevent obesity and other conditions that can lead to liver damage.",
            "Thanks, Medi. Can you recommend any specific exercises or diets?"
        ],
        "knowledge": "Hepatitis Hepatitis Routine vaccination for hepatitis B starts with the first dose administered as a shot into the muscle before the newborn is discharged from the hospital.   An additional two doses should be administered before the child is 18 months. For babies born to a mother with hepatitis B surface antigen positivity, the first dose is unique – in addition to the vaccine, the hepatitis immune globulin should also be administered, both within 12 hours of birth.   These newborns should also be regularly tested for infection for at least the first year of life. There is also a combination formulation that includes both hepatitis A and B vaccines. There are currently no vaccines available in the United States for hepatitis C or E.  In 2015, a group in China published an article regarding the development of a vaccine for hepatitis E Hepatitis Hepatitis",
        "response": "For exercise, I recommend activities that are low-impact and easy on your joints, like walking, swimming, or yoga. For diet, you should try to eat foods that are rich in antioxidants and vitamins, such as leafy greens, berries, and nuts."
    },
    {
        "dialog": [
            "Hello Medi, I am worried about hepatitis B.",
            "Okay, I am here to assist you. What concerns you about hepatitis B?",
            "How can I prevent hepatitis B infection?",
            "Routine vaccination for hepatitis B starts with the first dose administered as a shot into the muscle before the newborn is discharged from the hospital.",
            "Are there any additional doses?",
            "Yes, an additional two doses should be administered before the child is 18 months.",
            "What about babies born to a mother with hepatitis B surface antigen positivity?",
            "The first dose is unique – in addition to the vaccine, the hepatitis immune globulin should also be administered, both within 12 hours of birth. These newborns should also be regularly tested for infection for at least the first year of life.",
            "Is there a vaccine for other types of hepatitis such as hepatitis C or E?"
        ],
        "knowledge": "Hepatitis Hepatitis Routine vaccination for hepatitis B starts with the first dose administered as  a shot into the muscle before the newborn is discharged from the hospital. An additional two doses should be administered before the child is 18 months. For babies born to a mother with hepatitis B surface antigen positivity, the first dose is unique – in addition to the vaccine, the hepatitis immune globulin should also be administered, both within 12 hours of birth. These newborns should also be regularly tested for infection for at least the first year of life. There is also a combination formulation that includes both hepatitis A and B vaccines. There are currently no vaccines available in the United States for hepatitis C or E. In 2015, a group in China published an article regarding the development of a vaccine for hepatitis E Hepatitis Hepatitis",
        "response": "Unfortunately, there aren't vaccines available for hepatitis C or E in the United States."
    },
    {
        "dialog": [
            "Hello Medi, I just had a hepatitis B vaccine, what should I do now?",
            "Thanks for contacting. You don't have to do anything else, just make sure to complete the series by getting the additional doses at the recommended times.",
            "What should I do if I miss a dose?",
            "It's recommended to get the vaccine series according to the recommended schedule. If you miss a dose, talk to your healthcare provider who will be able to help you get back on track.",
            "Is there anything I need to be aware of after getting the vaccine?",
            "You may have some mild side effects, such as soreness at the injection site, fatigue, or a low-grade fever. These usually go away on their own and are not serious.",
            "Is there anything I should avoid after getting the vaccine?",
            "You don't need to avoid anything specific after getting the vaccine. However, if you experience any side effects, it's important to take care of yourself and rest.",
            "Can I still get hepatitis B even after getting the vaccine?"
        ],
        "knowledge": "Hepatitis Hepatitis Routine vaccination for hepatitis B starts with the first dose administered as  a shot into the muscle before the newborn is discharged from the hospital. An additional two doses should be administered before the child is 18 months. For babies born to a mother with hepatitis B surface antigen positivity, the first dose is unique – in addition to the vaccine, the hepatitis immune globulin should also be administered, both within 12 hours of birth. These newborns should also be regularly tested for infection for at least the first year of life. There is also a combination formulation that includes both hepatitis A and B vaccines. There are currently no vaccines available in the United States for hepatitis C or E. In 2015, a group in China published an article regarding the development of a vaccine for hepatitis E Hepatitis Hepatitis",
        "response": "It's very rare, but it is possible to get hepatitis B after getting the vaccine. However, the vaccine is highly effective and provides long-lasting protection against the disease."
    },
    {
        "dialog": [
            "Hello Medi, I just recovered from hepatitis B, what should I do now?",
            "I'm glad to hear you've recovered. After recovering from hepatitis B, it's important to take care of your liver health.",
            "How can I take care of my liver?",
            "You can start by having a healthy diet, regular exercise, and avoiding alcohol and drugs that can cause liver damage. It's also important to get regular check-ups with your healthcare provider and to follow up on any liver function tests or imaging studies that have been recommended.",
            "Is there anything specific I should eat or not eat?",
            "It's recommended to have a balanced diet that includes plenty of fruits, vegetables, and whole grains. You should also avoid foods that are high in fat, sugar, or salt. If you have any concerns about your diet, it's a good idea to talk to a registered dietitian who can provide you with personalized advice.",
            "Can I still get hepatitis B after recovering from it?",
            "No, once you've recovered from hepatitis B, you are immune to the virus and cannot get infected again. However, it's still important to get regular check-ups to monitor your liver health.",
            "How often should I get check-ups?"
        ],
        "knowledge": "Hepatitis Hepatitis Routine vaccination for hepatitis B starts with the first dose administered as  a shot into the muscle before the newborn is discharged from the hospital. An additional two doses should be administered before the child is 18 months. For babies born to a mother with hepatitis B surface antigen positivity, the first dose is unique – in addition to the vaccine, the hepatitis immune globulin should also be administered, both within 12 hours of birth. These newborns should also be regularly tested for infection for at least the first year of life. There is also a combination formulation that includes both hepatitis A and B vaccines. There are currently no vaccines available in the United States for hepatitis C or E. In 2015, a group in China published an article regarding the development of a vaccine for hepatitis E Hepatitis Hepatitis",
        "response": "Regular check-ups are important to monitor your liver health after recovering from hepatitis B. The frequency of check-ups will depend on your individual circumstances and your healthcare provider's recommendations."
    },
    {
        "dialog": [
            "Hi Medi, I feel worried about hepatitis B.",
            "Don't worry, I'm here to answer your question about it.",
            "Can you tell me more about the vaccine for hepatitis B?",
            "Yes, routine vaccination for hepatitis B starts with the first dose administered as a shot into the muscle before the newborn is discharged from the hospital.",
            "How many doses should be taken?",
            "An additional two doses should be administered before the child is 18 months.",
            "What's the special case for newborns born to mothers with hepatitis B surface antigen positivity?",
            "They should receive a unique first dose - in addition to the vaccine, the hepatitis immune globulin should also be administered, both within 12 hours of birth.",
            "Is there a combination formulation for hepatitis A and B vaccines?"
        ],
        "knowledge": "Hepatitis Hepatitis Routine vaccination for hepatitis B starts with the first dose administered as a shot into the muscle before the newborn is discharged from the hospital.   An additional two doses should be administered before the child is 18 months. For babies born to a mother with hepatitis B surface antigen positivity, the first dose is unique – in addition to the vaccine, the hepatitis immune globulin should also be administered, both within 12 hours of birth. These newborns should also be regularly tested for infection for at least the first year of life. There is also a combination formulation that includes both hepatitis A and B vaccines. There are currently no vaccines available in the United States for hepatitis C or E.  In 2015, a group in China published an article regarding the development of a vaccine for hepatitis E Hepatitis Hepatitis",
        "response": "Yes, there is a combination formulation available that includes both hepatitis A and B vaccines."
    },
    {
        "dialog": [
            "Hi Medi, I just had hepatitis B vaccine shot.",
            "Great! Do you have any questions about it?",
            "How often should I get tested for hepatitis B after receiving the vaccine?",
            "If you have no risk factors, you can be tested three to six months after the third dose of hepatitis B vaccine.",
            "What about the newborns born to mothers with hepatitis B surface antigen positivity?",
            "These newborns should be regularly tested for infection for at least the first year of life.",
            "What if I miss the scheduled second or third dose?",
            "You can get the missed dose as soon as possible, but you don't need to restart the series.",
            "How effective is the vaccine?"
        ],
        "knowledge": "Hepatitis Hepatitis Routine vaccination for hepatitis B starts with the first dose administered as a shot into the muscle before the newborn is discharged from the hospital.   An additional two doses should be administered before the child is 18 months. For babies born to a mother with hepatitis B surface antigen positivity, the first dose is unique – in addition to the vaccine, the hepatitis immune globulin should also be administered, both within 12 hours of birth. These newborns should also be regularly tested for infection for at least the first year of life. There is also a combination formulation that includes both hepatitis A and B vaccines. There are currently no vaccines available in the United States for hepatitis C or E.  In 2015, a group in China published an article regarding the development of a vaccine for hepatitis E Hepatitis Hepatitis",
        "response": "The vaccine is over 90% effective in preventing hepatitis B infection and its chronic consequences. But it's still important to get tested for hepatitis B if you think you may have been exposed to it because the vaccine does not protect against previous exposures."
    },
    {
        "dialog": [
            "Hi Medi, I had hepatitis B and fully recovered. What should I do to stay healthy?",
            "Glad to hear that! You should adopt a healthy lifestyle.",
            "Can you give me some examples of a healthy lifestyle?",
            "You should eat a balanced diet, exercise regularly, and avoid alcohol and drugs.",
            "Is there any food that I should avoid?",
            "You should avoid fatty, fried, and spicy foods, as well as raw shellfish and undercooked meat.",
            "What about the physical exercises?",
            "You should do at least 150 minutes of moderate-intensity exercise or 75 minutes of vigorous-intensity exercise per week.",
            "What kind of exercise should I do?"
        ],
        "knowledge": "Hepatitis Hepatitis Routine vaccination for hepatitis B starts with the first dose administered as a shot into the muscle before the newborn is discharged from the hospital.   An additional two doses should be administered before the child is 18 months. For babies born to a mother with hepatitis B surface antigen positivity, the first dose is unique – in addition to the vaccine, the hepatitis immune globulin should also be administered, both within 12 hours of birth. These newborns should also be regularly tested for infection for at least the first year of life. There is also a combination formulation that includes both hepatitis A and B vaccines. There are currently no vaccines available in the United States for hepatitis C or E.  In 2015, a group in China published an article regarding the development of a vaccine for hepatitis E Hepatitis Hepatitis",
        "response": "You can do aerobic exercise, such as walking or swimming, and strength training exercise, such as lifting weights or using resistance bands, to stay healthy."
    },
    {
        "dialog": [
            "Hello Medi, I think I might have hepatitis. What should I do?",
            "Don't worry, let's talk about your symptoms and proceed from there.",
            "I feel extremely fatigued and have yellow skin.",
            "Based on your symptoms, it's best to take a blood test to confirm your diagnosis.",
            "What is the treatment for hepatitis?",
            "The treatment for hepatitis varies based on the type and severity. Medications and lifestyle changes are common treatments.",
            "I see. Can hepatitis be prevented?",
            "Yes, routine vaccination for hepatitis B is recommended before a newborn is discharged from the hospital.",
            "What about hepatitis C and E?"
        ],
        "knowledge": "Hepatitis Hepatitis Routine vaccination for hepatitis B starts with the first dose administered as  a shot into the muscle before the newborn is discharged from the hospital.   An additional two doses should be administered before the child is 18 months. For babies born to a mother with hepatitis B surface antigen positivity, the first dose is unique – in addition to the vaccine, the hepatitis immune globulin should also be administered, both within 12 hours of birth.   These newborns should also be regularly tested for infection for at least the first year of life. There is also a combination formulation that includes both hepatitis A and B vaccines. There are currently no vaccines available in the United States for hepatitis C or E.  In 2015, a group in China published an article regarding the development of a vaccine for hepatitis E Hepatitis Hepatitis",
        "response": "Unfortunately, there are no vaccines available in the United States for hepatitis C or E."
    },
    {
        "dialog": [
            "Hello Medi, I just got vaccinated for hepatitis. What should I do now?",
            "It's important to follow up with additional doses and regular testing if you were born to a mother with hepatitis B surface antigen positivity.",
            "How many additional doses should I get?",
            "You should receive two additional doses before you turn 18 months old.",
            "Do I need to take any other precautions?",
            "It's also important to avoid contact with infected blood and practice safe sex to prevent hepatitis transmission.",
            "Got it. Is there a combination vaccine available for hepatitis?",
            "Yes, there is a combination formulation that includes both hepatitis A and B vaccines.",
            "That's helpful to know. Thanks, Medi!"
        ],
        "knowledge": "Hepatitis Hepatitis Routine vaccination for hepatitis B starts with the first dose administered as  a shot into the muscle before the newborn is discharged from the hospital.   An additional two doses should be administered before the child is 18 months. For babies born to a mother with hepatitis B surface antigen positivity, the first dose is unique – in addition to the vaccine, the hepatitis immune globulin should also be administered, both within 12 hours of birth.   These newborns should also be regularly tested for infection for at least the first year of life. There is also a combination formulation that includes both hepatitis A and B vaccines. There are currently no vaccines available in the United States for hepatitis C or E.  In 2015, a group in China published an article regarding the development of a vaccine for hepatitis E Hepatitis Hepatitis",
        "response": "You're welcome! Remember to follow up with your doctor and get regular testing."
    },
    {
        "dialog": [
            "Hi Medi, I just had a hepatitis vaccination. What should I expect?",
            "You may feel some soreness and swelling at the injection site. This is common and should go away within a few days.",
            "Is there anything I should do to help with the discomfort?",
            "Applying a cool, wet cloth to the injection site can help alleviate soreness and swelling.",
            "What about preventing infection after the vaccination?",
            "It's important to avoid contact with infected blood and practice safe sex to prevent hepatitis transmission even after vaccination.",
            "Are there any side effects I should be aware of?",
            "Common side effects include headache, fatigue, and fever.",
            "Thanks for your help, Medi!"
        ],
        "knowledge": "Hepatitis Hepatitis Routine vaccination for hepatitis B starts with the first dose administered as  a shot into the muscle before the newborn is discharged from the hospital.   An additional two doses should be administered before the child is 18 months. For babies born to a mother with hepatitis B surface antigen positivity, the first dose is unique – in addition to the vaccine, the hepatitis immune globulin should also be administered, both within 12 hours of birth.   These newborns should also be regularly tested for infection for at least the first year of life. There is also a combination formulation that includes both hepatitis A and B vaccines. There are currently no vaccines available in the United States for hepatitis C or E.  In 2015, a group in China published an article regarding the development of a vaccine for hepatitis E Hepatitis Hepatitis",
        "response": "You're welcome! Remember to contact your doctor if you experience any unusual symptoms."
    },
    {
        "dialog": [
            "Hello Medi, I am worried about my newborn's vaccination.",
            "No problem. What do you want to know?",
            "When should I give the first dose of hepatitis B vaccine?",
            "The first dose should be given as a shot into the muscle before the newborn is discharged from the hospital.",
            "And when should I give the additional two doses?",
            "The additional two doses should be administered before the child is 18 months.",
            "What should I do if the mother has hepatitis B surface antigen positivity?",
            "The first dose is unique - in addition to the vaccine, the hepatitis immune globulin should also be administered, both within 12 hours of birth.",
            "Should I test my baby for infection after the vaccination?"
        ],
        "knowledge": "Hepatitis Hepatitis Routine vaccination for hepatitis B starts with the first dose administered as  a shot into the muscle before the newborn is discharged from the hospital. An additional two doses should be administered before the child is 18 months. For babies born to a mother with hepatitis B surface antigen positivity, the first dose is unique – in addition to the vaccine, the hepatitis immune globulin should also be administered, both within 12 hours of birth. These newborns should also be regularly tested for infection for at least the first year of life. There is also a combination formulation that includes both hepatitis A and B vaccines. There are currently no vaccines available in the United States for hepatitis C or E. In 2015, a group in China published an article regarding the development of a vaccine for hepatitis E Hepatitis Hepatitis",
        "response": "Thanks for your explanation. I will follow the vaccination protocol."
    },
    {
        "dialog": [
            "Hello Medi, I have a question about hepatitis C.",
            "Ok, what is your question?",
            "How is hepatitis C transmitted?",
            "Hepatitis C is transmitted primarily through contact with the blood of an infected person.",
            "Is there any other way to become infected?",
            "Yes, it is also possible to become infected through sexual contact or from mother to baby during childbirth.",
            "What are the symptoms of hepatitis C?",
            "Most people do not have any symptoms initially. Later on, they may experience fatigue, nausea, loss of appetite, and yellowing of the skin and eyes.",
            "How can I prevent hepatitis C?"
        ],
        "knowledge": "Hepatitis C Hepatitis C Hepatitis C is primarily spread through contact with the blood of an infected person, although other modes of transmission such as sexual contact or mother-to-child transmission during childbirth may also occur.  Most people do not have any symptoms initially and about half of people who contract HCV will clear the infection without any treatment.  For those who develop chronic hepatitis, fatigue, nausea, loss of appetite, and yellowing of the skin and eyes are common symptoms.  Prevention includes avoiding sharing needles or other injection equipment, practicing safe sex, and avoiding sharing personal items like razors or toothbrushes.  A vaccine for hepatitis C is not currently available Hepatitis C Hepatitis C",
        "response": "You are welcome. It's important to take proper care to prevent hepatitis C."
    },
    {
        "dialog": [
            "Hi Medi, I just had a medical procedure. Can you give me advice on what to do next?",
            "Of course, what type of procedure did you have?",
            "I had a liver biopsy.",
            "I see. For the next few days, you should avoid any activities that may cause bleeding, like heavy lifting or rigorous exercise.",
            "How should I take care of the biopsy site?",
            "Keep the biopsy site clean and dry for 24 hours. After that, you can take a shower but do not scrub the biopsy area. You might notice some mild pain, which can be relieved with acetaminophen. Do not take aspirin or ibuprofen as they can increase the risk of bleeding.",
            "Is there anything I need to watch for?",
            "Yes, watch for any signs of infection such as fever, increasing pain, or redness at the biopsy site. If you experience any of these symptoms, contact your doctor immediately.",
            "Thank you for your advice, Medi."
        ],
        "knowledge": "Liver Biopsy Liver Biopsy After a liver biopsy, it is important to avoid any activities that may cause bleeding, like heavy lifting or rigorous exercise, for the next few days.  Keep the biopsy site clean and dry for 24 hours. After that, you can take a shower but do not scrub the biopsy area. You might notice some mild pain, which can be relieved with acetaminophen. Do not take aspirin or ibuprofen as they can increase the risk of bleeding.  Watch for any signs of infection such as fever, increasing pain, or redness at the biopsy site.  If you experience any of these symptoms, contact your doctor immediately. Liver Biopsy Liver Biopsy",
        "response": "Thank you, Medi. I will be careful and follow your advice."
    },
    {
        "dialog": [
            "Hi Medi, I think I might have contracted hepatitis B.",
            "Sorry to hear that, what symptoms are you experiencing?",
            "I've been feeling lethargic and nauseous for a few days now.",
            "Have you had any yellowing of the skin or eyes?",
            "Not yet. But I am really worried.",
            "Don't worry, it's important to get tested and treated early. Let me check some information for you.",
            "Thanks, Medi. Do you know if there are any vaccines available for hepatitis B?",
            "Yes, there are routine vaccinations available that can start as early as newborns. Additional doses should be given before the child reaches 18 months.",
            "That's good to know. I will definitely get vaccinated after I recover from this. Thank you for your help."
        ],
        "knowledge": "Hepatitis Hepatitis Routine vaccination for hepatitis B starts with the first dose administered as a shot into the muscle before the newborn is discharged from the hospital. An additional two doses should be administered before the child is 18 months. For babies born to a mother with hepatitis B surface antigen positivity, the first dose is unique – in addition to the vaccine, the hepatitis immune globulin should also be administered, both within 12 hours of birth. These newborns should also be regularly tested for infection for at least the first year of life. There is also a combination formulation that includes both hepatitis A and B vaccines. There are currently no vaccines available in the United States for hepatitis C or E. In 2015, a group in China published an article regarding the development of a vaccine for hepatitis E Hepatitis Hepatitis",
        "response": "You're welcome. I hope you get tested soon and treated if necessary. Don't forget to ask your doctor about the routine vaccinations for hepatitis B."
    },
    {
        "dialog": [
            "Hi Medi, I just received a hepatitis B vaccination. What should I expect after getting the vaccine?",
            "After getting the vaccine, it is common to have some soreness or redness where the shot was given. You may also experience a mild fever or headache.",
            "How long will these symptoms last?",
            "Usually, these symptoms only last for a day or two. If they persist or become worse, you should contact your healthcare provider.",
            "Okay, I will keep that in mind. Is there anything I can do to reduce the soreness or redness?",
            "You can apply a cool, wet cloth to the injection site to help reduce the soreness or redness.",
            "Good to know. I will keep an eye on my symptoms. Thanks, Medi.",
            "You're welcome. Don't forget to get your follow-up doses for the vaccine as recommended by your healthcare provider.",
            "Of course, I won't forget. Thank you for the reminder."
        ],
        "knowledge": "Hepatitis Hepatitis Routine vaccination for hepatitis B starts with the first dose administered as a shot into the muscle before the newborn is discharged from the hospital. An additional two doses should be administered before the child is 18 months. For babies born to a mother with hepatitis B surface antigen positivity, the first dose is unique – in addition to the vaccine, the hepatitis immune globulin should also be administered, both within 12 hours of birth. These newborns should also be regularly tested for infection for at least the first year of life. There is also a combination formulation that includes both hepatitis A and B vaccines. There are currently no vaccines available in the United States for hepatitis C or E. In 2015, a group in China published an article regarding the development of a vaccine for hepatitis E Hepatitis Hepatitis",
        "response": "You're welcome. I hope you don't experience any severe side effects after getting the vaccine. Don't forget to get your follow-up doses as recommended by your healthcare provider."
    },
    {
        "dialog": [
            "Hello Medi, I just had a hepatitis B test and it came out positive. What should I do now?",
            "I'm sorry to hear that. The next step will depend on the severity of your infection. You should discuss this with your healthcare provider.",
            "Okay, I will do that. Is there anything I can do to help prevent the spread of the virus?",
            "Yes, it's important to practice good hygiene, such as washing your hands frequently and avoiding sharing personal items such as toothbrushes or razors. You should also avoid sexual contact or use protection if you do have sex.",
            "I see. What about my diet and lifestyle?",
            "Your healthcare provider may recommend a special diet and lifestyle changes to help manage your infection and prevent further liver damage. It's important to follow their advice.",
            "Thank you, Medi. This is all very overwhelming.",
            "It's understandable. Just remember to take it one day at a time and prioritize your health and well-being.",
            "I will. Thank you for your support and advice, Medi."
        ],
        "knowledge": "Hepatitis Hepatitis Routine vaccination for hepatitis B starts with the first dose administered as a shot into the muscle before the newborn is discharged from the hospital. An additional two doses should be administered before the child is 18 months. For babies born to a mother with hepatitis B surface antigen positivity, the first dose is unique – in addition to the vaccine, the hepatitis immune globulin should also be administered, both within 12 hours of birth. These newborns should also be regularly tested for infection for at least the first year of life. There is also a combination formulation that includes both hepatitis A and B vaccines. There are currently no vaccines available in the United States for hepatitis C or E. In 2015, a group in China published an article regarding the development of a vaccine for hepatitis E Hepatitis Hepatitis",
        "response": "You're welcome. It's important to take care of yourself and seek medical advice from your healthcare provider. Don't hesitate to reach out to me if you have any more questions or concerns."
    }
]