[
    {
        "dialog": [
            "Hi Medi, I have a headache and I'm feeling dizzy",
            "I'm here to help you. Do you have any other symptoms?",
            "Yes, my neck is stiff and I'm having a hard time looking at bright lights.",
            "Based on your symptoms, it could be meningitis. You should see a doctor immediately.",
            "What is meningitis?",
            "Meningitis is the inflammation of the protective membranes covering the brain and spinal cord.",
            "Is meningitis contagious?",
            "Yes, meningitis can be contagious through saliva and nasal secretions.",
            "How can I prevent meningitis?"
        ],
        "knowledge": "Meningitis Meningitis  In 2013 meningitis resulted in 303,000 deaths – down from 464,000 deaths in 1990.  In 2010 it was estimated that meningitis resulted in 420,000 deaths, excluding cryptococcal meningitis. Bacterial meningitis occurs in about 3 people per 100,000 annually in Western countries.  Population-wide studies have shown that viral meningitis is more common, at 10. 9 per 100,000, and occurs more often in the summer.  In Brazil, the rate of bacterial meningitis is higher, at 45. 8 per 100,000 annually Meningitis Meningitis",
        "response": "You can prevent meningitis by practicing good hygiene, avoiding close contact with infected people, and getting vaccinated."
    },
    {
        "dialog": [
            "Hi Medi, I just had a spinal tap for meningitis. What should I do now?",
            "After a spinal tap, you should rest for at least 24 hours and avoid strenuous activities.",
            "Can I take a shower?",
            "You should avoid showering for 24 hours to reduce the risk of infection.",
            "What about my diet?",
            "You should avoid caffeine and alcohol for 24 hours and drink plenty of fluids to prevent dehydration.",
            "Can I take any pain medication?",
            "Yes, you can take over-the-counter pain medication such as acetaminophen or ibuprofen if you experience any headache or discomfort.",
            "What signs should I watch out for?"
        ],
        "knowledge": "Lumbar Puncture Lumbar Puncture  A lumbar puncture, also known as a spinal tap, is a medical procedure used to collect cerebrospinal fluid (CSF) for diagnostic testing. A spinal needle is inserted through the lower back and into the spinal canal.",
        "response": "You should watch out for any signs of infection such as fever, headache, or redness at the injection site. If you experience any of these symptoms, contact your doctor immediately."
    },
    {
        "dialog": [
            "Hi Medi, I recently recovered from meningitis. What should I do to prevent it from happening again?",
            "To prevent meningitis from happening again, you should practice good hygiene, wash your hands frequently, and avoid close contact with infected people.",
            "Is there anything I can do to boost my immune system?",
            "Yes, you can try to maintain a healthy lifestyle by eating a balanced diet, getting enough sleep, and exercising regularly.",
            "Are there any vaccines that I can take?",
            "Yes, there are vaccines available that can protect against certain types of meningitis such as meningococcal and pneumococcal meningitis.",
            "Where can I get these vaccines?",
            "You can get these vaccines at your doctor's office or at a local health clinic.",
            "Can I still get meningitis even if I have been vaccinated?"
        ],
        "knowledge": "Meningitis Meningitis  In 2013 meningitis resulted in 303,000 deaths – down from 464,000 deaths in 1990.  In 2010 it was estimated that meningitis resulted in 420,000 deaths, excluding cryptococcal meningitis. Bacterial meningitis occurs in about 3 people per 100,000 annually in Western countries.  Population-wide studies have shown that viral meningitis is more common, at 10. 9 per 100,000, and occurs more often in the summer.  In Brazil, the rate of bacterial meningitis is higher, at 45. 8 per 100,000 annually Meningitis Meningitis",
        "response": "While vaccines can greatly reduce the risk of meningitis, they are not 100% effective. It is important to continue practicing good hygiene and avoiding close contact with infected people to further reduce the risk of getting meningitis."
    },
    {
        "dialog": [
            "Hello Medi, I'm feeling very sick lately.",
            "What are your symptoms?",
            "I have a headache, neck stiffness, and a high fever.",
            "Based on your symptoms, it's possible you have meningitis. You should see a doctor immediately.",
            "What is meningitis?",
            "Meningitis is an inflammation of the membranes surrounding your brain and spinal cord. It can be caused by a virus or bacteria.",
            "Is it contagious?",
            "Yes, it can be spread through close contact with an infected person or by touching surfaces contaminated with the bacteria or virus.",
            "What should I do if I have been in contact with someone who has meningitis?"
        ],
        "knowledge": "Meningitis Meningitis  In 2013 meningitis resulted in 303,000 deaths – down from 464,000 deaths in 1990.  In 2010 it was estimated that meningitis resulted in 420,000 deaths, excluding cryptococcal meningitis. Bacterial meningitis occurs in about 3 people per 100,000 annually in Western countries.  Population-wide studies have shown that viral meningitis is more common, at 10. 9 per 100,000, and occurs more often in the summer.  In Brazil, the rate of bacterial meningitis is higher, at 45. 8 per 100,000 annually Meningitis Meningitis",
        "response": "You should see a doctor immediately, especially if you have been in contact with someone who has meningitis."
    },
    {
        "dialog": [
            "Hi Medi, I have some questions about meningitis.",
            "Sure, what would you like to know?",
            "What causes meningitis?",
            "Meningitis can be caused by a bacterial or viral infection. Other causes include an injury to the head, cancer, or certain medications.",
            "What are the symptoms of meningitis?",
            "Symptoms may include headache, fever, stiff neck, nausea, vomiting, sensitivity to light, and confusion or difficulty concentrating.",
            "Can meningitis be prevented?",
            "Yes, there are vaccines available for certain types of bacterial meningitis. You can also reduce your risk of getting meningitis by practicing good hygiene and avoiding sharing personal items like utensils or towels.",
            "Is meningitis treatable?"
        ],
        "knowledge": "Meningitis Meningitis  In 2013 meningitis resulted in 303,000 deaths – down from 464,000 deaths in 1990.  In 2010 it was estimated that meningitis resulted in 420,000 deaths, excluding cryptococcal meningitis. Bacterial meningitis occurs in about 3 people per 100,000 annually in Western countries.  Population-wide studies have shown that viral meningitis is more common, at 10. 9 per 100,000, and occurs more often in the summer.  In Brazil, the rate of bacterial meningitis is higher, at 45. 8 per 100,000 annually Meningitis Meningitis",
        "response": "You're welcome! Let me know if you have any other questions."
    },
    {
        "dialog": [
            "Hi Medi, I recently had meningitis and I'm wondering what I can do to prevent it from happening again.",
            "I'm sorry to hear that. There are several steps you can take to prevent meningitis from recurring. Firstly, ensure that you have completed your vaccination schedule. Additionally, practice good hygiene and avoid sharing personal items like utensils or towels. Ensure that you get plenty of sleep, eat nutritious foods, and exercise regularly.",
            "Are there any long-term complications I should be aware of?",
            "Yes, meningitis can cause a number of complications, including brain damage, hearing loss, and seizures. You should talk to your doctor about any concerns you have about long-term effects.",
            "Thank you for the advice, Medi.",
            "You're welcome. Don't hesitate to reach out if you have any other questions or concerns."
        ],
        "knowledge": "Meningitis Meningitis  In 2013 meningitis resulted in 303,000 deaths – down from 464,000 deaths in 1990.  In 2010 it was estimated that meningitis resulted in 420,000 deaths, excluding cryptococcal meningitis. Bacterial meningitis occurs in about 3 people per 100,000 annually in Western countries.  Population-wide studies have shown that viral meningitis is more common, at 10. 9 per 100,000, and occurs more often in the summer.  In Brazil, the rate of bacterial meningitis is higher, at 45. 8 per 100,000 annually Meningitis Meningitis",
        "response": "Thank you, Medi. You've been very helpful."
    },
    {
        "dialog": [
            "Hi Medi, I think I have meningitis.",
            "Hi, I'm Medi, a healthcare chatbot. Based on your symptoms, please describe the symptoms you are experiencing.",
            "I am experiencing a severe headache, high fever, and a stiff neck. My throat is also sore, and I feel nauseous.",
            "I understand. Based on your symptoms, you may have meningitis. I suggest you go to the hospital immediately.",
            "What should I do while I wait for the ambulance?",
            "While waiting for the ambulance, you should lie down in a dark, quiet room and avoid any activity that may cause your condition to worsen.",
            "Is there anything else I should do to prevent meningitis?",
            "Meningitis can be prevented by a vaccine that is available in most countries. You should also avoid sharing drinks, food, or personal items with others to prevent the spread of meningitis.",
            "Thank you for your help, Medi."
        ],
        "knowledge": "Meningitis Meningitis  In 2013 meningitis resulted in 303,000 deaths – down from 464,000 deaths in 1990.  In 2010 it was estimated that meningitis resulted in 420,000 deaths, excluding cryptococcal meningitis. Bacterial meningitis occurs in about 3 people per 100,000 annually in Western countries.  Population-wide studies have shown that viral meningitis is more common, at 10. 9 per 100,000, and occurs more often in the summer.  In Brazil, the rate of bacterial meningitis is higher, at 45. 8 per 100,000 annually Meningitis Meningitis",
        "response": "I advise you to go to the hospital immediately."
    },
    {
        "dialog": [
            "Hi Medi, I have a question about meningitis.",
            "Hi, I'm Medi, a healthcare chatbot. What would you like to know about meningitis?",
            "What are the symptoms of meningitis?",
            "The symptoms of meningitis include a severe headache, high fever, a stiff neck, nausea, and vomiting. You may also experience a rash that looks like red or purple spots.",
            "How is meningitis treated?",
            "Meningitis is usually treated with antibiotics, which are given intravenously in a hospital. It's important to start treatment as soon as possible to prevent serious complications.",
            "Can meningitis be prevented?",
            "Yes, meningitis can be prevented by a vaccine that is available in most countries. You should also avoid sharing drinks, food, or personal items with others to prevent the spread of meningitis.",
            "Thank you for your help, Medi."
        ],
        "knowledge": "Meningitis Meningitis  In 2013 meningitis resulted in 303,000 deaths – down from 464,000 deaths in 1990.  In 2010 it was estimated that meningitis resulted in 420,000 deaths, excluding cryptococcal meningitis. Bacterial meningitis occurs in about 3 people per 100,000 annually in Western countries.  Population-wide studies have shown that viral meningitis is more common, at 10. 9 per 100,000, and occurs more often in the summer.  In Brazil, the rate of bacterial meningitis is higher, at 45. 8 per 100,000 annually Meningitis Meningitis",
        "response": "Meningitis can be prevented by a vaccine that is available in most countries."
    },
    {
        "dialog": [
            "Hi Medi, I just underwent a spinal tap to diagnose meningitis.",
            "Hi, I'm Medi, a healthcare chatbot. How are you feeling now?",
            "I'm feeling a bit weak and dizzy. What can I do to help my recovery?",
            "After a spinal tap, it's important to rest and drink plenty of fluids to prevent dehydration. You should also avoid strenuous activities and follow any other advice given by your doctor.",
            "Are there any specific foods I should eat to help my recovery?",
            "You should eat foods that are high in protein, such as chicken, fish, beans, and lentils, and foods that are high in vitamins and minerals, such as fruits and vegetables. Avoid fatty or greasy foods, as these can cause nausea and vomiting.",
            "What kind of physical activity can I do to help my recovery?",
            "After a spinal tap, you should avoid any strenuous activity, including exercise, for at least 24 hours. After that, you can gradually increase your activity level, starting with light exercise such as walking or stretching.",
            "Thank you for your help, Medi."
        ],
        "knowledge": "Meningitis Meningitis  In 2013 meningitis resulted in 303,000 deaths – down from 464,000 deaths in 1990.  In 2010 it was estimated that meningitis resulted in 420,000 deaths, excluding cryptococcal meningitis. Bacterial meningitis occurs in about 3 people per 100,000 annually in Western countries.  Population-wide studies have shown that viral meningitis is more common, at 10. 9 per 100,000, and occurs more often in the summer.  In Brazil, the rate of bacterial meningitis is higher, at 45. 8 per 100,000 annually Meningitis Meningitis",
        "response": "After a spinal tap, it's important to rest and drink plenty of fluids to prevent dehydration."
    },
    {
        "dialog": [
            "Hello Medi, I feel really sick.",
            "I'm sorry to hear that. Can you tell me about your symptoms?",
            "I have a terrible headache, and my neck is really stiff.",
            "Okay. It sounds like you may have meningitis. You should go to the emergency room right away.",
            "What is meningitis, Medi?",
            "Meningitis is an inflammation of the membranes that surround the brain and spinal cord.",
            "Is it contagious?",
            "Yes, it can be spread through close contact with an infected person's saliva or mucus.",
            "Thank you, Medi."
        ],
        "knowledge": "Meningitis Meningitis  In 2013 meningitis resulted in 303,000 deaths – down from 464,000 deaths in 1990.  In 2010 it was estimated that meningitis resulted in 420,000 deaths, excluding cryptococcal meningitis. Bacterial meningitis occurs in about 3 people per 100,000 annually in Western countries.  Population-wide studies have shown that viral meningitis is more common, at 10. 9 per 100,000, and occurs more often in the summer.  In Brazil, the rate of bacterial meningitis is higher, at 45. 8 per 100,000 annually Meningitis Meningitis",
        "response": "You're welcome. Please go to the emergency room right away to get treatment."
    },
    {
        "dialog": [
            "Hi Medi, I have some questions about meningitis.",
            "Of course. I'm here to help. What would you like to know?",
            "Can you explain what causes meningitis?",
            "Meningitis can be caused by viruses, bacteria, or other microorganisms.",
            "What are the symptoms of meningitis?",
            "The symptoms of meningitis include a high fever, headache, stiff neck, vomiting, and a rash.",
            "Is there a vaccine for meningitis?",
            "Yes, there is a vaccine for certain types of meningitis. You should talk to your doctor about getting vaccinated.",
            "Thank you, Medi."
        ],
        "knowledge": "Meningitis Meningitis  In 2013 meningitis resulted in 303,000 deaths – down from 464,000 deaths in 1990.  In 2010 it was estimated that meningitis resulted in 420,000 deaths, excluding cryptococcal meningitis. Bacterial meningitis occurs in about 3 people per 100,000 annually in Western countries.  Population-wide studies have shown that viral meningitis is more common, at 10. 9 per 100,000, and occurs more often in the summer.  In Brazil, the rate of bacterial meningitis is higher, at 45. 8 per 100,000 annually Meningitis Meningitis",
        "response": "You're welcome. If you have any other questions, feel free to ask."
    },
    {
        "dialog": [
            "Hi Medi, I just got back from the hospital after being treated for meningitis.",
            "I'm glad to hear that you're okay. Did the doctors give you any advice for aftercare?",
            "Yes, they did. They told me to rest a lot and to avoid stress.",
            "That's a good idea. You should also try to eat a healthy diet and get some exercise.",
            "What kind of exercise should I do?",
            "You should start with light exercise, like walking or yoga. Once you feel better, you can gradually increase the intensity of your workout.",
            "Will I recover fully from meningitis?",
            "Most people recover fully from meningitis, but some may experience long-term effects such as hearing loss or memory problems.",
            "Thank you, Medi."
        ],
        "knowledge": "Meningitis Meningitis  In 2013 meningitis resulted in 303,000 deaths – down from 464,000 deaths in 1990.  In 2010 it was estimated that meningitis resulted in 420,000 deaths, excluding cryptococcal meningitis. Bacterial meningitis occurs in about 3 people per 100,000 annually in Western countries.  Population-wide studies have shown that viral meningitis is more common, at 10. 9 per 100,000, and occurs more often in the summer.  In Brazil, the rate of bacterial meningitis is higher, at 45. 8 per 100,000 annually Meningitis Meningitis",
        "response": "You're welcome. I hope you have a speedy recovery."
    },
    {
        "dialog": [
            "Hi Medi, I'm feeling very sick today, can you help me?",
            "Of course! What symptoms are you experiencing?",
            "I have a headache and a stiff neck, and my fever won't go down.",
            "It sounds like you may have meningitis. You should seek medical attention immediately.",
            "What is meningitis?",
            "It's an inflammation of the membranes surrounding your brain and spinal cord. It can be caused by bacteria or viruses.",
            "How serious is it?",
            "It can be very serious and even life-threatening if left untreated. That's why it's important to see a doctor right away.",
            "Okay, I'll do that. Thank you!"
        ],
        "knowledge": "Meningitis Meningitis  In 2013 meningitis resulted in 303,000 deaths – down from 464,000 deaths in 1990.  In 2010 it was estimated that meningitis resulted in 420,000 deaths, excluding cryptococcal meningitis. Bacterial meningitis occurs in about 3 people per 100,000 annually in Western countries.  Population-wide studies have shown that viral meningitis is more common, at 10. 9 per 100,000, and occurs more often in the summer.  In Brazil, the rate of bacterial meningitis is higher, at 45. 8 per 100,000 annually Meningitis Meningitis",
        "response": "It's an inflammation of the membranes surrounding your brain and spinal cord. It can be caused by bacteria or viruses, and can be very serious and even life-threatening if left untreated. That's why it's important to see a doctor right away."
    },
    {
        "dialog": [
            "Hello Medi, I have some questions about meningitis.",
            "Sure, I'm happy to help. What do you want to know?",
            "What are the symptoms of meningitis?",
            "The symptoms of meningitis can include fever, headache, stiff neck, sensitivity to light, confusion, and in severe cases, seizures and coma.",
            "Can meningitis be treated?",
            "Yes, meningitis can be treated with antibiotics if it's caused by bacteria, or antiviral medication if it's caused by a virus. It's important to seek medical attention as soon as possible.",
            "Is meningitis contagious?",
            "Yes, some forms of meningitis can be contagious, especially bacterial meningitis.",
            "How can I protect myself from meningitis?"
        ],
        "knowledge": "Meningitis Meningitis  In 2013 meningitis resulted in 303,000 deaths – down from 464,000 deaths in 1990.  In 2010 it was estimated that meningitis resulted in 420,000 deaths, excluding cryptococcal meningitis. Bacterial meningitis occurs in about 3 people per 100,000 annually in Western countries.  Population-wide studies have shown that viral meningitis is more common, at 10. 9 per 100,000, and occurs more often in the summer.  In Brazil, the rate of bacterial meningitis is higher, at 45. 8 per 100,000 annually Meningitis Meningitis",
        "response": "The symptoms of meningitis can include fever, headache, stiff neck, sensitivity to light, confusion, and in severe cases, seizures and coma. Meningitis can be treated with antibiotics if it's caused by bacteria, or antiviral medication if it's caused by a virus. It's also important to practice good hygiene, avoid close contact with anyone who has meningitis, and get vaccinated to protect yourself."
    },
    {
        "dialog": [
            "Hi Medi, I just had a lumbar puncture. What should I do now?",
            "After a lumbar puncture, it's important to rest and avoid strenuous activity for the next 24 hours.",
            "What about my diet?",
            "It's important to stay hydrated and drink plenty of fluids, but avoid caffeine and alcohol. Stick to plain water or sports drinks.",
            "What about exercise?",
            "You should avoid exercise for the next 24 hours, but after that, it's safe to resume normal physical activities.",
            "How can I manage the pain?",
            "You may experience some pain or discomfort at the puncture site. Over-the-counter pain relievers like acetaminophen or ibuprofen can help. If the pain persists, contact your doctor.",
            "Okay, thank you for the advice."
        ],
        "knowledge": "Meningitis Meningitis  In 2013 meningitis resulted in 303,000 deaths – down from 464,000 deaths in 1990.  In 2010 it was estimated that meningitis resulted in 420,000 deaths, excluding cryptococcal meningitis. Bacterial meningitis occurs in about 3 people per 100,000 annually in Western countries.  Population-wide studies have shown that viral meningitis is more common, at 10. 9 per 100,000, and occurs more often in the summer.  In Brazil, the rate of bacterial meningitis is higher, at 45. 8 per 100,000 annually Meningitis Meningitis",
        "response": "After a lumbar puncture, it's important to rest and avoid strenuous activity for the next 24 hours. Stay hydrated and drink plenty of fluids, but avoid caffeine and alcohol. You should avoid exercise for the next 24 hours, but after that, it's safe to resume normal physical activities. Over-the-counter pain relievers like acetaminophen or ibuprofen can help with any pain or discomfort at the puncture site."
    },
    {
        "dialog": [
            "Hi Medi, I feel terrible and not sure what is wrong",
            "I am here to help. Can you please tell me your symptoms?",
            "I have a bad headache and nausea. My neck is also stiff and hurts to move.",
            "Based on your symptoms, it could be a sign of meningitis. You should seek medical attention immediately",
            "What is meningitis and why is it so dangerous?",
            "Meningitis is the inflammation of the protective membranes around the brain and spinal cord. It can be caused by viruses or bacteria and can be deadly if not treated. It's important to seek medical attention right away",
            "How can I prevent meningitis?",
            "You can reduce your risk by getting vaccinated, practicing good hygiene, and avoiding close contact with people who are sick.",
            "Thanks for the information, Medi. I'm going to see a doctor now."
        ],
        "knowledge": "Meningitis Meningitis  In 2013 meningitis resulted in 303,000 deaths – down from 464,000 deaths in 1990.  In 2010 it was estimated that meningitis resulted in 420,000 deaths, excluding cryptococcal meningitis. Bacterial meningitis occurs in about 3 people per 100,000 annually in Western countries.  Population-wide studies have shown that viral meningitis is more common, at 10. 9 per 100,000, and occurs more often in the summer.  In Brazil, the rate of bacterial meningitis is higher, at 45. 8 per 100,000 annually Meningitis Meningitis",
        "response": "You're welcome. Please seek medical attention immediately, as meningitis can be deadly if not treated quickly."
    },
    {
        "dialog": [
            "Hi Medi, I've been diagnosed with meningitis. What should I expect?",
            "I'm sorry to hear that. The symptoms of meningitis can be severe and include headache, fever, and neck stiffness. You may also experience nausea and vomiting.",
            "What kind of treatment is available?",
            "Treatment depends on the cause of meningitis. Bacterial meningitis is typically treated with antibiotics, while viral meningitis is usually treated with rest and fluids. Your doctor will recommend the best course of action.",
            "Will I need to be hospitalized?",
            "It's possible, particularly if you have bacterial meningitis. Your doctor will make that decision based on the severity of your symptoms and other factors.",
            "What can I do to help my recovery?",
            "Rest is important, as well as staying hydrated and taking any medications your doctor prescribes. It's also important to follow up with your doctor and attend any scheduled appointments.",
            "Thanks for the advice, Medi. I'll do my best to take care of myself."
        ],
        "knowledge": "Meningitis Meningitis  In 2013 meningitis resulted in 303,000 deaths – down from 464,000 deaths in 1990.  In 2010 it was estimated that meningitis resulted in 420,000 deaths, excluding cryptococcal meningitis. Bacterial meningitis occurs in about 3 people per 100,000 annually in Western countries.  Population-wide studies have shown that viral meningitis is more common, at 10. 9 per 100,000, and occurs more often in the summer.  In Brazil, the rate of bacterial meningitis is higher, at 45. 8 per 100,000 annually Meningitis Meningitis",
        "response": "You're welcome. I hope you have a speedy recovery and don't hesitate to contact your doctor if you have any concerns."
    },
    {
        "dialog": [
            "Hi Medi, I recently recovered from meningitis. What lifestyle changes should I make to prevent it from happening again?",
            "I'm glad to hear you recovered. It's important to maintain good hygiene and try to avoid close contact with people who are sick. You can also boost your immune system by eating a healthy diet and getting regular exercise.",
            "Are there any vaccines I should consider?",
            "Yes, there are vaccines available to protect against some strains of meningitis, including the meningococcal vaccine. Talk to your doctor to see if you're a candidate for these vaccines.",
            "What are the long-term effects of meningitis?",
            "Unfortunately, meningitis can cause long-term complications, including hearing loss, brain damage, and seizures. It's important to follow up with your doctor for any ongoing symptoms or concerns.",
            "Thanks for the information, Medi. I'll do my best to take care of myself going forward.",
            "You're welcome. I'm here if you have any other questions."
        ],
        "knowledge": "Meningitis Meningitis  In 2013 meningitis resulted in 303,000 deaths – down from 464,000 deaths in 1990.  In 2010 it was estimated that meningitis resulted in 420,000 deaths, excluding cryptococcal meningitis. Bacterial meningitis occurs in about 3 people per 100,000 annually in Western countries.  Population-wide studies have shown that viral meningitis is more common, at 10. 9 per 100,000, and occurs more often in the summer.  In Brazil, the rate of bacterial meningitis is higher, at 45. 8 per 100,000 annually Meningitis Meningitis",
        "response": "You're welcome. Don't hesitate to reach out if you have any other questions or concerns."
    },
    {
        "dialog": [
            "Hello Medi, I'm feeling very sick and I don't know what to do.",
            "Hello, I'm here to help you. Can you describe your symptoms?",
            "I have a really bad headache, a stiff neck, and I'm feeling very sick to my stomach.",
            "Based on your symptoms, it might be meningitis. Have you been in contact with anyone who has had this disease?",
            "No, I haven't been in contact with anyone sick.",
            "That's good to hear, but meningitis is a serious condition. You should see a doctor right away to get tested.",
            "Ok, thank you for your help. I'll do that. ",
            "You're welcome. It's important to take care of yourself, especially when it comes to your health.",
            "What is meningitis?"
        ],
        "knowledge": "Meningitis Meningitis  In 2013 meningitis resulted in 303,000 deaths – down from 464,000 deaths in 1990.  In 2010 it was estimated that meningitis resulted in 420,000 deaths, excluding cryptococcal meningitis. Bacterial meningitis occurs in about 3 people per 100,000 annually in Western countries.  Population-wide studies have shown that viral meningitis is more common, at 10. 9 per 100,000, and occurs more often in the summer.  In Brazil, the rate of bacterial meningitis is higher, at 45. 8 per 100,000 annually Meningitis Meningitis",
        "response": "Meningitis is an inflammation of the membranes that surround and protect the brain and spinal cord, and it can be caused by either bacteria or viruses."
    },
    {
        "dialog": [
            "Hey Medi, I have a question about meningitis.",
            "Sure, what do you want to know?",
            "How is meningitis treated?",
            "That depends on the cause of the meningitis. If it's bacterial meningitis, it's usually treated with antibiotics.",
            "What about viral meningitis?",
            "Viral meningitis typically resolves on its own within a few weeks. Treatment focuses on relieving symptoms, such as pain and fever.",
            "Thanks for the information, Medi.",
            "You're welcome. Is there anything else you need to know?",
            "No, that's all. Thanks again!"
        ],
        "knowledge": "Meningitis Meningitis  In 2013 meningitis resulted in 303,000 deaths – down from 464,000 deaths in 1990.  In 2010 it was estimated that meningitis resulted in 420,000 deaths, excluding cryptococcal meningitis. Bacterial meningitis occurs in about 3 people per 100,000 annually in Western countries.  Population-wide studies have shown that viral meningitis is more common, at 10. 9 per 100,000, and occurs more often in the summer.  In Brazil, the rate of bacterial meningitis is higher, at 45. 8 per 100,000 annually Meningitis Meningitis",
        "response": "You're welcome. If you have any other questions, don't hesitate to ask."
    },
    {
        "dialog": [
            "Hi Medi, I recently had meningitis and I'm wondering what I can do to prevent it in the future.",
            "I'm sorry to hear that. There are some precautions you can take to reduce your risk of getting meningitis again.",
            "What kind of precautions?",
            "You can practice good hygiene, such as washing your hands regularly, covering your mouth when you cough or sneeze, and avoiding close contact with sick people. You can also get vaccinated against certain strains of meningitis.",
            "Thanks for the advice, Medi.",
            "You're welcome. Taking care of your health is important, especially after an illness like meningitis.",
            "One last question, what are the symptoms of meningitis?",
            "The symptoms of meningitis include headache, fever, stiff neck, nausea, and vomiting. In some cases, a rash may develop. If you experience any of these symptoms, you should see a doctor right away.",
            "Thanks for your help, Medi."
        ],
        "knowledge": "Meningitis Meningitis  In 2013 meningitis resulted in 303,000 deaths – down from 464,000 deaths in 1990.  In 2010 it was estimated that meningitis resulted in 420,000 deaths, excluding cryptococcal meningitis. Bacterial meningitis occurs in about 3 people per 100,000 annually in Western countries.  Population-wide studies have shown that viral meningitis is more common, at 10. 9 per 100,000, and occurs more often in the summer.  In Brazil, the rate of bacterial meningitis is higher, at 45. 8 per 100,000 annually Meningitis Meningitis",
        "response": "You're welcome. If you have any other questions, don't hesitate to ask."
    }
]