[
    {
        "dialog": [
            "Hello Medi, I'm worried about my heart health",
            "Hi there, what are your concerns about your heart health?",
            "I don't know if I'm at risk for cardiovascular disease",
            "Some factors that increase the risk of cardiovascular diseases include high blood pressure, high cholesterol, smoking, and diabetes. Do you have any of these conditions?",
            "I have high blood pressure and high cholesterol",
            "In that case, it's important to manage these conditions to reduce the risk of cardiovascular disease. Have you talked to your doctor about treatment options?",
            "Yes, I have. I'm taking medication but I'm also interested in lifestyle changes",
            "Great, lifestyle changes such as eating a healthy diet, exercising regularly, and quitting smoking can also help manage these conditions",
            "Ok, thanks for the advice Medi. One more question - how often should I get my cholesterol checked?"
        ],
        "knowledge": "Cardiovascular disease Cardiovascular disease Ankle-brachial index , high-sensitivity C-reactive protein , and coronary artery calcium, are also of unclear benefit in those without symptoms as of 2018. The NIH recommends lipid testing in children beginning at the age of 2 if there is a family history of heart disease or lipid problems. It is hoped that early testing will improve lifestyle factors in those at risk such as diet and exercise. Screening and selection for primary prevention interventions has traditionally been done through absolute risk using a variety of scores. This stratification has separated people who receive the lifestyle interventions from the medication. The number and variety of risk scores available for use has multiplied, but their efficacy according to a 2016 review was unclear due to lack of external validation or impact analysis. Risk stratification models often lack sensitivity for population groups and do not account for the large number of negative events among the intermediate and low risk groups Cardiovascular disease Cardiovascular disease",
        "response": "It's recommended to get your cholesterol checked at least once every 5 years, but your doctor may recommend more frequent testing depending on your specific situation."
    },
    {
        "dialog": [
            "Hello Medi, I just had a stent put in. What should I know about my diet now?",
            "Hi there. After a stent procedure, it's important to follow a heart-healthy diet to reduce the risk of further heart problems.",
            "What's a heart-healthy diet?",
            "A heart-healthy diet typically includes plenty of fruits, vegetables, whole grains, lean protein sources and healthy fats. It's also important to limit saturated fat, trans fat, sodium, and added sugar",
            "Are there any specific foods I should avoid?",
            "It's best to avoid processed foods, sugary drinks, and high-fat meats. Instead, opt for natural, whole foods like fruits, veggies, and lean protein sources",
            "Got it, thanks. What about exercise?",
            "Exercise is also important for heart health. It's best to talk to your doctor about what types of exercise are safe for you after your procedure.",
            "Thanks, Medi. One more question - how soon can I go back to work?"
        ],
        "knowledge": "Cardiovascular disease Cardiovascular disease Ankle-brachial index , high-sensitivity C-reactive protein , and coronary artery calcium, are also of unclear benefit in those without symptoms as of 2018. The NIH recommends lipid testing in children beginning at the age of 2 if there is a family history of heart disease or lipid problems. It is hoped that early testing will improve lifestyle factors in those at risk such as diet and exercise. Screening and selection for primary prevention interventions has traditionally been done through absolute risk using a variety of scores. This stratification has separated people who receive the lifestyle interventions from the medication. The number and variety of risk scores available for use has multiplied, but their efficacy according to a 2016 review was unclear due to lack of external validation or impact analysis. Risk stratification models often lack sensitivity for population groups and do not account for the large number of negative events among the intermediate and low risk groups Cardiovascular disease Cardiovascular disease",
        "response": "It's best to talk to your doctor about when it's safe for you to return to work after your procedure, as it will depend on your specific situation."
    },
    {
        "dialog": [
            "Hey Medi, I'm just wondering - can cardiovascular disease be prevented?",
            "Yes, there are many things you can do to reduce your risk of developing cardiovascular disease. One of the most important is to maintain a healthy lifestyle",
            "What does a healthy lifestyle look like?",
            "A healthy lifestyle includes eating a healthy diet, exercising regularly, quitting smoking, managing stress, and getting enough sleep",
            "Is there anything I should eat or avoid specifically?",
            "It's best to eat a diet that is rich in fruits, vegetables, whole grains, lean protein sources, and healthy fats. You should also limit your intake of foods high in saturated fat, trans fat, and added sugar",
            "Great, thanks for the advice. One more question - I have a family history of cardiovascular disease. What should I do?",
            "If you have a family history of cardiovascular disease, it's important to talk to your doctor about your risk. They may recommend additional testing or treatment options to help reduce your risk",
            "Ok, I'll do that. Thanks, Medi"
        ],
        "knowledge": "Cardiovascular disease Cardiovascular disease Ankle-brachial index , high-sensitivity C-reactive protein , and coronary artery calcium, are also of unclear benefit in those without symptoms as of 2018. The NIH recommends lipid testing in children beginning at the age of 2 if there is a family history of heart disease or lipid problems. It is hoped that early testing will improve lifestyle factors in those at risk such as diet and exercise. Screening and selection for primary prevention interventions has traditionally been done through absolute risk using a variety of scores. This stratification has separated people who receive the lifestyle interventions from the medication. The number and variety of risk scores available for use has multiplied, but their efficacy according to a 2016 review was unclear due to lack of external validation or impact analysis. Risk stratification models often lack sensitivity for population groups and do not account for the large number of negative events among the intermediate and low risk groups Cardiovascular disease Cardiovascular disease",
        "response": "You're welcome! It's always a good idea to talk to your doctor if you have a family history of cardiovascular disease to help manage your risk."
    },
    {
        "dialog": [
            "Hello Medi, I feel a tightness in my chest.",
            "Thank you for reaching out. Can you describe your symptoms more closely?",
            "I feel a squeezing or tightness in my chest that lasts several minutes",
            "This sounds concerning. Have you experienced this before?",
            "I have had it a few times now",
            "Based on your symptoms, it could indicate a cardiovascular issue. I recommend scheduling an appointment with your doctor as soon as possible.",
            "What tests or assessments should I get done, Medi?",
            "Your doctor may recommend an echocardiogram, stress test or blood tests to evaluate your heart's health",
            "Thank you for your help, Medi!"
        ],
        "knowledge": "Cardiovascular Disease Cardiovascular Disease  Ankle-brachial index, high-sensitivity C-reactive protein, and coronary artery calcium, are also of unclear benefit in those without symptoms as of 2018. The NIH recommends lipid testing in children beginning at the age of 2 if there is a family history of heart disease or lipid problems.  It is hoped that early testing will improve lifestyle factors in those at risk such as diet and exercise. Screening and selection for primary prevention interventions has traditionally been done through absolute risk using a variety of scores .  This stratification has separated people who receive the lifestyle interventions  from the medication .  The number and variety of risk scores available for use has multiplied, but their efficacy according to a 2016 review was unclear due to lack of external validation or impact analysis.  Risk stratification models often lack sensitivity for population groups and do not account for the large number of negative events among the intermediate and low risk groups Cardiovascular Disease Cardiovascular Disease",
        "response": "You're welcome! I suggest you see your doctor and they may recommend an echocardiogram, stress test or blood tests to evaluate your heart's health"
    },
    {
        "dialog": [
            "Hey Medi, what is high-sensitivity C-reactive protein?",
            "Great question! It is a protein that your liver produces in response to inflammation.",
            "Is it related to cardiovascular disease?",
            "Yes, studies have shown that people with higher levels of hs-CRP tend to have a higher risk of heart disease.",
            "How can I lower my hs-CRP levels?",
            "Some ways to lower your hs-CRP levels include exercise, quitting smoking, eating a healthy diet, and managing stress.",
            "Are there any medications I can take?",
            "While there are medications available to lower hs-CRP levels, it is important to consult your doctor before taking them.",
            "Thanks for the information, Medi!"
        ],
        "knowledge": "High-Sensitivity C-Reactive Protein High-Sensitivity C-Reactive Protein  hs-CRP is a protein that your liver produces in response to inflammation.  It is a marker of inflammation in the body and is measured through a blood test. Elevated levels of hs-CRP have been linked to a higher risk of cardiovascular disease.  While there are medications available to lower hs-CRP levels, lifestyle changes such as exercise, quitting smoking, eating a healthy diet, and managing stress can also help lower levels of hs-CRP. High-Sensitivity C-Reactive Protein High-Sensitivity C-Reactive Protein",
        "response": "You're welcome! Remember that lifestyle changes such as exercise, quitting smoking, eating a healthy diet, and managing stress can also help lower hs-CRP levels."
    },
    {
        "dialog": [
            "Hi Medi, I recently had a heart procedure. Any advice for my diet?",
            "Certainly! Following a heart procedure, it's important to eat a healthy, balanced diet.",
            "What kind of foods should I eat?",
            "Foods that are high in fiber, lean protein, and healthy fats are all good choices. Examples include fruits, vegetables, whole grains, fish, and nuts.",
            "Are there any foods I should avoid?",
            "It's best to avoid foods that are high in saturated fats, trans fats, and cholesterol. These include fried foods, processed snacks, and fatty meats.",
            "What about salt?",
            "Reducing your salt intake can also be beneficial for heart health. Try to limit your sodium intake to less than 2,300 milligrams per day.",
            "Thank you, Medi. This is very helpful!"
        ],
        "knowledge": "Heart Procedures Heart Procedures  Following a heart procedure, it's important to eat a healthy, balanced diet. Foods that are high in fiber, lean protein, and healthy fats are all good choices. Examples include fruits, vegetables, whole grains, fish, and nuts.  It's best to avoid foods that are high in saturated fats, trans fats, and cholesterol. These include fried foods, processed snacks, and fatty meats.  Reducing your salt intake can also be beneficial for heart health. Try to limit your sodium intake to less than 2,300 milligrams per day. Heart Procedures Heart Procedures",
        "response": "You're welcome! Remember to eat a diet high in fiber, lean protein, and healthy fats while avoiding foods high in saturated fats, trans fats, and cholesterol. Also, try to limit your sodium intake to less than 2,300 milligrams per day."
    },
    {
        "dialog": [
            "Hi Medi, I have some concerns about heart disease.",
            "Sure, what are your symptoms or questions?",
            "I don't have any symptoms, but I'm worried about my risk of developing it.",
            "It's good that you're being proactive. Have you had any lipid testing done?",
            "No, I haven't. When should I get tested?",
            "If there's a family history of heart disease or lipid problems, the NIH recommends testing starting at age 2.",
            "Got it. Do you recommend lifestyle changes or medication to reduce the risk?",
            "Screening and selection for primary prevention interventions has traditionally been done through absolute risk using a variety of scores. The best approach depends on your individual risk factors.",
            "What are some common risk factors?"
        ],
        "knowledge": "Cardiovascular disease Ankle-brachial index, high-sensitivity C-reactive protein, and coronary artery calcium, are also of unclear benefit in those without symptoms as of 2018. It is hoped that early testing will improve lifestyle factors in those at risk such as diet and exercise. Screening and selection for primary prevention interventions has traditionally been done through absolute risk using a variety of scores. This stratification has separated people who receive the lifestyle interventions from the medication. The number and variety of risk scores available for use has multiplied, but their efficacy according to a 2016 review was unclear due to lack of external validation or impact analysis. Risk stratification models often lack sensitivity for population groups and do not account for the large number of negative events among the intermediate and low risk groups Cardiovascular disease Cardiovascular disease",
        "response": "Some common risk factors include high blood pressure, high cholesterol, smoking, obesity, lack of physical activity, and family history."
    },
    {
        "dialog": [
            "Hi Medi, I just had a heart procedure done. What should I do now?",
            "Congratulations on taking care of your health. What kind of procedure did you have?",
            "I had a stent put in to help with a blocked artery.",
            "That's great news. You should focus on making lifestyle changes to prevent further complications. Have you talked to your doctor about a cardiac rehab program?",
            "No, I haven't. What is that?",
            "Cardiac rehab is a customized program that includes exercise, education, and counseling to help improve heart health. It's usually covered by insurance after a heart procedure.",
            "That sounds helpful. What about diet?",
            "It's important to focus on a heart-healthy diet that's low in saturated fat, trans fat, and cholesterol. Aim for plenty of fruits, vegetables, whole grains, and lean protein.",
            "Got it. Thanks for the advice, Medi. Is there anything else I should keep in mind?"
        ],
        "knowledge": "Cardiovascular disease Ankle-brachial index, high-sensitivity C-reactive protein, and coronary artery calcium, are also of unclear benefit in those without symptoms as of 2018. It is hoped that early testing will improve lifestyle factors in those at risk such as diet and exercise. Screening and selection for primary prevention interventions has traditionally been done through absolute risk using a variety of scores. This stratification has separated people who receive the lifestyle interventions from the medication. The number and variety of risk scores available for use has multiplied, but their efficacy according to a 2016 review was unclear due to lack of external validation or impact analysis. Risk stratification models often lack sensitivity for population groups and do not account for the large number of negative events among the intermediate and low risk groups Cardiovascular disease Cardiovascular disease",
        "response": "Make sure to follow your doctor's instructions for any medications or follow-up appointments. And don't hesitate to reach out to your doctor if you have any concerns or questions."
    },
    {
        "dialog": [
            "Medi, I've been feeling really stressed lately.",
            "I'm sorry to hear that. What kind of stress are you experiencing?",
            "Just general life stress from work and family. It's been hard to manage.",
            "I understand. Stress can have a significant impact on heart health. Have you tried any stress-management techniques?",
            "No, I haven't. What do you recommend?",
            "There are many techniques to try, including deep breathing exercises, meditation, yoga, and progressive muscle relaxation.",
            "Those sound interesting. What about physical activity?",
            "Exercise is a great way to manage stress and improve heart health. Aim for at least 30 minutes of moderate-intensity exercise most days of the week.",
            "Thanks for the advice, Medi. Is there anything else I should know?"
        ],
        "knowledge": "Cardiovascular disease Ankle-brachial index, high-sensitivity C-reactive protein, and coronary artery calcium, are also of unclear benefit in those without symptoms as of 2018. It is hoped that early testing will improve lifestyle factors in those at risk such as diet and exercise. Screening and selection for primary prevention interventions has traditionally been done through absolute risk using a variety of scores. This stratification has separated people who receive the lifestyle interventions from the medication. The number and variety of risk scores available for use has multiplied, but their efficacy according to a 2016 review was unclear due to lack of external validation or impact analysis. Risk stratification models often lack sensitivity for population groups and do not account for the large number of negative events among the intermediate and low risk groups Cardiovascular disease Cardiovascular disease",
        "response": "Make sure to prioritize self-care, such as getting enough sleep and eating a balanced diet. And don't hesitate to reach out to a therapist or mental health professional for additional support."
    },
    {
        "dialog": [
            "Hi Medi, I have concerns about my heart health",
            "Alright, can you tell me more about your symptoms?",
            "I feel chest pain and shortness of breath",
            "These are serious symptoms. I recommend you to visit a doctor immediately",
            "I am afraid of the medical procedures, is there any way to prevent heart diseases?",
            "Yes, you could maintain a healthy lifestyle, have a balanced diet and regular physical exercise.",
            "What kind of diets and exercises do you recommend?",
            "Avoid processed food, and eat more fruits and vegetables. Cardio exercises such as running, swimming and cycling are great choices.",
            "Thanks, Medi. Do you have any recommendation for a heart-friendly meal?"
        ],
        "knowledge": "Cardiovascular disease Cardiovascular disease Ankle-brachial index, high-sensitivity C-reactive protein, and coronary artery calcium, are also of unclear benefit in those without symptoms as of 2018. The NIH recommends lipid testing in children beginning at the age of 2 if there is a family history of heart disease or lipid problems. It is hoped that early testing will improve lifestyle factors in those at risk such as diet and exercise. Screening and selection for primary prevention interventions have traditionally been done through absolute risk using a variety of scores. This stratification has separated people who receive the lifestyle interventions from the medication. The number and variety of risk scores available for use have multiplied, but their efficacy according to a 2016 review was unclear due to lack of external validation or impact analysis. Risk stratification models often lack sensitivity for population groups and do not account for the large number of negative events among the intermediate and low risk groups Cardiovascular disease Cardiovascular disease",
        "response": "Sure, you could try roasted salmon with steamed vegetables and quinoa salad. It's delicious and heart-friendly."
    },
    {
        "dialog": [
            "Hi Medi, I have a question about heart disease",
            "Sure, what do you want to know?",
            "What are the risk factors for heart disease?",
            "Some of the major risk factors are high blood pressure, high cholesterol, smoking, diabetes, obesity, and a sedentary lifestyle",
            "How can I reduce the risk of getting heart disease?",
            "You can reduce your risk by maintaining a healthy lifestyle, exercising regularly, quitting smoking, and managing any chronic conditions such as high blood pressure or diabetes",
            "What kind of exercises can I do to reduce my risk?",
            "Any kind of exercise that gets your heart rate up, such as walking, running, cycling, and swimming",
            "Thanks for the advice. How long should I exercise every day?"
        ],
        "knowledge": "Cardiovascular disease Cardiovascular disease Ankle-brachial index, high-sensitivity C-reactive protein, and coronary artery calcium, are also of unclear benefit in those without symptoms as of 2018. The NIH recommends lipid testing in children beginning at the age of 2 if there is a family history of heart disease or lipid problems. It is hoped that early testing will improve lifestyle factors in those at risk such as diet and exercise. Screening and selection for primary prevention interventions have traditionally been done through absolute risk using a variety of scores. This stratification has separated people who receive the lifestyle interventions from the medication. The number and variety of risk scores available for use have multiplied, but their efficacy according to a 2016 review was unclear due to lack of external validation or impact analysis. Risk stratification models often lack sensitivity for population groups and do not account for the large number of negative events among the intermediate and low risk groups Cardiovascular disease Cardiovascular disease",
        "response": "I recommend at least 30 minutes of moderate-intensity exercise, such as brisk walking, every day."
    },
    {
        "dialog": [
            "Hi Medi, I recently had a heart procedure done and I need some advice",
            "Of course, I will do my best to help. What do you need advice on?",
            "I need some advice on my diet and exercise",
            "After a heart procedure, it's important to follow a heart-healthy diet. You should eat plenty of fruits and vegetables, whole grains, lean proteins, and healthy fats. As for exercise, start with light activities such as walking and gradually increase over time.",
            "Is there anything I should avoid",
            "Avoid processed and high-fat foods, and limit your salt and sugar intake. Avoid strenuous exercise or lifting heavy weights for a few weeks after the procedure",
            "Thanks for the advice, Medi. Do you have any other suggestions?",
            "Yes, make sure to take all your medications as prescribed by your doctor, and attend all your follow-up appointments",
            "Okay, thanks for your help."
        ],
        "knowledge": "Cardiovascular disease Cardiovascular disease Ankle-brachial index, high-sensitivity C-reactive protein, and coronary artery calcium, are also of unclear benefit in those without symptoms as of 2018. The NIH recommends lipid testing in children beginning at the age of 2 if there is a family history of heart disease or lipid problems. It is hoped that early testing will improve lifestyle factors in those at risk such as diet and exercise. Screening and selection for primary prevention interventions have traditionally been done through absolute risk using a variety of scores. This stratification has separated people who receive the lifestyle interventions from the medication. The number and variety of risk scores available for use have multiplied, but their efficacy according to a 2016 review was unclear due to lack of external validation or impact analysis. Risk stratification models often lack sensitivity for population groups and do not account for the large number of negative events among the intermediate and low risk groups Cardiovascular disease Cardiovascular disease",
        "response": "You're welcome. If you have any more questions or concerns, don't hesitate to ask."
    },
    {
        "dialog": [
            "Hi, Medi. I've been feeling some chest pain lately.",
            "Hello! I'm here to help you. Can you give me more details about your chest pain?",
            "Yes, it's a sharp, stabbing pain that comes and goes.",
            "Based on your description, you may be experiencing angina. You should see a doctor as soon as possible.",
            "Is angina a serious condition?",
            "Yes, it's a serious condition that requires medical attention. If left untreated, it can lead to a heart attack.",
            "Thank you, Medi. I will see a doctor right away.",
            "You're welcome. I hope you feel better soon.",
            "Can you give me more information about angina?"
        ],
        "knowledge": "Angina Angina  Angina is a type of chest pain caused by reduced blood flow to the heart. It's a common symptom of coronary artery disease, which occurs when the arteries that supply blood to your heart become narrowed or blocked. There are several types of angina, including stable angina, unstable angina, and variant angina. Stable angina is the most common type and occurs during physical or emotional stress. Unstable angina is a medical emergency that requires prompt treatment. Variant angina is rare and occurs at rest. Treatment for angina may include lifestyle changes, medications, and medical procedures to improve blood flow to the heart. ",
        "response": "Angina is a type of chest pain caused by reduced blood flow to the heart. It's a common symptom of coronary artery disease, which occurs when the arteries that supply blood to your heart become narrowed or blocked."
    },
    {
        "dialog": [
            "Hi, Medi. I have a family history of heart disease and I'm worried about my own risk.",
            "Hi! It's good that you're being proactive about your health. Have you had any symptoms or been diagnosed with any heart conditions?",
            "No, I haven't. But I want to know what I can do to prevent heart disease.",
            "That's a great question. Lifestyle changes are the most effective way to prevent heart disease. This includes exercising regularly, eating a healthy diet, quitting smoking, and managing stress.",
            "What about medications?",
            "Medications may be prescribed for certain individuals with a high risk of developing heart disease. However, lifestyle changes are still recommended as the first line of defense.",
            "Thank you, Medi. I will start making these lifestyle changes.",
            "Great to hear that! It's never too early to start taking care of your heart.",
            "What are some warning signs of heart disease?"
        ],
        "knowledge": "Heart disease Heart disease  Heart disease is a term used to describe several conditions that affect the heart. These conditions include coronary artery disease, heart failure, arrhythmias, and heart valve problems. The most common cause of heart disease is a buildup of plaque in the arteries, which can lead to blockages and reduce blood flow to the heart. Symptoms of heart disease may include chest pain, shortness of breath, dizziness, fatigue, and swelling in the legs, ankles, or feet. Risk factors for heart disease include smoking, high blood pressure, high cholesterol, diabetes, obesity, a family history of heart disease, and age.",
        "response": "Symptoms of heart disease may include chest pain, shortness of breath, dizziness, fatigue, and swelling in the legs, ankles, or feet."
    },
    {
        "dialog": [
            "Hi, Medi. I just had a heart procedure done and I want to know what I can do to recover well.",
            "Hi there! It's good to hear that you're taking an active role in your recovery. Can you tell me more about the procedure you had?",
            "It was an angioplasty. They cleared a blockage in one of my arteries.",
            "Okay, after an angioplasty, it's important to take it easy for a few days. You should avoid strenuous activities and follow your doctor's instructions for medication.",
            "What about my diet?",
            "You should follow a heart-healthy diet, which includes plenty of fruits, vegetables, whole grains, and lean proteins. You should also limit your intake of saturated and trans fats, sodium, and added sugars.",
            "What about exercise?",
            "You should gradually work your way back to your normal physical activity level. It's important to start with light exercise, such as walking, and gradually increase the intensity and duration.",
            "Thank you, Medi. I will follow these guidelines."
        ],
        "knowledge": "Angioplasty Angioplasty  Angioplasty is a medical procedure used to treat narrowed or blocked arteries. During the procedure, a catheter with a balloon on the end is inserted into the affected artery. The balloon is then inflated to widen the artery and improve blood flow. In some cases, a stent may be placed in the artery to help keep it open. Recovery time after an angioplasty varies depending on the individual and the extent of the procedure. It's important to follow your doctor's instructions for medication, physical activity, and diet to promote a smooth recovery.",
        "response": "Recovery time after an angioplasty varies depending on the individual and the extent of the procedure. It's important to follow your doctor's instructions for medication, physical activity, and diet to promote a smooth recovery."
    },
    {
        "dialog": [
            "Hello Medi, I have some symptoms, can you help me?",
            "Sure, Tell me what symptoms you have",
            "I often feel dizzy and have shortness of breath",
            "Okay, do you have any other symptoms?",
            "Yes, I also feel a tightness in my chest.",
            "I see, It might be related to your heart. Have you seen a doctor yet?",
            "No, I haven't. I didn't know what to do",
            "I suggest you should see a doctor as soon as possible to check your heart condition",
            "I'm very worried now, can you give me some advice to relieve my symptoms?"
        ],
        "knowledge": "Cardiovascular disease Cardiovascular disease  Ankle-brachial index , high-sensitivity C-reactive protein , and coronary artery calcium, are also of unclear benefit in those without symptoms as of 2018. The NIH recommends lipid testing in children beginning at the age of 2 if there is a family history of heart disease or lipid problems.  It is hoped that early testing will improve lifestyle factors in those at risk such as diet and exercise. Screening and selection for primary prevention interventions has traditionally been done through absolute risk using a variety of scores .  This stratification has separated people who receive the lifestyle interventions  from the medication .  The number and variety of risk scores available for use has multiplied, but their efficacy according to a 2016 review was unclear due to lack of external validation or impact analysis.  Risk stratification models often lack sensitivity for population groups and do not account for the large number of negative events among the intermediate and low risk groups Cardiovascular disease Cardiovascular disease",
        "response": "I advise you to seek medical help immediately. It may be related to heart disease. You should make sure that you are under the care of a doctor."
    },
    {
        "dialog": [
            "Hello Medi, I have a question about heart disease",
            "Sure, I'm here to help you. What's your question?",
            "How can I reduce the risk of heart disease?",
            "There are several things you can do to reduce the risk of heart disease",
            "What are they?",
            "Having a healthy diet, regular exercises, and maintaining a healthy weight can help reduce the risk of heart disease.",
            "Is there anything else?",
            "Yes, quit smoking and control your blood pressure and cholesterol levels",
            "Thank you for the advice. Is there anything else I should know about heart disease?"
        ],
        "knowledge": "Cardiovascular disease Cardiovascular disease  Ankle-brachial index , high-sensitivity C-reactive protein , and coronary artery calcium, are also of unclear benefit in those without symptoms as of 2018. The NIH recommends lipid testing in children beginning at the age of 2 if there is a family history of heart disease or lipid problems.  It is hoped that early testing will improve lifestyle factors in those at risk such as diet and exercise. Screening and selection for primary prevention interventions has traditionally been done through absolute risk using a variety of scores .  This stratification has separated people who receive the lifestyle interventions  from the medication .  The number and variety of risk scores available for use has multiplied, but their efficacy according to a 2016 review was unclear due to lack of external validation or impact analysis.  Risk stratification models often lack sensitivity for population groups and do not account for the large number of negative events among the intermediate and low risk groups Cardiovascular disease Cardiovascular disease",
        "response": "Yes, there are many things such as keeping your blood pressure and cholesterol levels under control, avoiding smoking, and managing stress which can prevent heart disease."
    },
    {
        "dialog": [
            "Hello Medi, I have had heart surgery recently. Can you give me some advice?",
            "Sure, What can I help you with?",
            "What should I do to recover fast after surgery?",
            "You should follow the doctor's advice and take your medications as prescribed. Also, you should gradually resume your daily activities but avoid heavy lifting or strenuous exercise.",
            "What about my diet?",
            "You should maintain a healthy diet that is low in sodium and cholesterol, and you should avoid fatty and fried foods",
            "Anything else?",
            "Yes, you should make sure to get plenty of rest and sleep to help your body recover.",
            "Thank you. Do you have any advice for long-term care after surgery?"
        ],
        "knowledge": "Cardiovascular disease Cardiovascular disease  Ankle-brachial index , high-sensitivity C-reactive protein , and coronary artery calcium, are also of unclear benefit in those without symptoms as of 2018. The NIH recommends lipid testing in children beginning at the age of 2 if there is a family history of heart disease or lipid problems.  It is hoped that early testing will improve lifestyle factors in those at risk such as diet and exercise. Screening and selection for primary prevention interventions has traditionally been done through absolute risk using a variety of scores .  This stratification has separated people who receive the lifestyle interventions  from the medication .  The number and variety of risk scores available for use has multiplied, but their efficacy according to a 2016 review was unclear due to lack of external validation or impact analysis.  Risk stratification models often lack sensitivity for population groups and do not account for the large number of negative events among the intermediate and low risk groups Cardiovascular disease Cardiovascular disease",
        "response": "You should keep following the doctor's instructions after surgery and take your medications as prescribed. Also, maintain a balanced and healthy diet, exercise regularly, and monitor your blood pressure and cholesterol levels frequently to prevent further complications."
    },
    {
        "dialog": [
            "Hi Medi, I feel chest pain and shortness of breath.",
            "That sounds serious.What is your age and gender?",
            "I'm 50 years old and a female. What should I do?",
            "Please take a rest and take a deep breath.Do you have a history of heart disease?",
            "Yes, my family has a history of heart problems and I had high blood pressure.",
            "Then you should go to the hospital immediately. I suspect you may have a heart attack.",
            "What kind of treatment will I receive?",
            "You may need medication or surgery. It depends on the severity of your condition.",
            "Okay, I will go to the hospital right now. Thank you, Medi."
        ],
        "knowledge": "Cardiovascular disease Cardiovascular disease  Ankle-brachial index , high-sensitivity C-reactive protein , and coronary artery calcium, are also of unclear benefit in those without symptoms as of 2018. The NIH recommends lipid testing in children beginning at the age of 2 if there is a family history of heart disease or lipid problems.  It is hoped that early testing will improve lifestyle factors in those at risk such as diet and exercise. Screening and selection for primary prevention interventions has traditionally been done through absolute risk using a variety of scores .  This stratification has separated people who receive the lifestyle interventions  from the medication .  The number and variety of risk scores available for use has multiplied, but their efficacy according to a 2016 review was unclear due to lack of external validation or impact analysis.  Risk stratification models often lack sensitivity for population groups and do not account for the large number of negative events among the intermediate and low risk groups Cardiovascular disease Cardiovascular disease",
        "response": "I suggest you go to the hospital immediately. It's possible that you have a heart attack, and the treatment depends on the severity of your condition."
    },
    {
        "dialog": [
            "Hi Medi, I have some questions about high blood pressure.",
            "Okay, I will do my best to answer your questions.",
            "What is high blood pressure and what are the symptoms?",
            "High blood pressure is a condition where the force of the blood against the artery wall is too high. The symptoms are usually unnoticeable",
            "What causes high blood pressure?",
            "There are many causes such as smoking, obesity, high salt intake, stress, and family history",
            "Is high blood pressure dangerous?",
            "It depends on how high the blood pressure is and the duration of the high blood pressure. It can cause long-term damage to the blood vessels and organs. ",
            "How can I prevent high blood pressure?"
        ],
        "knowledge": "High blood pressure High blood pressure  High blood pressure is a condition in which the force of the blood against the artery wall is too high. There are usually no symptoms. Long-term high blood pressure is a major risk factor for coronary artery disease, stroke, heart failure, atrial fibrillation, peripheral arterial disease, vision loss, chronic kidney disease, and dementia.  The causes of high blood pressure are multifactorial, and include smoking, obesity, high salt intake, stress, and family history.  Prevention includes modifying risk factors such as losing weight, quitting smoking, eating a healthy diet, reducing salt intake, and exercising regularly High blood pressure High blood pressure",
        "response": "High blood pressure is a condition where the force of the blood against the artery wall is too high, and its symptoms are usually unnoticeable. There are many causes such as smoking, obesity, high salt intake, stress, and family history. You can prevent it by modifying your lifestyle, such as losing weight, quitting smoking, eating healthier, and reducing salt intake."
    },
    {
        "dialog": [
            "Hello, Medi. I just had a heart bypass surgery. What should I do now?",
            "Congratulations on successfully undergoing the surgery. You need to take care of your health and maintain a healthy lifestyle",
            "Can you give me advice on how to maintain a healthy lifestyle?",
            "Sure, you should exercise regularly, eat a healthy diet, avoid smoking and drinking alcohol, and take your medications as prescribed by your doctor",
            "What kind of foods should I eat?",
            "You should eat foods low in saturated fat and high in fiber. Such as vegetables, fruits, whole grains, lean protein, and low-fat dairy products",
            "What should I avoid?",
            "You should avoid foods high in saturated and trans fats, sodium, and added sugar. Such as fast food, fried food, processed food, sugary drinks, and red meat",
            "Thank you, Medi. Your advice is very helpful."
        ],
        "knowledge": "Cardiovascular disease Cardiovascular disease  Ankle-brachial index , high-sensitivity C-reactive protein , and coronary artery calcium, are also of unclear benefit in those without symptoms as of 2018. The NIH recommends lipid testing in children beginning at the age of 2 if there is a family history of heart disease or lipid problems.  It is hoped that early testing will improve lifestyle factors in those at risk such as diet and exercise. Screening and selection for primary prevention interventions has traditionally been done through absolute risk using a variety of scores .  This stratification has separated people who receive the lifestyle interventions  from the medication .  The number and variety of risk scores available for use has multiplied, but their efficacy according to a 2016 review was unclear due to lack of external validation or impact analysis.  Risk stratification models often lack sensitivity for population groups and do not account for the large number of negative events among the intermediate and low risk groups Cardiovascular disease Cardiovascular disease",
        "response": "To maintain a healthy lifestyle after the surgery, you should exercise regularly, eat a healthy diet, avoid smoking and drinking alcohol, and take your medications as prescribed by your doctor. You should eat foods low in saturated fat and high in fiber, such as vegetables, fruits, whole grains, lean protein, and low-fat dairy products. You should avoid foods high in saturated and trans fats, sodium, and added sugar, such as fast food, fried food, processed food, sugary drinks, and red meat."
    },
    {
        "dialog": [
            "Hello Medi, I need your help. I feel some discomfort in my chest.",
            "Hello, I understand your concern. Can you describe the discomfort?",
            "It feels like pressure or squeezing, and sometimes it spreads to my arm and shoulder.",
            "This could be a sign of a heart problem. Have you seen a doctor?",
            "No, I haven't seen a doctor yet.",
            "I would suggest that you see a doctor as soon as possible for an evaluation.",
            "What kind of evaluation should I expect from the doctor?",
            "They may recommend an electrocardiogram or other tests to check your heart.",
            "Okay, thank you for your advice, Medi."
        ],
        "knowledge": "Cardiovascular disease Cardiovascular disease  Ankle-brachial index , high-sensitivity C-reactive protein , and coronary artery calcium, are also of unclear benefit in those without symptoms as of 2018. The NIH recommends lipid testing in children beginning at the age of 2 if there is a family history of heart disease or lipid problems.  It is hoped that early testing will improve lifestyle factors in those at risk such as diet and exercise. Screening and selection for primary prevention interventions has traditionally been done through absolute risk using a variety of scores .  This stratification has separated people who receive the lifestyle interventions  from the medication .  The number and variety of risk scores available for use has multiplied, but their efficacy according to a 2016 review was unclear due to lack of external validation or impact analysis.  Risk stratification models often lack sensitivity for population groups and do not account for the large number of negative events among the intermediate and low risk groups Cardiovascular disease Cardiovascular disease",
        "response": "You're welcome. You should see a doctor as soon as possible for evaluation, which may include an electrocardiogram or other heart tests."
    },
    {
        "dialog": [
            "Hi Medi, my father has a history of heart disease, and I'm worried about my own risk.",
            "Hello, I understand your concern. Have you talked to your doctor about this?",
            "No, I haven't discussed it with my doctor yet.",
            "I would recommend that you schedule an appointment to discuss your family history and any other risk factors you may have.",
            "What are some other risk factors for heart disease?",
            "Other risk factors include high blood pressure, high cholesterol, smoking, diabetes, and obesity.",
            "If I am at risk, are there any lifestyle changes I can make to reduce my risk?",
            "Yes, making lifestyle changes such as eating a healthy diet, exercising regularly, quitting smoking if you smoke, and managing any chronic conditions like high blood pressure or diabetes can help reduce your risk.",
            "Thank you, Medi. I will schedule an appointment with my doctor."
        ],
        "knowledge": "Cardiovascular disease Cardiovascular disease  Ankle-brachial index , high-sensitivity C-reactive protein , and coronary artery calcium, are also of unclear benefit in those without symptoms as of 2018. The NIH recommends lipid testing in children beginning at the age of 2 if there is a family history of heart disease or lipid problems.  It is hoped that early testing will improve lifestyle factors in those at risk such as diet and exercise. Screening and selection for primary prevention interventions has traditionally been done through absolute risk using a variety of scores .  This stratification has separated people who receive the lifestyle interventions  from the medication .  The number and variety of risk scores available for use has multiplied, but their efficacy according to a 2016 review was unclear due to lack of external validation or impact analysis.  Risk stratification models often lack sensitivity for population groups and do not account for the large number of negative events among the intermediate and low risk groups Cardiovascular disease Cardiovascular disease",
        "response": "You're welcome. It's a good idea to schedule an appointment with your doctor to discuss your family history and any other risk factors you may have. Making lifestyle changes such as eating a healthy diet, exercising regularly, quitting smoking if you smoke, and managing any chronic conditions like high blood pressure or diabetes can help reduce your risk."
    },
    {
        "dialog": [
            "Hi Medi, I just had a heart procedure and I'm not sure what to expect in terms of recovery.",
            "Hello, I'm here to help. What kind of procedure did you have?",
            "I had an angioplasty to clear a blocked artery.",
            "Okay, after your procedure, you will need to take it easy for a few days and avoid any strenuous activity.",
            "How long will I need to rest?",
            "It depends on your individual situation and your doctor's recommendations, but most people can return to normal activity within a week or two.",
            "Are there any lifestyle changes I should make to prevent another blockage?",
            "Yes, making lifestyle changes such as eating a heart-healthy diet, exercising regularly, quitting smoking if you smoke, and taking any medications prescribed by your doctor can help prevent another blockage.",
            "Thank you for your advice, Medi."
        ],
        "knowledge": "Cardiovascular disease Cardiovascular disease  Ankle-brachial index , high-sensitivity C-reactive protein , and coronary artery calcium, are also of unclear benefit in those without symptoms as of 2018. The NIH recommends lipid testing in children beginning at the age of 2 if there is a family history of heart disease or lipid problems.  It is hoped that early testing will improve lifestyle factors in those at risk such as diet and exercise. Screening and selection for primary prevention interventions has traditionally been done through absolute risk using a variety of scores .  This stratification has separated people who receive the lifestyle interventions  from the medication .  The number and variety of risk scores available for use has multiplied, but their efficacy according to a 2016 review was unclear due to lack of external validation or impact analysis.  Risk stratification models often lack sensitivity for population groups and do not account for the large number of negative events among the intermediate and low risk groups Cardiovascular disease Cardiovascular disease",
        "response": "You're welcome. After your angioplasty, you should take it easy for a few days and make lifestyle changes such as eating a heart-healthy diet, exercising regularly, quitting smoking if you smoke, and taking any medications prescribed by your doctor to help prevent another blockage."
    },
    {
        "dialog": [
            "Hi there, Medi. I'm experiencing chest pain.",
            "Hello. I'm a healthcare chatbot. Can you describe your symptoms further?",
            "It feels like a tightness or pressure in my chest that comes and goes.",
            "Chest pain can be a sign of several conditions, including heart disease. You should see a doctor immediately.",
            "What are some other signs of heart disease?",
            "Some other signs of heart disease include shortness of breath, fatigue, irregular heartbeat, and dizziness.",
            "What can I do to prevent heart disease?",
            "You can reduce your risk of heart disease by maintaining a healthy diet, regular physical activity, and avoiding smoking and excessive alcohol intake.",
            "Thank you, Medi. I will see a doctor right away."
        ],
        "knowledge": "Cardiovascular disease Cardiovascular disease  Ankle-brachial index, high-sensitivity C-reactive protein, and coronary artery calcium, are also of unclear benefit in those without symptoms as of 2018. The NIH recommends lipid testing in children beginning at the age of 2 if there is a family history of heart disease or lipid problems. It is hoped that early testing will improve lifestyle factors in those at risk such as diet and exercise. Screening and selection for primary prevention interventions has traditionally been done through absolute risk using a variety of scores. This stratification has separated people who receive the lifestyle interventions from the medication. The number and variety of risk scores available for use has multiplied, but their efficacy according to a 2016 review was unclear due to lack of external validation or impact analysis. Risk stratification models often lack sensitivity for population groups and do not account for the large number of negative events among the intermediate and low risk groups Cardiovascular disease Cardiovascular disease",
        "response": "You're welcome. I'm glad to hear that you'll see a doctor soon. It's better to be safe than sorry."
    },
    {
        "dialog": [
            "Hi, Medi. I have a question about lipid testing.",
            "Hello. I'm here to help. What would you like to know?",
            "When should children begin lipid testing?",
            "According to the NIH, lipid testing should begin at age 2 in children with a family history of heart disease or lipid problems.",
            "How can we improve lifestyle factors in those who are at risk?",
            "Early testing can help improve lifestyle factors. It allows for earlier intervention with diet and exercise.",
            "What are some other ways to prevent heart disease?",
            "Other ways to prevent heart disease include regular physical activity, maintaining a healthy diet, and avoiding smoking and excessive alcohol intake.",
            "Thank you for your help, Medi."
        ],
        "knowledge": "Cardiovascular disease Cardiovascular disease  Ankle-brachial index, high-sensitivity C-reactive protein, and coronary artery calcium, are also of unclear benefit in those without symptoms as of 2018. The NIH recommends lipid testing in children beginning at the age of 2 if there is a family history of heart disease or lipid problems. It is hoped that early testing will improve lifestyle factors in those at risk such as diet and exercise. Screening and selection for primary prevention interventions has traditionally been done through absolute risk using a variety of scores. This stratification has separated people who receive the lifestyle interventions from the medication. The number and variety of risk scores available for use has multiplied, but their efficacy according to a 2016 review was unclear due to lack of external validation or impact analysis. Risk stratification models often lack sensitivity for population groups and do not account for the large number of negative events among the intermediate and low risk groups Cardiovascular disease Cardiovascular disease",
        "response": "You're welcome. Let me know if you have any more questions."
    },
    {
        "dialog": [
            "Hi, Medi. I recently underwent a medical procedure to treat heart disease.",
            "Hello. As a chatbot, I'm not able to give medical advice. However, I can give you some general advice based on the context you provide.",
            "What kind of advice can you give?",
            "It's important to follow your doctor's instructions regarding post-procedure care. This may include lifestyle modifications such as diet and exercise, as well as any medications prescribed.",
            "What kind of diet should I follow?",
            "A heart-healthy diet is recommended, which includes plenty of fruits and vegetables, lean protein sources, and whole grains. It's also important to limit saturated and trans fats, as well as sodium and added sugars.",
            "What kind of physical activity is safe after a medical procedure?",
            "Your doctor can advise you on safe levels of physical activity after a medical procedure. In general, light to moderate exercise such as walking is recommended, with more strenuous activity to be added gradually as tolerated.",
            "Thank you, Medi. That's helpful information."
        ],
        "knowledge": "Cardiovascular disease Cardiovascular disease  Ankle-brachial index, high-sensitivity C-reactive protein, and coronary artery calcium, are also of unclear benefit in those without symptoms as of 2018. The NIH recommends lipid testing in children beginning at the age of 2 if there is a family history of heart disease or lipid problems. It is hoped that early testing will improve lifestyle factors in those at risk such as diet and exercise. Screening and selection for primary prevention interventions has traditionally been done through absolute risk using a variety of scores. This stratification has separated people who receive the lifestyle interventions from the medication. The number and variety of risk scores available for use has multiplied, but their efficacy according to a 2016 review was unclear due to lack of external validation or impact analysis. Risk stratification models often lack sensitivity for population groups and do not account for the large number of negative events among the intermediate and low risk groups Cardiovascular disease Cardiovascular disease",
        "response": "You're welcome. Always follow your doctor's advice and reach out if you have any questions or concerns."
    },
    {
        "dialog": [
            "Hi Medi, I have a family history of heart disease. What should I do?",
            "Hello! You should start with lipid testing if you are 2 years old or older.",
            "What are the benefits of early testing?",
            "Early testing will help you improve your lifestyle habits such as diet and exercise.",
            "Are there any tests that are not beneficial for people without symptoms?",
            "Yes, tests like ankle-brachial index, high-sensitivity C-reactive protein, and coronary artery calcium, are not beneficial.",
            "Why is risk stratification important?",
            "Risk stratification helps in choosing between lifestyle interventions and medication.",
            "How are people selected for primary prevention interventions?"
        ],
        "knowledge": "Cardiovascular disease Cardiovascular disease Ankle-brachial index, high-sensitivity C-reactive protein, and coronary artery calcium, are also of unclear benefit in those without symptoms as of 2018. The NIH recommends lipid testing in children beginning at the age of 2 if there is a family history of heart disease or lipid problems. It is hoped that early testing will improve lifestyle factors in those at risk such as diet and exercise. Screening and selection for primary prevention interventions has traditionally been done through absolute risk using a variety of scores. This stratification has separated people who receive the lifestyle interventions from the medication. The number and variety of risk scores available for use has multiplied, but their efficacy according to a 2016 review was unclear due to lack of external validation or impact analysis. Risk stratification models often lack sensitivity for population groups and do not account for the large number of negative events among the intermediate and low risk groups Cardiovascular disease Cardiovascular disease",
        "response": "Selection for primary prevention interventions is traditionally done through absolute risk using a variety of scores."
    },
    {
        "dialog": [
            "Hi Medi, I recently had a medical procedure and I'm wondering about the lifestyle changes I should make.",
            "Hello! There are many lifestyle changes you can make. What type of procedure did you have?",
            "I had a surgery to remove a tumor.",
            "After a surgery like that, it is important to start with light physical activity and slowly increase it.",
            "What kind of physical activity do you recommend?",
            "Walking or swimming are great activities to start with.",
            "What about my diet?",
            "A balanced diet with plenty of fruits and vegetables, lean proteins, and whole grains is ideal.",
            "Are there any foods I should avoid?"
        ],
        "knowledge": "Cardiovascular disease Cardiovascular disease Ankle-brachial index, high-sensitivity C-reactive protein, and coronary artery calcium, are also of unclear benefit in those without symptoms as of 2018. The NIH recommends lipid testing in children beginning at the age of 2 if there is a family history of heart disease or lipid problems. It is hoped that early testing will improve lifestyle factors in those at risk such as diet and exercise. Screening and selection for primary prevention interventions has traditionally been done through absolute risk using a variety of scores. This stratification has separated people who receive the lifestyle interventions from the medication. The number and variety of risk scores available for use has multiplied, but their efficacy according to a 2016 review was unclear due to lack of external validation or impact analysis. Risk stratification models often lack sensitivity for population groups and do not account for the large number of negative events among the intermediate and low risk groups Cardiovascular disease Cardiovascular disease",
        "response": "Foods high in sugar, salt, and saturated fat should be avoided after a medical procedure."
    },
    {
        "dialog": [
            "Hi Medi, I'm worried about my risk of developing cardiovascular disease.",
            "Hello! What is your current lifestyle like?",
            "I don't exercise as much as I should and I don't eat very healthy.",
            "Those are two important factors in reducing your risk of cardiovascular disease. You should aim for at least 30 minutes of exercise a day.",
            "What kind of exercise do you recommend?",
            "Any type of physical activity that gets your heart rate up is great, whether it's walking, running, swimming, or cycling.",
            "What about my diet?",
            "A heart-healthy diet includes plenty of fruits and vegetables, whole grains, lean proteins, and healthy fats.",
            "What are some foods that are high in healthy fats?"
        ],
        "knowledge": "Cardiovascular disease Cardiovascular disease Ankle-brachial index, high-sensitivity C-reactive protein, and coronary artery calcium, are also of unclear benefit in those without symptoms as of 2018. The NIH recommends lipid testing in children beginning at the age of 2 if there is a family history of heart disease or lipid problems. It is hoped that early testing will improve lifestyle factors in those at risk such as diet and exercise. Screening and selection for primary prevention interventions has traditionally been done through absolute risk using a variety of scores. This stratification has separated people who receive the lifestyle interventions from the medication. The number and variety of risk scores available for use has multiplied, but their efficacy according to a 2016 review was unclear due to lack of external validation or impact analysis. Risk stratification models often lack sensitivity for population groups and do not account for the large number of negative events among the intermediate and low risk groups Cardiovascular disease Cardiovascular disease",
        "response": "Other ways to reduce your risk of cardiovascular disease include not smoking, maintaining a healthy weight, and managing stress levels."
    }
]