[
    {
        "dialog": [
            "Hello Medi, I am feeling quite sick, can you help me?",
            "Of course, I am here to help. Can you tell me about your symptoms?",
            "I have a headache, sore throat, runny nose, cough, and a fever.",
            "Based on your symptoms, you may have the flu. You should get tested for Influenza.",
            "What kind of test do I need to take?",
            "You can take a nasal or throat swab. It's recommended for anyone hospitalized or connected to an influenza case.",
            "How can I prevent the flu?",
            "You can prevent the flu by getting the flu vaccine, washing your hands, and avoiding contact with infected individuals.",
            "Thanks, Medi. I will take your advice."
        ],
        "knowledge": "Influenza Influenza  Common ways of collecting samples for testing include nasal and throat swabs.  Samples may be taken from the lower respiratory tract if infection has cleared the upper but not lower respiratory tract.  Influenza testing is recommended for anyone hospitalized with symptoms resembling influenza during flu season or who is connected to an influenza case.  For severe cases, earlier diagnosis improves patient outcome.  Diagnostic methods that can identify influenza include viral cultures, antibody- and antigen-detecting tests, and nucleic acid-based tests. Viruses can be grown in a culture of mammalian cells or embryonated eggs for 3–10 days to monitor cytopathic effect.  Final confirmation can then be done via antibody staining, hemadsorption using red blood cells, or immunofluorescence microscopy Influenza Influenza",
        "response": "You are welcome. I hope you feel better soon."
    },
    {
        "dialog": [
            "Hello Medi, can you explain to me what Influenza is?",
            "Sure, Influenza is a viral infection that affects the respiratory system.",
            "What are the symptoms of Influenza?",
            "The symptoms include fever, cough, sore throat, headache, muscle aches, fatigue, runny or stuffy nose, vomiting, and diarrhea.",
            "Is Influenza dangerous?",
            "Influenza can be serious, especially for young children, the elderly, and those with weakened immune systems.",
            "How can I prevent Influenza?",
            "You can prevent Influenza by getting vaccinated, washing your hands, and avoiding contact with infected individuals.",
            "Thank you for explaining, Medi."
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "You're welcome. I'm glad I could help."
    },
    {
        "dialog": [
            "Hello Medi, I recently had a medical procedure. What should I do now?",
            "It depends on the procedure. Can you explain more about it?",
            "I had a surgery on my stomach.",
            "After surgery you should take it easy and follow the doctor's instructions. You may have dietary restrictions, exercise limitations, and you may need to take medication.",
            "What kind of exercises can I do after surgery?",
            "You should start with light exercises such as walking and gradually increase them as you recover. It's important to listen to your body and not push yourself too hard.",
            "What foods should I eat after surgery?",
            "You should eat foods that are easy to digest, such as soups, yogurt, and mashed potatoes. Avoid foods that are high in fat and sugar.",
            "Thanks for the advice, Medi."
        ],
        "knowledge": "Surgery Surgery  After surgery, you may experience pain, fatigue, and weakness. Your doctor will give you instructions on what to do during your recovery period, including dietary restrictions and physical activity limitations. It is important to follow these instructions to ensure proper healing. You may also be prescribed medication to manage pain and prevent infection. Surgery Surgery",
        "response": "No, that's all I needed. Thank you, Medi."
    },
    {
        "dialog": [
            "Hi Medi, I think I have influenza, because I have fever, dry cough and sore throat.",
            "Alright, let me ask you a few questions before I give any advice. How long have you been experiencing these symptoms?",
            "I have felt these symptoms for almost three days.",
            "Alright, have you been in contact with someone who has influenza?",
            "Not that I know of.",
            "Okay, based on your symptoms, it is highly possible that you have influenza. I suggest you to get some rest, drink plenty of fluids and consider taking over-the-counter medication to ease your symptoms. ",
            "What kind of over-the-counter medication should I take, Medi?",
            "You can take acetaminophen to reduce your fever and relieve your headache.",
            "Thanks for your help, Medi. I'll follow your advice. "
        ],
        "knowledge": "Influenza Influenza  Common ways of collecting samples for testing include nasal and throat swabs.  Samples may be taken from the lower respiratory tract if infection has cleared the upper but not lower respiratory tract.  Influenza testing is recommended for anyone hospitalized with symptoms resembling influenza during flu season or who is connected to an influenza case.  For severe cases, earlier diagnosis improves patient outcome.  Diagnostic methods that can identify influenza include viral cultures, antibody- and antigen-detecting tests, and nucleic acid-based tests. Viruses can be grown in a culture of mammalian cells or embryonated eggs for 3–10 days to monitor cytopathic effect.  Final confirmation can then be done via antibody staining, hemadsorption using red blood cells, or immunofluorescence microscopy Influenza Influenza",
        "response": "You're welcome, and if your symptoms persist or worsen, please see a doctor immediately."
    },
    {
        "dialog": [
            "Hello Medi, can you explain how influenza is diagnosed?",
            "Of course, influenza can be diagnosed through a variety of methods, including viral cultures, antigen- and antibody-detecting tests, and nucleic acid-based tests. ",
            "What are the symptoms of influenza?",
            "The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion. These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose. ",
            "Is it dangerous to have influenza?",
            "Influenza can be fatal, especially for older adults, young children and people with weakened immune systems or underlying medical conditions.",
            "What are the best ways to prevent influenza?",
            "The best way to prevent influenza is to get vaccinated every year, wash your hands frequently with soap and water, avoid close contact with people who are sick, and cover your mouth and nose when sneezing or coughing.",
            "Thank you, Medi. That was very helpful."
        ],
        "knowledge": "Influenza Influenza  Common ways of collecting samples for testing include nasal and throat swabs.  Samples may be taken from the lower respiratory tract if infection has cleared the upper but not lower respiratory tract.  Influenza testing is recommended for anyone hospitalized with symptoms resembling influenza during flu season or who is connected to an influenza case.  For severe cases, earlier diagnosis improves patient outcome.  Diagnostic methods that can identify influenza include viral cultures, antibody- and antigen-detecting tests, and nucleic acid-based tests. Viruses can be grown in a culture of mammalian cells or embryonated eggs for 3–10 days to monitor cytopathic effect.  Final confirmation can then be done via antibody staining, hemadsorption using red blood cells, or immunofluorescence microscopy Influenza Influenza",
        "response": "Glad to help. Stay safe and healthy!"
    },
    {
        "dialog": [
            "Hi Medi, I just recovered from influenza. What kind of physical activities should I do to improve my health?",
            "Congratulations on your recovery. After recovering from influenza, it is important to start with low-intensity exercise such as walking, stretching or yoga. You should gradually increase the intensity and the duration of exercise as you feel better.",
            "What kind of food should I eat to help me recover faster?",
            "Eating a balanced and nutritious diet is important for your recovery. You should eat plenty of fruits, vegetables, lean protein, and whole grains. Avoid processed or sugary foods, which can weaken your immune system.",
            "Can you recommend any supplements that can help my recovery?",
            "You should always consult with your doctor before taking any supplements or vitamins, but some studies have shown that Vitamin C, Zinc and Vitamin D can help boost your immune system.",
            "Thank you for your advice, Medi.",
            "You're welcome. Take care of yourself."
        ],
        "knowledge": "Influenza Influenza  Common ways of collecting samples for testing include nasal and throat swabs.  Samples may be taken from the lower respiratory tract if infection has cleared the upper but not lower respiratory tract.  Influenza testing is recommended for anyone hospitalized with symptoms resembling influenza during flu season or who is connected to an influenza case.  For severe cases, earlier diagnosis improves patient outcome.  Diagnostic methods that can identify influenza include viral cultures, antibody- and antigen-detecting tests, and nucleic acid-based tests. Viruses can be grown in a culture of mammalian cells or embryonated eggs for 3–10 days to monitor cytopathic effect.  Final confirmation can then be done via antibody staining, hemadsorption using red blood cells, or immunofluorescence microscopy Influenza Influenza",
        "response": "You're welcome. Stay hydrated and get plenty of rest to ensure a speedy recovery."
    },
    {
        "dialog": [
            "Hi Medi, I'm not feeling well, can you help me?",
            "Of course, what are your symptoms?",
            "I have a headache and a sore throat",
            "Do you have a fever or cough?",
            "Yes, I have a fever and a dry cough",
            "Based on your symptoms, I recommend you get tested for Influenza",
            "How can I get tested?",
            "You can get tested by nasal or throat swab",
            "Okay, thank you Medi"
        ],
        "knowledge": "Influenza Influenza  Common ways of collecting samples for testing include nasal and throat swabs.  Samples may be taken from the lower respiratory tract if infection has cleared the upper but not lower respiratory tract.  Influenza testing is recommended for anyone hospitalized with symptoms resembling influenza during flu season or who is connected to an influenza case.  For severe cases, earlier diagnosis improves patient outcome.  Diagnostic methods that can identify influenza include viral cultures, antibody- and antigen-detecting tests, and nucleic acid-based tests. Viruses can be grown in a culture of mammalian cells or embryonated eggs for 3–10 days to monitor cytopathic effect.  Final confirmation can then be done via antibody staining, hemadsorption using red blood cells, or immunofluorescence microscopy Influenza Influenza",
        "response": "You're welcome. Please get tested by nasal or throat swab to confirm whether you have Influenza or not"
    },
    {
        "dialog": [
            "Hi Medi, I have a question about Influenza",
            "Go ahead, what is your question?",
            "How is Influenza diagnosed?",
            "Influenza can be diagnosed through various diagnostic methods including viral cultures, antibody and antigen detecting tests, and nucleic acid-based tests",
            "Can Influenza be diagnosed through symptoms alone?",
            "No, symptoms alone are not enough for a proper diagnosis, it's important to get tested",
            "What are some common ways of collecting samples for testing?",
            "Common ways of collecting samples include nasal and throat swabs, or lower respiratory tract samples if infection has cleared the upper but not the lower respiratory tract",
            "Thank you for the information Medi"
        ],
        "knowledge": "Influenza Influenza  Common ways of collecting samples for testing include nasal and throat swabs.  Samples may be taken from the lower respiratory tract if infection has cleared the upper but not lower respiratory tract.  Influenza testing is recommended for anyone hospitalized with symptoms resembling influenza during flu season or who is connected to an influenza case.  For severe cases, earlier diagnosis improves patient outcome.  Diagnostic methods that can identify influenza include viral cultures, antibody- and antigen-detecting tests, and nucleic acid-based tests. Viruses can be grown in a culture of mammalian cells or embryonated eggs for 3–10 days to monitor cytopathic effect.  Final confirmation can then be done via antibody staining, hemadsorption using red blood cells, or immunofluorescence microscopy Influenza Influenza",
        "response": "You're welcome. If you have any more questions, feel free to ask"
    },
    {
        "dialog": [
            "Hi Medi, I recently had Influenza and I want to know how I can prevent getting it again",
            "To prevent Influenza, it's important to maintain a healthy lifestyle with regular exercise and a balanced diet",
            "What else can I do to prevent it?",
            "You can also get vaccinated for Influenza every year to reduce your risk of getting it again",
            "Is the vaccine effective?",
            "Yes, the vaccine is effective in reducing the severity and duration of Influenza if you do get it",
            "Thank you for the advice Medi",
            "You're welcome. If you have any more questions, let me know"
        ],
        "knowledge": "Influenza Influenza  Influenza can be prevented through vaccination every year, maintaining a healthy lifestyle with regular exercise and a balanced diet, and avoiding contact with people who have Influenza.  For those who have already contracted Influenza, it's important to stay home, rest, and avoid contact with others to prevent spreading the virus.  Antiviral medications are available to treat Influenza, but they are most effective when taken within the first two days of symptoms. Influenza Influenza",
        "response": "You're welcome. Remember to maintain a healthy lifestyle and get vaccinated every year to prevent Influenza"
    },
    {
        "dialog": [
            "Hello Medi, I have a headache and a stuffy nose. Can you help me?",
            "Hello. Based on your symptoms, it is possible that you have a cold.",
            "What can I do to feel better?",
            "I suggest that you rest and drink plenty of fluids. Over-the-counter cold medications may also help.",
            "Should I see a doctor?",
            "If your symptoms persist or worsen, you should seek medical advice.",
            "What should I do if I have a fever?",
            "If you have a fever, you should rest and drink plenty of fluids. Over-the-counter fever reducers may also help.",
            "Thank you for your help, Medi. I will follow your advice."
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "You're welcome. If you experience more symptoms such as fever or diarrhea, you should seek medical advice as soon as possible. Take care!"
    },
    {
        "dialog": [
            "Hi Medi, I'm feeling really tired all the time. What could be the issue?",
            "Hello. There are many possible reasons for feeling tired all the time. Have you been getting enough sleep?",
            "Yes, I have been sleeping for 8 hours every night.",
            "That's great. Have you been experiencing any symptoms other than fatigue?",
            "No, just fatigue.",
            "Have you been under stress recently?",
            "Yes, actually, my work has been really stressful lately.",
            "That could be the reason for your fatigue. Try to take some time for yourself to reduce stress.",
            "Thank you, Medi. I will definitely try to do that."
        ],
        "knowledge": "Influenza Influenza  Common ways of collecting samples for testing include nasal and throat swabs.  Samples may be taken from the lower respiratory tract if infection has cleared the upper but not lower respiratory tract.  Influenza testing is recommended for anyone hospitalized with symptoms resembling influenza during flu season or who is connected to an influenza case.  For severe cases, earlier diagnosis improves patient outcome.  Diagnostic methods that can identify influenza include viral cultures, antibody- and antigen-detecting tests, and nucleic acid-based tests. Viruses can be grown in a culture of mammalian cells or embryonated eggs for 3–10 days to monitor cytopathic effect.  Final confirmation can then be done via antibody staining, hemadsorption using red blood cells, or immunofluorescence microscopy Influenza Influenza",
        "response": "You're welcome. If your fatigue persists and you experience other symptoms, such as fever or body aches, you should seek medical advice as soon as possible. Take care!"
    },
    {
        "dialog": [
            "Hey Medi, I just had a flu test done. What can I expect?",
            "Hello. Depending on the type of test, you may have to wait a few days for the results.",
            "How is the flu test done?",
            "Common ways of collecting samples for testing include nasal and throat swabs. Samples may be taken from the lower respiratory tract if infection has cleared the upper but not lower respiratory tract.",
            "What happens after the test results come back?",
            "If the results are positive, your doctor may prescribe antiviral medications to help treat the flu. If the results are negative, your doctor may recommend other treatments or further testing.",
            "When should I get tested for the flu?",
            "Influenza testing is recommended for anyone hospitalized with symptoms resembling influenza during flu season or who is connected to an influenza case.",
            "Thank you for the information, Medi."
        ],
        "knowledge": "Influenza Influenza  Common ways of collecting samples for testing include nasal and throat swabs.  Samples may be taken from the lower respiratory tract if infection has cleared the upper but not lower respiratory tract.  Influenza testing is recommended for anyone hospitalized with symptoms resembling influenza during flu season or who is connected to an influenza case.  For severe cases, earlier diagnosis improves patient outcome.  Diagnostic methods that can identify influenza include viral cultures, antibody- and antigen-detecting tests, and nucleic acid-based tests. Viruses can be grown in a culture of mammalian cells or embryonated eggs for 3–10 days to monitor cytopathic effect.  Final confirmation can then be done via antibody staining, hemadsorption using red blood cells, or immunofluorescence microscopy Influenza Influenza",
        "response": "You're welcome. Remember to rest and drink plenty of fluids while waiting for the results. Take care!"
    },
    {
        "dialog": [
            "Hello Medi, I'm not feeling well, can you help me?",
            "Of course, I'm here to help. Can you describe your symptoms?",
            "I have a fever, cough, and sore throat. I feel very tired and weak.",
            "Based on your symptoms, it seems you may have influenza. Have you been in contact with anyone who has it?",
            "Yes, my colleague has it and I met them yesterday.",
            "Okay, I recommend you stay home and rest for a few days. Drink plenty of fluids and take over-the-counter medication for fever and cough.",
            "Okay, thank you for your advice. Is there anything else I should be aware of?",
            "Yes, make sure to cover your mouth and nose when you cough or sneeze and wash your hands regularly to prevent the spread of the virus.",
            "Got it. Thank you, Medi."
        ],
        "knowledge": "Influenza Influenza  Common ways of collecting samples for testing include nasal and throat swabs.  Samples may be taken from the lower respiratory tract if infection has cleared the upper but not lower respiratory tract.  Influenza testing is recommended for anyone hospitalized with symptoms resembling influenza during flu season or who is connected to an influenza case.  For severe cases, earlier diagnosis improves patient outcome.  Diagnostic methods that can identify influenza include viral cultures, antibody- and antigen-detecting tests, and nucleic acid-based tests. Viruses can be grown in a culture of mammalian cells or embryonated eggs for 3–10 days to monitor cytopathic effect.  Final confirmation can then be done via antibody staining, hemadsorption using red blood cells, or immunofluorescence microscopy Influenza Influenza",
        "response": "I recommend you stay home and rest for a few days. Drink plenty of fluids and take over-the-counter medication for fever and cough."
    },
    {
        "dialog": [
            "Hello Medi, I have some questions about influenza.",
            "Sure, I'm here to help. What would you like to know?",
            "How is influenza spread?",
            "Influenza is spread through droplets released when an infected person talks, coughs or sneezes.",
            "How long does it take to develop symptoms?",
            "It usually takes one to four days for symptoms to develop after you have been exposed to the virus.",
            "What are the symptoms of influenza?",
            "Symptoms include fever, cough, sore throat, body aches, headache, chills and fatigue.",
            "Thank you for your help, Medi. How can I prevent getting influenza?"
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "You can prevent getting influenza by getting vaccinated, washing your hands regularly, avoiding close contact with sick people, and covering your mouth and nose when you cough or sneeze."
    },
    {
        "dialog": [
            "Hello Medi, I recently had influenza and I want some advice on how to recover faster.",
            "Sure, I'm here to help. What do you need advice on?",
            "What should I eat to recover faster?",
            "You should eat a balanced diet with plenty of fruits and vegetables, lean protein, and whole grains. Drink plenty of fluids to stay hydrated.",
            "How much rest should I get?",
            "You should get plenty of rest and avoid physical exertion until your symptoms have improved.",
            "What kind of physical activity is safe to do?",
            "You can do light physical activity like walking or yoga, but avoid strenuous exercise until you have fully recovered.",
            "Thank you for your help, Medi. Is there anything else I should be aware of?"
        ],
        "knowledge": "Influenza Influenza  Common ways of collecting samples for testing include nasal and throat swabs.  Samples may be taken from the lower respiratory tract if infection has cleared the upper but not lower respiratory tract.  Influenza testing is recommended for anyone hospitalized with symptoms resembling influenza during flu season or who is connected to an influenza case.  For severe cases, earlier diagnosis improves patient outcome.  Diagnostic methods that can identify influenza include viral cultures, antibody- and antigen-detecting tests, and nucleic acid-based tests. Viruses can be grown in a culture of mammalian cells or embryonated eggs for 3–10 days to monitor cytopathic effect.  Final confirmation can then be done via antibody staining, hemadsorption using red blood cells, or immunofluorescence microscopy Influenza Influenza",
        "response": "You should eat a balanced diet with plenty of fruits and vegetables, lean protein, and whole grains. Drink plenty of fluids to stay hydrated."
    },
    {
        "dialog": [
            "Hi Medi, I think I might have influenza. What should I do?",
            "Hello! Can you describe your symptoms?",
            "I have a fever, a cough, and a runny nose.",
            "It's important to get a proper diagnosis. Have you been tested?",
            "No, I haven't. How do I get tested?",
            "You can get tested by nasal or throat swab. Testing is recommended if you have symptoms.",
            "What if the test comes out positive?",
            "If it's positive, self-isolate and follow the doctor's advice. Get rest and maintain fluid intake.",
            "Thank you for your advice. How long does the virus last?"
        ],
        "knowledge": "Influenza Influenza  Symptoms include fever, cough, sore throat, runny or stuffy nose, body aches, headache, chills, and fatigue.  Some people may also have vomiting and diarrhea.  Influenza is highly contagious and can cause severe illness especially in high risk groups.  Common ways of collecting samples for testing include nasal and throat swabs.  Samples may be taken from the lower respiratory tract if infection has cleared the upper but not lower respiratory tract.  Influenza testing is recommended for anyone hospitalized with symptoms resembling influenza during flu season or who is connected to an influenza case.  For severe cases, earlier diagnosis improves patient outcome.",
        "response": "The duration of the virus is usually about a week. It's important to rest and stay hydrated."
    },
    {
        "dialog": [
            "Hey Medi, I just got diagnosed with influenza and I'm feeling really down. What should I do?",
            "I'm sorry to hear that. You should stay home and rest. Do you have any other symptoms?",
            "Yes, I have a fever and my throat feels sore.",
            "You can try gargling with salt water to soothe your throat. Have you been taking any medication?",
            "No, I haven't. Should I take something?",
            "Over-the-counter medication like acetaminophen and ibuprofen can relieve symptoms. Consult with your doctor before taking anything.",
            "Thanks for the advice. Should I still practice social distancing?",
            "Yes, you should stay home and avoid contact with others until you are feeling better. Keep practicing good hygiene like washing your hands regularly.",
            "Okay, I'll do that. How can I prevent getting the flu in the future?"
        ],
        "knowledge": "Influenza Influenza  Symptoms include fever, cough, sore throat, runny or stuffy nose, body aches, headache, chills, and fatigue.  Some people may also have vomiting and diarrhea.  Influenza is highly contagious and can cause severe illness especially in high risk groups.  Common ways of collecting samples for testing include nasal and throat swabs.  Samples may be taken from the lower respiratory tract if infection has cleared the upper but not lower respiratory tract.  Influenza testing is recommended for anyone hospitalized with symptoms resembling influenza during flu season or who is connected to an influenza case.  For severe cases, earlier diagnosis improves patient outcome.",
        "response": "You can prevent getting the flu in the future by getting vaccinated yearly, practicing good hygiene like washing your hands regularly, and avoiding contact with sick people."
    },
    {
        "dialog": [
            "Hi Medi, I just recovered from influenza and I want to know how to stay healthy.",
            "Congratulations on your recovery. What lifestyle changes have you made?",
            "I've been trying to eat healthier and exercise more. What other changes should I make?",
            "You can try getting enough sleep and reducing stress. Have you been vaccinated?",
            "No, I haven't. Should I get vaccinated?",
            "Yes, getting vaccinated can help protect you from the flu. Consult with your doctor about getting vaccinated.",
            "Okay, I'll do that. What else can I do to prevent getting sick?",
            "You can practice good hygiene like washing your hands regularly and avoid contact with sick people. It's also important to maintain a healthy diet and stay hydrated.",
            "Thank you for your advice. When should I get vaccinated?"
        ],
        "knowledge": "Influenza Influenza  Symptoms include fever, cough, sore throat, runny or stuffy nose, body aches, headache, chills, and fatigue.  Some people may also have vomiting and diarrhea.  Influenza is highly contagious and can cause severe illness especially in high risk groups.  Common ways of collecting samples for testing include nasal and throat swabs.  Samples may be taken from the lower respiratory tract if infection has cleared the upper but not lower respiratory tract.  Influenza testing is recommended for anyone hospitalized with symptoms resembling influenza during flu season or who is connected to an influenza case.  For severe cases, earlier diagnosis improves patient outcome.",
        "response": "You should get vaccinated yearly before flu season starts. Consult with your doctor about the best time to get vaccinated."
    },
    {
        "dialog": [
            "Hello Medi, I have a terrible headache and a sore throat.",
            "Hi, sorry to hear that. How long have you had these symptoms?",
            "I have had these symptoms for two days now.",
            "Okay, do you have a fever or cough?",
            "No, I don't have a fever or cough.",
            "Based on your symptoms, you may have a cold or flu. I suggest drinking plenty of fluids and getting some rest.",
            "What should I take for my headache?",
            "You can take acetaminophen or ibuprofen for your headache.",
            "Thank you, Medi. How long does it usually take to recover from a cold or flu?"
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion. These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose. Coughing is the most common symptom.  Standard influenza symptoms typically last for 2 - 8 days. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common. Influenza Influenza",
        "response": "Cold or flu usually lasts for about a week. If symptoms persist or worsen, consult your doctor."
    },
    {
        "dialog": [
            "Hi Medi, I think I have symptoms of the flu.",
            "Hello, I'm sorry to hear that. What are your symptoms?",
            "I have a fever, cough, and body aches.",
            "When did your symptoms start?",
            "I started to feel sick yesterday.",
            "Based on your symptoms, you may have the flu. I suggest getting plenty of rest and drinking lots of fluids.",
            "What else can I do to feel better?",
            "You can take acetaminophen or ibuprofen for your fever and body aches. You can also try using a humidifier or taking a warm shower to ease cough and sore throat.",
            "Thanks, Medi. Is there anything I should be concerned about?"
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion. These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose. Coughing is the most common symptom.  Standard influenza symptoms typically last for 2 - 8 days. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common. Influenza Influenza",
        "response": "If your symptoms persist or worsen, or if you have trouble breathing, please seek medical attention immediately."
    },
    {
        "dialog": [
            "Hi Medi, I just recovered from the flu. What should I do now?",
            "Hi, that's great news. I suggest getting some rest and slowly resuming your normal activities.",
            "What about my diet? Should I eat anything specific?",
            "It's important to eat a balanced diet with plenty of fruits and vegetables to boost your immune system. You should also stay hydrated and drink lots of fluids.",
            "Should I exercise?",
            "You can resume your normal exercise routine gradually. Listen to your body and don't push yourself too hard.",
            "What else should I do?",
            "You should continue to practice good hygiene, such as washing your hands regularly and covering your mouth when you cough or sneeze.",
            "Thank you, Medi. I feel like I'm fully recovered now."
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion. These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose. Coughing is the most common symptom.  Standard influenza symptoms typically last for 2 - 8 days. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common. Influenza Influenza",
        "response": "I'm glad to hear that. Remember to take care of yourself and practice good hygiene to prevent getting sick again."
    },
    {
        "dialog": [
            "Hi Medi, I'm not feeling well and I think I might have the flu",
            "Hi there! I'm sorry to hear that, could you please describe your symptoms?",
            "I have a fever, a cough and I feel very weak and tired",
            "Okay, it sounds like you might have the flu. Have you been in contact with someone who has it?",
            "Yes, my colleague came to work with the flu last week",
            "I see. Based on your symptoms and exposure to the virus, it's likely that you have the flu",
            "What should I do next?",
            "I recommend that you rest and drink plenty of fluids. If your symptoms get worse, seek medical attention",
            "Thank you, Medi. How long does the flu usually last?"
        ],
        "knowledge": "Influenza Influenza The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion. These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose. Coughing is the most common symptom. Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children. The standard influenza symptoms typically last for 2 - 8 days. A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "The flu usually lasts for 2-8 days, but symptoms can sometimes last longer, especially in severe cases"
    },
    {
        "dialog": [
            "Hi Medi, can you explain to me how influenza is diagnosed?",
            "Sure, there are several methods used to diagnose the flu. The most common way is to take a nasal or throat swab to test for the virus",
            "What if the virus isn't detected in the swab?",
            "If the virus isn't detected in the swab, it's possible that the infection has cleared the upper respiratory tract and moved to the lower respiratory tract. In this case, a sample may be taken from the lower respiratory tract",
            "I see. When is testing recommended?",
            "Testing for the flu is recommended for anyone hospitalized with symptoms resembling influenza during flu season or who is connected to an influenza case. For severe cases, earlier diagnosis improves patient outcome",
            "What are the diagnostic methods used to identify influenza?",
            "Diagnostic methods include viral cultures, antibody- and antigen-detecting tests, and nucleic acid-based tests. In some cases, viruses can be grown in a culture of mammalian cells or embryonated eggs for 3-10 days to monitor cytopathic effect. Final confirmation can be done via antibody staining, hemadsorption using red blood cells, or immunofluorescence microscopy",
            "Thanks for explaining, Medi. Is there anything else I should know about diagnosing the flu?"
        ],
        "knowledge": "Influenza Influenza Common ways of collecting samples for testing include nasal and throat swabs. Samples may be taken from the lower respiratory tract if infection has cleared the upper but not lower respiratory tract. Influenza testing is recommended for anyone hospitalized with symptoms resembling influenza during flu season or who is connected to an influenza case. For severe cases, earlier diagnosis improves patient outcome. Diagnostic methods that can identify influenza include viral cultures, antibody- and antigen-detecting tests, and nucleic acid-based tests. Viruses can be grown in a culture of mammalian cells or embryonated eggs for 3-10 days to monitor cytopathic effect. Final confirmation can then be done via antibody staining, hemadsorption using red blood cells, or immunofluorescence microscopy Influenza Influenza",
        "response": "No problem! It's worth noting that some diagnostic tests can produce a false negative result, so a negative test doesn't always mean that you don't have the flu"
    },
    {
        "dialog": [
            "Hi Medi, I recently had the flu and I'm wondering what lifestyle changes I should make to avoid getting sick again",
            "Hi there! Sorry to hear that you had the flu. There are several lifestyle changes that can help you avoid getting sick again",
            "What changes should I make?",
            "One of the most important things is to wash your hands frequently and avoid touching your face. It's also important to get enough sleep and exercise regularly to keep your immune system healthy. Eating a healthy diet with plenty of fruits and vegetables can also help",
            "Thanks for the advice, Medi. Are there any other ways to prevent the flu?",
            "You're welcome! Another way to prevent the flu is to get vaccinated every year. The flu vaccine can help protect you from getting sick or reduce the severity of your symptoms if you do get sick",
            "That's good to know. Is the flu vaccine safe?",
            "Yes, the flu vaccine is safe for most people. The most common side effects are soreness at the injection site and a low-grade fever, but these usually go away on their own",
            "Thanks for your help, Medi. I'll make sure to follow your advice"
        ],
        "knowledge": "Influenza Influenza The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion. These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose. Coughing is the most common symptom. Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children. The standard influenza symptoms typically last for 2 - 8 days. A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "You're welcome! Stay healthy and let me know if you have any other questions"
    },
    {
        "dialog": [
            "Hello, Medi. I think I have influenza.",
            "Hi, can you describe your symptoms?",
            "I have a fever, runny nose, sore throat, and muscle pain.",
            "Based on your symptoms, you might have influenza.",
            "What should I do if I have influenza?",
            "You should get plenty of rest, drink fluids, and take antiviral medication.",
            "Is there anything else I should be doing?",
            "Yes, you should also cover your mouth when coughing or sneezing and wash your hands frequently.",
            "Got it. How long will it take for me to recover?"
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "The duration of influenza symptoms is usually 2-8 days, but it may take a few weeks to fully recover."
    },
    {
        "dialog": [
            "Hello, Medi. I just recovered from influenza. What should I do now?",
            "Hi, it's good to hear that. I suggest you rest and take it easy for a few days.",
            "I've heard that some people develop complications after having influenza. What should I watch out for?",
            "If you experience difficulty breathing, chest pain, or persistent vomiting, you should seek medical attention immediately.",
            "Are there any long-term effects of having influenza?",
            "In rare cases, influenza can lead to pneumonia, which can be life-threatening. Otherwise, most people recover fully without any lasting effects.",
            "Is there anything I can do to prevent getting influenza again?",
            "Yes, getting a flu vaccine every year is the best way to prevent getting influenza.",
            "Thank you for your help, Medi. I'll make sure to get vaccinated."
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "You're welcome. Don't forget to get vaccinated every year to prevent getting influenza again."
    },
    {
        "dialog": [
            "Hello, Medi. I'm worried that I might have influenza.",
            "Hi, can you describe your symptoms?",
            "I have a headache, fever, and my throat is sore.",
            "Based on your symptoms, you might have influenza.",
            "What should I do if I have influenza?",
            "You should consult with your doctor and take antiviral medication if prescribed.",
            "Can I do anything to manage the symptoms?",
            "You should get plenty of rest, drink fluids, and take over-the-counter pain relievers to help with the symptoms.",
            "Thanks, Medi. Is there anything else I should know?"
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "Yes, make sure to cover your mouth and nose when coughing or sneezing, and wash your hands frequently to prevent spreading the virus."
    }
]