[
    {
        "dialog": [
            "Hello Medi, I think I am getting sick.",
            "Hi, I am here to help. What are your symptoms?",
            "I have fever, headache, and a runny nose.",
            "Based on your symptoms, you may have influenza. Rest and stay hydrated.",
            "Is there anything I can take to feel better?",
            "You can try over-the-counter medication for your symptoms. Consult your doctor if they persist.",
            "Thank you, Medi. I'll try that.",
            "You're welcome. Hope you feel better soon.",
            "What causes influenza?"
        ],
        "knowledge": "Influenza Influenza The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion. These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose. Coughing is the most common symptom. Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children. The standard influenza symptoms typically last for 2 - 8 days. A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "Influenza is caused by a virus and is highly contagious."
    },
    {
        "dialog": [
            "Hi Medi, I am curious about the different influenza subtypes.",
            "Hi, I can help you with that. Which subtype do you want to know about?",
            "What are the differences between H1N1 and H3N2?",
            "H1N1 and H3N2 are two of the most common subtypes in circulation. H1N1 is usually associated with less severe symptoms, while H3N2 can cause severe illness, especially in older adults.",
            "What about the other subtypes?",
            "There are several other subtypes, such as H5N1, which can cause severe illness in humans, and H7N9, which has also caused outbreaks in humans.",
            "I see. Is there a way to prevent getting the flu?",
            "Yes, getting vaccinated is the best way to prevent getting the flu. It's also important to practice good hygiene, such as washing your hands frequently and avoiding close contact with sick people.",
            "Thank you for the information, Medi."
        ],
        "knowledge": "Influenza Influenza Diagnosis of influenza is usually based on symptoms and a physical examination. A rapid influenza diagnostic test may be used to confirm the diagnosis. Other tests, such as a viral culture or a PCR test, may be used to identify the specific subtype of influenza. In severe cases, a chest x-ray may be done to look for signs of pneumonia or other complications. Influenza Influenza",
        "response": "Influenza is usually diagnosed based on symptoms and a physical examination. A rapid influenza diagnostic test may be used to confirm the diagnosis."
    },
    {
        "dialog": [
            "Hi Medi, I recently had the flu and I want to know what I can do to prevent getting it again.",
            "Hi, sorry to hear that. The best way to prevent getting the flu again is to get vaccinated.",
            "What if I already got vaccinated?",
            "The flu vaccine is not 100% effective, but it can still reduce the severity of symptoms if you do get the flu. It's also important to practice good hygiene, such as washing your hands frequently and avoiding close contact with sick people.",
            "Is there anything else I can do?",
            "Yes, maintaining a healthy lifestyle can also help boost your immune system and reduce your risk of getting sick.",
            "What kind of lifestyle changes should I make?",
            "Eating a balanced diet, getting enough sleep, and staying physically active are all important for maintaining a healthy immune system.",
            "Thank you for the advice, Medi."
        ],
        "knowledge": "Influenza Influenza No, you cannot get the flu from the vaccine. The flu vaccine contains inactivated or weakened viruses that cannot cause illness. However, it can take up to two weeks for the vaccine to become effective, so it's still possible to get the flu during that time. Additionally, the vaccine only protects against certain subtypes of the flu, so it's still possible to get a different strain of the virus.",
        "response": "No, you cannot get the flu from the vaccine, but it can take up to two weeks for the vaccine to become effective, and it only protects against certain subtypes of the flu."
    },
    {
        "dialog": [
            "Hi, Medi. I think I have the flu.",
            "Oh no. Can you tell me the symptoms you're experiencing?",
            "I have a bad headache, fever, chills, body aches, and coughing.",
            "Based on your symptoms, it's likely that you have the flu. You should rest and drink plenty of fluids.",
            "Is there anything else I can do to feel better?",
            "You can take over-the-counter pain relievers, such as ibuprofen or acetaminophen, to alleviate your symptoms. And if you develop difficulty breathing, chest pain, or persistent vomiting, seek medical attention immediately.",
            "Okay, thanks. How long will it take for me to recover?",
            "The flu usually lasts about a week, but it may take longer for you to feel completely well again.",
            "Thanks for your help, Medi."
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "You're welcome. Take care of yourself and rest. And if you develop difficulty breathing, chest pain, or persistent vomiting, seek medical attention immediately."
    },
    {
        "dialog": [
            "Hello Medi, can you explain what ibv is?",
            "Sure, IBV is a type of influenza virus that mainly infects humans.",
            "Is it the same as IAV?",
            "No, it's not the same. IAV has subtypes like H1N1 and H3N2, while IBV does not have subtypes. Instead, it has two antigenically distinct lineages called Victoria and Yamagata.",
            "What are the symptoms of IBV?",
            "The symptoms of IBV are similar to those of IAV, including fever, cough, sore throat, runny or stuffy nose, body aches, headache, chills, and fatigue. However, IBV does not cause as severe symptoms as IAV.",
            "Is there a vaccine for IBV?",
            "Yes, there is a vaccine for IBV. It's included in the seasonal flu vaccine.",
            "Thanks for the info, Medi."
        ],
        "knowledge": "Influenza Influenza  The IAV subtypes in circulation as of 2018 are H1N1 and H3N2.  IAVs can be classified more specifically by natural host species, geographical origin, year of isolation, and strain number, such as H1N1/A/duck/Alberta/35/76. IBV mainly infects humans but has been identified in seals, horses, dogs, and pigs.  IBV does not have subtypes like IAV but has two antigenically distinct lineages, termed the B/Victoria/2/1987-like and B/Yamagata/16/1988-like lineages, or simply Victoria and Yamagata.  Both lineages are in circulation in humans, disproportionately affecting children.  IBVs contribute to seasonal epidemics alongside IAVs but have never been associated with a pandemic. ICV, like IBV, is primarily found in humans, though it also has been detected in pigs, feral dogs, dromedary camels, cattle, and dogs Influenza Influenza",
        "response": "You're welcome. If you have any more questions, don't hesitate to ask."
    },
    {
        "dialog": [
            "Hi, Medi. I recently had the flu and I'm wondering if there's anything I can do to prevent getting it again.",
            "The best way to prevent the flu is to get vaccinated every year. Did you get vaccinated this year?",
            "No, I didn't. Is it too late to get vaccinated now?",
            "It's not too late. Even if you've already had the flu this season, getting the vaccine can still protect you against other strains of the virus.",
            "What else can I do to prevent getting the flu?",
            "Washing your hands frequently with soap and water, avoiding contact with people who are sick, and covering your mouth and nose when you cough or sneeze can all help reduce your risk of getting the flu.",
            "Thanks for the advice, Medi.",
            "You're welcome. Stay healthy!"
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "You're welcome. Don't hesitate to ask if you have any other questions."
    },
    {
        "dialog": [
            "Hi Medi, I have a running nose, cough and a fever.",
            "Hello! Based on your symptoms, you may have the flu.",
            "What should I do next?",
            "You should rest and drink plenty of fluids. I recommend taking over-the-counter medication to relieve your symptoms.",
            "What kind of medication should I take?",
            "You can take acetaminophen for fever and body aches, and cough syrup to soothe your cough.",
            "How long will it take me to recover?",
            "The flu usually lasts 1-2 weeks. Get lots of rest and fluids and you should feel better soon.",
            "Thank you for your help, Medi!"
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "You're welcome. I hope you feel better soon!"
    },
    {
        "dialog": [
            "Hi Medi, can you explain what is Influenza B and how is it different from Influenza A?",
            "Sure! Influenza B mainly infects humans but has been identified in seals, horses, dogs, and pigs. It does not have subtypes like Influenza A but has two antigenically distinct lineages, Victoria and Yamagata. Both lineages are in circulation in humans, disproportionately affecting children. Influenza A, on the other hand, has different subtypes and can infect a variety of animals.",
            "What are the symptoms of Influenza B?",
            "The symptoms of Influenza B are similar to those of Influenza A. They include fever, cough, sore throat, body aches, headache, chills, and fatigue",
            "Is there any vaccine for Influenza B?",
            "Yes, there is a vaccine available to protect against both Influenza A and B.",
            "Thank you for your explanation. Is there anything else I should know?",
            "Make sure to practice good hygiene, such as washing your hands frequently and covering your mouth and nose when coughing or sneezing. This can help prevent the spread of the flu.",
            "Thanks, Medi!"
        ],
        "knowledge": "Influenza Influenza  The IAV subtypes in circulation as of 2018 are H1N1 and H3N2.  IAVs can be classified more specifically by natural host species, geographical origin, year of isolation, and strain number, such as H1N1/A/duck/Alberta/35/76. IBV mainly infects humans but has been identified in seals, horses, dogs, and pigs.  IBV does not have subtypes like IAV but has two antigenically distinct lineages, termed the B/Victoria/2/1987-like and B/Yamagata/16/1988-like lineages, or simply Victoria and Yamagata.  Both lineages are in circulation in humans, disproportionately affecting children.  IBVs contribute to seasonal epidemics alongside IAVs but have never been associated with a pandemic. ICV, like IBV, is primarily found in humans, though it also has been detected in pigs, feral dogs, dromedary camels, cattle, and dogs Influenza Influenza",
        "response": "You're welcome. Stay healthy!"
    },
    {
        "dialog": [
            "Hi Medi, I recently had the flu. What can I do to prevent getting sick again?",
            "Hello! Good question. The best way to prevent the flu is to get vaccinated every year.",
            "What if I don't want to get the vaccine?",
            "You can also practice good hygiene, such as washing your hands frequently and avoiding close contact with sick people.",
            "Are there any other measures I can take?",
            "Yes, you can also make sure to get plenty of rest, eat a healthy diet, and exercise regularly to keep your immune system strong.",
            "Thanks for the advice, Medi. How often should I wash my hands?",
            "You should wash your hands regularly throughout the day, especially before eating or touching your face.",
            "Okay, I'll keep that in mind. Thanks again!"
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "You're welcome. Stay healthy and take care!"
    },
    {
        "dialog": [
            "Hi Medi, I feel like I have a cold. What should I do?",
            "Hello, I can help you with that. Can you tell me about your symptoms?",
            "I have a sore throat, runny nose, and a fever.",
            "Okay, it sounds like you might have influenza. My advice is to rest at home and drink lots of fluids.",
            "Should I take any medicine?",
            "You can take over-the-counter medication like ibuprofen or acetaminophen to relieve any pain or fever. But if your symptoms don't improve, see a doctor.",
            "Thank you for the advice. Is there anything else I can do?",
            "Yes, you can use a humidifier or take a steamy shower to help with congestion and avoid contact with others to prevent spreading the virus.",
            "Okay, thank you for your help."
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "You're welcome. Remember to rest at home and drink lots of fluids. Take over-the-counter medication like ibuprofen or acetaminophen to relieve any pain or fever. If your symptoms don't improve, see a doctor."
    },
    {
        "dialog": [
            "Hi Medi, can you tell me more about influenza?",
            "Of course, what would you like to know?",
            "What are the symptoms of influenza?",
            "The symptoms of influenza include fever, chills, headaches, muscle pain, sore throat, cough, and congestion. In some cases, symptoms may also include gastrointestinal issues like nausea, vomiting, and diarrhea.",
            "How is influenza different from a common cold?",
            "Influenza tends to be more severe than a common cold and can cause more severe complications like pneumonia. Additionally, the symptoms of influenza tend to come on more suddenly than a cold.",
            "How is influenza treated?",
            "Influenza is usually treated with rest, fluids, and over-the-counter medication to relieve symptoms like pain and fever. In some cases, antiviral medication may be prescribed to help speed up recovery.",
            "Thanks for the information. Is there anything I can do to prevent contracting the virus?"
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "You're welcome. Remember to get a flu vaccine each year, avoid close contact with people who are sick, and practice good hygiene like washing your hands frequently."
    },
    {
        "dialog": [
            "Hi Medi, I recently recovered from influenza. What can I do to prevent getting it again?",
            "Hi. It's great that you've recovered. The best way to prevent getting influenza again is to get a flu vaccine each year. You can also practice good hygiene like washing your hands frequently and avoiding close contact with people who are sick.",
            "Can I still get the flu even if I got a flu vaccine?",
            "Yes, there is a chance that you may still contract the virus even if you received a flu vaccine. However, the vaccine can help reduce the severity of symptoms if you do get sick.",
            "What other precautions can I take?",
            "Other precautions you can take include avoiding close contact with people who are sick, covering your mouth and nose when you cough or sneeze, and avoiding touching your face.",
            "Thanks for the advice. Are there any complications that can arise from influenza?",
            "Yes, influenza can lead to complications like pneumonia, bronchitis, and sinus and ear infections. It can also worsen existing health conditions like asthma and heart disease.",
            "Thanks for the information, Medi."
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "You're welcome. Remember to get a flu vaccine each year, practice good hygiene, and avoid close contact with people who are sick."
    },
    {
        "dialog": [
            "Hi Medi, I am feeling unwell and have a headache.",
            "Hello, sorry to hear that. Can you describe your headache?",
            "It's throbbing and in the front of my head.",
            "Have you had any other symptoms besides the headache?",
            "Yes, I also have a stuffy nose and a mild fever.",
            "Based on your symptoms, it's possible you have a sinus infection.",
            "What can I do to feel better?",
            "Drink plenty of fluids, get rest, and consider taking over-the-counter pain relievers.",
            "Thank you for your help, Medi."
        ],
        "knowledge": "Sinus Infection Sinus Infection Sinus infections occur when the mucous membranes in your nose and sinuses become inflamed. This inflammation can cause a buildup of mucus that can block the sinuses, causing pain and pressure in your forehead, nose, and cheeks. Other symptoms of a sinus infection include a stuffy or runny nose, postnasal drip, fever, and headache. A sinus infection can be caused by a virus, bacteria, or fungus. Treatment may involve over-the-counter pain relievers, nasal decongestants, and in some cases, antibiotics. Drinking plenty of fluids and getting rest can also help speed up recovery.",
        "response": "You're welcome. If your symptoms persist or worsen, you may want to consider seeing a doctor."
    },
    {
        "dialog": [
            "Hi Medi, can you tell me more about Influenza?",
            "Yes, of course. Influenza is a viral respiratory illness that can cause fever, coughing, body aches, and fatigue.",
            "Are there different types of Influenza?",
            "Yes, there are several different strains of Influenza, including H1N1 and H3N2.",
            "How does Influenza spread?",
            "Influenza is spread through respiratory droplets when an infected person coughs or sneezes.",
            "What can I do to prevent getting Influenza?",
            "The best way to prevent getting Influenza is to get vaccinated each year. You can also avoid close contact with sick people and wash your hands frequently.",
            "Thank you for the information, Medi."
        ],
        "knowledge": "Influenza Influenza The IAV subtypes in circulation as of 2018 are H1N1 and H3N2. IAVs can be classified more specifically by natural host species, geographical origin, year of isolation, and strain number, such as H1N1/A/duck/Alberta/35/76. IBV mainly infects humans but has been identified in seals, horses, dogs, and pigs. IBV does not have subtypes like IAV but has two antigenically distinct lineages, termed the B/Victoria/2/1987-like and B/Yamagata/16/1988-like lineages, or simply Victoria and Yamagata. Both lineages are in circulation in humans, disproportionately affecting children. IBVs contribute to seasonal epidemics alongside IAVs but have never been associated with a pandemic. ICV, like IBV, is primarily found in humans, though it also has been detected in pigs, feral dogs, dromedary camels, cattle, and dogs.",
        "response": "You're welcome. Let me know if you have any other questions!"
    },
    {
        "dialog": [
            "Hi Medi, I recently had surgery and am wondering what kind of physical activity is safe for me.",
            "Hello, it's important to talk to your doctor before starting any new physical activity after surgery.",
            "My doctor said it's okay for me to start exercising again, but I'm not sure where to start.",
            "It's important to start slowly and gradually increase the intensity of your workout over time.",
            "What kind of exercises are safe for me to do?",
            "Low-impact exercises like walking, swimming, and cycling are generally safe after surgery.",
            "What should I avoid?",
            "You should avoid high-impact exercises like running or jumping, as well as any activities that put strain on the area where you had surgery.",
            "Thank you for your advice, Medi."
        ],
        "knowledge": "Post-Surgery Exercise Post-Surgery Exercise After surgery, it's important to talk to your doctor before starting any new physical activity. Start slowly and gradually increase the intensity of your workout over time. Low-impact exercises like walking, swimming, and cycling are generally safe after surgery, while high-impact exercises like running or jumping should be avoided. It's also important to avoid any activities that put strain on the area where you had surgery.",
        "response": "You're welcome. I'm glad I could help. Let me know if you have any other questions!"
    },
    {
        "dialog": [
            "Hi Medi, I've been feeling really sick lately",
            "I'm sorry to hear that. Can you tell me more about your symptoms?",
            "I have a high fever, cough, and really bad body aches",
            "Those are all common symptoms of the flu. Have you been around anyone who has been sick?",
            "Yes, actually my coworker has been out with the flu for the past week",
            "That's a good indicator that you might have the flu. My advice would be to rest, drink plenty of fluids, and take over-the-counter pain relievers to ease your symptoms",
            "Is there anything else I should do to get better?",
            "Make sure you're covering your mouth and nose when you cough or sneeze to prevent spreading the virus. Also, avoid contact with others until your symptoms subside",
            "Thank you for your help, Medi. I'll make sure to take care of myself"
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "Based on your symptoms of high fever, cough, and body aches, it's likely that you have the flu."
    },
    {
        "dialog": [
            "Hi Medi, I heard about a disease called IBV. What can you tell me about it?",
            "IBV is a virus that mainly infects humans, but has also been found in animals like seals, horses, dogs, and pigs. It doesn't have subtypes like the flu does, but it has two different lineages that affect humans",
            "What kind of symptoms does IBV cause?",
            "Symptoms of IBV are similar to the flu, including fever, cough, and body aches. It's also commonly associated with sore throat and runny nose",
            "How is IBV spread?",
            "IBV is spread through respiratory droplets, so it can be passed from person to person through coughing or sneezing. It can also be spread by touching a surface contaminated with the virus and then touching your mouth, nose, or eyes",
            "Is there a vaccine for IBV?",
            "Currently, there is no vaccine for IBV. The best way to prevent infection is to practice good hygiene, like washing your hands regularly and avoiding close contact with people who are sick",
            "Thank you for the information, Medi. I'll make sure to take precautions to avoid getting sick"
        ],
        "knowledge": "IBV IBV mainly infects humans but has been identified in seals, horses, dogs, and pigs.  IBV does not have subtypes like IAV but has two antigenically distinct lineages, termed the B/Victoria/2/1987-like and B/Yamagata/16/1988-like lineages, or simply Victoria and Yamagata.  Both lineages are in circulation in humans, disproportionately affecting children.  IBVs contribute to seasonal epidemics alongside IAVs but have never been associated with a pandemic IBV IBV",
        "response": "IBV is a virus that mainly infects humans and can cause symptoms similar to the flu. It's spread through respiratory droplets and there is currently no vaccine for it"
    },
    {
        "dialog": [
            "Hi Medi, I just had my flu shot. Is there anything else I can do to prevent getting sick?",
            "That's great to hear! Besides getting vaccinated, there are a few other things you can do to reduce your risk of getting sick",
            "Like what?",
            "Washing your hands regularly with soap and water is one of the best ways to prevent the spread of germs. You can also try to avoid close contact with people who are sick",
            "Are there any foods I should be eating to boost my immune system?",
            "Eating a healthy, balanced diet can definitely help boost your immune system. Try to focus on getting plenty of fruits, vegetables, and whole grains in your diet. Foods high in vitamin C, like citrus fruits and leafy greens, can also be beneficial",
            "What about exercise? Can that help prevent me from getting sick?",
            "Regular physical activity can actually help boost your immune system and reduce your risk of getting sick. Aim for at least 30 minutes of moderate activity most days of the week",
            "Thanks for the advice, Medi. I'll make sure to take care of myself!"
        ],
        "knowledge": "Influenza Influenza  Getting vaccinated is one of the best ways to prevent the flu. Other measures to help prevent the spread of germs include washing your hands regularly, avoiding close contact with people who are sick, covering your mouth and nose when coughing or sneezing, and staying home when you're feeling ill. Eating a healthy, balanced diet with plenty of fruits, vegetables, and whole grains can help boost your immune system. Regular physical activity can also help reduce your risk of getting sick Influenza Influenza",
        "response": "Good job getting the flu shot! Besides vaccination, washing your hands regularly, avoiding close contact with sick people, and eating a healthy diet are all great ways to prevent getting sick."
    },
    {
        "dialog": [
            "Hello Medi, I think I have the flu. What should I do?",
            "Certainly, what are your specific symptoms?",
            "I have a fever, cough, sore throat, and body aches.",
            "Based on your symptoms, it is possible that you have the flu. Rest and drink fluids, and take medicine to reduce your fever and relieve your symptoms.",
            "Okay, is there anything else I can do to speed up my recovery?",
            "Yes, try to avoid contact with others to prevent the spread of the virus, and stay home until you are feeling better.",
            "Understood. How long will it take for me to recover from the flu?",
            "It varies, but most people feel better within a week or two. Make sure to get plenty of rest and take care of yourself.",
            "Thanks for your help, Medi."
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "You're welcome. Take care of yourself and rest. Most people feel better within a week or two."
    },
    {
        "dialog": [
            "Hello Medi, I'm worried about getting the flu. What can I do to avoid it?",
            "Good question. The best way to prevent the flu is to get a flu shot every year.",
            "I see. What else can I do?",
            "Wash your hands frequently, avoid close contact with people who are sick, and cover your mouth and nose when coughing or sneezing.",
            "Okay, what should I do if I think I have been exposed to the flu?",
            "Watch for symptoms such as fever, cough, sore throat, and body aches. If you have these symptoms, rest and drink fluids, and take medicine to reduce your fever and relieve your symptoms.",
            "Understood. Thank you for your advice, Medi.",
            "You're welcome. Stay safe and take care of yourself.",
            "One more thing, Medi. How effective is the flu vaccine?"
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "You're welcome. Remember to get a flu shot and take preventative measures such as washing your hands frequently and avoiding close contact with sick people."
    },
    {
        "dialog": [
            "Hello Medi, I recently had the flu and I want to know what I can do to prevent getting it again in the future.",
            "Good question. The best way to prevent the flu is to get a flu shot every year.",
            "I see. What else can I do?",
            "Wash your hands frequently, avoid close contact with people who are sick, and cover your mouth and nose when coughing or sneezing.",
            "Okay, what should I do if I think I have been exposed to the flu?",
            "Watch for symptoms such as fever, cough, sore throat, and body aches. If you have these symptoms, rest and drink fluids, and take medicine to reduce your fever and relieve your symptoms.",
            "Understood. Is there anything else I can do to boost my immune system?",
            "Yes, make sure to get enough sleep, exercise regularly, and eat a balanced diet with plenty of fruits and vegetables.",
            "That's good advice. Thank you, Medi."
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "You're welcome. Remember to get a flu shot every year, wash your hands frequently, and practice good hygiene to prevent getting the flu again."
    },
    {
        "dialog": [
            "Hi Medi, I have a fever and cough",
            "Hi, I'm here to assist you. When did you start feeling this way?",
            "It started just yesterday and my temperature has been high all day",
            "I see. Any other symptoms?",
            "I feel tired and my throat is sore",
            "Based on your symptoms, it's possible you have the flu. You should rest and drink plenty of fluids.",
            "Is there anything else I can do to feel better?",
            "You can take over-the-counter pain relievers for your fever and sore throat. If your symptoms get worse, seek medical attention.",
            "Thank you for your help, Medi. How can I prevent the flu in the future?"
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "You can prevent the flu by getting vaccinated and practicing good hygiene such as washing your hands regularly and avoiding close contact with sick people."
    },
    {
        "dialog": [
            "Hello Medi, I feel scared about getting the flu",
            "Hi, don't worry. I'm here to help. What are you worried about?",
            "I heard the flu can be deadly and I don't want to get sick",
            "While the flu can be serious, it is usually not deadly for most people. You can reduce your risk by getting vaccinated and practicing good hygiene.",
            "I see. What if I do get sick?",
            "If you do get sick, rest and drink plenty of fluids. You can take over-the-counter pain relievers for your fever and sore throat. If your symptoms get worse, seek medical attention.",
            "Is there anything else I can do to prevent the flu?",
            "You can also avoid close contact with sick people and avoid touching your face with unwashed hands.",
            "Thanks, Medi. I feel better knowing what I can do to protect myself."
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "I'm glad I could help. Is there anything else you're concerned about?"
    },
    {
        "dialog": [
            "Hi Medi, I just recovered from the flu. What should I do now?",
            "Congratulations on recovering. It's important to take care of your body now. Rest, eat healthy foods, and drink plenty of fluids.",
            "Are there any exercises I can do to help my body recover?",
            "Yes, light exercise such as walking or yoga can help your body recover.",
            "How can I prevent getting the flu again?",
            "You can get vaccinated every year and practice good hygiene such as washing your hands regularly and avoiding close contact with sick people.",
            "Thank you for your help, Medi. I'll follow your advice.",
            "You're welcome. It's always important to take care of yourself, especially after being sick.",
            "Do you have any other advice for staying healthy during flu season?"
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "Yes, make sure to get enough sleep, eat a balanced diet, and continue practicing good hygiene."
    }
]