[
    {
        "dialog": [
            "Hi Medi, I'm feeling feverish and my neck is sore",
            "I'm sorry to hear that. Based on your symptoms, it could be meningitis",
            "What's meningitis?",
            "It's an inflammation of the protective membranes covering the brain and spinal cord",
            "What are other symptoms?",
            "Confusion, altered consciousness, nausea, vomiting, and an inability to tolerate light or loud noises",
            "What causes it?",
            "The inflammation may be caused by infection with viruses, bacteria, fungi or parasites",
            "How is it treated?"
        ],
        "knowledge": "Meningitis Meningitis Meningitis is acute or chronic inflammation of the protective membranes covering the brain and spinal cord, collectively called the meninges.  The most common symptoms are fever, headache, and neck stiffness.  Other symptoms include confusion or altered consciousness, nausea, vomiting, and an inability to tolerate light or loud noises.  Young children often exhibit only nonspecific symptoms, such as irritability, drowsiness, or poor feeding.  A non-blanching rash  may also be present. The inflammation may be caused by infection with viruses, bacteria, fungi or parasites.  Non-infectious causes include malignancy , subarachnoid hemorrhage, chronic inflammatory disease  and certain drugs Meningitis Meningitis",
        "response": "The treatment depends on the cause of meningitis, but can include antibiotics, antivirals, or anti-fungal medications as well as supportive care such as pain relief and hydration."
    },
    {
        "dialog": [
            "Hi Medi, I just had a lumbar puncture",
            "Ok, how are you feeling now?",
            "My back is a bit sore, but overall I'm okay",
            "That's good! After a lumbar puncture, it's important to rest for 24 hours and avoid strenuous activity",
            "Anything I should eat or avoid?",
            "It's best to avoid caffeine and alcohol for the next 24 hours, but you can eat normally as long as you stay hydrated",
            "How about physical activity?",
            "Avoid any heavy lifting, exercise, or activities that involve bending or twisting your back for the next 24 hours",
            "Thanks for the advice!"
        ],
        "knowledge": "Lumbar puncture Lumbar puncture A lumbar puncture is a medical procedure in which a needle is inserted into the spinal canal to collect cerebrospinal fluid (CSF) for analysis.  It is used to diagnose infections of the central nervous system, such as meningitis and encephalitis, as well as other disorders such as multiple sclerosis and Guillain-Barre syndrome.  After a lumbar puncture, it is important to rest for 24 hours and avoid strenuous activity, including heavy lifting, exercise, or activities that involve bending or twisting your back.  It is also recommended to avoid caffeine and alcohol for the next 24 hours, but you can eat normally as long as you stay hydrated Lumbar puncture Lumbar puncture",
        "response": "You're welcome, don't hesitate to contact me if you have any more questions."
    },
    {
        "dialog": [
            "Hi Medi, I have a question about meningitis",
            "Sure, what's your question?",
            "Can meningitis be prevented?",
            "There are vaccines available that can help prevent some types of meningitis, such as the pneumococcal and meningococcal vaccines",
            "What about lifestyle changes?",
            "Unfortunately, there are no lifestyle changes that can directly prevent meningitis, but maintaining good hygiene practices can help prevent the spread of infectious diseases",
            "How can I minimize the risk of getting meningitis?",
            "Avoid close contact with people who are sick, wash your hands frequently, cover your mouth and nose when coughing or sneezing, and avoid sharing food, drinks, or utensils",
            "Thanks for the information!"
        ],
        "knowledge": "Meningitis Meningitis Meningitis is acute or chronic inflammation of the protective membranes covering the brain and spinal cord, collectively called the meninges.  The most common symptoms are fever, headache, and neck stiffness.  Other symptoms include confusion or altered consciousness, nausea, vomiting, and an inability to tolerate light or loud noises.  Young children often exhibit only nonspecific symptoms, such as irritability, drowsiness, or poor feeding.  A non-blanching rash  may also be present. The inflammation may be caused by infection with viruses, bacteria, fungi or parasites.  Non-infectious causes include malignancy , subarachnoid hemorrhage, chronic inflammatory disease  and certain drugs Meningitis Meningitis",
        "response": "You're welcome! It's important to be informed and take precautions to protect yourself."
    },
    {
        "dialog": [
            "Hi Medi, I have a fever, headache and neck stiffness.",
            "I see. Those symptoms could mean you have meningitis.",
            "What can I do now? Can you make a diagnosis?",
            "I am sorry, I am just a chatbot and I suggest you seek medical attention as soon as possible.",
            "I understand, but what are the causes of this disease?",
            "Meningitis can be caused by viruses, bacteria, fungi or parasites.",
            "Is there a way to prevent it?",
            "Yes, good hygiene habits such as washing hands frequently and covering nose and mouth when coughing or sneezing can reduce the risk of infection.",
            "Thank you for your advice, Medi."
        ],
        "knowledge": "Meningitis Meningitis Meningitis is acute or chronic inflammation of the protective membranes covering the brain and spinal cord, collectively called the meninges.  The most common symptoms are fever, headache, and neck stiffness.  Other symptoms include confusion or altered consciousness, nausea, vomiting, and an inability to tolerate light or loud noises.  Young children often exhibit only nonspecific symptoms, such as irritability, drowsiness, or poor feeding.  A non-blanching rash  may also be present. The inflammation may be caused by infection with viruses, bacteria, fungi or parasites.  Non-infectious causes include malignancy , subarachnoid hemorrhage, chronic inflammatory disease  and certain drugs Meningitis Meningitis",
        "response": "You're welcome. Please seek medical attention as soon as possible for proper diagnosis and treatment."
    },
    {
        "dialog": [
            "Hello Medi, can you give me some information about Meningitis?",
            "Sure. Meningitis is inflammation of the protective membranes covering the brain and spinal cord. It can be caused by infections or other factors.",
            "What are the symptoms of Meningitis?",
            "The most common symptoms are fever, headache, and neck stiffness. Other symptoms include confusion or altered consciousness, nausea, vomiting, and an inability to tolerate light or loud noises.",
            "Can this disease be cured?",
            "Meningitis can be treated with antibiotics and antiviral medications, depending on the cause. It is important to seek medical attention as soon as possible.",
            "What can I do to prevent it?",
            "Good hygiene habits such as washing hands frequently and covering nose and mouth when coughing or sneezing can reduce the risk of infection.",
            "Thanks for the information, Medi."
        ],
        "knowledge": "Meningitis Meningitis Meningitis is acute or chronic inflammation of the protective membranes covering the brain and spinal cord, collectively called the meninges.  The most common symptoms are fever, headache, and neck stiffness.  Other symptoms include confusion or altered consciousness, nausea, vomiting, and an inability to tolerate light or loud noises.  Young children often exhibit only nonspecific symptoms, such as irritability, drowsiness, or poor feeding.  A non-blanching rash  may also be present. The inflammation may be caused by infection with viruses, bacteria, fungi or parasites.  Non-infectious causes include malignancy , subarachnoid hemorrhage, chronic inflammatory disease  and certain drugs Meningitis Meningitis",
        "response": "You're welcome, feel free to ask me anything else."
    },
    {
        "dialog": [
            "Hi Medi, I just went through a medical procedure. Do you have any advice for my recovery?",
            "Sure. Depending on the procedure, you may need to rest and avoid strenuous activities for a while. Follow your doctor's instructions.",
            "What about my diet?",
            "You may need to avoid certain foods and drinks or follow a specific diet, depending on the procedure. It is important to eat a healthy and balanced diet to promote healing.",
            "What kind of physical exercise can I do?",
            "You may need to avoid strenuous activities for a while, but light exercises such as walking or stretching can be beneficial for your recovery. Consult with your doctor before starting any exercise program.",
            "Can you suggest some lifestyle changes for a speedy recovery?",
            "Getting enough rest, eating a healthy and balanced diet, and avoiding smoking and alcohol can all help promote healing and a speedy recovery.",
            "Thank you for your advice, Medi."
        ],
        "knowledge": "Meningitis Meningitis Meningitis is acute or chronic inflammation of the protective membranes covering the brain and spinal cord, collectively called the meninges.  The most common symptoms are fever, headache, and neck stiffness.  Other symptoms include confusion or altered consciousness, nausea, vomiting, and an inability to tolerate light or loud noises.  Young children often exhibit only nonspecific symptoms, such as irritability, drowsiness, or poor feeding.  A non-blanching rash  may also be present. The inflammation may be caused by infection with viruses, bacteria, fungi or parasites.  Non-infectious causes include malignancy , subarachnoid hemorrhage, chronic inflammatory disease  and certain drugs Meningitis Meningitis",
        "response": "You're welcome. Take care and feel free to ask me anything else."
    },
    {
        "dialog": [
            "Hello Medi, I am feeling very sick and I don't know what to do.",
            "Hi, I'm Medi. Can you describe your symptoms?",
            "I've been feeling very unwell lately, with a fever, headache, and a stiff neck",
            "It is possible you may have meningitis. You need to see a doctor immediately",
            "What are the other symptoms of meningitis I should look out for?",
            "Other symptoms of meningitis include confusion, nausea, vomiting, and sensitivity to light and sound.",
            "How do I know if I have meningitis or just a common cold?",
            "One of the most distinctive symptoms of meningitis is the inability to bend your chin down to your chest.",
            "Thank you. I'll go see a doctor as soon as possible."
        ],
        "knowledge": "Meningitis Meningitis Meningitis is acute or chronic inflammation of the protective membranes covering the brain and spinal cord, collectively called the meninges.  The most common symptoms are fever, headache, and neck stiffness.  Other symptoms include confusion or altered consciousness, nausea, vomiting, and an inability to tolerate light or loud noises.  Young children often exhibit only nonspecific symptoms, such as irritability, drowsiness, or poor feeding.  A non-blanching rash  may also be present. The inflammation may be caused by infection with viruses, bacteria, fungi or parasites.  Non-infectious causes include malignancy , subarachnoid hemorrhage, chronic inflammatory disease  and certain drugs Meningitis Meningitis",
        "response": "You're welcome. Please see a doctor as soon as possible and explain your symptoms to them. They may need to perform tests to determine if you have meningitis or not."
    },
    {
        "dialog": [
            "Hello Medi, I have some questions concerning meningitis",
            "Hello, I am happy to help. What would you like to know?",
            "What is meningitis and how do people get it?",
            "Meningitis is the inflammation of the protective membranes covering the brain and spinal cord. It can be caused by bacteria, viruses, fungi or other parasites.",
            "Ok, what are the symptoms of meningitis?",
            "The most common symptoms of meningitis are fever, headache, and neck stiffness. Other symptoms can include confusion or altered consciousness, nausea, vomiting, and an inability to tolerate light or loud noises.",
            "What should I do if I think I have meningitis?",
            "If you think you have meningitis, you should seek medical attention immediately. Meningitis can be very serious and requires prompt treatment.",
            "What kind of treatments are available for meningitis?"
        ],
        "knowledge": "Meningitis Meningitis Meningitis is acute or chronic inflammation of the protective membranes covering the brain and spinal cord, collectively called the meninges.  The most common symptoms are fever, headache, and neck stiffness.  Other symptoms include confusion or altered consciousness, nausea, vomiting, and an inability to tolerate light or loud noises.  Young children often exhibit only nonspecific symptoms, such as irritability, drowsiness, or poor feeding.  A non-blanching rash  may also be present. The inflammation may be caused by infection with viruses, bacteria, fungi or parasites.  Non-infectious causes include malignancy , subarachnoid hemorrhage, chronic inflammatory disease  and certain drugs Meningitis Meningitis",
        "response": "You're welcome! I hope I was able to answer your questions about meningitis. If you have any more questions, feel free to ask."
    },
    {
        "dialog": [
            "Hello Medi, I just had a spinal tap as part of my meningitis diagnosis.",
            "Hi there, how are you feeling?",
            "I'm feeling fine but I was wondering what I should do after having a spinal tap?",
            "After a spinal tap, it is important to stay lying down for several hours to prevent headaches.",
            "How long should I lie down for?",
            "You should try to lie down for at least four hours after the procedure.",
            "Is there anything else I should do after having a spinal tap?",
            "You should avoid strenuous physical activity for a few days after the procedure to allow your body to recover.",
            "Thank you for your help, Medi."
        ],
        "knowledge": "Meningitis Meningitis Meningitis is acute or chronic inflammation of the protective membranes covering the brain and spinal cord, collectively called the meninges.  The most common symptoms are fever, headache, and neck stiffness.  Other symptoms include confusion or altered consciousness, nausea, vomiting, and an inability to tolerate light or loud noises.  Young children often exhibit only nonspecific symptoms, such as irritability, drowsiness, or poor feeding.  A non-blanching rash  may also be present. The inflammation may be caused by infection with viruses, bacteria, fungi or parasites.  Non-infectious causes include malignancy , subarachnoid hemorrhage, chronic inflammatory disease  and certain drugs Meningitis Meningitis",
        "response": "You're welcome. I'm glad to hear you're feeling fine. Remember to take it easy for a few days and avoid any strenuous activity."
    },
    {
        "dialog": [
            "Hi Medi, I'm feeling unwell and I think I might have meningitis.",
            "Okay, let's start by determining your symptoms. What symptoms are you experiencing?",
            "I have a fever, headache, and a stiff neck. I also feel nauseous and sensitive to light.",
            "Based on your symptoms, it's possible that you have meningitis. You need to see a doctor immediately.",
            "What kind of tests will the doctor perform to confirm the diagnosis?",
            "The doctor will do a physical examination, check for signs of meningitis, and take a sample of your spinal fluid for testing.",
            "Is there any way to prevent meningitis?",
            "Some forms of meningitis can be prevented by vaccines. It's important to maintain good hygiene and avoid close contact with people who have meningitis.",
            "Thank you for your help, Medi."
        ],
        "knowledge": "Meningitis Meningitis Meningitis is acute or chronic inflammation of the protective membranes covering the brain and spinal cord, collectively called the meninges.  The most common symptoms are fever, headache, and neck stiffness.  Other symptoms include confusion or altered consciousness, nausea, vomiting, and an inability to tolerate light or loud noises.  Young children often exhibit only nonspecific symptoms, such as irritability, drowsiness, or poor feeding.  A non-blanching rash  may also be present. The inflammation may be caused by infection with viruses, bacteria, fungi or parasites.  Non-infectious causes include malignancy , subarachnoid hemorrhage, chronic inflammatory disease  and certain drugs Meningitis Meningitis",
        "response": "You must see a doctor immediately for a physical examination, signs check, and spinal fluid testing."
    },
    {
        "dialog": [
            "Hi Medi, I just learned about meningitis. Can you tell me more about it?",
            "Sure, meningitis is an inflammation of the membranes that surround the brain and spinal cord. It can be caused by viruses, bacteria, fungi, or parasites.",
            "What are the symptoms of meningitis?",
            "The most common symptoms are fever, headache, and neck stiffness. Other symptoms include confusion or altered consciousness, nausea, vomiting, and an inability to tolerate light or loud noises. Young children often exhibit only nonspecific symptoms, such as irritability, drowsiness, or poor feeding. A non-blanching rash may also be present.",
            "Is meningitis contagious?",
            "Yes, some forms of meningitis can be contagious. For example, bacterial meningitis is spread through close contact with an infected person's saliva or mucus.",
            "Can meningitis be treated?",
            "Yes, bacterial meningitis can be treated with antibiotics. Antiviral or antifungal medications may be used to treat other forms of meningitis.",
            "Thanks for explaining that to me, Medi."
        ],
        "knowledge": "Meningitis Meningitis Meningitis is acute or chronic inflammation of the protective membranes covering the brain and spinal cord, collectively called the meninges.  The most common symptoms are fever, headache, and neck stiffness.  Other symptoms include confusion or altered consciousness, nausea, vomiting, and an inability to tolerate light or loud noises.  Young children often exhibit only nonspecific symptoms, such as irritability, drowsiness, or poor feeding.  A non-blanching rash  may also be present. The inflammation may be caused by infection with viruses, bacteria, fungi or parasites.  Non-infectious causes include malignancy , subarachnoid hemorrhage, chronic inflammatory disease  and certain drugs Meningitis Meningitis",
        "response": "You're welcome, let me know if you have any other questions."
    },
    {
        "dialog": [
            "Hi Medi, I just had a lumbar puncture for meningitis. What can I do to take care of myself after the procedure?",
            "Rest and take it easy for the rest of the day. Drink plenty of fluids to help replace the spinal fluid that was removed.",
            "Can I take a bath or shower after the procedure?",
            "It's best to avoid taking a bath or shower for at least 24 hours after the procedure to reduce the risk of infection.",
            "Is there anything I should avoid after the procedure?",
            "Avoid any strenuous activity for a few days after the procedure. Avoid lifting anything heavy, and avoid bending or twisting your back.",
            "Thanks for your help, Medi.",
            "You're welcome. Let me know if you have any other questions or concerns."
        ],
        "knowledge": "Meningitis Meningitis Meningitis is acute or chronic inflammation of the protective membranes covering the brain and spinal cord, collectively called the meninges.  The most common symptoms are fever, headache, and neck stiffness.  Other symptoms include confusion or altered consciousness, nausea, vomiting, and an inability to tolerate light or loud noises.  Young children often exhibit only nonspecific symptoms, such as irritability, drowsiness, or poor feeding.  A non-blanching rash  may also be present. The inflammation may be caused by infection with viruses, bacteria, fungi or parasites.  Non-infectious causes include malignancy , subarachnoid hemorrhage, chronic inflammatory disease  and certain drugs Meningitis Meningitis",
        "response": "You're welcome. Take care of yourself and rest, let me know if you have any other questions or concerns."
    },
    {
        "dialog": [
            "Hi Medi, I'm feeling unwell. I have a headache and neck stiffness.",
            "Hmm, those could be symptoms of meningitis. Any other symptoms?",
            "I also have a fever and I'm vomiting.",
            "Based on your symptoms, I recommend you go to the hospital immediately.",
            "What's meningitis?",
            "It's an inflammation of the protective membranes covering the brain and spinal cord.",
            "Is it dangerous?",
            "Yes, it can be life-threatening if not treated quickly.",
            "Thank you Medi."
        ],
        "knowledge": "Meningitis Meningitis Meningitis is acute or chronic inflammation of the protective membranes covering the brain and spinal cord, collectively called the meninges.  The most common symptoms are fever, headache, and neck stiffness.  Other symptoms include confusion or altered consciousness, nausea, vomiting, and an inability to tolerate light or loud noises.  Young children often exhibit only nonspecific symptoms, such as irritability, drowsiness, or poor feeding.  A non-blanching rash  may also be present. The inflammation may be caused by infection with viruses, bacteria, fungi or parasites.  Non-infectious causes include malignancy , subarachnoid hemorrhage, chronic inflammatory disease  and certain drugs Meningitis Meningitis",
        "response": "Please go to the hospital immediately and get yourself checked for meningitis."
    },
    {
        "dialog": [
            "Hi Medi, I want to know more about meningitis.",
            "Sure, what would you like to know about it?",
            "What are the causes of meningitis?",
            "Meningitis can be caused by viruses, bacteria, fungi or parasites.",
            "What are the symptoms of meningitis?",
            "Some common symptoms are fever, headache, neck stiffness, and nausea.",
            "Is it contagious?",
            "Yes, some forms of meningitis can be contagious.",
            "Thanks for your help, Medi."
        ],
        "knowledge": "Meningitis Meningitis Meningitis is acute or chronic inflammation of the protective membranes covering the brain and spinal cord, collectively called the meninges.  The most common symptoms are fever, headache, and neck stiffness.  Other symptoms include confusion or altered consciousness, nausea, vomiting, and an inability to tolerate light or loud noises.  Young children often exhibit only nonspecific symptoms, such as irritability, drowsiness, or poor feeding.  A non-blanching rash  may also be present. The inflammation may be caused by infection with viruses, bacteria, fungi or parasites.  Non-infectious causes include malignancy , subarachnoid hemorrhage, chronic inflammatory disease  and certain drugs Meningitis Meningitis",
        "response": "You're welcome. Let me know if you have any other questions."
    },
    {
        "dialog": [
            "Hi Medi, I recently had meningitis. What should I do to stay healthy?",
            "I'm glad to hear that you're recovering. You should get plenty of rest and take your medications as prescribed.",
            "Are there any long-term effects of meningitis?",
            "Yes, some people may experience hearing loss, memory problems, or difficulty concentrating.",
            "What can I do to prevent meningitis?",
            "There are vaccines available to prevent some types of meningitis. You should also practice good hygiene and avoid contact with people who are sick.",
            "Thank you for your help, Medi.",
            "You're welcome. Take care of yourself."
        ],
        "knowledge": "Meningitis Meningitis Meningitis is acute or chronic inflammation of the protective membranes covering the brain and spinal cord, collectively called the meninges.  The most common symptoms are fever, headache, and neck stiffness.  Other symptoms include confusion or altered consciousness, nausea, vomiting, and an inability to tolerate light or loud noises.  Young children often exhibit only nonspecific symptoms, such as irritability, drowsiness, or poor feeding.  A non-blanching rash  may also be present. The inflammation may be caused by infection with viruses, bacteria, fungi or parasites.  Non-infectious causes include malignancy , subarachnoid hemorrhage, chronic inflammatory disease  and certain drugs Meningitis Meningitis",
        "response": "You're welcome. Let me know if you have any other questions."
    },
    {
        "dialog": [
            "Hello Medi, I'm feeling unwell.",
            "Hi there, can you tell me what symptoms you're experiencing?",
            "I have a fever, headache, and neck stiffness.",
            "Based on your symptoms, it's possible that you may have meningitis.",
            "What is meningitis?",
            "Meningitis is an inflammation of the protective membranes covering the brain and spinal cord.",
            "What are the other symptoms?",
            "Other symptoms include confusion or altered consciousness, nausea, vomiting, and an inability to tolerate light or loud noises.",
            "What should I do if I have meningitis?"
        ],
        "knowledge": "Meningitis Meningitis Meningitis is acute or chronic inflammation of the protective membranes covering the brain and spinal cord, collectively called the meninges.  The most common symptoms are fever, headache, and neck stiffness.  Other symptoms include confusion or altered consciousness, nausea, vomiting, and an inability to tolerate light or loud noises.  Young children often exhibit only nonspecific symptoms, such as irritability, drowsiness, or poor feeding.  A non-blanching rash  may also be present. The inflammation may be caused by infection with viruses, bacteria, fungi or parasites.  Non-infectious causes include malignancy , subarachnoid hemorrhage, chronic inflammatory disease  and certain drugs Meningitis Meningitis",
        "response": "If you have meningitis, you should see a doctor right away. They may prescribe antibiotics or antiviral medications depending on the cause of the infection."
    },
    {
        "dialog": [
            "Hello Medi, I have a question about meningitis.",
            "Sure, what would you like to know?",
            "What causes meningitis?",
            "Meningitis can be caused by a variety of factors, including viruses, bacteria, fungi, or parasites.",
            "Is there a way to prevent meningitis?",
            "You can reduce your risk of meningitis by practicing good hygiene and avoiding contact with infected individuals.",
            "What are the complications of meningitis?",
            "Meningitis can lead to severe complications such as brain damage, hearing loss, or even death.",
            "Are there any vaccines available for meningitis?"
        ],
        "knowledge": "Meningitis Meningitis Meningitis is acute or chronic inflammation of the protective membranes covering the brain and spinal cord, collectively called the meninges.  The most common symptoms are fever, headache, and neck stiffness.  Other symptoms include confusion or altered consciousness, nausea, vomiting, and an inability to tolerate light or loud noises.  Young children often exhibit only nonspecific symptoms, such as irritability, drowsiness, or poor feeding.  A non-blanching rash  may also be present. The inflammation may be caused by infection with viruses, bacteria, fungi or parasites.  Non-infectious causes include malignancy , subarachnoid hemorrhage, chronic inflammatory disease  and certain drugs Meningitis Meningitis",
        "response": "Yes, there are vaccines available for certain strains of bacterial meningitis. You should discuss with your doctor if you are a good candidate for vaccination."
    },
    {
        "dialog": [
            "Hello Medi, I recently had meningitis and recovered. What should I do to maintain my health?",
            "Glad to hear you recovered. You should rest and avoid strenuous activity for a few weeks.",
            "How can I manage the headaches that I still have?",
            "You can try over the counter pain relievers such as acetaminophen or ibuprofen. If your headaches persist, you should see your doctor.",
            "Are there any dietary changes I should make to aid my recovery?",
            "A healthy and balanced diet with plenty of fruits and vegetables can help your immune system recover. You should also drink plenty of fluids.",
            "Can I go back to work or school?",
            "You should wait until your doctor clears you to return to work or school.",
            "How long does it typically take to recover from meningitis?"
        ],
        "knowledge": "Meningitis Meningitis Meningitis is acute or chronic inflammation of the protective membranes covering the brain and spinal cord, collectively called the meninges.  The most common symptoms are fever, headache, and neck stiffness.  Other symptoms include confusion or altered consciousness, nausea, vomiting, and an inability to tolerate light or loud noises.  Young children often exhibit only nonspecific symptoms, such as irritability, drowsiness, or poor feeding.  A non-blanching rash  may also be present. The inflammation may be caused by infection with viruses, bacteria, fungi or parasites.  Non-infectious causes include malignancy , subarachnoid hemorrhage, chronic inflammatory disease  and certain drugs Meningitis Meningitis",
        "response": "The recovery time from meningitis can vary depending on the severity of the infection and the individual's overall health. It may take several weeks or months to fully recover."
    },
    {
        "dialog": [
            "Hi Medi, I feel feverish and I have a headache.",
            "Okay, let me ask you some questions to help diagnose your condition.",
            "Sure, go ahead.",
            "Do you have any neck stiffness or sensitivity to light?",
            "Yes, I do.",
            "You may have meningitis. Seek medical attention immediately.",
            "What should I do in the meantime?",
            "Rest and avoid contact with others until you see a doctor.",
            "Okay, thank you."
        ],
        "knowledge": "Meningitis Meningitis Meningitis is acute or chronic inflammation of the protective membranes covering the brain and spinal cord, collectively called the meninges.  The most common symptoms are fever, headache, and neck stiffness.  Other symptoms include confusion or altered consciousness, nausea, vomiting, and an inability to tolerate light or loud noises.  Young children often exhibit only nonspecific symptoms, such as irritability, drowsiness, or poor feeding.  A non-blanching rash  may also be present. The inflammation may be caused by infection with viruses, bacteria, fungi or parasites.  Non-infectious causes include malignancy , subarachnoid hemorrhage, chronic inflammatory disease  and certain drugs Meningitis Meningitis",
        "response": "You may have meningitis. Seek medical attention immediately. Rest and avoid contact with others until you see a doctor."
    },
    {
        "dialog": [
            "Hi Medi, I have some questions about meningitis.",
            "Sure, what would you like to know?",
            "What are the symptoms of meningitis?",
            "The most common symptoms are fever, headache, and neck stiffness. Other symptoms include confusion or altered consciousness, nausea, vomiting, and an inability to tolerate light or loud noises.",
            "What causes meningitis?",
            "The inflammation may be caused by infection with viruses, bacteria, fungi or parasites. Non-infectious causes include malignancy, subarachnoid hemorrhage, chronic inflammatory disease, and certain drugs.",
            "Can meningitis be prevented?",
            "Meningitis caused by bacterial infections can be prevented with vaccines. Practicing good hygiene can also help prevent the spread of viral meningitis.",
            "Thank you for the information."
        ],
        "knowledge": "Meningitis Meningitis Meningitis is acute or chronic inflammation of the protective membranes covering the brain and spinal cord, collectively called the meninges.  The most common symptoms are fever, headache, and neck stiffness.  Other symptoms include confusion or altered consciousness, nausea, vomiting, and an inability to tolerate light or loud noises.  Young children often exhibit only nonspecific symptoms, such as irritability, drowsiness, or poor feeding.  A non-blanching rash  may also be present. The inflammation may be caused by infection with viruses, bacteria, fungi or parasites.  Non-infectious causes include malignancy , subarachnoid hemorrhage, chronic inflammatory disease  and certain drugs Meningitis Meningitis",
        "response": "Meningitis caused by bacterial infections can be prevented with vaccines. Practicing good hygiene can also help prevent the spread of viral meningitis."
    },
    {
        "dialog": [
            "Hi Medi, I just recovered from meningitis. What should I do to regain my health?",
            "Congratulations on your recovery! You should take it easy and avoid overexerting yourself.",
            "What kind of diet should I follow?",
            "You should eat a well-balanced diet that includes plenty of fruits and vegetables, lean protein, and whole grains. Drink plenty of water and avoid alcohol and caffeine.",
            "What kind of physical activity is safe to do?",
            "It's best to start with light exercise such as stretching or walking and gradually increase intensity as you feel comfortable.",
            "What kind of lifestyle changes should I make?",
            "Get plenty of rest, avoid stress, and follow your doctor's instructions regarding any medications or follow-up appointments.",
            "Thank you for the advice."
        ],
        "knowledge": "Meningitis Meningitis Meningitis is acute or chronic inflammation of the protective membranes covering the brain and spinal cord, collectively called the meninges.  The most common symptoms are fever, headache, and neck stiffness.  Other symptoms include confusion or altered consciousness, nausea, vomiting, and an inability to tolerate light or loud noises.  Young children often exhibit only nonspecific symptoms, such as irritability, drowsiness, or poor feeding.  A non-blanching rash  may also be present. The inflammation may be caused by infection with viruses, bacteria, fungi or parasites.  Non-infectious causes include malignancy , subarachnoid hemorrhage, chronic inflammatory disease  and certain drugs Meningitis Meningitis",
        "response": "Get plenty of rest, avoid stress, and follow your doctor's instructions regarding any medications or follow-up appointments."
    },
    {
        "dialog": [
            "Hi, Medi. I'm feeling unwell and I think I have meningitis.",
            "I'm sorry to hear that. What are your symptoms?",
            "I have a fever, headache, and a stiff neck.",
            "Those are all common symptoms of meningitis. I suggest you see a doctor immediately.",
            "What kind of treatment will I need?",
            "It depends on the cause of your meningitis. Treatment can range from antibiotics to antivirals, and in severe cases, hospitalization may be necessary.",
            "Is there anything I can do to prevent meningitis?",
            "Some types of meningitis can be prevented by vaccines. It's also important to practice good hygiene, such as washing your hands frequently and avoiding close contact with people who are sick.",
            "Thank you, Medi. What should I expect from treatment?"
        ],
        "knowledge": "Meningitis Meningitis is acute or chronic inflammation of the protective membranes covering the brain and spinal cord, collectively called the meninges. The most common symptoms are fever, headache, and neck stiffness. Other symptoms include confusion or altered consciousness, nausea, vomiting, and an inability to tolerate light or loud noises. Young children often exhibit only nonspecific symptoms, such as irritability, drowsiness, or poor feeding. A non-blanching rash may also be present. The inflammation may be caused by infection with viruses, bacteria, fungi or parasites. Non-infectious causes include malignancy, subarachnoid hemorrhage, chronic inflammatory disease, and certain drugs.",
        "response": "Your doctor will determine the best course of treatment based on the cause of your meningitis. Treatment can range from antibiotics to antivirals, and in severe cases, hospitalization may be necessary."
    },
    {
        "dialog": [
            "Hi, Medi. I have a question about meningitis.",
            "Of course, what would you like to know?",
            "What causes meningitis?",
            "Meningitis can be caused by a number of factors, including infections from viruses, bacteria, fungi, or parasites, as well as non-infectious causes such as malignancy, chronic inflammatory disease, or certain drugs.",
            "What are the symptoms of meningitis?",
            "The most common symptoms of meningitis are fever, headache, and neck stiffness. Other symptoms include confusion or altered consciousness, nausea, vomiting, and an inability to tolerate light or loud noises. Young children often exhibit only nonspecific symptoms, such as irritability, drowsiness, or poor feeding. A non-blanching rash may also be present.",
            "Is meningitis contagious?",
            "Some forms of meningitis can be contagious, particularly those caused by viruses or bacteria. It's important to practice good hygiene, such as washing your hands frequently and avoiding close contact with people who are sick.",
            "Thanks, Medi. How is meningitis treated?"
        ],
        "knowledge": "Meningitis Meningitis is acute or chronic inflammation of the protective membranes covering the brain and spinal cord, collectively called the meninges. The most common symptoms are fever, headache, and neck stiffness. Other symptoms include confusion or altered consciousness, nausea, vomiting, and an inability to tolerate light or loud noises. Young children often exhibit only nonspecific symptoms, such as irritability, drowsiness, or poor feeding. A non-blanching rash may also be present. The inflammation may be caused by infection with viruses, bacteria, fungi or parasites. Non-infectious causes include malignancy, subarachnoid hemorrhage, chronic inflammatory disease, and certain drugs.",
        "response": "Treatment for meningitis can range from antibiotics to antivirals, and in severe cases, hospitalization may be necessary. Your doctor will determine the best course of treatment based on the cause of your meningitis."
    },
    {
        "dialog": [
            "Hi, Medi. I recently recovered from meningitis. What lifestyle changes should I make?",
            "I'm glad to hear you're feeling better. After meningitis, it's important to get plenty of rest and stay hydrated. You may also want to consider making changes to your diet and exercise routine to support your recovery.",
            "What kind of diet changes should I make?",
            "A healthy diet rich in fruits, vegetables, lean protein, and whole grains can support your recovery. You may also want to limit your intake of processed foods, sugar, and saturated fats.",
            "What kind of exercise should I do?",
            "Gentle exercise, such as walking or yoga, can be beneficial for your recovery. However, it's important to listen to your body and not push yourself too hard too quickly.",
            "Thanks, Medi. What else can I do to support my recovery?",
            "Getting plenty of rest and avoiding stress can also be helpful for your recovery. It's important to be patient and give yourself time to heal.",
            "That makes sense. Thanks for your help, Medi."
        ],
        "knowledge": "Meningitis Meningitis is acute or chronic inflammation of the protective membranes covering the brain and spinal cord, collectively called the meninges. The most common symptoms are fever, headache, and neck stiffness. Other symptoms include confusion or altered consciousness, nausea, vomiting, and an inability to tolerate light or loud noises. Young children often exhibit only nonspecific symptoms, such as irritability, drowsiness, or poor feeding. A non-blanching rash may also be present. The inflammation may be caused by infection with viruses, bacteria, fungi or parasites. Non-infectious causes include malignancy, subarachnoid hemorrhage, chronic inflammatory disease, and certain drugs.",
        "response": "You're welcome. Remember to prioritize rest, hydration, and a healthy diet to support your recovery from meningitis."
    },
    {
        "dialog": [
            "Hi Medi! I think I'm having a fever, headache, and neck stiffness. What should I do?",
            "Based on your symptoms, it is possible that you have meningitis. You should seek medical attention immediately.",
            "Oh no, I'm really scared. Can you tell me more about meningitis?",
            "Meningitis is an inflammation of the lining around the brain and spinal cord. It can be caused by bacteria or viruses.",
            "How is meningitis treated?",
            "Treatment depends on the cause of the meningitis. Bacterial meningitis is treated with antibiotics, while viral meningitis is usually treated with supportive care.",
            "Thank you for your help. Is there anything else I should know about meningitis?",
            "Yes, it's important to know that meningitis can be very serious and can cause long-term complications, so seeking medical attention immediately is crucial.",
            "Thank you for the advice, Medi."
        ],
        "knowledge": "Meningitis Meningitis Meningitis is acute or chronic inflammation of the protective membranes covering the brain and spinal cord, collectively called the meninges.  The most common symptoms are fever, headache, and neck stiffness.  Other symptoms include confusion or altered consciousness, nausea, vomiting, and an inability to tolerate light or loud noises.  Young children often exhibit only nonspecific symptoms, such as irritability, drowsiness, or poor feeding.  A non-blanching rash  may also be present. The inflammation may be caused by infection with viruses, bacteria, fungi or parasites.  Non-infectious causes include malignancy , subarachnoid hemorrhage, chronic inflammatory disease  and certain drugs Meningitis Meningitis",
        "response": "You're welcome. I hope you'll seek medical attention soon and get better soon."
    },
    {
        "dialog": [
            "Hi Medi, I'm just curious about meningitis. What causes it?",
            "Meningitis can be caused by infection with viruses, bacteria, fungi, or parasites. Non-infectious causes include malignancy, subarachnoid hemorrhage, chronic inflammatory disease, and certain drugs.",
            "What are the symptoms of meningitis?",
            "The most common symptoms are fever, headache, and neck stiffness. Other symptoms include confusion or altered consciousness, nausea, vomiting, and an inability to tolerate light or loud noises. Young children often exhibit only nonspecific symptoms, such as irritability, drowsiness, or poor feeding. A non-blanching rash may also be present.",
            "Is meningitis treatable?",
            "Treatment depends on the cause of the meningitis. Bacterial meningitis is treated with antibiotics, while viral meningitis is usually treated with supportive care.",
            "What are the long-term effects of meningitis?",
            "Meningitis can cause long-term complications such as hearing loss, brain damage, and learning difficulties, so seeking medical attention immediately is crucial.",
            "Thank you for the information, Medi."
        ],
        "knowledge": "Meningitis Meningitis Meningitis is acute or chronic inflammation of the protective membranes covering the brain and spinal cord, collectively called the meninges.  The most common symptoms are fever, headache, and neck stiffness.  Other symptoms include confusion or altered consciousness, nausea, vomiting, and an inability to tolerate light or loud noises.  Young children often exhibit only nonspecific symptoms, such as irritability, drowsiness, or poor feeding.  A non-blanching rash  may also be present. The inflammation may be caused by infection with viruses, bacteria, fungi or parasites.  Non-infectious causes include malignancy , subarachnoid hemorrhage, chronic inflammatory disease  and certain drugs Meningitis Meningitis",
        "response": "You're welcome. I hope you found the information helpful."
    },
    {
        "dialog": [
            "Hi Medi, I recently had meningitis. Do you have any advice for my recovery?",
            "Yes, it's important to get plenty of rest and stay hydrated. You may also need medication to manage your symptoms.",
            "Are there any lifestyle changes I should make to help with my recovery?",
            "Yes, it's important to eat a healthy diet with plenty of fruits and vegetables, and to avoid alcohol and smoking. You may also want to consider doing light exercises such as stretching or walking.",
            "What long-term effects could meningitis have on my health?",
            "Meningitis can cause long-term complications such as hearing loss, brain damage, and learning difficulties, so it's important to follow up with your doctor regularly.",
            "Thank you for the advice, Medi. I appreciate it.",
            "You're welcome. I hope you have a speedy recovery."
        ],
        "knowledge": "Meningitis Meningitis Meningitis is acute or chronic inflammation of the protective membranes covering the brain and spinal cord, collectively called the meninges.  The most common symptoms are fever, headache, and neck stiffness.  Other symptoms include confusion or altered consciousness, nausea, vomiting, and an inability to tolerate light or loud noises.  Young children often exhibit only nonspecific symptoms, such as irritability, drowsiness, or poor feeding.  A non-blanching rash  may also be present. The inflammation may be caused by infection with viruses, bacteria, fungi or parasites.  Non-infectious causes include malignancy , subarachnoid hemorrhage, chronic inflammatory disease  and certain drugs Meningitis Meningitis",
        "response": "You're welcome. I hope you have a smooth recovery process and don't experience any long-term complications."
    },
    {
        "dialog": [
            "Hello Medi, I'm feeling very sick.",
            "I'm sorry to hear that. What are your symptoms?",
            "I have a fever, a headache, and neck stiffness.",
            "Hmm, those are common symptoms for meningitis. You should see a doctor immediately.",
            "How is meningitis caused?",
            "It can be caused by viruses, bacteria, fungi, or parasites.",
            "What should I do while I wait to see a doctor?",
            "Rest and avoid close contact with others. Take over-the-counter pain relief and drink plenty of fluids.",
            "Thank you for your help, Medi."
        ],
        "knowledge": "Meningitis Meningitis Meningitis is acute or chronic inflammation of the protective membranes covering the brain and spinal cord, collectively called the meninges.  The most common symptoms are fever, headache, and neck stiffness.  Other symptoms include confusion or altered consciousness, nausea, vomiting, and an inability to tolerate light or loud noises.  Young children often exhibit only nonspecific symptoms, such as irritability, drowsiness, or poor feeding.  A non-blanching rash  may also be present. The inflammation may be caused by infection with viruses, bacteria, fungi or parasites.  Non-infectious causes include malignancy , subarachnoid hemorrhage, chronic inflammatory disease  and certain drugs Meningitis Meningitis",
        "response": "You're welcome. Please see a doctor immediately. Meningitis can be very serious and requires prompt medical attention."
    },
    {
        "dialog": [
            "Hi Medi, can you tell me more about meningitis?",
            "Of course! Meningitis is inflammation of the protective membranes covering the brain and spinal cord.",
            "What are the symptoms?",
            "The most common symptoms are fever, headache, and neck stiffness. Other symptoms may include confusion, nausea, vomiting, and sensitivity to light or loud noises. A non-blanching rash may also be present.",
            "How is meningitis treated?",
            "It depends on the cause. Bacterial meningitis is treated with antibiotics while viral meningitis usually clears up on its own. Hospitalization may be necessary for severe cases.",
            "Is meningitis contagious?",
            "Yes, it can be contagious. It spreads through contact with respiratory and throat secretions.",
            "Thank you for the information, Medi."
        ],
        "knowledge": "Meningitis Meningitis Meningitis is acute or chronic inflammation of the protective membranes covering the brain and spinal cord, collectively called the meninges.  The most common symptoms are fever, headache, and neck stiffness.  Other symptoms include confusion or altered consciousness, nausea, vomiting, and an inability to tolerate light or loud noises.  Young children often exhibit only nonspecific symptoms, such as irritability, drowsiness, or poor feeding.  A non-blanching rash  may also be present. The inflammation may be caused by infection with viruses, bacteria, fungi or parasites.  Non-infectious causes include malignancy , subarachnoid hemorrhage, chronic inflammatory disease  and certain drugs Meningitis Meningitis",
        "response": "You're welcome. If you have any more questions, feel free to ask."
    },
    {
        "dialog": [
            "Hey Medi, I just got diagnosed with meningitis. What should I do?",
            "I'm sorry to hear that. The most important thing is to follow your doctor's instructions.",
            "What can I expect during treatment?",
            "Treatment depends on the cause of the meningitis. You may need to stay in the hospital and receive antibiotics or antiviral medication.",
            "Will I make a full recovery?",
            "Most people do make a full recovery, but the recovery time can vary. Some people may experience long-term complications such as hearing loss or seizures.",
            "What can I do to prevent meningitis?",
            "Practice good hygiene, avoid close contact with sick people, and stay up-to-date on vaccines such as the meningococcal vaccine.",
            "Thank you for the advice, Medi."
        ],
        "knowledge": "Meningitis Meningitis Meningitis is acute or chronic inflammation of the protective membranes covering the brain and spinal cord, collectively called the meninges.  The most common symptoms are fever, headache, and neck stiffness.  Other symptoms include confusion or altered consciousness, nausea, vomiting, and an inability to tolerate light or loud noises.  Young children often exhibit only nonspecific symptoms, such as irritability, drowsiness, or poor feeding.  A non-blanching rash  may also be present. The inflammation may be caused by infection with viruses, bacteria, fungi or parasites.  Non-infectious causes include malignancy , subarachnoid hemorrhage, chronic inflammatory disease  and certain drugs Meningitis Meningitis",
        "response": "You're welcome. I hope you have a speedy recovery. If you have any questions, don't hesitate to ask your doctor."
    }
]