[
    {
        "dialog": [
            "Hello Medi, I am feeling very irritable and have difficulty in breathing.",
            "Sorry to hear that. Can you tell me more about your symptoms?",
            "Yes, I have difficulty in breathing and sometimes feel like I am suffocating. Also, I often feel dizzy and my heart beats faster than usual.",
            "Based on your symptoms, it seems like you might have hypertension. You need to see a doctor as soon as possible.",
            "What is hypertension exactly?",
            "Hypertension is a condition where your blood pressure is consistently high. It is a serious condition that can lead to heart disease, stroke, and other complications.",
            "Can it be cured?",
            "It can be managed and controlled with medication and lifestyle changes.",
            "What kind of lifestyle changes do I need to make?"
        ],
        "knowledge": "Hypertension Hypertension In contrast, gestational hypertension is defined as new-onset hypertension during pregnancy without protein in the urine. Failure to thrive, seizures, irritability, lack of energy, and difficulty in breathing can be associated with hypertension in newborns and young infants.  In older infants and children, hypertension can cause headache, unexplained irritability, fatigue, failure to thrive, blurred vision, nosebleeds, and facial paralysis. Hypertension results from a complex interaction of genes and environmental factors.  Numerous common genetic variants with small effects on blood pressure have been identified as well as some rare genetic variants with large effects on blood pressure.  Also, genome-wide association studies  have identified 35 genetic loci related to blood pressure; 12 of these genetic loci influencing blood pressure were newly found.  Sentinel SNP for each new genetic locus identified has shown an association with DNA methylation at multiple nearby CpG sites Hypertension Hypertension",
        "response": "You need to reduce your salt intake, quit smoking, engage in regular physical activity, lose weight if you are overweight, and manage stress."
    },
    {
        "dialog": [
            "Hello Medi, I have a few questions about hypertension.",
            "Sure thing, I'm here to help. What would you like to know?",
            "What causes hypertension?",
            "It's a complex condition that can be caused by a variety of factors such as genetics, unhealthy lifestyle, and underlying health conditions.",
            "What are some of the other health conditions that can lead to hypertension?",
            "Some of the conditions that can increase your risk of hypertension are diabetes, sleep apnea, and kidney disease.",
            "Are there any symptoms of hypertension that I should be aware of?",
            "In most cases, hypertension doesn't have any noticeable symptoms, which is why it's often referred to as the 'silent killer.' That's why it's important to get your blood pressure checked regularly.",
            "How often should I get my blood pressure checked?"
        ],
        "knowledge": "Hypertension Hypertension In contrast, gestational hypertension is defined as new-onset hypertension during pregnancy without protein in the urine. Failure to thrive, seizures, irritability, lack of energy, and difficulty in breathing can be associated with hypertension in newborns and young infants.  In older infants and children, hypertension can cause headache, unexplained irritability, fatigue, failure to thrive, blurred vision, nosebleeds, and facial paralysis. Hypertension results from a complex interaction of genes and environmental factors.  Numerous common genetic variants with small effects on blood pressure have been identified as well as some rare genetic variants with large effects on blood pressure.  Also, genome-wide association studies  have identified 35 genetic loci related to blood pressure; 12 of these genetic loci influencing blood pressure were newly found.  Sentinel SNP for each new genetic locus identified has shown an association with DNA methylation at multiple nearby CpG sites Hypertension Hypertension",
        "response": "If you are over 18 and have normal blood pressure, you should get it checked at least every 2 years. If you have high blood pressure, your doctor may recommend more frequent checks."
    },
    {
        "dialog": [
            "Hello Medi, I just had a procedure done and I need advice on what to do next.",
            "Of course. What kind of procedure did you have?",
            "I had a surgery done to treat my hypertension.",
            "That's good to hear. After the procedure, it's important to take care of yourself and follow your doctor's instructions closely. ",
            "What kind of lifestyle changes should I make after the procedure?",
            "After the procedure, it's important to maintain a healthy weight, eat a balanced diet, and engage in regular physical activity. You should also quit smoking and limit your alcohol intake.",
            "Are there any foods that I should avoid?",
            "You should avoid foods that are high in salt, saturated fat, and cholesterol. These include processed foods, fried foods, and red meat.",
            "What about physical activity? How much should I be doing?"
        ],
        "knowledge": "Hypertension Hypertension In contrast, gestational hypertension is defined as new-onset hypertension during pregnancy without protein in the urine. Failure to thrive, seizures, irritability, lack of energy, and difficulty in breathing can be associated with hypertension in newborns and young infants.  In older infants and children, hypertension can cause headache, unexplained irritability, fatigue, failure to thrive, blurred vision, nosebleeds, and facial paralysis. Hypertension results from a complex interaction of genes and environmental factors.  Numerous common genetic variants with small effects on blood pressure have been identified as well as some rare genetic variants with large effects on blood pressure.  Also, genome-wide association studies  have identified 35 genetic loci related to blood pressure; 12 of these genetic loci influencing blood pressure were newly found.  Sentinel SNP for each new genetic locus identified has shown an association with DNA methylation at multiple nearby CpG sites Hypertension Hypertension",
        "response": "Your doctor will provide specific guidelines based on your individual case, but generally, you should aim to do at least 30 minutes of moderate-intensity exercise most days of the week."
    },
    {
        "dialog": [
            "Hi Medi, I have a headache and nosebleed, what should I do?",
            "Based on your symptoms, you may have hypertension. You should measure your blood pressure.",
            "I have never measured my blood pressure before. How can I do it?",
            "There are many blood pressure monitors you can purchase at a drugstore, or you can visit a clinic or hospital to have your blood pressure checked.",
            "If I have hypertension, what are the symptoms?",
            "Hypertension can cause headaches, nosebleeds, and facial paralysis.",
            "What can I do to prevent hypertension?",
            "You can prevent hypertension by maintaining a healthy weight, exercising regularly, reducing salt in your diet, and not smoking.",
            "Thanks for the advice, Medi. Can you suggest some exercises for me?"
        ],
        "knowledge": "Hypertension Hypertension In contrast, gestational hypertension is defined as new-onset hypertension during pregnancy without protein in the urine. Failure to thrive, seizures, irritability, lack of energy, and difficulty in breathing can be associated with hypertension in newborns and young infants.  In older infants and children, hypertension can cause headache, unexplained irritability, fatigue, failure to thrive, blurred vision, nosebleeds, and facial paralysis. Hypertension results from a complex interaction of genes and environmental factors.  Numerous common genetic variants with small effects on blood pressure have been identified as well as some rare genetic variants with large effects on blood pressure.  Also, genome-wide association studies  have identified 35 genetic loci related to blood pressure; 12 of these genetic loci influencing blood pressure were newly found.  Sentinel SNP for each new genetic locus identified has shown an association with DNA methylation at multiple nearby CpG sites Hypertension Hypertension",
        "response": "Sure, aerobic exercises like walking, jogging, or swimming can help lower your blood pressure. Yoga and other relaxation exercises can also be helpful."
    },
    {
        "dialog": [
            "Hello Medi, I recently had a heart attack. What diet should I follow?",
            "You should eat a low-fat, high-fiber diet with plenty of fruits, vegetables, whole grains, and lean proteins.",
            "Can you suggest some foods for me to avoid?",
            "You should avoid saturated fats, trans fats, and cholesterol found in fatty meats, whole milk, and cheese. Also, limit your intake of salt and sugar.",
            "What about alcohol and caffeine?",
            "You should limit your alcohol intake to no more than one drink per day for women or two drinks per day for men. You can drink caffeine in moderation, but avoid energy drinks.",
            "Can I eat fish?",
            "Yes, eating fish high in omega-3 fatty acids can benefit your heart. Examples include salmon, tuna, and mackerel.",
            "Thank you for the advice, Medi. Can I still eat chocolate?"
        ],
        "knowledge": "Heart Attack Heart Attack A heart attack occurs when the flow of blood to the heart muscle is blocked. Common symptoms include chest pain or discomfort, upper body pain or discomfort, shortness of breath, sweating, nausea, and lightheadedness. Risk factors for heart attack include high blood pressure, high cholesterol, smoking, diabetes, and a family history of heart disease.  A healthy diet can help reduce your risk of heart disease and heart attack by lowering cholesterol and blood pressure. Heart-healthy foods include fruits, vegetables, whole grains, low-fat dairy, lean proteins, and healthy fats. Heart Attack Heart Attack",
        "response": "Dark chocolate in moderation can have health benefits for your heart, but be sure to choose a variety with a high percentage of cocoa and avoid added sugar."
    },
    {
        "dialog": [
            "Hi Medi, I had heart surgery a week ago. What should I do in terms of physical activity?",
            "You should start with light physical activity like walking and gradually increase your activity level as instructed by your doctor.",
            "What about weightlifting or other strenuous exercises?",
            "You should avoid any strenuous exercise or heavy lifting for at least 6 weeks after surgery.",
            "What about swimming or cycling?",
            "You can start swimming or cycling when you feel comfortable, but be sure to avoid strenuous swimming or cycling.",
            "What about stretching?",
            "Gentle stretching can help improve your flexibility and range of motion, but be sure to avoid any movements that cause pain.",
            "Thanks for the advice, Medi. How long should I avoid driving?"
        ],
        "knowledge": "Heart Surgery Heart Surgery After heart surgery, it is important to gradually increase your physical activity level as instructed by your doctor. Walking is a good exercise to start with. Avoid strenuous exercise or heavy lifting for at least 6 weeks after surgery. Swimming, cycling, and gentle stretching can be helpful, but avoid movements that cause pain. You should also avoid driving until your doctor approves.",
        "response": "You should avoid driving for at least 1 week after surgery or until your doctor approves."
    },
    {
        "dialog": [
            "Hi Medi, I'm experiencing some symptoms and I'm not sure what it could be.",
            "Hi there, I'll do my best to help. What are your symptoms?",
            "I have been experiencing headaches and nosebleeds recently.",
            "Based on your symptoms, it may be possible that you have hypertension.",
            "What is hypertension exactly?",
            "Hypertension, also known as high blood pressure, is a condition where the force of the blood against your artery walls is too high.",
            "What causes hypertension?",
            "There are many factors that can cause hypertension, including genetics and lifestyle choices.",
            "What should I do if I have hypertension?"
        ],
        "knowledge": "Hypertension Hypertension In contrast, gestational hypertension is defined as new-onset hypertension during pregnancy without protein in the urine. Failure to thrive, seizures, irritability, lack of energy, and difficulty in breathing can be associated with hypertension in newborns and young infants.  In older infants and children, hypertension can cause headache, unexplained irritability, fatigue, failure to thrive, blurred vision, nosebleeds, and facial paralysis. Hypertension results from a complex interaction of genes and environmental factors.  Numerous common genetic variants with small effects on blood pressure have been identified as well as some rare genetic variants with large effects on blood pressure.  Also, genome-wide association studies  have identified 35 genetic loci related to blood pressure; 12 of these genetic loci influencing blood pressure were newly found.  Sentinel SNP for each new genetic locus identified has shown an association with DNA methylation at multiple nearby CpG sites Hypertension Hypertension",
        "response": "It's important to monitor your blood pressure and make lifestyle changes such as exercising regularly and eating a healthy diet. You may also need medication to manage your hypertension."
    },
    {
        "dialog": [
            "Hello Medi, can you explain more about hypertension?",
            "Sure thing. Hypertension is a condition where the force of the blood against your artery walls is too high.",
            "Are there specific groups of people who are more at risk for hypertension?",
            "Yes, certain factors can increase your risk for hypertension, such as age, genetics, and lifestyle choices.",
            "What are some lifestyle choices that I should avoid to prevent hypertension?",
            "You should avoid smoking, excessive alcohol consumption, and eating a diet high in salt and saturated fats.",
            "What kind of exercises are recommended for preventing hypertension?",
            "Aerobic exercises such as running and cycling are great for preventing hypertension.",
            "What are some symptoms of hypertension?"
        ],
        "knowledge": "Hypertension Hypertension In contrast, gestational hypertension is defined as new-onset hypertension during pregnancy without protein in the urine. Failure to thrive, seizures, irritability, lack of energy, and difficulty in breathing can be associated with hypertension in newborns and young infants.  In older infants and children, hypertension can cause headache, unexplained irritability, fatigue, failure to thrive, blurred vision, nosebleeds, and facial paralysis. Hypertension results from a complex interaction of genes and environmental factors.  Numerous common genetic variants with small effects on blood pressure have been identified as well as some rare genetic variants with large effects on blood pressure.  Also, genome-wide association studies  have identified 35 genetic loci related to blood pressure; 12 of these genetic loci influencing blood pressure were newly found.  Sentinel SNP for each new genetic locus identified has shown an association with DNA methylation at multiple nearby CpG sites Hypertension Hypertension",
        "response": "Some symptoms of hypertension include headaches, nosebleeds, blurred vision, fatigue and difficulty breathing."
    },
    {
        "dialog": [
            "Hi Medi, I was recently diagnosed with hypertension. What lifestyle changes should I make?",
            "Hi there, lifestyle changes are very important in managing hypertension. What's your current diet like?",
            "I tend to eat a lot of fried and processed foods.",
            "It's important to reduce your intake of salt and saturated fats. Eating more fruits, vegetables and lean proteins can be helpful.",
            "What about exercise?",
            "Regular exercise can greatly help improve your blood pressure. Aim for at least 30 minutes of physical activity a day.",
            "Are there any supplements I can take to help with hypertension?",
            "Some supplements such as fish oil, magnesium and coenzyme Q10 have been shown to be helpful in managing hypertension.",
            "Are there any foods that are particularly good for managing hypertension?"
        ],
        "knowledge": "Hypertension Hypertension In contrast, gestational hypertension is defined as new-onset hypertension during pregnancy without protein in the urine. Failure to thrive, seizures, irritability, lack of energy, and difficulty in breathing can be associated with hypertension in newborns and young infants.  In older infants and children, hypertension can cause headache, unexplained irritability, fatigue, failure to thrive, blurred vision, nosebleeds, and facial paralysis. Hypertension results from a complex interaction of genes and environmental factors.  Numerous common genetic variants with small effects on blood pressure have been identified as well as some rare genetic variants with large effects on blood pressure.  Also, genome-wide association studies  have identified 35 genetic loci related to blood pressure; 12 of these genetic loci influencing blood pressure were newly found.  Sentinel SNP for each new genetic locus identified has shown an association with DNA methylation at multiple nearby CpG sites Hypertension Hypertension",
        "response": "Yes, foods that are rich in potassium such as bananas and avocados can help manage hypertension. Eating dark chocolate and drinking green tea have also been shown to have a positive impact on blood pressure."
    },
    {
        "dialog": [
            "Hello Medi, I have been feeling unwell lately.",
            "Hi! Can you tell me the symptoms you are experiencing?",
            "I have been feeling quite fatigued and have been experiencing headaches.",
            "How long have you been experiencing these symptoms?",
            "For about a week now.",
            "Have you been getting enough sleep?",
            "Yes, I have been sleeping about eight hours a night.",
            "It could be hypertension, have you taken your blood pressure recently?",
            "No, I haven't. What should I do now?"
        ],
        "knowledge": "Hypertension Hypertension In contrast, gestational hypertension is defined as new-onset hypertension during pregnancy without protein in the urine. Failure to thrive, seizures, irritability, lack of energy, and difficulty in breathing can be associated with hypertension in newborns and young infants.  In older infants and children, hypertension can cause headache, unexplained irritability, fatigue, failure to thrive, blurred vision, nosebleeds, and facial paralysis. Hypertension results from a complex interaction of genes and environmental factors.  Numerous common genetic variants with small effects on blood pressure have been identified as well as some rare genetic variants with large effects on blood pressure.  Also, genome-wide association studies  have identified 35 genetic loci related to blood pressure; 12 of these genetic loci influencing blood pressure were newly found.  Sentinel SNP for each new genetic locus identified has shown an association with DNA methylation at multiple nearby CpG sites Hypertension Hypertension",
        "response": "I suggest you take your blood pressure immediately and consult with your doctor or a healthcare provider."
    },
    {
        "dialog": [
            "Hi Medi, can you tell me more about hypertension?",
            "Sure! Hypertension is a medical condition where the blood pressure in your arteries is consistently high.",
            "What causes hypertension?",
            "There is no one cause of hypertension, but it can result from a complex interaction of genes and environmental factors.",
            "What are the symptoms of hypertension?",
            "Hypertension can cause headache, unexplained irritability, fatigue, failure to thrive, blurred vision, nosebleeds, and facial paralysis.",
            "Is hypertension curable?",
            "It is not curable, but it can be managed through medication, lifestyle changes, and regular monitoring.",
            "What kind of lifestyle changes can help manage hypertension?"
        ],
        "knowledge": "Hypertension Hypertension In contrast, gestational hypertension is defined as new-onset hypertension during pregnancy without protein in the urine. Failure to thrive, seizures, irritability, lack of energy, and difficulty in breathing can be associated with hypertension in newborns and young infants.  In older infants and children, hypertension can cause headache, unexplained irritability, fatigue, failure to thrive, blurred vision, nosebleeds, and facial paralysis. Hypertension results from a complex interaction of genes and environmental factors.  Numerous common genetic variants with small effects on blood pressure have been identified as well as some rare genetic variants with large effects on blood pressure.  Also, genome-wide association studies  have identified 35 genetic loci related to blood pressure; 12 of these genetic loci influencing blood pressure were newly found.  Sentinel SNP for each new genetic locus identified has shown an association with DNA methylation at multiple nearby CpG sites Hypertension Hypertension",
        "response": "Dietary changes such as limiting salt intake, reducing alcohol consumption, and increasing physical activity can help to manage hypertension."
    },
    {
        "dialog": [
            "Hello Medi, I had to undergo a surgical procedure a few days ago.",
            "I hope you are feeling better now. What was the procedure?",
            "It was a very minor surgery, but I am still recovering.",
            "That's understandable. Do you have any questions about recovery and aftercare?",
            "Yes, what kind of physical activity can I do during recovery?",
            "It depends on the type of surgery you underwent, but generally you should avoid any strenuous activities and stick to light exercises like walking.",
            "What about my diet?",
            "You should avoid processed foods and foods high in sugar and saturated fats. Instead, focus on eating a balanced diet rich in whole grains, fruits, and vegetables.",
            "Got it. How long will it take for me to recover fully?"
        ],
        "knowledge": "Surgical Procedure Surgical Procedure Recovery time after surgery depends on the type of surgery performed, your overall health, and how well you follow your doctor's instructions. You may need to avoid certain activities, such as heavy lifting and strenuous exercise, for a period of time. Your doctor may also recommend physical therapy or other forms of rehabilitation to help you return to normal activities. A balanced diet rich in whole grains, fruits, and vegetables can help promote healing and reduce the risk of complications after surgery. It is important to follow your doctor's instructions carefully to ensure a smooth and speedy recovery.",
        "response": "It depends on the type of surgery you had and how well you follow your doctor's instructions. You should consult with your doctor to get a better idea of your recovery timeline."
    },
    {
        "dialog": [
            "Hello Medi, I feel like I have a headache.",
            "I'm sorry to hear that. Can you tell me more about your symptoms?",
            "I feel a pounding in my head and some pressure in my temples.",
            "I see. Have you been experiencing this for a while?",
            "Yes, it started yesterday and hasn't gone away.",
            "Based on your symptoms, it might be a migraine. Have you tried taking medication?",
            "Yes, but it doesn't seem to be helping.",
            "Okay, if the pain persists, you should contact your doctor for further evaluation.",
            "Thank you, Medi. What kind of further evaluation might I need?"
        ],
        "knowledge": "Migraine Migraine Migraine is a type of headache characterized by recurrent episodes of moderate to severe head pain that is typically pulsating, often unilateral, and usually lasts from 4 to 72 hours in adults. The pain is often accompanied by nausea and vomiting, as well as sensitivity to light, sound, and smells. Migraines can be triggered by a variety of factors, such as stress, certain foods, hormonal changes, and changes in sleep patterns. Over-the-counter pain relievers such as ibuprofen or acetaminophen can help relieve mild migraines, but severe migraines may require prescription medication. In some cases, preventive medication may also be prescribed. Migraine Migraine",
        "response": "If the pain persists, you will need to contact your doctor for further evaluation, which may involve imaging tests such as an MRI or CT scan."
    },
    {
        "dialog": [
            "Hey Medi, I'm feeling really anxious lately.",
            "I'm sorry to hear that. Can you tell me more about what's been going on?",
            "I've been feeling really stressed and overwhelmed with work and personal life.",
            "I see. Have you tried any relaxation techniques?",
            "I've tried deep breathing exercises but they don't seem to be helping much.",
            "In addition to deep breathing exercises, you could also try progressive muscle relaxation or meditation.",
            "Okay, I'll give those a try. Thank you, Medi.",
            "You're welcome. Remember to take breaks and prioritize self-care.",
            "Thank you, Medi. I will. Do you have any more advice for me?"
        ],
        "knowledge": "Anxiety Anxiety Anxiety is a feeling of unease, such as worry or fear, that can be mild or severe. It is a normal response to stress or danger and can be helpful in some situations. However, excessive or long-term anxiety can be harmful to one's physical and mental health. There are many different types of anxiety disorders, such as generalized anxiety disorder, panic disorder, and social anxiety disorder. Treatment for anxiety may involve therapy, medication, or a combination of both. Lifestyle changes such as regular exercise, healthy eating, and stress management techniques can also be helpful in managing anxiety. Anxiety Anxiety",
        "response": "Just remember to take breaks and prioritize self-care, and try relaxation techniques such as progressive muscle relaxation or meditation. If your anxiety persists, you should consider seeking further evaluation from a healthcare professional."
    },
    {
        "dialog": [
            "Hi Medi, I recently had high blood pressure during my last check-up.",
            "I'm sorry to hear that. Have you been experiencing any symptoms?",
            "No, I haven't felt any different. But I'm concerned about my lifestyle now.",
            "That's understandable. Lifestyle changes can help manage high blood pressure.",
            "What kind of lifestyle changes do you recommend?",
            "Maintaining a healthy weight, reducing sodium intake, and increasing physical activity can all be helpful.",
            "Okay, I'll try to incorporate those changes into my routine. Thank you, Medi.",
            "You're welcome. Remember to also limit alcohol and caffeine intake.",
            "Thank you for the advice. How often should I check my blood pressure?"
        ],
        "knowledge": "Hypertension Hypertension In contrast, gestational hypertension is defined as new-onset hypertension during pregnancy without protein in the urine. Failure to thrive, seizures, irritability, lack of energy, and difficulty in breathing can be associated with hypertension in newborns and young infants.  In older infants and children, hypertension can cause headache, unexplained irritability, fatigue, failure to thrive, blurred vision, nosebleeds, and facial paralysis. Hypertension results from a complex interaction of genes and environmental factors.  Numerous common genetic variants with small effects on blood pressure have been identified as well as some rare genetic variants with large effects on blood pressure.  Also, genome-wide association studies  have identified 35 genetic loci related to blood pressure; 12 of these genetic loci influencing blood pressure were newly found.  Sentinel SNP for each new genetic locus identified has shown an association with DNA methylation at multiple nearby CpG sites Hypertension Hypertension",
        "response": "You should check your blood pressure regularly, especially if you have other risk factors such as a family history of hypertension. Your doctor can recommend how often you should check it based on your individual needs."
    },
    {
        "dialog": [
            "Hello Medi, I've been feeling a lot of headaches lately.",
            "I see. Have you had any other symptoms?",
            "I also feel a little lightheaded and dizzy, especially when standing up.",
            "Okay, based on your symptoms, you may have hypertension. You should see a doctor to confirm.",
            "I'm a bit nervous about that. Can you tell me more about hypertension?",
            "Hypertension is a condition where your blood pressure is consistently high. It can lead to various health problems, so it's important to manage it.",
            "What can I do to manage it?",
            "You can try to make lifestyle changes such as exercise regularly, eat a healthy diet, reduce your salt intake, and avoid smoking.",
            "Okay. Thanks for the advice. If I have any more questions, can I ask you for help again?"
        ],
        "knowledge": "Hypertension Hypertension In contrast, gestational hypertension is defined as new-onset hypertension during pregnancy without protein in the urine. Failure to thrive, seizures, irritability, lack of energy, and difficulty in breathing can be associated with hypertension in newborns and young infants. In older infants and children, hypertension can cause headache, unexplained irritability, fatigue, failure to thrive, blurred vision, nosebleeds, and facial paralysis. Hypertension results from a complex interaction of genes and environmental factors. Numerous common genetic variants with small effects on blood pressure have been identified as well as some rare genetic variants with large effects on blood pressure. Also, genome-wide association studies have identified 35 genetic loci related to blood pressure; 12 of these genetic loci influencing blood pressure were newly found. Sentinel SNP for each new genetic locus identified has shown an association with DNA methylation at multiple nearby CpG sites Hypertension Hypertension",
        "response": "Of course! Don't be afraid to ask questions if anything else comes up."
    },
    {
        "dialog": [
            "Hello Medi, can you explain what hypertension is?",
            "Hypertension is a condition where your blood pressure is consistently high. It can lead to various health problems, so it's important to manage it.",
            "What kind of health problems can it lead to?",
            "It can lead to heart disease, stroke, kidney disease, and other health problems.",
            "How can I tell if I have hypertension?",
            "You usually can't tell if you have hypertension without measuring your blood pressure. You should see a doctor to have your blood pressure checked regularly.",
            "What can I do to prevent hypertension?",
            "You can try to make lifestyle changes such as exercise regularly, eat a healthy diet, reduce your salt intake, and avoid smoking.",
            "Thank you, Medi. I'll keep that in mind."
        ],
        "knowledge": "Hypertension Hypertension In contrast, gestational hypertension is defined as new-onset hypertension during pregnancy without protein in the urine. Failure to thrive, seizures, irritability, lack of energy, and difficulty in breathing can be associated with hypertension in newborns and young infants. In older infants and children, hypertension can cause headache, unexplained irritability, fatigue, failure to thrive, blurred vision, nosebleeds, and facial paralysis. Hypertension results from a complex interaction of genes and environmental factors. Numerous common genetic variants with small effects on blood pressure have been identified as well as some rare genetic variants with large effects on blood pressure. Also, genome-wide association studies have identified 35 genetic loci related to blood pressure; 12 of these genetic loci influencing blood pressure were newly found. Sentinel SNP for each new genetic locus identified has shown an association with DNA methylation at multiple nearby CpG sites Hypertension Hypertension",
        "response": "You're welcome! Always remember to check your blood pressure regularly."
    },
    {
        "dialog": [
            "Hello Medi, I was recently diagnosed with hypertension, what can I do to manage it?",
            "I'm sorry to hear about your diagnosis. You can try to make lifestyle changes such as exercise regularly, eat a healthy diet, reduce your salt intake, and avoid smoking.",
            "Are there any medications I can take for hypertension?",
            "Yes, there are medications such as ACE inhibitors, diuretics, and calcium channel blockers that can help manage hypertension. You should discuss with your doctor which medication is best for you.",
            "What should I expect when taking medication for hypertension?",
            "You may experience side effects such as dizziness, fatigue, and nausea. However, these side effects usually go away after a few weeks. Make sure to let your doctor know if you experience any severe side effects.",
            "Thank you, Medi. I'll discuss with my doctor about which medication is best for me.",
            "You're welcome. Just remember to take your medication as prescribed and maintain a healthy lifestyle.",
            "Okay, I will. Thank you so much for your help."
        ],
        "knowledge": "Hypertension Hypertension In contrast, gestational hypertension is defined as new-onset hypertension during pregnancy without protein in the urine. Failure to thrive, seizures, irritability, lack of energy, and difficulty in breathing can be associated with hypertension in newborns and young infants. In older infants and children, hypertension can cause headache, unexplained irritability, fatigue, failure to thrive, blurred vision, nosebleeds, and facial paralysis. Hypertension results from a complex interaction of genes and environmental factors. Numerous common genetic variants with small effects on blood pressure have been identified as well as some rare genetic variants with large effects on blood pressure. Also, genome-wide association studies have identified 35 genetic loci related to blood pressure; 12 of these genetic loci influencing blood pressure were newly found. Sentinel SNP for each new genetic locus identified has shown an association with DNA methylation at multiple nearby CpG sites Hypertension Hypertension",
        "response": "You're welcome! Always remember to take your medication as prescribed and maintain a healthy lifestyle."
    },
    {
        "dialog": [
            "Hi there, how can I assist you today?",
            "I am feeling very unwell, can you help me?",
            "Sure, what seems to be troubling you?",
            "I am experiencing headaches, difficulty breathing and irritability.",
            "I see, based on your symptoms it looks like you might be suffering from hypertension. You should consult with a doctor for confirmation",
            "Is hypertension a serious condition?",
            "Yes, hypertension can lead to more serious conditions if left untreated. Do you have any other questions?",
            "Can hypertension be managed with lifestyle changes?",
            "Yes, making changes to your diet, exercising regularly and reducing stress can help manage hypertension. You should consult with a doctor to create a plan that works for you."
        ],
        "knowledge": "Hypertension Hypertension In contrast, gestational hypertension is defined as new-onset hypertension during pregnancy without protein in the urine. Failure to thrive, seizures, irritability, lack of energy, and difficulty in breathing can be associated with hypertension in newborns and young infants. In older infants and children, hypertension can cause headache, unexplained irritability, fatigue, failure to thrive, blurred vision, nosebleeds, and facial paralysis. Hypertension results from a complex interaction of genes and environmental factors. Numerous common genetic variants with small effects on blood pressure have been identified as well as some rare genetic variants with large effects on blood pressure. Also, genome-wide association studies have identified 35 genetic loci related to blood pressure; 12 of these genetic loci influencing blood pressure were newly found. Sentinel SNP for each new genetic locus identified has shown an association with DNA methylation at multiple nearby CpG sites Hypertension Hypertension ",
        "response": "Do you have any more questions about hypertension?"
    },
    {
        "dialog": [
            "Hi Medi, I have a question about hypertension.",
            "Sure, what's your question?",
            "Can hypertension cause facial paralysis?",
            "Yes, hypertension can lead to facial paralysis in some cases. It's important to manage hypertension as it can lead to more serious conditions if left untreated.",
            "What other conditions can hypertension lead to?",
            "Hypertension can lead to conditions such as heart disease, stroke and kidney failure. It's important to consult with a doctor to manage hypertension.",
            "Can hypertension be managed with medication?",
            "Yes, medication can be prescribed by a doctor to manage hypertension. However, lifestyle changes should also be made to improve overall health.",
            "Thank you for your help Medi."
        ],
        "knowledge": "Hypertension Hypertension In contrast, gestational hypertension is defined as new-onset hypertension during pregnancy without protein in the urine. Failure to thrive, seizures, irritability, lack of energy, and difficulty in breathing can be associated with hypertension in newborns and young infants. In older infants and children, hypertension can cause headache, unexplained irritability, fatigue, failure to thrive, blurred vision, nosebleeds, and facial paralysis. Hypertension results from a complex interaction of genes and environmental factors. Numerous common genetic variants with small effects on blood pressure have been identified as well as some rare genetic variants with large effects on blood pressure. Also, genome-wide association studies have identified 35 genetic loci related to blood pressure; 12 of these genetic loci influencing blood pressure were newly found. Sentinel SNP for each new genetic locus identified has shown an association with DNA methylation at multiple nearby CpG sites Hypertension Hypertension",
        "response": "You're welcome. Do you have any more questions about hypertension?"
    },
    {
        "dialog": [
            "Hi Medi, I was recently diagnosed with hypertension.",
            "I'm here to help, what would you like to know?",
            "What lifestyle changes should I make to manage my hypertension?",
            "Making changes to your diet, exercising regularly and reducing stress can help manage hypertension. It's important to consult with a doctor to create a plan that works for you.",
            "Are there any foods I should avoid?",
            "Yes, you should avoid foods high in sodium, saturated fats and added sugars. Instead, focus on eating fruits, vegetables and whole grains.",
            "Can I still exercise with hypertension?",
            "Yes, exercising can actually help manage hypertension. However, you should consult with a doctor to create an exercise plan that works for you.",
            "Thank you for your help Medi."
        ],
        "knowledge": "Hypertension Hypertension In contrast, gestational hypertension is defined as new-onset hypertension during pregnancy without protein in the urine. Failure to thrive, seizures, irritability, lack of energy, and difficulty in breathing can be associated with hypertension in newborns and young infants. In older infants and children, hypertension can cause headache, unexplained irritability, fatigue, failure to thrive, blurred vision, nosebleeds, and facial paralysis. Hypertension results from a complex interaction of genes and environmental factors. Numerous common genetic variants with small effects on blood pressure have been identified as well as some rare genetic variants with large effects on blood pressure. Also, genome-wide association studies have identified 35 genetic loci related to blood pressure; 12 of these genetic loci influencing blood pressure were newly found. Sentinel SNP for each new genetic locus identified has shown an association with DNA methylation at multiple nearby CpG sites Hypertension Hypertension",
        "response": "You're welcome. Do you have any more questions about managing hypertension?"
    },
    {
        "dialog": [
            "Hi Medi, I suspect that I have hypertension, can you help me?",
            "Sure! What symptoms do you have?",
            "I feel headache, fatigue, and get nosebleeds occasionally.",
            "Based on your symptoms, you could have hypertension. Have you checked your blood pressure?",
            "No, I haven’t. What can I do to lower my blood pressure?",
            "You can try to exercise regularly, eat a balanced diet, and limit your salt intake.",
            "Okay, what are some foods I should avoid?",
            "You should avoid processed foods, red meat, and sweets.",
            "Got it, thanks for the advice! How often should I check my blood pressure?"
        ],
        "knowledge": "Hypertension Hypertension In contrast, gestational hypertension is defined as new-onset hypertension during pregnancy without protein in the urine. Failure to thrive, seizures, irritability, lack of energy, and difficulty in breathing can be associated with hypertension in newborns and young infants. In older infants and children, hypertension can cause headache, unexplained irritability, fatigue, failure to thrive, blurred vision, nosebleeds, and facial paralysis. Hypertension results from a complex interaction of genes and environmental factors. Numerous common genetic variants with small effects on blood pressure have been identified as well as some rare genetic variants with large effects on blood pressure. Also, genome-wide association studies have identified 35 genetic loci related to blood pressure; 12 of these genetic loci influencing blood pressure were newly found. Sentinel SNP for each new genetic locus identified has shown an association with DNA methylation at multiple nearby CpG sites Hypertension Hypertension",
        "response": "You should check your blood pressure at least once a year, or more frequently based on your doctor's recommendation."
    },
    {
        "dialog": [
            "Hi Medi, I have a question about hypertension. What is it exactly?",
            "Hypertension is a condition where your blood pressure is higher than normal. This can increase your risk of heart disease and other serious health problems.",
            "What causes hypertension?",
            "Hypertension results from a complex interaction of genes and environmental factors. Lifestyle factors such as being overweight, not exercising, or eating a diet high in salt can also contribute to hypertension.",
            "Can hypertension be cured?",
            "Hypertension can be managed with lifestyle changes and medications, but it cannot be cured. It is important to keep your blood pressure under control to reduce the risk of complications.",
            "What complications can arise from hypertension?",
            "Untreated hypertension can lead to serious health problems such as heart disease, stroke, and kidney failure.",
            "Thanks for the information, Medi! Is hypertension hereditary?"
        ],
        "knowledge": "Hypertension Hypertension In contrast, gestational hypertension is defined as new-onset hypertension during pregnancy without protein in the urine. Failure to thrive, seizures, irritability, lack of energy, and difficulty in breathing can be associated with hypertension in newborns and young infants. In older infants and children, hypertension can cause headache, unexplained irritability, fatigue, failure to thrive, blurred vision, nosebleeds, and facial paralysis. Hypertension results from a complex interaction of genes and environmental factors. Numerous common genetic variants with small effects on blood pressure have been identified as well as some rare genetic variants with large effects on blood pressure. Also, genome-wide association studies have identified 35 genetic loci related to blood pressure; 12 of these genetic loci influencing blood pressure were newly found. Sentinel SNP for each new genetic locus identified has shown an association with DNA methylation at multiple nearby CpG sites Hypertension Hypertension",
        "response": "Yes, genetics can play a role in hypertension. If your family members have hypertension, you may be at a higher risk of developing it too."
    },
    {
        "dialog": [
            "Hi Medi, I recently had a medical procedure for hypertension. What lifestyle changes should I make?",
            "Congratulations on taking the first step towards managing your hypertension! You should try to exercise regularly, eat a balanced diet with plenty of fruits and vegetables, and limit your salt intake.",
            "What kind of exercise should I do?",
            "Aerobic exercise such as walking, jogging, or swimming can be beneficial for managing hypertension.",
            "What foods should I eat to manage my hypertension?",
            "Foods that are high in potassium, magnesium, and fiber can help lower your blood pressure. You should also avoid processed foods, red meat, and foods high in salt.",
            "Should I stop taking my medication if my blood pressure is under control?",
            "No, you should continue taking your medication as prescribed by your doctor. Stopping your medication without your doctor's advice can be dangerous.",
            "Thanks for the advice, Medi! Can yoga or meditation help with managing hypertension?"
        ],
        "knowledge": "Hypertension Hypertension In contrast, gestational hypertension is defined as new-onset hypertension during pregnancy without protein in the urine. Failure to thrive, seizures, irritability, lack of energy, and difficulty in breathing can be associated with hypertension in newborns and young infants. In older infants and children, hypertension can cause headache, unexplained irritability, fatigue, failure to thrive, blurred vision, nosebleeds, and facial paralysis. Hypertension results from a complex interaction of genes and environmental factors. Numerous common genetic variants with small effects on blood pressure have been identified as well as some rare genetic variants with large effects on blood pressure. Also, genome-wide association studies have identified 35 genetic loci related to blood pressure; 12 of these genetic loci influencing blood pressure were newly found. Sentinel SNP for each new genetic locus identified has shown an association with DNA methylation at multiple nearby CpG sites Hypertension Hypertension",
        "response": "Yes, yoga or meditation can be beneficial for managing hypertension by reducing stress levels and promoting relaxation."
    },
    {
        "dialog": [
            "Hello Medi, I have a persistent headache and difficulty in breathing",
            "Hello, let me ask some questions. How long have you been experiencing this?",
            "It's been more than a week now and my headache is getting worse",
            "Okay. Do you have a fever or cough?",
            "No, I don't have a fever or cough",
            "Based on your symptoms, I suggest you get tested for COVID-19, just to be safe",
            "Oh no, I hope it's not COVID-19. What should I do if it is positive?",
            "If it's positive, you should self-isolate, follow the guidelines from the health department and take care of yourself",
            "Thank you, Medi. I will get tested and take necessary actions based on the result"
        ],
        "knowledge": "COVID-19 COVID-19 COVID-19 is a highly contagious respiratory illness caused by the SARS-CoV-2 virus. Common symptoms include fever, cough, fatigue, and difficulty breathing. COVID-19 can cause severe respiratory illness, and in some cases, can be fatal. The virus spreads primarily through respiratory droplets when an infected person talks, coughs or sneezes. It can also spread by touching a surface or object contaminated with the virus and then touching the mouth, nose or eyes. There is no specific treatment for COVID-19, but most people recover on their own. Prevention involves good hygiene practices like washing hands frequently, wearing masks, and practicing physical distancing. Vaccines are also available to prevent COVID-19.",
        "response": "If you test positive for COVID-19, you should self-isolate, follow the guidelines from the health department and take care of yourself"
    },
    {
        "dialog": [
            "Hey Medi, my newborn has been experiencing seizures and lack of energy. What could be the cause?",
            "Hi there, I'm sorry to hear that. Does your baby have a fever or high-pitched cry?",
            "No, there is no fever and the cry seems normal",
            "Based on your symptoms, I suggest you take your baby to a medical professional immediately as it could be a sign of hypertension. ",
            "What is hypertension and how is it treated?",
            "Hypertension is a condition where the blood pressure is too high. It can cause severe complications if left untreated. Treatment for hypertension depends on the severity of the condition and may involve medications to lower blood pressure, lifestyle changes like exercising and eating a healthy diet, and monitoring blood pressure regularly.",
            "Thank you, Medi. I will take my baby to the doctor immediately",
            "You're welcome. I hope your baby feels better soon",
            "Can hypertension be hereditary?"
        ],
        "knowledge": "Hypertension Hypertension In contrast, gestational hypertension is defined as new-onset hypertension during pregnancy without protein in the urine. Failure to thrive, seizures, irritability, lack of energy, and difficulty in breathing can be associated with hypertension in newborns and young infants.  In older infants and children, hypertension can cause headache, unexplained irritability, fatigue, failure to thrive, blurred vision, nosebleeds, and facial paralysis. Hypertension results from a complex interaction of genes and environmental factors.  Numerous common genetic variants with small effects on blood pressure have been identified as well as some rare genetic variants with large effects on blood pressure.  Also, genome-wide association studies  have identified 35 genetic loci related to blood pressure; 12 of these genetic loci influencing blood pressure were newly found.  Sentinel SNP for each new genetic locus identified has shown an association with DNA methylation at multiple nearby CpG sites Hypertension Hypertension",
        "response": "Yes, hypertension can be caused by a complex interaction of genes and environmental factors"
    },
    {
        "dialog": [
            "Hi Medi, I recently underwent a medical surgery and I'm not sure what to do next",
            "Hello there, congratulations on making it through the surgery. What kind of surgery did you have?",
            "I had a heart bypass surgery",
            "Okay, after heart bypass surgery you need to be careful with your diet and physical activities. Have you consulted with your doctor about a proper diet and exercise plan?",
            "Yes, I have. But are there any specific foods I should avoid?",
            "Yes, you should avoid foods that are high in saturated and trans fats like red meat, fried foods, and processed foods. You should also limit your salt intake and avoid sugary drinks.",
            "What kind of exercises should I do?",
            "You should start with light exercises like walking and gradually increase the intensity. But make sure to consult with your doctor before starting any new exercise routine",
            "Thank you for your advice, Medi. I will make sure to follow your advice carefully"
        ],
        "knowledge": "Heart Bypass Surgery Heart Bypass Surgery Heart bypass surgery, also known as coronary artery bypass grafting, is a surgical procedure that helps restore normal blood flow to an obstructed coronary artery. The surgery involves taking a healthy blood vessel from another part of the body and grafting it onto the blocked artery. Recovery from heart bypass surgery can take several weeks and requires making lifestyle changes like following a healthy diet, exercising regularly, and taking medications as prescribed. It's important to follow your doctor's instructions carefully to ensure a successful recovery. ",
        "response": "It usually takes 6-12 weeks to recover from heart bypass surgery, but it can vary depending on the individual's health condition and age."
    },
    {
        "dialog": [
            "Hello Medi, I have been experiencing some headaches lately.",
            "I see. Have you experienced any other symptoms?",
            "Yes, I have also been experiencing blurred vision and nosebleeds.",
            "Based on those symptoms, it is possible that you have hypertension.",
            "What causes hypertension?",
            "Hypertension can result from a complex interaction of genes and environmental factors.",
            "Is there any way to prevent hypertension?",
            "Yes, lifestyle changes such as exercising regularly and reducing salt intake can help.",
            "Got it. Thanks for your help, Medi."
        ],
        "knowledge": "Hypertension Hypertension In contrast, gestational hypertension is defined as new-onset hypertension during pregnancy without protein in the urine. Failure to thrive, seizures, irritability, lack of energy, and difficulty in breathing can be associated with hypertension in newborns and young infants.  In older infants and children, hypertension can cause headache, unexplained irritability, fatigue, failure to thrive, blurred vision, nosebleeds, and facial paralysis. Hypertension results from a complex interaction of genes and environmental factors.  Numerous common genetic variants with small effects on blood pressure have been identified as well as some rare genetic variants with large effects on blood pressure.  Also, genome-wide association studies  have identified 35 genetic loci related to blood pressure; 12 of these genetic loci influencing blood pressure were newly found.  Sentinel SNP for each new genetic locus identified has shown an association with DNA methylation at multiple nearby CpG sites Hypertension Hypertension",
        "response": "You're welcome. If you have any more questions, feel free to ask."
    },
    {
        "dialog": [
            "Hello Medi, can you explain what hypertension is?",
            "Hypertension is a medical term for high blood pressure.",
            "What are the symptoms of hypertension?",
            "Headaches, nosebleeds, and fatigue are a few symptoms of hypertension.",
            "How is hypertension diagnosed?",
            "Hypertension is typically diagnosed by measuring blood pressure.",
            "What is considered high blood pressure?",
            "Blood pressure of 130/80 mmHg or higher is considered high.",
            "Thanks for the information, Medi."
        ],
        "knowledge": "Hypertension Hypertension In contrast, gestational hypertension is defined as new-onset hypertension during pregnancy without protein in the urine. Failure to thrive, seizures, irritability, lack of energy, and difficulty in breathing can be associated with hypertension in newborns and young infants.  In older infants and children, hypertension can cause headache, unexplained irritability, fatigue, failure to thrive, blurred vision, nosebleeds, and facial paralysis. Hypertension results from a complex interaction of genes and environmental factors.  Numerous common genetic variants with small effects on blood pressure have been identified as well as some rare genetic variants with large effects on blood pressure.  Also, genome-wide association studies  have identified 35 genetic loci related to blood pressure; 12 of these genetic loci influencing blood pressure were newly found.  Sentinel SNP for each new genetic locus identified has shown an association with DNA methylation at multiple nearby CpG sites Hypertension Hypertension",
        "response": "You're welcome. Let me know if you have any more questions."
    },
    {
        "dialog": [
            "Hello Medi, I recently had a medical procedure done.",
            "I see. Can you tell me more about the procedure?",
            "I had a stent put in my heart.",
            "After your procedure, it is important to eat a healthy diet and exercise regularly.",
            "What kind of diet should I follow?",
            "A heart-healthy diet that is low in sodium and saturated fat is recommended.",
            "Are there any foods I should avoid?",
            "Processed and fast foods should be avoided, as well as foods high in sodium and saturated fat.",
            "Thanks for the advice, Medi."
        ],
        "knowledge": "Hypertension Hypertension In contrast, gestational hypertension is defined as new-onset hypertension during pregnancy without protein in the urine. Failure to thrive, seizures, irritability, lack of energy, and difficulty in breathing can be associated with hypertension in newborns and young infants.  In older infants and children, hypertension can cause headache, unexplained irritability, fatigue, failure to thrive, blurred vision, nosebleeds, and facial paralysis. Hypertension results from a complex interaction of genes and environmental factors.  Numerous common genetic variants with small effects on blood pressure have been identified as well as some rare genetic variants with large effects on blood pressure.  Also, genome-wide association studies  have identified 35 genetic loci related to blood pressure; 12 of these genetic loci influencing blood pressure were newly found.  Sentinel SNP for each new genetic locus identified has shown an association with DNA methylation at multiple nearby CpG sites Hypertension Hypertension",
        "response": "You're welcome. Let me know if you have any more questions."
    }
]