[
    {
        "dialog": [
            "Hi Medi, I think I may have Hepatitis. What should I do?",
            "Hello, let me ask you a few questions to help diagnose. What symptoms do you have?",
            "I have a fever, nausea, loss of appetite and my urine is dark",
            "Based on your symptoms, it is possible that you have Hepatitis. You should see a doctor immediately",
            "Is there anything else I can do to help relieve the symptoms?",
            "You should rest as much as possible and avoid alcohol and other drugs that could damage your liver",
            "Thanks Medi. What causes Hepatitis?",
            "Hepatitis can be caused by viruses, alcohol consumption, toxins, and autoimmune disorders among other things",
            "Thanks for your help Medi. I'll go see a doctor soon."
        ],
        "knowledge": "Hepatitis Hepatitis Viral particles have also been found in saliva and breastmilk. Kissing, sharing utensils, and breastfeeding do not lead to transmission unless these fluids are introduced into open sores or cuts. Many families who do not have safe drinking water or live in unhygienic homes have contracted hepatitis because saliva and blood droplets are often carried through the water and blood-borne illnesses spread quickly in unsanitary settings. Hepatitis B and C can present either acutely or chronically. Hepatitis D is a defective virus that requires hepatitis B to replicate and is only found with hepatitis B co-infection. In adults, hepatitis B infection is most commonly self-limiting, with less than 5% progressing to chronic state, and 20 to 30% of those chronically infected developing cirrhosis or liver cancer. Infection in infants and children frequently leads to chronic infection Hepatitis Hepatitis",
        "response": "You're welcome. I recommend seeing a doctor as soon as possible to get a proper diagnosis and treatment."
    },
    {
        "dialog": [
            "Hi Medi. I have a question about Hepatitis. Can it be transmitted through casual contact like holding hands? ",
            "No, Hepatitis is not transmitted through casual contact like holding hands. It is mainly spread through contact with infected blood, semen or other body fluids. ",
            "Thanks for clearing that up. Can it be cured?",
            "It depends on the type of hepatitis you have. Some types are curable while others can only be managed. It is important to see a doctor for proper diagnosis and treatment.",
            "Is there anything I can do to prevent getting hepatitis?",
            "Yes, there are things you can do. You should practice good hygiene, use protection during sexual activity, avoid sharing needles or other drug paraphernalia and get vaccinated for hepatitis A and B if you haven't already",
            "Thanks for the information. Can you tell me more about hepatitis B and C?",
            "Both hepatitis B and C can cause chronic infection which can lead to liver damage and cancer. It is important to get tested if you are at risk and to get vaccinated for hepatitis B if you haven't already.",
            "Okay, thank you Medi. That was very helpful."
        ],
        "knowledge": "Hepatitis Hepatitis Viral particles have also been found in saliva and breastmilk. Kissing, sharing utensils, and breastfeeding do not lead to transmission unless these fluids are introduced into open sores or cuts. Many families who do not have safe drinking water or live in unhygienic homes have contracted hepatitis because saliva and blood droplets are often carried through the water and blood-borne illnesses spread quickly in unsanitary settings. Hepatitis B and C can present either acutely or chronically. Hepatitis D is a defective virus that requires hepatitis B to replicate and is only found with hepatitis B co-infection. In adults, hepatitis B infection is most commonly self-limiting, with less than 5% progressing to chronic state, and 20 to 30% of those chronically infected developing cirrhosis or liver cancer. Infection in infants and children frequently leads to chronic infection Hepatitis Hepatitis",
        "response": "You're welcome. Feel free to ask me anything else if you need to."
    },
    {
        "dialog": [
            "Hi Medi. I just had treatment for Hepatitis. What can I do to take care of my liver now?",
            "Congratulations on finishing your treatment. You should avoid alcohol and other drugs that can damage your liver as well as fatty foods and excess sugar. It is also important to exercise regularly and maintain a healthy weight.",
            "Thanks for the advice. Are there any specific foods that can help my liver?",
            "Yes, some foods that are good for your liver include leafy greens like spinach and kale, berries like blueberries and raspberries, nuts like almonds and walnuts, and fatty fish like salmon and mackerel. It is also important to stay hydrated by drinking plenty of water.",
            "That's great to know. Is there anything else I can do to improve my liver health?",
            "Yes, you can also take supplements like milk thistle and turmeric which have been shown to have liver-protective properties. It is important to talk to your doctor before taking any new supplements though.",
            "Got it. Thanks for the information, Medi.",
            "You're welcome. Remember to always take care of your liver and get regular check-ups to make sure it stays healthy.",
            "Sure, I will. Thanks again."
        ],
        "knowledge": "Hepatitis Hepatitis Viral particles have also been found in saliva and breastmilk. Kissing, sharing utensils, and breastfeeding do not lead to transmission unless these fluids are introduced into open sores or cuts. Many families who do not have safe drinking water or live in unhygienic homes have contracted hepatitis because saliva and blood droplets are often carried through the water and blood-borne illnesses spread quickly in unsanitary settings. Hepatitis B and C can present either acutely or chronically. Hepatitis D is a defective virus that requires hepatitis B to replicate and is only found with hepatitis B co-infection. In adults, hepatitis B infection is most commonly self-limiting, with less than 5% progressing to chronic state, and 20 to 30% of those chronically infected developing cirrhosis or liver cancer. Infection in infants and children frequently leads to chronic infection Hepatitis Hepatitis",
        "response": "You're welcome. Feel free to ask me if you need any more advice."
    },
    {
        "dialog": [
            "Hi Medi, I think I might have hepatitis.",
            "What symptoms are you experiencing?",
            "I feel tired all the time and my urine is dark.",
            "Hepatitis can cause these symptoms. Have you been in contact with infected blood or needles?",
            "No, I haven't.",
            "Hepatitis can also be caused by unsanitary water and poor hygiene. Have you traveled to an area with poor sanitation?",
            "Yes, actually I was visiting a rural area in Africa.",
            "That could be the cause. You should see a doctor for testing.",
            "Thanks Medi. What are the treatment options for hepatitis?"
        ],
        "knowledge": "Hepatitis Hepatitis  Viral particles have also been found in saliva and breastmilk.  Kissing, sharing utensils, and breastfeeding do not lead to transmission unless these fluids are introduced into open sores or cuts.  Many families who do not have safe drinking water or live in unhygienic homes have contracted hepatitis because saliva and blood droplets are often carried through the water and blood-borne illnesses spread quickly in unsanitary settings. Hepatitis B and C can present either acutely or chronically.  Hepatitis D is a defective virus that requires hepatitis B to replicate and is only found with hepatitis B co-infection.  In adults, hepatitis B infection is most commonly self-limiting, with less than 5% progressing to chronic state, and 20 to 30% of those chronically infected developing cirrhosis or liver cancer.  Infection in infants and children frequently leads to chronic infection Hepatitis Hepatitis",
        "response": "Treatment options depend on the type and severity of hepatitis. It's best to see a doctor for personalized treatment options."
    },
    {
        "dialog": [
            "Hi Medi, can you tell me more about hepatitis?",
            "Sure. What do you want to know?",
            "How is hepatitis transmitted?",
            "Hepatitis can be transmitted through contact with infected blood, needles, or unsanitary living conditions.",
            "Can it be transmitted through saliva?",
            "Yes, viral particles have been found in saliva, but the virus is not transmitted through kissing or sharing utensils unless there are open sores or cuts.",
            "What about breastfeeding?",
            "Breastfeeding does not lead to transmission unless the virus is introduced through open sores or cuts on the nipple.",
            "Thanks for the information, Medi. Is there anything else I should know?"
        ],
        "knowledge": "Hepatitis Hepatitis  Viral particles have also been found in saliva and breastmilk.  Kissing, sharing utensils, and breastfeeding do not lead to transmission unless these fluids are introduced into open sores or cuts.  Many families who do not have safe drinking water or live in unhygienic homes have contracted hepatitis because saliva and blood droplets are often carried through the water and blood-borne illnesses spread quickly in unsanitary settings. Hepatitis B and C can present either acutely or chronically.  Hepatitis D is a defective virus that requires hepatitis B to replicate and is only found with hepatitis B co-infection.  In adults, hepatitis B infection is most commonly self-limiting, with less than 5% progressing to chronic state, and 20 to 30% of those chronically infected developing cirrhosis or liver cancer.  Infection in infants and children frequently leads to chronic infection Hepatitis Hepatitis",
        "response": "No problem. Let me know if you have any other questions about hepatitis."
    },
    {
        "dialog": [
            "Hi Medi, I just had a liver biopsy. What should I do now?",
            "After a liver biopsy, it's important to rest and avoid strenuous activity for a few days.",
            "What about my diet?",
            "You should avoid heavy lifting and anything that puts pressure on your abdomen. It's also best to avoid alcohol and fatty foods.",
            "How long will it take for me to recover?",
            "Most people recover from a liver biopsy within a few days. However, if you experience severe pain or bleeding, you should contact your doctor immediately.",
            "Thanks for the advice, Medi. What kind of physical activity can I do?",
            "You can do light exercise such as walking or yoga, but avoid anything too strenuous. Make sure to discuss any physical activity with your doctor before doing it.",
            "Okay, thanks for the information, Medi."
        ],
        "knowledge": "Hepatitis Hepatitis  Viral particles have also been found in saliva and breastmilk.  Kissing, sharing utensils, and breastfeeding do not lead to transmission unless these fluids are introduced into open sores or cuts.  Many families who do not have safe drinking water or live in unhygienic homes have contracted hepatitis because saliva and blood droplets are often carried through the water and blood-borne illnesses spread quickly in unsanitary settings. Hepatitis B and C can present either acutely or chronically.  Hepatitis D is a defective virus that requires hepatitis B to replicate and is only found with hepatitis B co-infection.  In adults, hepatitis B infection is most commonly self-limiting, with less than 5% progressing to chronic state, and 20 to 30% of those chronically infected developing cirrhosis or liver cancer.  Infection in infants and children frequently leads to chronic infection Hepatitis Hepatitis",
        "response": "No problem. Let me know if you have any other questions about liver biopsy recovery."
    },
    {
        "dialog": [
            "Hello Medi, I have some symptoms and I need your help.",
            "Sure, please tell me what's bothering you.",
            "I have been experiencing fatigue, nausea, and abdominal pain.",
            "Do you have any other symptoms?",
            "I also have a loss of appetite and jaundice.",
            "Based on your symptoms, it is possible that you have Hepatitis B or C.",
            "What should I do if I have Hepatitis B or C?",
            "You should see a healthcare provider as soon as possible to determine the proper treatment for your condition.",
            "How can I prevent Hepatitis B or C?"
        ],
        "knowledge": "Hepatitis Hepatitis Viral particles have also been found in saliva and breastmilk. Kissing, sharing utensils, and breastfeeding do not lead to transmission unless these fluids are introduced into open sores or cuts. Many families who do not have safe drinking water or live in unhygienic homes have contracted hepatitis because saliva and blood droplets are often carried through the water and blood-borne illnesses spread quickly in unsanitary settings. Hepatitis B and C can present either acutely or chronically. Hepatitis D is a defective virus that requires hepatitis B to replicate and is only found with hepatitis B co-infection. In adults, hepatitis B infection is most commonly self-limiting, with less than 5% progressing to chronic state, and 20 to 30% of those chronically infected developing cirrhosis or liver cancer. Infection in infants and children frequently leads to chronic infection Hepatitis Hepatitis",
        "response": "You can prevent Hepatitis B by getting vaccinated and practicing safe sex and avoiding shared needles. Hepatitis C can be prevented by avoiding shared needles and practicing safe sex."
    },
    {
        "dialog": [
            "Hello Medi, I would like to know more about Hepatitis.",
            "Sure, I'm here to provide you with information.",
            "What are the symptoms of Hepatitis?",
            "The symptoms of Hepatitis include fever, fatigue, loss of appetite, nausea, vomiting, abdominal pain, dark urine, and jaundice.",
            "How is Hepatitis transmitted?",
            "Hepatitis can be transmitted through contact with infected blood, semen, and other body fluids.",
            "Is there a cure for Hepatitis?",
            "There is no cure for Hepatitis B, but there are treatments that can help manage the symptoms and reduce the risk of complications. There is a cure for Hepatitis C with antiviral medications.",
            "What happens if Hepatitis is left untreated?"
        ],
        "knowledge": "Hepatitis Hepatitis Viral particles have also been found in saliva and breastmilk. Kissing, sharing utensils, and breastfeeding do not lead to transmission unless these fluids are introduced into open sores or cuts. Many families who do not have safe drinking water or live in unhygienic homes have contracted hepatitis because saliva and blood droplets are often carried through the water and blood-borne illnesses spread quickly in unsanitary settings. Hepatitis B and C can present either acutely or chronically. Hepatitis D is a defective virus that requires hepatitis B to replicate and is only found with hepatitis B co-infection. In adults, hepatitis B infection is most commonly self-limiting, with less than 5% progressing to chronic state, and 20 to 30% of those chronically infected developing cirrhosis or liver cancer. Infection in infants and children frequently leads to chronic infection Hepatitis Hepatitis",
        "response": "If left untreated, Hepatitis B and C can lead to liver cirrhosis, liver cancer, or liver failure."
    },
    {
        "dialog": [
            "Hello Medi, I have recently undergone a medical procedure and I need advice on my lifestyle.",
            "Sure, I'm here to assist you. What kind of medical procedure did you undergo?",
            "I had a liver transplant.",
            "After a liver transplant, it is important to maintain a healthy lifestyle.",
            "Can you give me some tips on how to maintain a healthy lifestyle?",
            "Here are some tips: Eat a well-balanced diet, exercise regularly, avoid alcohol, quit smoking, and take your medications as prescribed.",
            "Why is it important to avoid alcohol and quit smoking?",
            "Alcohol and smoking can damage the liver and reduce its ability to function. This can lead to complications such as liver failure and the need for another transplant.",
            "Thank you for your help. Is there anything else I need to be aware of?"
        ],
        "knowledge": "Hepatitis Hepatitis Viral particles have also been found in saliva and breastmilk. Kissing, sharing utensils, and breastfeeding do not lead to transmission unless these fluids are introduced into open sores or cuts. Many families who do not have safe drinking water or live in unhygienic homes have contracted hepatitis because saliva and blood droplets are often carried through the water and blood-borne illnesses spread quickly in unsanitary settings. Hepatitis B and C can present either acutely or chronically. Hepatitis D is a defective virus that requires hepatitis B to replicate and is only found with hepatitis B co-infection. In adults, hepatitis B infection is most commonly self-limiting, with less than 5% progressing to chronic state, and 20 to 30% of those chronically infected developing cirrhosis or liver cancer. Infection in infants and children frequently leads to chronic infection Hepatitis Hepatitis",
        "response": "It is important to avoid contact with people who are sick, practice good hygiene, and attend all of your medical appointments."
    },
    {
        "dialog": [
            "Hi Medi, I have some concerns about hepatitis.",
            "Sure, what symptoms do you have?",
            "I don't have any symptoms, I am just curious about it.",
            "Hepatitis is a viral infection that attacks the liver and can cause inflammation and liver damage.",
            "How is it spread?",
            "It can be spread through contaminated food or water, sharing needles or having unprotected sex with an infected person.",
            "Are there any treatments for it?",
            "There are antiviral medications available to treat hepatitis B and C, and hepatitis A usually resolves on its own.",
            "Thank you for the information, Medi."
        ],
        "knowledge": "Hepatitis Hepatitis  Viral particles have also been found in saliva and breastmilk.  Kissing, sharing utensils, and breastfeeding do not lead to transmission unless these fluids are introduced into open sores or cuts.  Many families who do not have safe drinking water or live in unhygienic homes have contracted hepatitis because saliva and blood droplets are often carried through the water and blood-borne illnesses spread quickly in unsanitary settings. Hepatitis B and C can present either acutely or chronically.  Hepatitis D is a defective virus that requires hepatitis B to replicate and is only found with hepatitis B co-infection.  In adults, hepatitis B infection is most commonly self-limiting, with less than 5% progressing to chronic state, and 20 to 30% of those chronically infected developing cirrhosis or liver cancer.  Infection in infants and children frequently leads to chronic infection Hepatitis Hepatitis",
        "response": "You're welcome. Do you have any other questions?"
    },
    {
        "dialog": [
            "Hi Medi, I just had a medical procedure and I'm not sure what to do next.",
            "What kind of procedure did you have?",
            "I had a liver biopsy.",
            "After a liver biopsy, it is recommended to rest for the remainder of the day and avoid any strenuous activity for at least 24 hours.",
            "Are there any foods I should avoid?",
            "It's recommended to avoid alcohol and any blood-thinning medications for a few days after the biopsy to reduce the risk of bleeding.",
            "What about my regular exercise routine?",
            "You should avoid any strenuous physical activity for at least 24 hours after the biopsy to reduce the risk of bleeding.",
            "Thanks for the advice, Medi."
        ],
        "knowledge": "Hepatitis Hepatitis  Viral particles have also been found in saliva and breastmilk.  Kissing, sharing utensils, and breastfeeding do not lead to transmission unless these fluids are introduced into open sores or cuts.  Many families who do not have safe drinking water or live in unhygienic homes have contracted hepatitis because saliva and blood droplets are often carried through the water and blood-borne illnesses spread quickly in unsanitary settings. Hepatitis B and C can present either acutely or chronically.  Hepatitis D is a defective virus that requires hepatitis B to replicate and is only found with hepatitis B co-infection.  In adults, hepatitis B infection is most commonly self-limiting, with less than 5% progressing to chronic state, and 20 to 30% of those chronically infected developing cirrhosis or liver cancer.  Infection in infants and children frequently leads to chronic infection Hepatitis Hepatitis",
        "response": "You're welcome. Is there anything else I can help you with?"
    },
    {
        "dialog": [
            "Hi Medi, I'm wondering if hepatitis can be prevented.",
            "Yes, there are ways to prevent hepatitis.",
            "What are they?",
            "Vaccines are available for hepatitis A and B, and there are measures you can take to reduce your risk of contracting hepatitis C, such as avoiding sharing needles and practicing safe sex.",
            "Are there any lifestyle changes I can make to prevent hepatitis?",
            "Maintaining good hygiene practices such as washing your hands regularly and avoiding contaminated food and water can help prevent hepatitis.",
            "Thank you for the information, Medi.",
            "You're welcome. Do you have any other questions?"
        ],
        "knowledge": "Hepatitis Hepatitis  Viral particles have also been found in saliva and breastmilk.  Kissing, sharing utensils, and breastfeeding do not lead to transmission unless these fluids are introduced into open sores or cuts.  Many families who do not have safe drinking water or live in unhygienic homes have contracted hepatitis because saliva and blood droplets are often carried through the water and blood-borne illnesses spread quickly in unsanitary settings. Hepatitis B and C can present either acutely or chronically.  Hepatitis D is a defective virus that requires hepatitis B to replicate and is only found with hepatitis B co-infection.  In adults, hepatitis B infection is most commonly self-limiting, with less than 5% progressing to chronic state, and 20 to 30% of those chronically infected developing cirrhosis or liver cancer.  Infection in infants and children frequently leads to chronic infection Hepatitis Hepatitis",
        "response": "No, that's all. Thank you for the help, Medi."
    },
    {
        "dialog": [
            "Hello Medi, I am feeling very sick",
            "I am sorry to hear that. What symptoms are you experiencing?",
            "I have been vomiting and have had diarrhea all day. I also have a fever.",
            "I see. Based on your symptoms, it sounds like you may have gastroenteritis.",
            "What should I do?",
            "It is important to stay hydrated and get plenty of rest. You may also need to take medication to control your symptoms.",
            "How long will it take to recover?",
            "Gastroenteritis usually lasts a few days, but it is important to monitor your symptoms and seek medical attention if they worsen.",
            "Thank you Medi. What are some ways to prevent gastroenteritis?"
        ],
        "knowledge": "Gastroenteritis Gastroenteritis  The main symptoms of gastroenteritis are diarrhea and vomiting, which can lead to dehydration.  Gastroenteritis is caused by bacteria, viruses, or parasites, and is spread through contact with contaminated food or water, or from person to person.  Good hygiene practices, such as frequent hand washing, can help prevent the spread of gastroenteritis.  Treatment usually involves rest, hydration, and medication to control symptoms.  Most cases of gastroenteritis are not serious and resolve on their own within a few days. Gastroenteritis Gastroenteritis",
        "response": "Good hygiene practices such as frequent hand washing can help prevent the spread of gastroenteritis"
    },
    {
        "dialog": [
            "Hello Medi, I recently found out I have hepatitis",
            "I'm sorry to hear that. Which type of hepatitis do you have?",
            "I have hepatitis B. What do I need to do to manage it?",
            "The most important thing is to avoid alcohol and certain medications that can damage your liver. You may also need antiviral medication to control the virus.",
            "What are the long-term effects of hepatitis B?",
            "Hepatitis B can lead to cirrhosis or liver cancer if left untreated. However, with proper management, most people with hepatitis B can live long, healthy lives.",
            "Can I still work and go to school with hepatitis B?",
            "Yes, you can still work and go to school. However, it is important to take precautions to avoid spreading the virus to others.",
            "Thank you Medi. What are some precautions I can take?"
        ],
        "knowledge": "Hepatitis Hepatitis  Hepatitis B is a viral infection that can cause liver disease.  It is spread through contact with infected blood or other body fluids.  Treatment may involve antiviral medication and avoiding alcohol and certain medications that can damage the liver.  Long-term complications can include cirrhosis or liver cancer.  People with hepatitis B can still work and go to school, but should take precautions to avoid spreading the virus to others. Hepatitis Hepatitis",
        "response": "You can take precautions such as not sharing personal items like razors or toothbrushes, practicing safe sex, and avoiding contact with blood or other body fluids from someone who is infected with hepatitis B."
    },
    {
        "dialog": [
            "Hello Medi, I just had a liver biopsy",
            "How are you feeling after your biopsy?",
            "I'm feeling a little sore. What can I do to help with the pain?",
            "It is normal to feel sore after a liver biopsy. You can take pain medication as prescribed by your doctor and rest for a few days.",
            "What should I avoid after my biopsy?",
            "You should avoid heavy lifting and strenuous exercise for at least a week after your biopsy. You should also avoid taking blood thinners or aspirin for a few days.",
            "Can I still eat and drink normally?",
            "Yes, you can eat and drink normally. However, it is important to stay hydrated and avoid alcohol.",
            "Thank you Medi. What are some things I should watch out for after my biopsy?"
        ],
        "knowledge": "Liver Biopsy Liver Biopsy  A liver biopsy is a medical procedure used to obtain a small sample of liver tissue for testing.  After a liver biopsy, it is normal to feel some pain and soreness at the biopsy site.  You can take pain medication as prescribed by your doctor and rest for a few days.  You should avoid heavy lifting and strenuous exercise for at least a week after your biopsy.  You should also avoid taking blood thinners or aspirin for a few days.  It is important to stay hydrated and avoid alcohol after your biopsy. Liver Biopsy Liver Biopsy",
        "response": "You should watch out for signs of infection such as fever, chills, or redness and swelling at the biopsy site. If you experience these symptoms, you should contact your doctor immediately."
    },
    {
        "dialog": [
            "Hi Medi, I feel very tired and have a loss of appetite.",
            "Hello! Can you tell me more about how you're feeling?",
            "I feel fatigued and my stomach doesn't feel good. I also have a headache.",
            "I see. Have you had any issues with your liver or blood before?",
            "No, not that I know of.",
            "I'm suspecting that you might have hepatitis. Are you aware of what it is?",
            "I've heard of it, but I'm not too sure. Can you explain it to me?",
            "Hepatitis is a liver disease caused by a viral infection. It can be transmitted through blood, contaminated water, and sexual contact. Some types can also be transmitted through breastmilk and saliva.",
            "How can I prevent the spread of hepatitis?"
        ],
        "knowledge": "Hepatitis Hepatitis  Viral particles have also been found in saliva and breastmilk.  Kissing, sharing utensils, and breastfeeding do not lead to transmission unless these fluids are introduced into open sores or cuts.  Many families who do not have safe drinking water or live in unhygienic homes have contracted hepatitis because saliva and blood droplets are often carried through the water and blood-borne illnesses spread quickly in unsanitary settings. Hepatitis B and C can present either acutely or chronically.  Hepatitis D is a defective virus that requires hepatitis B to replicate and is only found with hepatitis B co-infection.  In adults, hepatitis B infection is most commonly self-limiting, with less than 5% progressing to chronic state, and 20 to 30% of those chronically infected developing cirrhosis or liver cancer.  Infection in infants and children frequently leads to chronic infection Hepatitis Hepatitis",
        "response": "You can prevent the spread of hepatitis by avoiding sharing personal hygiene items like razors and toothbrushes, practicing safe sex, and getting vaccinated."
    },
    {
        "dialog": [
            "Hi Medi, I just had a medical procedure done. What should I do to take care of myself?",
            "Hello! Congratulations on completing your medical procedure. What kind of procedure was it?",
            "I had a minor surgery for a skin growth. What kind of physical activity can I do?",
            "It's important to avoid any physical activity that puts strain on the affected area. Walking and light stretching are usually safe.",
            "Do I need to follow a special diet?",
            "It depends on your surgical procedure and any dietary restrictions your doctor may have given you. Generally, it's best to avoid alcohol, caffeine, and spicy foods.",
            "How long should I wait before returning to work?",
            "It depends on your post-surgery recovery progress, but it's usually safe to go back to work a few days after the procedure. Your doctor will give you more specific guidelines.",
            "Thank you for the information, Medi. What are some warning signs that I should call my doctor for?"
        ],
        "knowledge": "Surgery Surgery  After surgery, it's important to follow your doctor's instructions for recovery. In general, you should avoid physical activity that puts a strain on the affected area. Walking and light stretching are usually safe. You may also need to follow a special diet, depending on the type of surgery you had. In addition, you should keep an eye out for any warning signs that something may be wrong, like fever, redness or swelling, or increased pain at the surgery site. If you experience any of these, be sure to contact your doctor right away. Surgery Surgery",
        "response": "You should call your doctor if you experience fever, redness or swelling, or increased pain at the surgery site."
    },
    {
        "dialog": [
            "Hi Medi, I used to have obesity. Can you give me some advice on how to maintain a healthy weight?",
            "Hello! Maintaining a healthy weight is important for overall health. What have you tried so far?",
            "I've tried dieting and exercising, but it's hard to stay consistent.",
            "Consistency is key. It's important to make sustainable lifestyle changes that you can stick to in the long run. Have you tried incorporating more fruits and vegetables into your diet?",
            "Yes, I have. But I still struggle with cravings for unhealthy foods.",
            "It's okay to indulge in moderation, but it's important to keep track of your portion sizes. Have you tried keeping a food journal?",
            "No, I haven't. Does that help?",
            "Yes, keeping a food journal can help you stay accountable and mindful of what you're eating. It can also help you identify patterns and triggers for overeating.",
            "That's helpful. Thank you, Medi. Are there any other tips you have for maintaining a healthy weight?"
        ],
        "knowledge": "Obesity Obesity Obesity is a complex public health and policy problem because of its prevalence, costs, and health effects.  As such, managing it requires changes in the wider societal context and effort by communities, local authorities, and governments.  Public health efforts seek to understand and correct the environmental factors responsible for the increasing prevalence of obesity in the population.  Solutions look at changing the factors that cause excess food energy consumption and inhibit physical activity.  Efforts include federally reimbursed meal programs in schools, limiting direct junk food marketing to children, and decreasing access to sugar-sweetened beverages in schools.  The World Health Organization recommends the taxing of sugary drinks.  When constructing urban environments, efforts have been made to increase access to parks and to develop pedestrian routes Obesity Obesity",
        "response": "Other tips for maintaining a healthy weight include staying hydrated, getting enough sleep, and finding an exercise routine that you enjoy."
    },
    {
        "dialog": [
            "Hi Medi, I have an upset stomach.",
            "Hi there, I'm here to help you. Can you describe your symptoms?",
            "I have a stomach ache, nausea and diarrhea",
            "I see. Have you eaten anything unusual recently?",
            "Yes, I ate some street food yesterday",
            "It's possible that you have food poisoning. You should drink plenty of fluids and rest.",
            "What else can I do to recover quickly?",
            "You can take some over-the-counter medication to relieve your symptoms. If they persist, see a doctor.",
            "Thank you, Medi. What foods should I avoid?"
        ],
        "knowledge": "Food poisoning Food poisoning Food poisoning is an illness caused by eating food that contains harmful bacteria, viruses or parasites.  Symptoms include stomach pain, nausea, vomiting, and diarrhea.  Most cases of food poisoning are not serious, and the illness will improve within a few days.  Treatment includes drinking plenty of fluids and resting.  Most people do not need to see a doctor, but those with severe symptoms should seek medical attention.  To avoid food poisoning, wash your hands and cooking surfaces regularly, keep raw and cooked foods separate, and cook food thoroughly.",
        "response": "You should avoid eating any spicy, oily, or fried food for a few days. Stick to plain, easy-to-digest foods like soup, toast, and crackers."
    },
    {
        "dialog": [
            "Hey Medi, I have been diagnosed with hepatitis B.",
            "I'm sorry to hear that. Do you have any questions about the disease?",
            "Yes, I want to know how it spreads from person to person.",
            "Hepatitis B spreads through contact with infected blood, semen, or other body fluids.",
            "Can it be transmitted through kissing or breastfeeding?",
            "Kissing, sharing utensils, and breastfeeding do not lead to transmission unless these fluids are introduced into open sores or cuts.",
            "What are the chances of developing complications from hepatitis B?",
            "In adults, hepatitis B infection is most commonly self-limiting, with less than 5% progressing to a chronic state, and 20 to 30% of those chronically infected developing cirrhosis or liver cancer.",
            "Thanks, Medi. How can I prevent the spread of hepatitis B to others?"
        ],
        "knowledge": "Hepatitis B Hepatitis B Hepatitis B spreads through contact with infected blood, semen, or other body fluids.  Kissing, sharing utensils, and breastfeeding do not lead to transmission unless these fluids are introduced into open sores or cuts.  Hepatitis B can present either acutely or chronically.  In adults, hepatitis B infection is most commonly self-limiting, with less than 5% progressing to chronic state, and 20 to 30% of those chronically infected developing cirrhosis or liver cancer.  Infection in infants and children frequently leads to chronic infection.  To prevent the spread of hepatitis B, avoid sharing needles or personal care items that may have blood on them, use a condom during sex, and tell your sexual partners and anyone you live with that you have hepatitis B.",
        "response": "You should avoid sharing personal care items that may have blood on them, use a condom during sex, and tell your sexual partners and anyone you live with that you have hepatitis B."
    },
    {
        "dialog": [
            "Hi Medi, I just had a liver transplant.",
            "Congratulations on your successful transplant! Do you have any questions about post-transplant care?",
            "What lifestyle changes should I make after the transplant?",
            "It's important to maintain a healthy diet, get regular exercise, and avoid tobacco, alcohol, and drugs.",
            "Can you suggest some specific foods that are good for my liver?",
            "Foods that are high in antioxidants, such as berries, dark chocolate, and green leafy vegetables, can be beneficial for your liver.",
            "What kind of exercise is safe for me to do?",
            "Light to moderate exercise, such as walking, cycling, or swimming, is safe and can help improve your overall health.",
            "Thanks, Medi. How often should I see my transplant team for check-ups?"
        ],
        "knowledge": "Liver transplant Liver transplant After a liver transplant, it's important to maintain a healthy lifestyle to ensure the success of the transplant.  This includes eating a balanced diet, getting regular exercise, and avoiding tobacco, alcohol, and drugs.  Foods that are high in antioxidants, such as berries, dark chocolate, and green leafy vegetables, can be beneficial for your liver.  Light to moderate exercise, such as walking, cycling, or swimming, is safe and can help improve your overall health.  You should see your transplant team for check-ups on a regular basis, as they will monitor your health and adjust your medications as needed.",
        "response": "You should see your transplant team for check-ups on a regular basis, as they will monitor your health and adjust your medications as needed."
    },
    {
        "dialog": [
            "Hi Medi, I'm feeling very tired and nauseous lately.",
            "Hello! Can you tell me more about your symptoms?",
            "I feel weak and dizzy all the time, and sometimes I vomit.",
            "I see. Have you been exposed to any viruses or bacteria recently?",
            "No, I don't think so.",
            "How about your diet and lifestyle? Did you eat anything unusual or start any new medications?",
            "No, nothing out of the ordinary.",
            "Okay. Based on your symptoms, it could be a viral infection. You should rest and drink plenty of fluids.",
            "Do you think I need to take any medication for it?"
        ],
        "knowledge": "Viral Infection - Viral infections can cause a variety of symptoms, depending on the type of virus and the affected area of the body. They can be transmitted through direct contact with infected people, contaminated objects or surfaces, or through airborne particles. Symptoms may include fever, headache, muscle aches, coughing, and fatigue. Treatment may involve rest, fluid intake, and over-the-counter pain relievers, but antibiotics are not effective against viral infections.",
        "response": "No, you don't need medication for it. Just rest and drink plenty of fluids."
    },
    {
        "dialog": [
            "Hi Medi, I think I might have hepatitis. Can you tell me more about it?",
            "Sure, I can help with that. What symptoms are you experiencing?",
            "I have been feeling very tired and have yellowing of the skin and eyes.",
            "Okay, yellowing of the skin and eyes can be a sign of jaundice, which is a common symptom of hepatitis. Do you know what type of hepatitis you might have?",
            "No, I'm not sure.",
            "There are several types of hepatitis, but the most common ones are hepatitis A, B, and C. Have you been vaccinated for hepatitis A and B?",
            "I'm not sure. I don't think so.",
            "You should check with your doctor to see if you have been vaccinated and get tested for hepatitis. Treatment will depend on the type of hepatitis you have and the severity of the infection.",
            "Is there anything I can do in the meantime to feel better?"
        ],
        "knowledge": "Hepatitis - Hepatitis is an inflammation of the liver that can be caused by a variety of factors, including viruses, alcohol, drugs, and autoimmune diseases. Symptoms may include fatigue, nausea, vomiting, yellowing of the skin and eyes, dark urine, and abdominal pain. Hepatitis can be acute or chronic and can lead to serious complications such as liver failure and liver cancer. Treatment may involve antiviral medications, lifestyle changes, or in some cases, liver transplantation.",
        "response": "You can rest, avoid alcohol and drugs, and eat a healthy diet to help your liver recover. But it's important to see a doctor for proper diagnosis and treatment."
    },
    {
        "dialog": [
            "Hi Medi, I just had surgery to remove my appendix. What should I do to help with my recovery?",
            "Hello! After surgery, it's important to rest and take care of yourself to aid in the healing process. Have you been following your doctor's instructions?",
            "Yes, I have. But I'm not sure what else I can do.",
            "You should avoid strenuous activity for several weeks and get plenty of rest. You can also apply ice to the incision site to reduce swelling and pain.",
            "Okay, that sounds manageable. What about my diet?",
            "You should eat a healthy diet that includes plenty of protein, fiber, and vitamins to help your body heal. Avoid fatty, spicy, and processed foods that can irritate your digestive system.",
            "Got it. How about physical therapy?",
            "Your doctor may recommend physical therapy to help you regain your strength and mobility. It's important to follow their instructions and attend all appointments.",
            "Thank you, Medi. I appreciate your advice."
        ],
        "knowledge": "Appendectomy Recovery - After an appendectomy, it's important to rest and take care of yourself to aid in the healing process. You should avoid strenuous activity for several weeks and follow your doctor's instructions for caring for the incision site. A healthy diet that includes plenty of protein, fiber, and vitamins is recommended for healing. Physical therapy may be recommended to help regain strength and mobility.",
        "response": "You're welcome! Remember to take it easy and follow your doctor's instructions for a smooth recovery."
    },
    {
        "dialog": [
            "Hi Medi, I'm experiencing some symptoms and I think it might be hepatitis",
            "Alright, what are your symptoms?",
            "I feel nausea, abdominal pain, and my skin has turned yellow.",
            "Based on your symptoms, it is possible you have hepatitis. I advise you to get tested.",
            "Is hepatitis contagious?",
            "Yes, it can be transmitted through saliva and blood droplets in unsanitary settings. Avoid sharing personal belongings and practice good hygiene.",
            "What is the treatment for hepatitis?",
            "It depends on the type of hepatitis but generally involves rest, hydration, and antiviral medication.",
            "Thank you, I'll get tested. How can I prevent hepatitis?"
        ],
        "knowledge": "Hepatitis Hepatitis  Viral particles have also been found in saliva and breastmilk.  Kissing, sharing utensils, and breastfeeding do not lead to transmission unless these fluids are introduced into open sores or cuts.  Many families who do not have safe drinking water or live in unhygienic homes have contracted hepatitis because saliva and blood droplets are often carried through the water and blood-borne illnesses spread quickly in unsanitary settings. Hepatitis B and C can present either acutely or chronically.  Hepatitis D is a defective virus that requires hepatitis B to replicate and is only found with hepatitis B co-infection.  In adults, hepatitis B infection is most commonly self-limiting, with less than 5% progressing to chronic state, and 20 to 30% of those chronically infected developing cirrhosis or liver cancer.  Infection in infants and children frequently leads to chronic infection Hepatitis Hepatitis",
        "response": "You can prevent hepatitis by getting vaccinated, avoiding sharing personal belongings, practicing good hygiene, and avoiding unsanitary environments."
    },
    {
        "dialog": [
            "Hi Medi, I just underwent a liver transplant. What should I expect in terms of lifestyle changes?",
            "Congratulations on your successful transplant. You will need to adhere to a strict diet and exercise regimen to ensure your liver stays healthy.",
            "What kind of diet should I follow?",
            "You should avoid alcohol, high-fat foods, and foods that are difficult to digest. Fruits, vegetables, and lean protein are good choices.",
            "What about exercise?",
            "You should engage in moderate exercise such as walking or swimming for at least 30 minutes a day. Consult with your doctor before beginning any new exercise regimen.",
            "Can I still take my regular medications?",
            "You will need to consult with your doctor before taking any new medications as they can interact with your immunosuppressant medication.",
            "Thank you, what are the risks of rejection?"
        ],
        "knowledge": "Liver transplant Liver transplant  A liver transplant is a surgical procedure that replaces a severely diseased or malfunctioning liver with a healthy liver from a donor.  Lifestyle changes are necessary for successful recovery, including a healthy diet, regular exercise, and avoiding alcohol and drugs that can damage the liver.  Immunosuppressant medication must be taken to prevent rejection of the transplant, which can lead to serious complications.  Rejection is a risk for all liver transplant patients and requires close monitoring by a physician.  Regular check-ups and lab work are necessary for monitoring the health of the liver transplant. Liver transplant Liver transplant",
        "response": "The risk of rejection is a lifelong concern for liver transplant patients. You will need to take immunosuppressant medication to prevent rejection and have regular check-ups and lab work done to monitor the health of your liver."
    },
    {
        "dialog": [
            "Hi Medi, I want to know more about hepatitis B",
            "Sure, what would you like to know?",
            "What is the difference between acute and chronic hepatitis B?",
            "Acute hepatitis B is a short-term infection that usually goes away on its own within six months. Chronic hepatitis B is a long-term infection that can cause serious liver damage over time.",
            "Is hepatitis B curable?",
            "There is no cure for hepatitis B but it can be managed with antiviral medication and lifestyle changes.",
            "Can hepatitis B be prevented?",
            "Yes, getting vaccinated is the best way to prevent hepatitis B. You should also avoid sharing personal belongings and practice good hygiene.",
            "Thank you, how often should I get tested for hepatitis B?"
        ],
        "knowledge": "Hepatitis B Hepatitis B  Hepatitis B is a viral infection that attacks the liver and can cause both acute and chronic disease.  Hepatitis B is primarily spread through contact with blood and bodily fluids.  Hepatitis B can present either acutely or chronically.  In adults, hepatitis B infection is most commonly self-limiting, with less than 5% progressing to chronic state, and 20 to 30% of those chronically infected developing cirrhosis or liver cancer.  Infection in infants and children frequently leads to chronic infection.  There is no cure for hepatitis B, but antiviral medication can help manage the virus.  Vaccination is the best way to prevent hepatitis B Hepatitis B Hepatitis B",
        "response": "If you are at high risk of contracting hepatitis B, you should get tested every six months. Otherwise, you should get tested every year."
    },
    {
        "dialog": [
            "Hi Medi, I think I might have hepatitis",
            "Hi, let's find out more about your symptoms",
            "I have pain in my upper right abdomen and yellowing of the skin",
            "Those are common symptoms of hepatitis, have you been exposed to contaminated blood or needles?",
            "No, I haven't done anything like that. But I do share utensils often",
            "Sharing utensils can spread hepatitis, but don't worry. It can be treated with antiviral medication",
            "That's a relief. What else can I do to help with my recovery?",
            "You should avoid alcohol and eat a healthy diet to support your liver function",
            "Thanks for your help, Medi"
        ],
        "knowledge": "Hepatitis Hepatitis  Viral particles have also been found in saliva and breastmilk.  Kissing, sharing utensils, and breastfeeding do not lead to transmission unless these fluids are introduced into open sores or cuts.  Many families who do not have safe drinking water or live in unhygienic homes have contracted hepatitis because saliva and blood droplets are often carried through the water and blood-borne illnesses spread quickly in unsanitary settings. Hepatitis B and C can present either acutely or chronically.  Hepatitis D is a defective virus that requires hepatitis B to replicate and is only found with hepatitis B co-infection.  In adults, hepatitis B infection is most commonly self-limiting, with less than 5% progressing to chronic state, and 20 to 30% of those chronically infected developing cirrhosis or liver cancer.  Infection in infants and children frequently leads to chronic infection Hepatitis Hepatitis ",
        "response": "You're welcome. If you have any more questions, feel free to ask!"
    },
    {
        "dialog": [
            "Hey Medi, can you tell me more about hepatitis?",
            "Sure, which type of hepatitis are you interested in?",
            "How about hepatitis B?",
            "Hepatitis B is spread through contact with infected blood or body fluids. It can be acute or chronic, with chronic cases putting you at risk for liver damage and cancer",
            "Wow, that's scary. How can I protect myself?",
            "You can get vaccinated and practice safe sex by using condoms. You should also avoid sharing needles or razors",
            "Thanks for the information, Medi",
            "You're welcome, stay safe!"
        ],
        "knowledge": "Hepatitis Hepatitis  Viral particles have also been found in saliva and breastmilk.  Kissing, sharing utensils, and breastfeeding do not lead to transmission unless these fluids are introduced into open sores or cuts.  Many families who do not have safe drinking water or live in unhygienic homes have contracted hepatitis because saliva and blood droplets are often carried through the water and blood-borne illnesses spread quickly in unsanitary settings. Hepatitis B and C can present either acutely or chronically.  Hepatitis D is a defective virus that requires hepatitis B to replicate and is only found with hepatitis B co-infection.  In adults, hepatitis B infection is most commonly self-limiting, with less than 5% progressing to chronic state, and 20 to 30% of those chronically infected developing cirrhosis or liver cancer.  Infection in infants and children frequently leads to chronic infection Hepatitis Hepatitis",
        "response": "If you have any more questions, don't hesitate to ask"
    },
    {
        "dialog": [
            "Hi Medi, I just had a liver biopsy. What should I expect?",
            "After the biopsy, you may experience some pain or soreness in your abdomen. You should avoid heavy lifting and strenuous activity for a few days",
            "What about my diet?",
            "You should avoid alcohol and fatty foods to support your liver function. Drink plenty of water and eat a balanced diet rich in vegetables and lean protein",
            "That's helpful. What about exercise?",
            "You should avoid strenuous exercise for at least a week after the biopsy. Once you've recovered, light exercise like walking can be helpful",
            "Thanks for the tips, Medi",
            "You're welcome. Don't hesitate to reach out if you have more questions"
        ],
        "knowledge": "Hepatitis Hepatitis  Viral particles have also been found in saliva and breastmilk.  Kissing, sharing utensils, and breastfeeding do not lead to transmission unless these fluids are introduced into open sores or cuts.  Many families who do not have safe drinking water or live in unhygienic homes have contracted hepatitis because saliva and blood droplets are often carried through the water and blood-borne illnesses spread quickly in unsanitary settings. Hepatitis B and C can present either acutely or chronically.  Hepatitis D is a defective virus that requires hepatitis B to replicate and is only found with hepatitis B co-infection.  In adults, hepatitis B infection is most commonly self-limiting, with less than 5% progressing to chronic state, and 20 to 30% of those chronically infected developing cirrhosis or liver cancer.  Infection in infants and children frequently leads to chronic infection Hepatitis Hepatitis",
        "response": "You're welcome. I hope your recovery goes smoothly"
    }
]