[
    {
        "dialog": [
            "Hi Medi, I have some symptoms and I need your help.",
            "Of course, tell me your symptoms.",
            "I have a fever, headaches, and confusion.",
            "Based on your symptoms, it could be encephalitis. Have you had a recent mosquito bite or tick bite?",
            "No, I haven't.",
            "Okay, that's good. You should visit a doctor immediately. Encephalitis can be very dangerous.",
            "Is there any medication to treat it?",
            "There are antiviral medications that can help, but it's crucial to consult a doctor first.",
            "Okay, I will do that. Thank you, Medi!"
        ],
        "knowledge": "Encephalitis Encephalitis The effectiveness of intravenous immunoglobulin for the management of childhood encephalitis is unclear.  Systematic reviews have been unable to draw firm conclusions because of a lack of randomised double-blind studies with sufficient numbers of patients and sufficient follow-up.  There is the possibility of a benefit of intravenous immunoglobulin for some forms of childhood encephalitis on some indicators such as length of hospital stay, time to stop spasms, time to regain consciousness, and time to resolution of neuropathic symptoms and fever.   Intravenous immunoglobulin for Japanese Encephalitis appeared to have no benefit when compared with placebo  treatment. Identification of poor prognostic factors include cerebral edema, status epilepticus, and thrombocytopenia.  In contrast, a normal encephalogram at the early stages of diagnosis is associated with high rates of survival. The number of new cases a year of acute encephalitis in Western countries is 7 Encephalitis Encephalitis",
        "response": "It could be encephalitis, so it's important to visit a doctor immediately."
    },
    {
        "dialog": [
            "Hi Medi, I have a question about encephalitis.",
            "Sure, what would you like to know?",
            "What is encephalitis?",
            "Encephalitis is inflammation of the brain. It can be caused by a virus or bacteria.",
            "What are the symptoms of encephalitis?",
            "Symptoms include fever, headache, confusion, seizures, and sensitivity to light.",
            "How is encephalitis treated?",
            "Treatment depends on the cause of the encephalitis. Antiviral medications, antibiotics, and corticosteroids can be used.",
            "Okay, thank you for the information."
        ],
        "knowledge": "Encephalitis Encephalitis The effectiveness of intravenous immunoglobulin for the management of childhood encephalitis is unclear.  Systematic reviews have been unable to draw firm conclusions because of a lack of randomised double-blind studies with sufficient numbers of patients and sufficient follow-up.  There is the possibility of a benefit of intravenous immunoglobulin for some forms of childhood encephalitis on some indicators such as length of hospital stay, time to stop spasms, time to regain consciousness, and time to resolution of neuropathic symptoms and fever.   Intravenous immunoglobulin for Japanese Encephalitis appeared to have no benefit when compared with placebo  treatment. Identification of poor prognostic factors include cerebral edema, status epilepticus, and thrombocytopenia.  In contrast, a normal encephalogram at the early stages of diagnosis is associated with high rates of survival. The number of new cases a year of acute encephalitis in Western countries is 7 Encephalitis Encephalitis",
        "response": "Encephalitis is inflammation of the brain caused by a virus or bacteria. Treatment depends on the cause."
    },
    {
        "dialog": [
            "Hi Medi, I recently endured a medical procedure and I need some advice.",
            "Sure, what type of medical procedure was it?",
            "I had surgery to remove a tumor.",
            "I see. It's important to rest and take it easy for a while. Make sure to follow your doctor's instructions.",
            "What type of exercise can I do?",
            "It's best to start with light exercise such as walking and gradually increase the intensity. Avoid heavy lifting or strenuous activity for a while.",
            "What type of food should I eat?",
            "Make sure to eat a balanced diet with plenty of fruits and vegetables. Avoid processed foods and sugary drinks. Drink plenty of water.",
            "Okay, thanks for your help."
        ],
        "knowledge": "Encephalitis Encephalitis The effectiveness of intravenous immunoglobulin for the management of childhood encephalitis is unclear.  Systematic reviews have been unable to draw firm conclusions because of a lack of randomised double-blind studies with sufficient numbers of patients and sufficient follow-up.  There is the possibility of a benefit of intravenous immunoglobulin for some forms of childhood encephalitis on some indicators such as length of hospital stay, time to stop spasms, time to regain consciousness, and time to resolution of neuropathic symptoms and fever.   Intravenous immunoglobulin for Japanese Encephalitis appeared to have no benefit when compared with placebo  treatment. Identification of poor prognostic factors include cerebral edema, status epilepticus, and thrombocytopenia.  In contrast, a normal encephalogram at the early stages of diagnosis is associated with high rates of survival. The number of new cases a year of acute encephalitis in Western countries is 7 Encephalitis Encephalitis",
        "response": "After surgery, it's important to rest and take it easy. Start with light exercise and eat a balanced diet."
    },
    {
        "dialog": [
            "Hi, Medi. I feel very sick and have a high fever.",
            "Hello, I'm here to help. How long have you had a fever?",
            "It's been going on for three days now. I'm also experiencing chills.",
            "Based on your symptoms, it's possible that you have encephalitis. You should see a doctor as soon as possible.",
            "What is encephalitis, Medi?",
            "Encephalitis is the inflammation of the brain. It can be caused by a viral infection, such as herpes simplex virus, or a mosquito-borne virus, such as West Nile virus. ",
            "Is it curable and what is the treatment process?",
            "The effectiveness of intravenous immunoglobulin for the management of childhood encephalitis is unclear.",
            "What are the symptoms of encephalitis? "
        ],
        "knowledge": "Encephalitis Encephalitis The effectiveness of intravenous immunoglobulin for the management of childhood encephalitis is unclear.  Systematic reviews have been unable to draw firm conclusions because of a lack of randomised double-blind studies with sufficient numbers of patients and sufficient follow-up.  There is the possibility of a benefit of intravenous immunoglobulin for some forms of childhood encephalitis on some indicators such as length of hospital stay, time to stop spasms, time to regain consciousness, and time to resolution of neuropathic symptoms and fever.   Intravenous immunoglobulin for Japanese Encephalitis appeared to have no benefit when compared with placebo  treatment. Identification of poor prognostic factors include cerebral edema, status epilepticus, and thrombocytopenia.  In contrast, a normal encephalogram at the early stages of diagnosis is associated with high rates of survival. The number of new cases a year of acute encephalitis in Western countries is 7 Encephalitis Encephalitis",
        "response": "The symptoms of encephalitis include fever, headache, neck stiffness, drowsiness, confusion, seizures, and sometimes hallucinations."
    },
    {
        "dialog": [
            "Hello Medi, I'm curious about encephalitis. What causes it?",
            "Hi there. Encephalitis can be caused by a viral infection, such as herpes simplex virus, or a mosquito-borne virus, such as West Nile virus. ",
            "Can encephalitis be treated?",
            "The effectiveness of intravenous immunoglobulin for the management of childhood encephalitis is unclear.",
            "What are the symptoms of encephalitis?",
            "The symptoms of encephalitis include fever, headache, neck stiffness, drowsiness, confusion, seizures, and sometimes hallucinations.",
            "Can encephalitis be prevented?",
            "Encephalitis can be prevented by taking steps to avoid mosquito bites, such as using insect repellent and wearing protective clothing, and by getting vaccinated against certain viruses, such as the Japanese encephalitis virus.",
            "Is it possible to fully recover from encephalitis?"
        ],
        "knowledge": "Encephalitis Encephalitis The effectiveness of intravenous immunoglobulin for the management of childhood encephalitis is unclear.  Systematic reviews have been unable to draw firm conclusions because of a lack of randomised double-blind studies with sufficient numbers of patients and sufficient follow-up.  There is the possibility of a benefit of intravenous immunoglobulin for some forms of childhood encephalitis on some indicators such as length of hospital stay, time to stop spasms, time to regain consciousness, and time to resolution of neuropathic symptoms and fever.   Intravenous immunoglobulin for Japanese Encephalitis appeared to have no benefit when compared with placebo  treatment. Identification of poor prognostic factors include cerebral edema, status epilepticus, and thrombocytopenia.  In contrast, a normal encephalogram at the early stages of diagnosis is associated with high rates of survival. The number of new cases a year of acute encephalitis in Western countries is 7 Encephalitis Encephalitis",
        "response": "The severity of encephalitis can vary, but many people can recover fully with treatment. However, some people may experience long-term problems, such as memory loss or seizures."
    },
    {
        "dialog": [
            "Hey, Medi. I just got discharged from the hospital after having encephalitis. What should I do now?",
            "Hi, I'm glad you're feeling better. You should take it easy for a while and rest.",
            "Are there any lifestyle changes or dietary recommendations that I should follow?",
            "Yes, there are a few things you can do to help your body recover. First, make sure you're getting enough rest and sleep. Second, eat a healthy and balanced diet, focusing on foods that are rich in vitamins and nutrients. Finally, try to do some light exercise, such as walking or yoga, to help improve your strength and flexibility.",
            "What kind of exercises are good for me?",
            "Gentle exercise such as yoga and tai chi are great options. You can also try walking, swimming, or cycling, but make sure to take it easy and not overdo it.",
            "Can I go back to work and my daily routine now?",
            "It's best to wait until you've fully recovered before returning to work or your daily routine. You should talk to your doctor to see when it's safe for you to do so.",
            "Thank you for your help, Medi. "
        ],
        "knowledge": "Encephalitis Encephalitis The effectiveness of intravenous immunoglobulin for the management of childhood encephalitis is unclear.  Systematic reviews have been unable to draw firm conclusions because of a lack of randomised double-blind studies with sufficient numbers of patients and sufficient follow-up.  There is the possibility of a benefit of intravenous immunoglobulin for some forms of childhood encephalitis on some indicators such as length of hospital stay, time to stop spasms, time to regain consciousness, and time to resolution of neuropathic symptoms and fever.   Intravenous immunoglobulin for Japanese Encephalitis appeared to have no benefit when compared with placebo  treatment. Identification of poor prognostic factors include cerebral edema, status epilepticus, and thrombocytopenia.  In contrast, a normal encephalogram at the early stages of diagnosis is associated with high rates of survival. The number of new cases a year of acute encephalitis in Western countries is 7 Encephalitis Encephalitis",
        "response": "You're welcome. Take it easy and follow your doctor's instructions. If you experience any symptoms again, don't hesitate to contact your doctor."
    },
    {
        "dialog": [
            "Hello Medi, I have a headache and fever.",
            "I'm sorry to hear that. How long have you been experiencing these symptoms?",
            "I started feeling the headache yesterday and the fever started today.",
            "Okay, based on your symptoms, it is possible that you have encephalitis.",
            "What is encephalitis?",
            "Encephalitis is inflammation of the brain usually caused by a viral infection.",
            "Is there anything I can do to alleviate the symptoms?",
            "I suggest you get some rest and take over-the-counter pain relief medication for the headache.",
            "Thank you, Medi. What should I do if the symptoms persist?"
        ],
        "knowledge": "Encephalitis Encephalitis The effectiveness of intravenous immunoglobulin for the management of childhood encephalitis is unclear. Systematic reviews have been unable to draw firm conclusions because of a lack of randomised double-blind studies with sufficient numbers of patients and sufficient follow-up. There is the possibility of a benefit of intravenous immunoglobulin for some forms of childhood encephalitis on some indicators such as length of hospital stay, time to stop spasms, time to regain consciousness, and time to resolution of neuropathic symptoms and fever. Intravenous immunoglobulin for Japanese Encephalitis appeared to have no benefit when compared with placebo treatment. Identification of poor prognostic factors include cerebral edema, status epilepticus, and thrombocytopenia. In contrast, a normal encephalogram at the early stages of diagnosis is associated with high rates of survival. The number of new cases a year of acute encephalitis in Western countries is 7 Encephalitis Encephalitis",
        "response": "If the symptoms persist, you should visit a doctor as soon as possible for further evaluation and treatment."
    },
    {
        "dialog": [
            "Hi Medi, can you tell me more about encephalitis?",
            "Sure. Encephalitis is inflammation of the brain usually caused by a viral infection.",
            "What are the symptoms of encephalitis?",
            "The symptoms of encephalitis can include fever, headache, nausea and vomiting, confusion, seizures, and sensitivity to light and sound.",
            "How is encephalitis treated?",
            "The treatment for encephalitis depends on the cause of the inflammation. If it is caused by a virus, antiviral medication may be prescribed. Supportive care such as rest, fluids, and pain relief medication may also be recommended.",
            "Can encephalitis be prevented?",
            "Encephalitis can be prevented by taking measures to avoid getting infected with the virus that causes it. This includes practicing good hygiene, avoiding contact with infected individuals, and getting vaccinated if a vaccine is available.",
            "Thank you, Medi. That was very helpful."
        ],
        "knowledge": "Encephalitis Encephalitis The effectiveness of intravenous immunoglobulin for the management of childhood encephalitis is unclear. Systematic reviews have been unable to draw firm conclusions because of a lack of randomised double-blind studies with sufficient numbers of patients and sufficient follow-up. There is the possibility of a benefit of intravenous immunoglobulin for some forms of childhood encephalitis on some indicators such as length of hospital stay, time to stop spasms, time to regain consciousness, and time to resolution of neuropathic symptoms and fever. Intravenous immunoglobulin for Japanese Encephalitis appeared to have no benefit when compared with placebo treatment. Identification of poor prognostic factors include cerebral edema, status epilepticus, and thrombocytopenia. In contrast, a normal encephalogram at the early stages of diagnosis is associated with high rates of survival. The number of new cases a year of acute encephalitis in Western countries is 7 Encephalitis Encephalitis",
        "response": "You're welcome. Let me know if you have any other questions."
    },
    {
        "dialog": [
            "Hi Medi, I just recovered from encephalitis. What should I do now?",
            "I'm glad to hear that you've recovered. After recovering from encephalitis, it's important to take care of yourself by getting plenty of rest, eating a balanced diet, and staying hydrated.",
            "Are there any long-term effects of encephalitis?",
            "It is possible to have long-term effects after recovering from encephalitis, such as memory problems, difficulty concentrating, and fatigue. You should see your doctor for follow-up care to monitor for any potential complications.",
            "Is there anything I can do to prevent getting encephalitis again?",
            "Encephalitis can be prevented by taking measures to avoid getting infected with the virus that causes it. This includes practicing good hygiene, avoiding contact with infected individuals, and getting vaccinated if a vaccine is available.",
            "Thank you, Medi. That was very helpful.",
            "You're welcome. Let me know if you have any other questions."
        ],
        "knowledge": "Encephalitis Encephalitis The effectiveness of intravenous immunoglobulin for the management of childhood encephalitis is unclear. Systematic reviews have been unable to draw firm conclusions because of a lack of randomised double-blind studies with sufficient numbers of patients and sufficient follow-up. There is the possibility of a benefit of intravenous immunoglobulin for some forms of childhood encephalitis on some indicators such as length of hospital stay, time to stop spasms, time to regain consciousness, and time to resolution of neuropathic symptoms and fever. Intravenous immunoglobulin for Japanese Encephalitis appeared to have no benefit when compared with placebo treatment. Identification of poor prognostic factors include cerebral edema, status epilepticus, and thrombocytopenia. In contrast, a normal encephalogram at the early stages of diagnosis is associated with high rates of survival. The number of new cases a year of acute encephalitis in Western countries is 7 Encephalitis Encephalitis",
        "response": "You're welcome. Take care of yourself and stay healthy."
    },
    {
        "dialog": [
            "Hey Medi, I'm feeling nauseous and dizzy today",
            "Hi there, sorry to hear that. Can you tell me more about your symptoms?",
            "Well, I've been feeling lightheaded and I can't keep anything down",
            "I see. Based on your symptoms, you may have viral encephalitis. You should seek medical attention immediately.",
            "What is viral encephalitis?",
            "It's a rare but serious condition that causes inflammation of the brain. It can lead to permanent damage if left untreated.",
            "Oh no, what should I do?",
            "You should go to the nearest hospital as soon as possible and get proper medical treatment.",
            "Thank you for your help."
        ],
        "knowledge": "Encephalitis Encephalitis The effectiveness of intravenous immunoglobulin for the management of childhood encephalitis is unclear.  Systematic reviews have been unable to draw firm conclusions because of a lack of randomised double-blind studies with sufficient numbers of patients and sufficient follow-up.  There is the possibility of a benefit of intravenous immunoglobulin for some forms of childhood encephalitis on some indicators such as length of hospital stay, time to stop spasms, time to regain consciousness, and time to resolution of neuropathic symptoms and fever.   Intravenous immunoglobulin for Japanese Encephalitis appeared to have no benefit when compared with placebo  treatment. Identification of poor prognostic factors include cerebral edema, status epilepticus, and thrombocytopenia.  In contrast, a normal encephalogram at the early stages of diagnosis is associated with high rates of survival. The number of new cases a year of acute encephalitis in Western countries is 7 Encephalitis Encephalitis",
        "response": "You're welcome. Please seek medical attention as soon as possible."
    },
    {
        "dialog": [
            "Hi Medi, can you tell me more about encephalitis?",
            "Hi there, encephalitis is an inflammation of the brain caused by a viral infection or an autoimmune reaction.",
            "What are the symptoms of encephalitis?",
            "The symptoms of encephalitis can include fever, headache, confusion, seizures, and behavioral changes.",
            "Is encephalitis treatable?",
            "Yes, encephalitis can be treated with antiviral medications or immunomodulatory therapies.",
            "What are the long-term effects of encephalitis?",
            "The long-term effects of encephalitis can include cognitive impairment, memory loss, and motor dysfunction.",
            "Thank you for your answers."
        ],
        "knowledge": "Encephalitis Encephalitis The effectiveness of intravenous immunoglobulin for the management of childhood encephalitis is unclear.  Systematic reviews have been unable to draw firm conclusions because of a lack of randomised double-blind studies with sufficient numbers of patients and sufficient follow-up.  There is the possibility of a benefit of intravenous immunoglobulin for some forms of childhood encephalitis on some indicators such as length of hospital stay, time to stop spasms, time to regain consciousness, and time to resolution of neuropathic symptoms and fever.   Intravenous immunoglobulin for Japanese Encephalitis appeared to have no benefit when compared with placebo  treatment. Identification of poor prognostic factors include cerebral edema, status epilepticus, and thrombocytopenia.  In contrast, a normal encephalogram at the early stages of diagnosis is associated with high rates of survival. The number of new cases a year of acute encephalitis in Western countries is 7 Encephalitis Encephalitis",
        "response": "You're welcome. Do you have any other questions?"
    },
    {
        "dialog": [
            "Hey Medi, I recently had encephalitis and I'm wondering what lifestyle changes I should make to aid my recovery",
            "Hi there, sorry to hear about your experience. You should try to get plenty of rest, eat a balanced diet, and refrain from alcohol and tobacco use.",
            "Are there any physical activities that might help?",
            "Yes, gentle exercise like walking or yoga can help improve your overall health and well-being.",
            "What about my cognitive function? Can I do anything to improve that?",
            "Yes, you can try cognitive rehabilitation exercises or brain training games to improve your cognitive function.",
            "That's helpful. Thank you, Medi.",
            "You're welcome. I'm here to help."
        ],
        "knowledge": "Encephalitis Encephalitis The effectiveness of intravenous immunoglobulin for the management of childhood encephalitis is unclear.  Systematic reviews have been unable to draw firm conclusions because of a lack of randomised double-blind studies with sufficient numbers of patients and sufficient follow-up.  There is the possibility of a benefit of intravenous immunoglobulin for some forms of childhood encephalitis on some indicators such as length of hospital stay, time to stop spasms, time to regain consciousness, and time to resolution of neuropathic symptoms and fever.   Intravenous immunoglobulin for Japanese Encephalitis appeared to have no benefit when compared with placebo  treatment. Identification of poor prognostic factors include cerebral edema, status epilepticus, and thrombocytopenia.  In contrast, a normal encephalogram at the early stages of diagnosis is associated with high rates of survival. The number of new cases a year of acute encephalitis in Western countries is 7 Encephalitis Encephalitis",
        "response": "You're welcome. If you have any other questions, feel free to ask."
    },
    {
        "dialog": [
            "Hello Medi, I have a headache and fever since yesterday.",
            "I see, have you been to a crowded or polluted place recently?",
            "Yes, I have been to a market near my place.",
            "Okay, it seems like you have contracted a viral infection.",
            "Oh no, what should I do?",
            "You should abstain from work or school and take rest at home until you recover completely.",
            "What about medication?",
            "You can take paracetamol for fever and headache, it will help you feel better.",
            "How long will it take to recover?"
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "Based on your symptoms, you may have contracted a viral infection called influenza. The recovery time may vary depending on the severity of the infection."
    },
    {
        "dialog": [
            "Hi Medi, I have been diagnosed with encephalitis. What should I do now?",
            "I'm sorry to hear that. Do you experience seizures or spasms?",
            "Yes, I have severe spasms that make me uncomfortable.",
            "Okay, you should be hospitalized immediately for treatment.",
            "What kind of treatment?",
            "The treatment may include intravenous immunoglobulin, which can help reduce the spasms and neuropathic symptoms.",
            "Is it guaranteed to work?",
            "There is no guarantee, but studies have shown it can be effective in reducing length of hospital stay and other symptoms.",
            "What are the poor prognostic factors?"
        ],
        "knowledge": "Encephalitis Encephalitis The effectiveness of intravenous immunoglobulin for the management of childhood encephalitis is unclear.  Systematic reviews have been unable to draw firm conclusions because of a lack of randomised double-blind studies with sufficient numbers of patients and sufficient follow-up.  There is the possibility of a benefit of intravenous immunoglobulin for some forms of childhood encephalitis on some indicators such as length of hospital stay, time to stop spasms, time to regain consciousness, and time to resolution of neuropathic symptoms and fever.   Intravenous immunoglobulin for Japanese Encephalitis appeared to have no benefit when compared with placebo  treatment. Identification of poor prognostic factors include cerebral edema, status epilepticus, and thrombocytopenia.  In contrast, a normal encephalogram at the early stages of diagnosis is associated with high rates of survival. The number of new cases a year of acute encephalitis in Western countries is 7 Encephalitis Encephalitis",
        "response": "The poor prognostic factors include cerebral edema, status epilepticus, and thrombocytopenia."
    },
    {
        "dialog": [
            "Hello Medi, I have just recovered from an encephalitis infection.",
            "That's great! How are you feeling now?",
            "I feel weak and my body is sore. What should I do about it?",
            "You should start with some light exercises such as walking and stretching to regain your strength gradually.",
            "What about my diet?",
            "You should eat a healthy and balanced diet, rich in vitamins and proteins to help your body recover.",
            "Can you suggest some food to eat?",
            "You should eat more fruits and vegetables, whole grains, lean proteins, and healthy fats such as avocados and nuts.",
            "How about my sleep?"
        ],
        "knowledge": "Encephalitis Encephalitis The effectiveness of intravenous immunoglobulin for the management of childhood encephalitis is unclear.  Systematic reviews have been unable to draw firm conclusions because of a lack of randomised double-blind studies with sufficient numbers of patients and sufficient follow-up.  There is the possibility of a benefit of intravenous immunoglobulin for some forms of childhood encephalitis on some indicators such as length of hospital stay, time to stop spasms, time to regain consciousness, and time to resolution of neuropathic symptoms and fever.   Intravenous immunoglobulin for Japanese Encephalitis appeared to have no benefit when compared with placebo  treatment. Identification of poor prognostic factors include cerebral edema, status epilepticus, and thrombocytopenia.  In contrast, a normal encephalogram at the early stages of diagnosis is associated with high rates of survival. The number of new cases a year of acute encephalitis in Western countries is 7 Encephalitis Encephalitis",
        "response": "You should have enough sleep and rest to allow your body to recover and regain your strength."
    },
    {
        "dialog": [
            "Hi Medi, I am feeling dizzy and have a headache",
            "Hello, I'm here to help. How long have you been feeling this way?",
            "It's been a day since I started feeling like this",
            "I think it's better to consult your doctor for a proper diagnosis",
            "Okay, I'll make an appointment. Can I take any medicine in the meantime?",
            "No, it's not advisable to take any medicine without a prescription",
            "Alright. Thank you for your help, Medi",
            "You're welcome. Take care of yourself and get well soon",
            "What could be the possible reasons for my symptoms?"
        ],
        "knowledge": "Headache Headache A headache is a common symptom of many possible conditions, including migraine, tension headache, cluster headache, sinusitis and brain tumour. A headache can be caused by a variety of factors, including genetics, stress, infections, head trauma, environmental factors, and other medical conditions. Treatment options vary depending on the cause and may include medication, lifestyle changes, and other therapies. It is important to seek medical attention for any headache that is accompanied by other symptoms such as fever, confusion, seizures, or neck stiffness. Headache Headache",
        "response": "It is hard to determine the cause without an examination but consulting with your doctor will help to find out."
    },
    {
        "dialog": [
            "Hi Medi, I have a question about encephalitis",
            "Hi there. What would you like to know?",
            "What are the symptoms of encephalitis?",
            "The symptoms can vary but common ones include fever, headache, confusion, seizures, and difficulty speaking or moving",
            "Can it be transmitted from one person to another?",
            "Yes, it can be transmitted through direct contact with infected animals or through mosquito bites in some cases",
            "How can it be prevented?",
            "Prevention includes using mosquito repellent, wearing long-sleeved clothing, and avoiding areas with a high risk of mosquito-borne diseases. It is also important to maintain good hygiene and avoid coming into contact with infected animals",
            "Thank you for the information, Medi"
        ],
        "knowledge": "Encephalitis Encephalitis Encephalitis is an inflammation of the brain that can be caused by a viral infection, bacteria, or other factors. Symptoms can vary but common ones include fever, headache, confusion, seizures, and difficulty speaking or moving. Encephalitis can be transmitted through direct contact with infected animals or through mosquito bites in some cases. Prevention includes using mosquito repellent, wearing long-sleeved clothing, and avoiding areas with a high risk of mosquito-borne diseases. It is also important to maintain good hygiene and avoid coming into contact with infected animals. Encephalitis Encephalitis",
        "response": "No, that's all I wanted to know. Thank you, Medi"
    },
    {
        "dialog": [
            "Hi Medi, I recently had encephalitis and I'm worried about my future health",
            "Hello. I understand your concern. How long ago did you have encephalitis?",
            "It's been a few weeks",
            "It's important to follow your doctor's advice and get plenty of rest. It's also important to take any medication as prescribed",
            "Is there anything I can do to improve my chances of recovering fully?",
            "Yes, physical therapy and rehabilitation can help improve your muscle strength and coordination. A healthy diet and regular exercise can also help with recovery",
            "What are the chances of getting encephalitis again?",
            "It depends on the cause of your encephalitis. Some causes make it more likely to reoccur than others. It's important to discuss this with your doctor",
            "Thank you for your advice, Medi"
        ],
        "knowledge": "Encephalitis Encephalitis The effectiveness of intravenous immunoglobulin for the management of childhood encephalitis is unclear. Systematic reviews have been unable to draw firm conclusions because of a lack of randomised double-blind studies with sufficient numbers of patients and sufficient follow-up. There is the possibility of a benefit of intravenous immunoglobulin for some forms of childhood encephalitis on some indicators such as length of hospital stay, time to stop spasms, time to regain consciousness, and time to resolution of neuropathic symptoms and fever. Intravenous immunoglobulin for Japanese Encephalitis appeared to have no benefit when compared with placebo treatment. Identification of poor prognostic factors include cerebral edema, status epilepticus, and thrombocytopenia. In contrast, a normal encephalogram at the early stages of diagnosis is associated with high rates of survival. The number of new cases a year of acute encephalitis in Western countries is 7 Encephalitis Encephalitis",
        "response": "You're welcome. I hope you recover soon. Don't hesitate to ask your doctor for any specific advice regarding your condition."
    },
    {
        "dialog": [
            "Hello Medi, I feel a headache and running nose",
            "I see. Do you have any other symptoms?",
            "I feel tired and my throat is sore",
            "Based on your symptoms, you may have a cold. Get enough rest and drink plenty of water.",
            "Thank you, Medi. How can I relieve my symptoms?",
            "You can use nasal decongestants and pain relievers, or try saltwater gargle for your sore throat.",
            "Alright, I'll give it a try. Is there anything else I should do?",
            "Avoid contact with others to prevent the spread of your cold.",
            "Understood. How long will my cold last? "
        ],
        "knowledge": "Common cold Common cold The common cold is a viral infectious disease of the upper respiratory tract that primarily affects the nose.  The throat, sinuses, and voice box may also be affected.  Signs and symptoms include coughing, sore throat, runny nose, and fever.  These can last up to two weeks.  Symptoms are typically more severe in the first three to five days and can sometimes overlap with flu-like symptoms.  The cold is spread through coughing, sneezing, and touching objects touched by infected people.  There is no vaccine available for the common cold.  Treatment is usually focused on relieving symptoms. Common cold Common cold",
        "response": "Your cold may last up to two weeks, but it's best to rest and take care of yourself to speed up the recovery process."
    },
    {
        "dialog": [
            "Hello, Medi. I have a child with encephalitis. What can we do to help?",
            "I'm sorry to hear that. What are the symptoms?",
            "My child has a fever, headache, and confusion.",
            "Encephalitis is a serious condition that requires medical attention. You should take your child to the hospital immediately.",
            "What will happen at the hospital? What's the treatment?",
            "The hospital will provide appropriate medical care and treatment. Intravenous immunoglobulin may be given for some forms of childhood encephalitis, but there is no clear evidence of its effectiveness. The treatment may include medications to relieve symptoms, such as fever and pain.",
            "Will my child make a full recovery? ",
            "The prognosis depends on the severity of the condition. Early diagnosis and treatment may improve the chances of a full recovery.",
            "Thank you for the information, Medi. I appreciate it."
        ],
        "knowledge": "Encephalitis Encephalitis The effectiveness of intravenous immunoglobulin for the management of childhood encephalitis is unclear.  Systematic reviews have been unable to draw firm conclusions because of a lack of randomised double-blind studies with sufficient numbers of patients and sufficient follow-up.  There is the possibility of a benefit of intravenous immunoglobulin for some forms of childhood encephalitis on some indicators such as length of hospital stay, time to stop spasms, time to regain consciousness, and time to resolution of neuropathic symptoms and fever.   Intravenous immunoglobulin for Japanese Encephalitis appeared to have no benefit when compared with placebo  treatment. Identification of poor prognostic factors include cerebral edema, status epilepticus, and thrombocytopenia.  In contrast, a normal encephalogram at the early stages of diagnosis is associated with high rates of survival. The number of new cases a year of acute encephalitis in Western countries is 7 Encephalitis Encephalitis",
        "response": "Early diagnosis and treatment may improve the chances of a full recovery, but it depends on the severity of the condition."
    },
    {
        "dialog": [
            "Hi Medi, I just had a lumbar puncture. What should I do now?",
            "Lumbar puncture is a medical procedure that requires proper aftercare to avoid complications. Are you experiencing any symptoms?",
            "I have a headache and my back hurts.",
            "These are common side effects of a lumbar puncture. You should lie down and drink plenty of fluids to avoid dehydration. Avoid strenuous activity for the next few days.",
            "Is there anything else I should do?",
            "If your headache persists, you can take pain relievers or see a doctor for further treatment.",
            "What activities should I avoid?",
            "Avoid any activities that involve bending or straining your back, such as lifting heavy objects or exercising vigorously. Rest as much as possible to allow your body to heal.",
            "Okay, I'll keep that in mind. When can I resume normal activities?"
        ],
        "knowledge": "Lumbar puncture Lumbar puncture Lumbar puncture is a medical procedure that involves inserting a needle into the lower back to collect cerebrospinal fluid. It is used to diagnose and treat conditions that affect the brain and spinal cord, such as meningitis, encephalitis, and multiple sclerosis. It can cause side effects such as headache, back pain, and nausea. Proper aftercare is necessary to avoid complications. The patient should lie down and drink plenty of fluids to avoid dehydration. Strenuous activity should be avoided for a few days after the procedure. Pain relievers may be used to alleviate symptoms. Lumbar puncture Lumbar puncture",
        "response": "You can resume normal activities after a few days, depending on your condition. Consult your doctor before making any changes to your routine."
    },
    {
        "dialog": [
            "Hello Medi, I'm having some symptoms, can you help me?",
            "Of course, tell me your symptoms and I'll try my best to help you.",
            "I have been feeling dizzy and nauseous for a few days.",
            "Alright, have you been experiencing any other symptoms like fever or headache?",
            "No, just dizziness and nausea.",
            "Based on your symptoms, it could be vertigo. I suggest you to consult a doctor for a proper diagnosis.",
            "What is vertigo exactly?",
            "Vertigo is a type of dizziness that makes you feel like you're spinning or everything around you is spinning.",
            "Alright, I'll consult a doctor. Thank you for your help, Medi."
        ],
        "knowledge": "Vertigo Vertigo Vertigo is a type of dizziness that can be described as a spinning sensation or a feeling of movement inside your head.  It's a symptom of an underlying condition and not a diagnosis in itself.  It can be caused by a problem in the inner ear, such as benign paroxysmal positional vertigo (BPPV), migraine or labyrinthitis.  When the cause is a problem in the inner ear, it is called peripheral vertigo.  When the cause is in the brain, it is called central vertigo.  Symptoms may include a spinning sensation, unsteadiness, nausea, vomiting, sweating, and abnormal eye movements. Vertigo Vertigo",
        "response": "Vertigo is a type of dizziness that makes you feel like you're spinning or everything around you is spinning."
    },
    {
        "dialog": [
            "Hello Medi, I've just had a medical procedure, what precautions should I take?",
            "Hi there, what procedure did you have and when did you have it?",
            "I just had an endoscopy yesterday.",
            "Alright, after an endoscopy, you should avoid eating or drinking anything for a few hours.",
            "What about after a few hours?",
            "After that, you should try to eat light and easy-to-digest food for a few days. Avoid spicy, greasy and heavy food.",
            "What about physical activity?",
            "For the first day, avoid any strenuous physical activity or heavy lifting.",
            "Okay, thanks for the advice, Medi!"
        ],
        "knowledge": "Endoscopy Endoscopy After an endoscopy, you should avoid eating or drinking anything for a few hours until the anesthetic has worn off.  You can eat and drink as normal after this, unless you are told otherwise.  You may experience a sore throat or bloating for a few hours after the procedure.  You should try to eat light and easy-to-digest food for a few days.  Avoid spicy, greasy or heavy food.  For the first day, avoid any strenuous physical activity or heavy lifting. Endoscopy Endoscopy",
        "response": "After an endoscopy, you should avoid eating or drinking anything for a few hours, try to eat light and easy-to-digest food for a few days, and avoid strenuous physical activity or heavy lifting for the first day."
    },
    {
        "dialog": [
            "Hi Medi, I have a question about encephalitis.",
            "Sure, I'll try my best to answer your question.",
            "What are the symptoms of encephalitis?",
            "The symptoms of encephalitis can vary depending on the severity and cause of the inflammation, but they can include fever, headache, neck stiffness, fatigue, confusion, drowsiness, seizures, and muscle weakness.",
            "What are the treatments for encephalitis?",
            "The treatment for encephalitis involves managing the symptoms and providing supportive care. Antiviral medication may be prescribed for viral encephalitis, while antibiotics may be used for bacterial encephalitis. Corticosteroids may be used to reduce inflammation in the brain.",
            "Is encephalitis contagious?",
            "It depends on the cause of the encephalitis. Some types of encephalitis, such as viral encephalitis, can be contagious and spread from person to person. While others, such as autoimmune encephalitis, are not contagious.",
            "Thank you for the information, Medi."
        ],
        "knowledge": "Encephalitis Encephalitis The symptoms of encephalitis can vary depending on the severity and cause of the inflammation.  They can include fever, headache, neck stiffness, fatigue, confusion, drowsiness, seizures, and muscle weakness.  The treatment for encephalitis involves managing the symptoms and providing supportive care. Antiviral medication may be prescribed for viral encephalitis, while antibiotics may be used for bacterial encephalitis. Corticosteroids may be used to reduce inflammation in the brain.  Some types of encephalitis, such as viral encephalitis, can be contagious and spread from person to person. While others, such as autoimmune encephalitis, are not contagious. Encephalitis Encephalitis",
        "response": "The symptoms of encephalitis can include fever, headache, neck stiffness, fatigue, confusion, drowsiness, seizures, and muscle weakness. The treatment involves managing the symptoms and providing supportive care. Some types of encephalitis, such as viral encephalitis, can be contagious and spread from person to person."
    },
    {
        "dialog": [
            "Hi Medi, I am feeling very sick lately.",
            "Hello, I am sorry to hear that. Could you please tell me your symptoms?",
            "I have had a high fever and severe headaches, and I feel very tired all the time.",
            "I see. Have you ever been diagnosed with encephalitis before?",
            "No, I have not. What is encephalitis?",
            "Encephalitis is inflammation of the brain, which can cause high fever and severe headaches. I recommend that you visit a hospital as soon as possible for a check-up.",
            "Is it a dangerous disease?",
            "Yes, it can be serious if not treated promptly.",
            "What is the treatment for encephalitis?"
        ],
        "knowledge": "Encephalitis Encephalitis The effectiveness of intravenous immunoglobulin for the management of childhood encephalitis is unclear.  Systematic reviews have been unable to draw firm conclusions because of a lack of randomised double-blind studies with sufficient numbers of patients and sufficient follow-up.  There is the possibility of a benefit of intravenous immunoglobulin for some forms of childhood encephalitis on some indicators such as length of hospital stay, time to stop spasms, time to regain consciousness, and time to resolution of neuropathic symptoms and fever.   Intravenous immunoglobulin for Japanese Encephalitis appeared to have no benefit when compared with placebo  treatment. Identification of poor prognostic factors include cerebral edema, status epilepticus, and thrombocytopenia.  In contrast, a normal encephalogram at the early stages of diagnosis is associated with high rates of survival. The number of new cases a year of acute encephalitis in Western countries is 7 Encephalitis Encephalitis",
        "response": "The treatment for encephalitis depends on the cause and severity of the disease, but it usually involves antiviral or antibiotic medication and supportive care such as rest and hydration."
    },
    {
        "dialog": [
            "Hi Medi, I want to ask a question about encephalitis.",
            "Of course, I am glad to help. What is your question?",
            "What are the symptoms of encephalitis, and how is it diagnosed?",
            "The symptoms of encephalitis include fever, headache, confusion, seizures, and sometimes a rash. It can be diagnosed through physical examination and laboratory tests such as lumbar puncture and brain imaging.",
            "Can encephalitis be prevented?",
            "There is no specific way to prevent encephalitis, but you can reduce your risk by taking precautions such as avoiding mosquito bites, washing your hands frequently, and avoiding contact with people who are sick.",
            "Can anyone get encephalitis?",
            "Yes, anyone can get encephalitis, but some people are at higher risk than others, such as young children, older adults, and people with weakened immune systems.",
            "What should I do if I suspect that I have encephalitis?"
        ],
        "knowledge": "Encephalitis Encephalitis The effectiveness of intravenous immunoglobulin for the management of childhood encephalitis is unclear.  Systematic reviews have been unable to draw firm conclusions because of a lack of randomised double-blind studies with sufficient numbers of patients and sufficient follow-up.  There is the possibility of a benefit of intravenous immunoglobulin for some forms of childhood encephalitis on some indicators such as length of hospital stay, time to stop spasms, time to regain consciousness, and time to resolution of neuropathic symptoms and fever.   Intravenous immunoglobulin for Japanese Encephalitis appeared to have no benefit when compared with placebo  treatment. Identification of poor prognostic factors include cerebral edema, status epilepticus, and thrombocytopenia.  In contrast, a normal encephalogram at the early stages of diagnosis is associated with high rates of survival. The number of new cases a year of acute encephalitis in Western countries is 7 Encephalitis Encephalitis",
        "response": "If you suspect that you have encephalitis, I recommend that you seek medical attention immediately, as early diagnosis and treatment are crucial for a better outcome."
    },
    {
        "dialog": [
            "Hi Medi, I had encephalitis before. What kind of lifestyle changes should I make to prevent it from happening again?",
            "I am sorry to hear that. Some lifestyle changes that may help prevent encephalitis include practicing good hygiene, avoiding mosquito bites or other insect bites, and getting vaccinated if you are at risk for certain types of encephalitis.",
            "What should I do if I experience symptoms again?",
            "If you experience symptoms of encephalitis again, such as fever, headache, confusion, or seizures, it is important to seek medical attention right away to receive prompt treatment.",
            "Can encephalitis cause any long-term effects?",
            "Yes, encephalitis can cause long-term effects such as memory problems, seizures, and behavioral changes. It is important to receive appropriate treatment and follow-up care to manage these effects.",
            "I see. Thank you for your advice, Medi.",
            "You're welcome. Please take care of yourself and do not hesitate to contact me if you have any further questions or concerns.",
            "Sure, I will. Thank you again."
        ],
        "knowledge": "Encephalitis Encephalitis The effectiveness of intravenous immunoglobulin for the management of childhood encephalitis is unclear.  Systematic reviews have been unable to draw firm conclusions because of a lack of randomised double-blind studies with sufficient numbers of patients and sufficient follow-up.  There is the possibility of a benefit of intravenous immunoglobulin for some forms of childhood encephalitis on some indicators such as length of hospital stay, time to stop spasms, time to regain consciousness, and time to resolution of neuropathic symptoms and fever.   Intravenous immunoglobulin for Japanese Encephalitis appeared to have no benefit when compared with placebo  treatment. Identification of poor prognostic factors include cerebral edema, status epilepticus, and thrombocytopenia.  In contrast, a normal encephalogram at the early stages of diagnosis is associated with high rates of survival. The number of new cases a year of acute encephalitis in Western countries is 7 Encephalitis Encephalitis",
        "response": "You're welcome. Please take care of yourself and do not hesitate to contact me if you have any further questions or concerns."
    },
    {
        "dialog": [
            "Hello Medi, I have a concern about encephalitis. Can you help me?",
            "Sure. What symptoms do you have?",
            "I've been experiencing severe headaches and a stiff neck for a few days now.",
            "Headaches and a stiff neck could be early signs of encephalitis. You might also experience fever, confusion, seizures, and sensitivity to light.",
            "That sounds scary. Is there anything I can do to prevent encephalitis?",
            "You can reduce your risk by avoiding mosquito bites, practicing good hygiene, and keeping your immune system strong.",
            "Thanks for the advice! How is encephalitis diagnosed?",
            "Encephalitis is usually diagnosed through a combination of a physical exam, blood tests, and imaging tests such as a CT scan or MRI.",
            "I see. If I have encephalitis, what are my treatment options?"
        ],
        "knowledge": "Encephalitis Encephalitis The effectiveness of intravenous immunoglobulin for the management of childhood encephalitis is unclear.  Systematic reviews have been unable to draw firm conclusions because of a lack of randomised double-blind studies with sufficient numbers of patients and sufficient follow-up.  There is the possibility of a benefit of intravenous immunoglobulin for some forms of childhood encephalitis on some indicators such as length of hospital stay, time to stop spasms, time to regain consciousness, and time to resolution of neuropathic symptoms and fever.   Intravenous immunoglobulin for Japanese Encephalitis appeared to have no benefit when compared with placebo  treatment. Identification of poor prognostic factors include cerebral edema, status epilepticus, and thrombocytopenia.  In contrast, a normal encephalogram at the early stages of diagnosis is associated with high rates of survival. The number of new cases a year of acute encephalitis in Western countries is 7 Encephalitis Encephalitis",
        "response": "Treatment of encephalitis depends on the cause, but can include antiviral medications, corticosteroids, and supportive care such as pain management and hydration."
    },
    {
        "dialog": [
            "Hello Medi, I have a question about encephalitis.",
            "Sure, what would you like to know?",
            "What is encephalitis exactly?",
            "Encephalitis is inflammation of the brain caused by a viral or bacterial infection.",
            "What are the symptoms of encephalitis?",
            "The symptoms of encephalitis can vary, but can include fever, headaches, confusion, seizures, and sensitivity to light.",
            "Is encephalitis contagious?",
            "Most cases of encephalitis are not contagious, but some types such as viral encephalitis can be spread through mosquito bites or contact with infected animals.",
            "Thanks for the information! How serious is encephalitis?"
        ],
        "knowledge": "Encephalitis Encephalitis The effectiveness of intravenous immunoglobulin for the management of childhood encephalitis is unclear.  Systematic reviews have been unable to draw firm conclusions because of a lack of randomised double-blind studies with sufficient numbers of patients and sufficient follow-up.  There is the possibility of a benefit of intravenous immunoglobulin for some forms of childhood encephalitis on some indicators such as length of hospital stay, time to stop spasms, time to regain consciousness, and time to resolution of neuropathic symptoms and fever.   Intravenous immunoglobulin for Japanese Encephalitis appeared to have no benefit when compared with placebo  treatment. Identification of poor prognostic factors include cerebral edema, status epilepticus, and thrombocytopenia.  In contrast, a normal encephalogram at the early stages of diagnosis is associated with high rates of survival. The number of new cases a year of acute encephalitis in Western countries is 7 Encephalitis Encephalitis",
        "response": "The severity of encephalitis can vary depending on the cause and individual factors, but it can be a serious condition that requires medical attention."
    },
    {
        "dialog": [
            "Hi Medi, I recently had encephalitis and I'm wondering what I can do to improve my recovery.",
            "I'm sorry to hear that. Lifestyle changes can be helpful, such as getting enough rest, staying hydrated, and eating nutritious foods.",
            "What about physical activity?",
            "Physical activity can be beneficial, but you should talk to your doctor before starting any exercise program.",
            "Are there any medications that can help with recovery?",
            "There is no specific medication for encephalitis, but your doctor may prescribe antiviral medications or corticosteroids depending on the cause and severity of your condition.",
            "Thanks for the information. Is there anything else I should know?",
            "It's important to attend all follow-up appointments with your doctor and follow their recommendations for treatment and recovery.",
            "Got it. How long does it typically take to recover from encephalitis?"
        ],
        "knowledge": "Encephalitis Encephalitis The effectiveness of intravenous immunoglobulin for the management of childhood encephalitis is unclear.  Systematic reviews have been unable to draw firm conclusions because of a lack of randomised double-blind studies with sufficient numbers of patients and sufficient follow-up.  There is the possibility of a benefit of intravenous immunoglobulin for some forms of childhood encephalitis on some indicators such as length of hospital stay, time to stop spasms, time to regain consciousness, and time to resolution of neuropathic symptoms and fever.   Intravenous immunoglobulin for Japanese Encephalitis appeared to have no benefit when compared with placebo  treatment. Identification of poor prognostic factors include cerebral edema, status epilepticus, and thrombocytopenia.  In contrast, a normal encephalogram at the early stages of diagnosis is associated with high rates of survival. The number of new cases a year of acute encephalitis in Western countries is 7 Encephalitis Encephalitis",
        "response": "The recovery time for encephalitis can vary depending on the cause and severity of the condition, but it can take weeks or even months to fully recover."
    }
]