[
    {
        "dialog": [
            "Hello Medi, I am feeling really tired today.",
            "I'm sorry to hear that. Can you tell me more about your symptoms?",
            "I have no energy and sometimes feel nauseous.",
            "I see. How long have you been feeling like this?",
            "A few days now. It's really affecting my work.",
            "Based on your symptoms, it's possible you have hepatitis. You should see a doctor for a proper diagnosis.",
            "What is Hepatitis and how common is it?",
            "Hepatitis is a disease that affects the liver and is caused by a viral infection. Currently in the United States, approximately 3.5 million adults are estimated to be infected. Hepatitis C is particularly prevalent among people born between 1945 and 1965, a group of about 800,000 people, with prevalence as high as 3.2% versus 1.6% in the general U.S. population.",
            "Can hepatitis be treated?"
        ],
        "knowledge": "Hepatitis Hepatitis  Currently in the United States, approximately 3.5 million adults are estimated to be infected. Hepatitis C is particularly prevalent among people born between 1945 and 1965, a group of about 800,000 people, with prevalence as high as 3.2% versus 1.6% in the general U.S. population Hepatitis Hepatitis",
        "response": "Yes, there are treatments available for hepatitis, but it's important to see a doctor for a proper diagnosis and to discuss treatment options."
    },
    {
        "dialog": [
            "Hi Medi, I just got diagnosed with hepatitis. What should I do?",
            "I'm sorry to hear that. The most important thing is to follow your doctor's advice and take any prescribed medication.",
            "Is there anything else I can do to help with my recovery?",
            "Yes, you can modify your lifestyle to reduce stress on your liver. This includes eating a healthy diet, getting regular exercise, and avoiding alcohol and other harmful substances.",
            "How long will it take for me to recover?",
            "It varies from person to person, but with proper treatment and lifestyle changes, many people are able to recover fully.",
            "What are some common symptoms of hepatitis?",
            "Symptoms can include fatigue, nausea, vomiting, abdominal pain, and jaundice, which is a yellowing of the skin and eyes.",
            "Can hepatitis be passed from person to person?"
        ],
        "knowledge": "Hepatitis Hepatitis  Currently in the United States, approximately 3.5 million adults are estimated to be infected. Hepatitis C is particularly prevalent among people born between 1945 and 1965, a group of about 800,000 people, with prevalence as high as 3.2% versus 1.6% in the general U.S. population Hepatitis Hepatitis",
        "response": "Yes, hepatitis can be spread through contact with infected blood or bodily fluids, so it's important to take precautions to avoid spreading the disease."
    },
    {
        "dialog": [
            "Hi Medi, I just had a liver biopsy. What should I do now?",
            "It's important to follow your doctor's advice and rest for a few days after the procedure.",
            "Is there anything else I can do to help with my recovery?",
            "Yes, you can modify your lifestyle to reduce stress on your liver. This includes eating a healthy diet, getting regular exercise, and avoiding alcohol and other harmful substances.",
            "What kind of diet should I be following?",
            "You should aim to eat a balanced diet with plenty of fruits, vegetables, and whole grains. You should also avoid processed foods and foods high in sugar and saturated fat.",
            "What kind of exercise is best for my recovery?",
            "Aerobic exercise, such as walking or cycling, can be a great way to improve your overall health and help your liver recover. Just be sure to consult with your doctor before starting any new exercise regimen.",
            "How long will it take for me to recover?"
        ],
        "knowledge": "Hepatitis Hepatitis  Currently in the United States, approximately 3.5 million adults are estimated to be infected. Hepatitis C is particularly prevalent among people born between 1945 and 1965, a group of about 800,000 people, with prevalence as high as 3.2% versus 1.6% in the general U.S. population Hepatitis Hepatitis",
        "response": "It varies from person to person, but with proper care and lifestyle changes, many people are able to make a full recovery after a liver biopsy."
    },
    {
        "dialog": [
            "Hi Medi, I think I might have Hepatitis C.",
            "Hello, what symptoms are you experiencing?",
            "I have been feeling very tired and have had a loss of appetite.",
            "I see. Have you experienced any abdominal pain or jaundice?",
            "No, just the tiredness and loss of appetite.",
            "Based on your symptoms, it's possible that you could have Hepatitis C. I suggest you see a doctor for a diagnosis.",
            "Is Hepatitis C common?",
            "Yes, in fact, approximately 3.5 million adults in the United States are estimated to be infected.",
            "Thank you for your help, Medi."
        ],
        "knowledge": "Hepatitis Hepatitis  Currently in the United States, approximately 3.5 million adults are estimated to be infected. Hepatitis C is particularly prevalent among people born between 1945 and 1965, a group of about 800,000 people, with prevalence as high as 3.2% versus 1.6% in the general U.S. population Hepatitis Hepatitis",
        "response": "You're welcome. I hope you see a doctor soon for a proper diagnosis."
    },
    {
        "dialog": [
            "Hi Medi, can you tell me more about Hepatitis C?",
            "Of course, what would you like to know?",
            "What causes Hepatitis C?",
            "Hepatitis C is caused by the hepatitis C virus. It's usually spread through contaminated blood.",
            "How is it diagnosed?",
            "A blood test can diagnose Hepatitis C. If you think you have been exposed to the virus, it's important to get tested.",
            "Is there a cure for Hepatitis C?",
            "Yes, there are several medications available that can cure Hepatitis C.",
            "Thank you for the information, Medi."
        ],
        "knowledge": "Hepatitis Hepatitis  Currently in the United States, approximately 3.5 million adults are estimated to be infected. Hepatitis C is particularly prevalent among people born between 1945 and 1965, a group of about 800,000 people, with prevalence as high as 3.2% versus 1.6% in the general U.S. population Hepatitis Hepatitis",
        "response": "You're welcome. If you have any other questions, feel free to ask."
    },
    {
        "dialog": [
            "Hi Medi, I was recently diagnosed with Hepatitis C. What can I do to manage it?",
            "I'm sorry to hear that. The first step is to see a doctor and discuss your treatment options.",
            "What kind of treatment is available?",
            "There are several medications available that can cure Hepatitis C. Your doctor can determine the best course of treatment for you.",
            "Is there anything I can do to prevent spreading the virus?",
            "Yes, you should avoid sharing needles, razors, or toothbrushes with others. You should also practice safe sex and use protection.",
            "Will I need to change my diet or lifestyle?",
            "It's important to maintain a healthy lifestyle to help manage the virus. This includes eating a healthy diet and getting regular exercise.",
            "Thank you for the advice, Medi."
        ],
        "knowledge": "Hepatitis Hepatitis  Currently in the United States, approximately 3.5 million adults are estimated to be infected. Hepatitis C is particularly prevalent among people born between 1945 and 1965, a group of about 800,000 people, with prevalence as high as 3.2% versus 1.6% in the general U.S. population Hepatitis Hepatitis",
        "response": "You're welcome. Remember to follow your doctor's advice and take care of yourself."
    },
    {
        "dialog": [
            "Hi Medi, I'm feeling unwell and I suspect I have Hepatitis C.",
            "I'm here to help. What are your symptoms?",
            "I have been feeling tired and nauseous for about a week now. I also have some abdominal pain",
            "I see. Based on your symptoms, it's possible that you have Hepatitis C. I suggest you get tested.",
            "What is Hepatitis C and how did I get it?",
            "Hepatitis C is a liver disease caused by the Hepatitis C virus. You could have contracted it from shared needles or from unprotected sex with an infected person.",
            "That's worrying. Is Hepatitis C treatable?",
            "Yes, it is. Treatment usually involves antiviral medication. The earlier the diagnosis, the better the outcome.",
            "Thanks for your help, Medi. I'll make sure to get tested."
        ],
        "knowledge": "Hepatitis C is a liver disease caused by the Hepatitis C virus. About 3.5 million adults in the US are estimated to be infected. It is particularly prevalent among people born between 1945 and 1965, with prevalence as high as 3.2% versus 1.6% in the general US population.",
        "response": "You can get Hepatitis C from shared needles or from unprotected sex with an infected person. Treatment usually involves antiviral medication."
    },
    {
        "dialog": [
            "Hi Medi, I have a few questions about Hepatitis C.",
            "Sure, go ahead.",
            "What are the symptoms of Hepatitis C?",
            "The symptoms can vary, but some common ones include fatigue, nausea, abdominal pain, and jaundice.",
            "How is Hepatitis C diagnosed?",
            "It can be diagnosed through a blood test that looks for the presence of the Hepatitis C virus in your bloodstream.",
            "Can Hepatitis C be prevented?",
            "Yes, you can reduce your risk of getting Hepatitis C by not sharing needles, practicing safe sex, and avoiding contact with blood from an infected person.",
            "Thanks, Medi. That's very helpful."
        ],
        "knowledge": "Hepatitis C is a liver disease caused by the Hepatitis C virus. About 3.5 million adults in the US are estimated to be infected. It is particularly prevalent among people born between 1945 and 1965, with prevalence as high as 3.2% versus 1.6% in the general US population.",
        "response": "The symptoms of Hepatitis C can include fatigue, nausea, abdominal pain, and jaundice. It can be diagnosed through a blood test and can be prevented by not sharing needles, practicing safe sex, and avoiding contact with blood from an infected person."
    },
    {
        "dialog": [
            "Hi Medi, I recently underwent treatment for Hepatitis C. What should I do now?",
            "Congratulations on completing your treatment. I suggest you make some lifestyle changes to prevent a recurrence.",
            "What kind of lifestyle changes should I make?",
            "You should avoid alcohol and illicit drugs, maintain a healthy diet, and make sure to get enough rest and exercise.",
            "Can you recommend any specific diet or exercise regimen?",
            "For your diet, you should focus on whole foods, fruits, vegetables, lean protein, and whole grains. For exercise, aim for at least 30 minutes of physical activity per day, such as walking, jogging, or cycling.",
            "Thanks, that's very helpful. What else can I do to stay healthy?",
            "You should also make sure to get regular check-ups with your doctor and keep up to date with any recommended vaccinations.",
            "Great, thanks for the advice, Medi."
        ],
        "knowledge": "Hepatitis C is a liver disease caused by the Hepatitis C virus. About 3.5 million adults in the US are estimated to be infected. It is particularly prevalent among people born between 1945 and 1965, with prevalence as high as 3.2% versus 1.6% in the general US population.",
        "response": "To prevent a recurrence of Hepatitis C, it's important to avoid alcohol and illicit drugs, maintain a healthy diet, exercise regularly, get regular check-ups with your doctor, and keep up to date with any recommended vaccinations."
    },
    {
        "dialog": [
            "Hello Medi, I have some symptoms and I need your help.",
            "Hello there, I'm here to help. Can you tell me what symptoms you're experiencing?",
            "I have been feeling really tired lately and have had a loss of appetite.",
            "I see, those are definitely concerning symptoms. Have you experienced any other symptoms?",
            "Yes, I've also been experiencing some abdominal pain and my urine has been darker than usual.",
            "Based on your symptoms, it's possible that you have hepatitis. I recommend you get some blood tests done to check for liver function and hepatitis infection.",
            "What causes hepatitis and how can it be treated?",
            "Hepatitis is caused by a virus that attacks the liver. Treatment depends on the type of hepatitis and the severity of the infection. It's important to see a doctor to get a proper diagnosis and treatment plan.",
            "Thank you for your help, Medi."
        ],
        "knowledge": "Hepatitis Hepatitis  Currently in the United States, approximately 3.5 million adults are estimated to be infected. Hepatitis C is particularly prevalent among people born between 1945 and 1965, a group of about 800,000 people, with prevalence as high as 3.2% versus 1.6% in the general U.S. population Hepatitis Hepatitis",
        "response": "Hepatitis is caused by a virus that attacks the liver. Treatment depends on the type of hepatitis and the severity of the infection. It's important to see a doctor to get a proper diagnosis and treatment plan."
    },
    {
        "dialog": [
            "Hi Medi, I have a question about hepatitis.",
            "Of course, I'm here to help. What's your question?",
            "What are the different types of hepatitis and how do they differ?",
            "There are several types of hepatitis, including A, B, C, D, and E. They are caused by different viruses and have different modes of transmission and treatments.",
            "What are the most common types of hepatitis?",
            "Hepatitis A, B, and C are the most common types in the United States. It's important to get vaccinated for hepatitis A and B if you haven't already and to take precautions to avoid contracting hepatitis C.",
            "What precautions can I take to avoid contracting hepatitis C?",
            "Hepatitis C is often spread through sharing needles or other injection equipment, so it's important to avoid sharing needles or equipment. You should also practice safe sex and avoid getting tattoos or piercings from unlicensed facilities.",
            "Thank you for the information, Medi."
        ],
        "knowledge": "Hepatitis Hepatitis  Currently in the United States, approximately 3.5 million adults are estimated to be infected. Hepatitis C is particularly prevalent among people born between 1945 and 1965, a group of about 800,000 people, with prevalence as high as 3.2% versus 1.6% in the general U.S. population Hepatitis Hepatitis",
        "response": "Hepatitis A, B, and C are the most common types in the United States. It's important to get vaccinated for hepatitis A and B if you haven't already and to take precautions to avoid contracting hepatitis C."
    },
    {
        "dialog": [
            "Hello Medi, I recently had a medical procedure and I'm not sure how to take care of myself afterwards.",
            "Hi there, I'm here to help. What kind of procedure did you have?",
            "I had a liver biopsy.",
            "Ah, I see. After a liver biopsy, it's important to avoid heavy lifting or strenuous activity for at least a week. You should also avoid taking any blood thinning medications for a few days and avoid alcohol for at least 24 hours.",
            "What should I eat after a liver biopsy?",
            "It's important to eat a healthy and balanced diet, including plenty of fruits and vegetables and lean protein. It's also important to stay hydrated by drinking plenty of water and other fluids.",
            "Can I exercise after a liver biopsy?",
            "It's important to avoid strenuous activity for at least a week after a liver biopsy, but light exercise such as walking is usually okay. However, you should always follow the advice of your doctor.",
            "Thank you for the advice, Medi."
        ],
        "knowledge": "Hepatitis Hepatitis  Currently in the United States, approximately 3.5 million adults are estimated to be infected. Hepatitis C is particularly prevalent among people born between 1945 and 1965, a group of about 800,000 people, with prevalence as high as 3.2% versus 1.6% in the general U.S. population Hepatitis Hepatitis",
        "response": "After a liver biopsy, it's important to avoid heavy lifting or strenuous activity for at least a week. You should also avoid taking any blood thinning medications for a few days and avoid alcohol for at least 24 hours."
    },
    {
        "dialog": [
            "Hello Medi, I am feeling sick and tired lately.",
            "I'm sorry to hear that. Can you tell me about your symptoms?",
            "I have a low-grade fever, nausea, and stomach pain.",
            "Okay. Have you noticed any yellowing of the skin or eyes?",
            "No, I haven't.",
            "Based on your symptoms, it's possible that you have viral Hepatitis A. I recommend you see a doctor for further testing.",
            "Is there anything I can do to treat it?",
            "Rest, drink plenty of fluids, and avoid alcohol and fatty foods. Your doctor may also prescribe antiviral medication.",
            "Thank you for your help, Medi."
        ],
        "knowledge": "Hepatitis Hepatitis  Currently in the United States, approximately 3. 5 million adults are estimated to be infected.  Hepatitis C is particularly prevalent among people born between 1945 and 1965, a group of about 800,000 people, with prevalence as high as 3. 2% versus 1. 6% in the general U. S.  population Hepatitis Hepatitis",
        "response": "Based on your symptoms, it's possible that you have viral Hepatitis A. I recommend you see a doctor for further testing."
    },
    {
        "dialog": [
            "Hello Medi, I've heard about Hepatitis C. Can you tell me more about it?",
            "Of course. Hepatitis C is a viral infection that causes liver inflammation, sometimes leading to serious liver damage.",
            "How is it spread?",
            "Hepatitis C is spread through contaminated blood. This can happen through sharing needles or other equipment used to inject drugs, or through unsterile tattoo equipment.",
            "Is there a cure for Hepatitis C?",
            "Yes, there are several effective treatments for Hepatitis C, including antiviral medications.",
            "What can I do to prevent Hepatitis C?",
            "You can reduce your risk of Hepatitis C by not sharing needles or other equipment used to inject drugs, not sharing personal care items that may have come into contact with infected blood (such as razors or toothbrushes), and using condoms during sex.",
            "Thank you, Medi. That was very helpful."
        ],
        "knowledge": "Hepatitis Hepatitis  Currently in the United States, approximately 3. 5 million adults are estimated to be infected.  Hepatitis C is particularly prevalent among people born between 1945 and 1965, a group of about 800,000 people, with prevalence as high as 3. 2% versus 1. 6% in the general U. S.  population Hepatitis Hepatitis",
        "response": "You can reduce your risk of Hepatitis C by not sharing needles or other equipment used to inject drugs, not sharing personal care items that may have come into contact with infected blood (such as razors or toothbrushes), and using condoms during sex."
    },
    {
        "dialog": [
            "Hello Medi, I just underwent a liver biopsy. What should I expect in terms of recovery?",
            "After a liver biopsy, you should rest for the remainder of the day. You may experience some pain or soreness at the biopsy site for a few days.",
            "What can I do to manage the pain?",
            "You can take over-the-counter pain medication such as acetaminophen. Avoid aspirin or ibuprofen as these can increase the risk of bleeding.",
            "Is there anything I should avoid after the biopsy?",
            "Avoid vigorous physical activity, heavy lifting, and strenuous exercise for up to a week after the biopsy to avoid bleeding or further injury to the liver.",
            "What should I eat after the biopsy?",
            "Eat a light, healthy meal after the biopsy. Avoid fatty or spicy foods that may irritate the digestive system.",
            "Thank you for your help, Medi."
        ],
        "knowledge": "Hepatitis Hepatitis  Currently in the United States, approximately 3. 5 million adults are estimated to be infected.  Hepatitis C is particularly prevalent among people born between 1945 and 1965, a group of about 800,000 people, with prevalence as high as 3. 2% versus 1. 6% in the general U. S.  population Hepatitis Hepatitis",
        "response": "After a liver biopsy, you should rest for the remainder of the day. You may experience some pain or soreness at the biopsy site for a few days."
    },
    {
        "dialog": [
            "Hello Medi, I have been feeling some pain in my liver area lately.",
            "I am sorry to hear that. Can you describe the pain?",
            "It's a dull ache and feels like a pressure in my right side.",
            "Based on your description, it is possible that you have an issue with your liver. Have you been tested for hepatitis?",
            "No, I haven't. What is hepatitis?",
            "Hepatitis is an inflammation of the liver. There are several types of hepatitis, including viral hepatitis caused by a virus and non-viral hepatitis.",
            "Wow, I didn't know that. How do people get hepatitis?",
            "Hepatitis can be contracted through contact with contaminated blood or bodily fluids, through unprotected sex, or through sharing needles. It can also be caused by excessive alcohol consumption or liver damage from medication.",
            "Is it treatable?"
        ],
        "knowledge": "Hepatitis Hepatitis  Currently in the United States, approximately 3.5 million adults are estimated to be infected. Hepatitis C is particularly prevalent among people born between 1945 and 1965, a group of about 800,000 people, with prevalence as high as 3.2% versus 1.6% in the general U.S. population Hepatitis Hepatitis",
        "response": "Yes, hepatitis can be treated depending on the type and severity of the infection. It is important to get tested and diagnosed as soon as possible to prevent further complications."
    },
    {
        "dialog": [
            "Hi Medi, I was recently diagnosed with hepatitis. What should I do next?",
            "I'm sorry to hear that. Depending on the type of hepatitis you have, there are different treatment options. Have you been told which type you have?",
            "Yes, I have hepatitis C.",
            "Treatment for hepatitis C often involves antiviral medications that can help clear the virus from your body. It is important to follow your doctor's instructions regarding treatment and any lifestyle changes you need to make.",
            "What lifestyle changes do I need to make?",
            "It is important to avoid alcohol and any substances that can put stress on your liver. You should also maintain a healthy diet and engage in regular physical activity.",
            "How long does treatment usually last?",
            "Treatment can last anywhere from several weeks to several months depending on the type and severity of the infection. It is important to follow your doctor's instructions and attend regular check-ups to monitor your progress.",
            "Thank you for the information."
        ],
        "knowledge": "Hepatitis Hepatitis  Currently in the United States, approximately 3.5 million adults are estimated to be infected. Hepatitis C is particularly prevalent among people born between 1945 and 1965, a group of about 800,000 people, with prevalence as high as 3.2% versus 1.6% in the general U.S. population Hepatitis Hepatitis",
        "response": "You're welcome. It is important to stay on top of your treatment and follow any recommendations from your doctor to ensure the best possible outcome for your health."
    },
    {
        "dialog": [
            "Hi Medi, I recently had a liver transplant due to complications from hepatitis. What can I do to ensure a healthy recovery?",
            "Congratulations on your successful transplant. It is important to follow your doctor's instructions regarding post-operative care and any medication you may need to take.",
            "What kind of medication will I need to take?",
            "You will need to take immunosuppressant medication to prevent your body from rejecting the new liver. It is important to take this medication exactly as prescribed and attend regular check-ups with your doctor.",
            "What lifestyle changes should I make?",
            "It is important to avoid any activities or substances that can put stress on your liver, such as alcohol and certain medications. You should also eat a healthy diet and engage in regular physical activity as recommended by your doctor.",
            "How long will my recovery take?",
            "Recovery times can vary depending on the individual and the extent of the surgery. It is important to follow your doctor's instructions and attend all follow-up appointments to monitor your progress.",
            "Thank you for the advice, Medi."
        ],
        "knowledge": "Hepatitis Hepatitis  Currently in the United States, approximately 3.5 million adults are estimated to be infected. Hepatitis C is particularly prevalent among people born between 1945 and 1965, a group of about 800,000 people, with prevalence as high as 3.2% versus 1.6% in the general U.S. population Hepatitis Hepatitis",
        "response": "You're welcome. It is important to prioritize your health and follow your doctor's instructions to ensure a successful recovery from your liver transplant."
    },
    {
        "dialog": [
            "Hi Medi, I feel really sick and I don't know what's wrong",
            "Hi there, can you tell me what symptoms you have?",
            "I have been feeling very tired and nauseous lately",
            "Okay, have you been experiencing any other symptoms?",
            "I've also had some stomach pain and my skin is really yellow",
            "Based on your symptoms, it's possible that you have Hepatitis C",
            "What is Hepatitis C and how is it treated?",
            "Hepatitis C is a viral infection that causes liver inflammation, it can be treated with antiviral medications",
            "Do I need to be hospitalized for treatment or can I take the medication at home?"
        ],
        "knowledge": "Hepatitis Hepatitis  Currently in the United States, approximately 3. 5 million adults are estimated to be infected.  Hepatitis C is particularly prevalent among people born between 1945 and 1965, a group of about 800,000 people, with prevalence as high as 3. 2% versus 1. 6% in the general U. S.  population Hepatitis Hepatitis",
        "response": "You can take the medication at home, but it's best to consult with a doctor to determine the best course of treatment"
    },
    {
        "dialog": [
            "Hi Medi, I have been diagnosed with Hepatitis C",
            "I'm sorry to hear that, how are you feeling right now?",
            "I'm feeling really worried and scared about what's going to happen",
            "Don't worry, we'll get through this together. Do you have any questions about the condition?",
            "Yes, what caused me to get Hepatitis C? I've always been careful with my health",
            "Hepatitis C is usually caused by contact with infected blood, such as through sharing needles or receiving a blood transfusion before 1992",
            "I see, what can I do to manage the symptoms?",
            "It's important to get plenty of rest, eat a healthy diet, and avoid alcohol and certain medications that can damage the liver",
            "How long does it take to recover from Hepatitis C?"
        ],
        "knowledge": "Hepatitis Hepatitis  Currently in the United States, approximately 3. 5 million adults are estimated to be infected.  Hepatitis C is particularly prevalent among people born between 1945 and 1965, a group of about 800,000 people, with prevalence as high as 3. 2% versus 1. 6% in the general U. S.  population Hepatitis Hepatitis",
        "response": "The recovery time varies for each individual, but with proper treatment, it's possible to completely recover from Hepatitis C"
    },
    {
        "dialog": [
            "Hi Medi, I recently had a liver transplant due to Hepatitis C",
            "I hope you're feeling better now. How can I help you today?",
            "I wanted to know if there are any lifestyle changes I should make to ensure my new liver stays healthy",
            "Yes, it's important to maintain a healthy diet, exercise regularly, and avoid alcohol and tobacco use",
            "Are there any specific foods I should avoid?",
            "You should avoid foods that are high in fat, sodium, and sugar, as well as processed foods and alcohol",
            "I see, how often should I follow up with my doctor?",
            "You should follow up with your doctor regularly to monitor your liver function and ensure that your transplant is successful",
            "Thank you, Medi. You have been very helpful"
        ],
        "knowledge": "Hepatitis Hepatitis  Currently in the United States, approximately 3. 5 million adults are estimated to be infected.  Hepatitis C is particularly prevalent among people born between 1945 and 1965, a group of about 800,000 people, with prevalence as high as 3. 2% versus 1. 6% in the general U. S.  population Hepatitis Hepatitis",
        "response": "You're welcome! Please remember to follow your doctor's advice and take good care of yourself"
    }
]