[
    {
        "dialog": [
            "Hello Medi, I'm not feeling well and I think I have a fever.",
            "I see, do you have any other symptoms?",
            "Yes, I have a headache and my body feels achy.",
            "Okay, based on your symptoms, you might have a viral infection.",
            "Oh no, what should I do?",
            "You should rest and drink plenty of fluids. You can also take over-the-counter medication for the headache and fever.",
            "Okay, thank you for your advice. How long will it take for me to feel better?",
            "You should start feeling better within a few days. If your symptoms persist or get worse, please see a doctor.",
            "Okay, I'll make sure to monitor my condition. Thank you."
        ],
        "knowledge": "Viral Infection Viral Infection  The symptoms of a viral infection can include fever, headache, body aches, and fatigue.  Other symptoms may include nausea, vomiting, diarrhea, and a cough.  Treatment for a viral infection usually involves rest and staying hydrated.  Over-the-counter medication can also be taken to relieve symptoms such as fever and headache.  It is important to monitor your condition and see a doctor if your symptoms persist or get worse. Viral Infection Viral Infection",
        "response": "Rest and drink plenty of fluids. You can also take over-the-counter medication for the headache and fever."
    },
    {
        "dialog": [
            "Hi Medi, I'm worried that I might have meningitis. Can you help me?",
            "Sure, what are your symptoms?",
            "I have a severe headache, a stiff neck, and a high fever. I also feel nauseous and have trouble with lights.",
            "Based on your symptoms, it is possible that you have meningitis. You should go to the hospital immediately for a diagnosis and treatment.",
            "What kind of treatment can I expect?",
            "The treatment for meningitis involves antibiotics if the cause is bacterial. If it is viral, then supportive care is given to manage the symptoms.",
            "Is there anything else I should know?",
            "Meningitis can be very serious and can lead to complications such as brain damage, hearing loss, and even death. It is important to seek medical attention as soon as possible.",
            "Okay, I will go to the hospital right away. Thank you for your help."
        ],
        "knowledge": "Meningitis Meningitis  Meningitis is an inflammation of the membranes that surround the brain and spinal cord. Symptoms of meningitis can include fever, headache, nausea, vomiting, sensitivity to light, and a stiff neck. Meningitis can be caused by bacteria, viruses, or other factors. Treatment for meningitis involves antibiotics if the cause is bacterial. If it is viral, then supportive care is given to manage the symptoms. Meningitis can be very serious and can lead to complications such as brain damage, hearing loss, and even death. It is important to seek medical attention as soon as possible. Meningitis Meningitis",
        "response": "You should go to the hospital immediately for a diagnosis and treatment."
    },
    {
        "dialog": [
            "Hi Medi, I recently had a lumbar puncture and I'm wondering what I should do now.",
            "After a lumbar puncture, it is important to rest for 24 hours and avoid any strenuous activity.",
            "Is there anything else I should be aware of?",
            "You may experience some pain or discomfort at the site of the puncture, but this should go away within a few days. You should also drink plenty of fluids to help prevent a headache.",
            "Are there any foods I should eat or avoid?",
            "It is recommended that you eat a healthy and balanced diet with plenty of fruits, vegetables, and whole grains. You should also avoid caffeine and alcohol for the first 24 hours after the procedure.",
            "Okay, thank you for your advice. What about physical activity?",
            "You should avoid any strenuous activity or heavy lifting for the first 24 hours. After that, you can gradually resume your normal activities.",
            "Great, thank you for your help."
        ],
        "knowledge": "Lumbar Puncture Lumbar Puncture  After a lumbar puncture, it is important to rest for 24 hours and avoid any strenuous activity. You may experience some pain or discomfort at the site of the puncture, but this should go away within a few days. You should also drink plenty of fluids to help prevent a headache. It is recommended that you eat a healthy and balanced diet with plenty of fruits, vegetables, and whole grains. You should also avoid caffeine and alcohol for the first 24 hours after the procedure. You should avoid any strenuous activity or heavy lifting for the first 24 hours. After that, you can gradually resume your normal activities. Lumbar Puncture Lumbar Puncture",
        "response": "After a lumbar puncture, it is important to rest for 24 hours and avoid any strenuous activity."
    },
    {
        "dialog": [
            "Hello Medi, I don't feel good and I have some symptoms.",
            "Hello! Can you tell me about your symptoms so that I can help you?",
            "I have a headache and a stiff neck, and I feel dizzy.",
            "These symptoms could indicate meningitis. You should seek medical attention immediately.",
            "What is meningitis?",
            "Meningitis is an inflammation of the membranes that surround the brain and spinal cord.",
            "How is meningitis diagnosed?",
            "Microbiological culture of the sample is more sensitive, but results can take up to 48 hours to become available.",
            "Thank you for your advice, Medi."
        ],
        "knowledge": "Meningitis Meningitis  Microbiological culture of the sample is more sensitive but results can take up to 48 hours to become available. The type of white blood cell predominantly present indicates whether meningitis is bacterial or viral, although at the beginning of the disease, this is not always a reliable indicator. Less commonly, eosinophils predominate, suggesting parasitic or fungal etiology, among others. The concentration of glucose in CSF is normally above 40% of that in blood. In bacterial meningitis, it is typically lower; the CSF glucose level is therefore divided by the blood glucose. A ratio ≤0.4 is indicative of bacterial meningitis; in the newborn, glucose levels in CSF are normally higher, and a ratio below 0 Meningitis Meningitis",
        "response": "You're welcome. Please seek medical attention immediately as these symptoms could indicate meningitis."
    },
    {
        "dialog": [
            "Hello Medi, I have a question about meningitis.",
            "Sure! How can I help you?",
            "What are the symptoms of meningitis?",
            "The symptoms of meningitis include a headache, fever, and a stiff neck. Other symptoms can include nausea, vomiting, sensitivity to light, confusion, and seizures. Infants may have different symptoms, such as appearing lethargic, being irritable, or refusing to eat.",
            "How is meningitis treated?",
            "Meningitis is typically treated with antibiotics. Treatment may also include hospitalization and supportive care, such as pain relief and intravenous fluids. In some cases, the infection may be viral and resolve on its own.",
            "Is meningitis contagious?",
            "Meningitis can be contagious but it depends on the type. Bacterial meningitis is more likely to be contagious than viral meningitis.",
            "Thank you for your explanation, Medi."
        ],
        "knowledge": "Meningitis Meningitis  Microbiological culture of the sample is more sensitive but results can take up to 48 hours to become available. The type of white blood cell predominantly present indicates whether meningitis is bacterial or viral, although at the beginning of the disease, this is not always a reliable indicator. Less commonly, eosinophils predominate, suggesting parasitic or fungal etiology, among others. The concentration of glucose in CSF is normally above 40% of that in blood. In bacterial meningitis, it is typically lower; the CSF glucose level is therefore divided by the blood glucose. A ratio ≤0.4 is indicative of bacterial meningitis; in the newborn, glucose levels in CSF are normally higher, and a ratio below 0 Meningitis Meningitis",
        "response": "You're welcome. Let me know if you have any other questions about meningitis."
    },
    {
        "dialog": [
            "Hello Medi, I just got diagnosed with meningitis. What should I do now?",
            "I'm sorry to hear that. You should follow your doctor's advice and take the medication prescribed to you.",
            "What kind of medication will I take and how long will it take?",
            "You'll be prescribed antibiotics to treat the bacterial infection. The length of treatment depends on the severity of the infection and can range from 7 to 21 days.",
            "What should I do to take care of myself at home?",
            "You should rest as much as possible and drink plenty of fluids to avoid dehydration. You should also avoid close contact with others until you're no longer contagious.",
            "What kind of complications can meningitis cause?",
            "Complications of meningitis can include brain damage, hearing loss, and learning disabilities. In severe cases, it can be fatal.",
            "Thank you for your advice, Medi."
        ],
        "knowledge": "Meningitis Meningitis  Microbiological culture of the sample is more sensitive but results can take up to 48 hours to become available. The type of white blood cell predominantly present indicates whether meningitis is bacterial or viral, although at the beginning of the disease, this is not always a reliable indicator. Less commonly, eosinophils predominate, suggesting parasitic or fungal etiology, among others. The concentration of glucose in CSF is normally above 40% of that in blood. In bacterial meningitis, it is typically lower; the CSF glucose level is therefore divided by the blood glucose. A ratio ≤0.4 is indicative of bacterial meningitis; in the newborn, glucose levels in CSF are normally higher, and a ratio below 0 Meningitis Meningitis",
        "response": "You're welcome. Let me know if you have any other questions or concerns about meningitis."
    },
    {
        "dialog": [
            "Hi Medi, I'm not feeling well, I have a terrible headache and fever.",
            "Sorry to hear that. How long have you been experiencing these symptoms?",
            "It started last night and it's still there.",
            "Okay, you might have meningitis. I suggest you go to the hospital and do a microbiological culture test immediately.",
            "Is there any other option to treat it?",
            "There are medications to help relieve the symptoms but getting medical attention as soon as possible is the best way to prevent the condition from getting worse.",
            "Thank you for your advice, Medi.",
            "You're welcome. Take care of yourself and feel better soon!",
            "How can I prevent meningitis in the future?"
        ],
        "knowledge": "Meningitis Meningitis  Microbiological culture of the sample is more sensitive  but results can take up to 48 hours to become available.  The type of white blood cell predominantly present  indicates whether meningitis is bacterial  or viral , although at the beginning of the disease this is not always a reliable indicator.  Less commonly, eosinophils predominate, suggesting parasitic or fungal etiology, among others. The concentration of glucose in CSF is normally above 40% of that in blood.  In bacterial meningitis it is typically lower; the CSF glucose level is therefore divided by the blood glucose .  A ratio ≤0. 4 is indicative of bacterial meningitis; in the newborn, glucose levels in CSF are normally higher, and a ratio below 0 Meningitis Meningitis",
        "response": "Meningitis can be prevented by maintaining good hygiene, avoiding close contact with people who are sick, and getting vaccinated if necessary."
    },
    {
        "dialog": [
            "Hi Medi, I have a question about meningitis.",
            "Sure, what would you like to know?",
            "What are the symptoms of meningitis?",
            "The symptoms of meningitis can include fever, headache, stiff neck, nausea, vomiting, sensitivity to light, confusion, and seizures.",
            "Is it contagious?",
            "Yes, meningitis can be contagious. It can be spread through close contact with an infected person's saliva or mucus.",
            "Is there any way to prevent it?",
            "Yes, maintaining good hygiene, avoiding close contact with people who are sick, and getting vaccinated if necessary can help prevent meningitis.",
            "Thank you for your explanation, Medi."
        ],
        "knowledge": "Meningitis Meningitis  Microbiological culture of the sample is more sensitive  but results can take up to 48 hours to become available.  The type of white blood cell predominantly present  indicates whether meningitis is bacterial  or viral , although at the beginning of the disease this is not always a reliable indicator.  Less commonly, eosinophils predominate, suggesting parasitic or fungal etiology, among others. The concentration of glucose in CSF is normally above 40% of that in blood.  In bacterial meningitis it is typically lower; the CSF glucose level is therefore divided by the blood glucose .  A ratio ≤0. 4 is indicative of bacterial meningitis; in the newborn, glucose levels in CSF are normally higher, and a ratio below 0 Meningitis Meningitis",
        "response": "The treatment for meningitis depends on the cause of the infection, but it may include antibiotics, antiviral medications, or corticosteroids."
    },
    {
        "dialog": [
            "Hi Medi, I recently had meningitis. What lifestyle changes should I make to prevent it from happening again?",
            "Sorry to hear that. Some lifestyle changes that may help prevent meningitis include maintaining good hygiene, getting enough rest, staying hydrated, and avoiding contact with people who are sick.",
            "Are there any foods that I should avoid or eat more of?",
            "There are no specific foods that can prevent meningitis, but a healthy and balanced diet can help strengthen your immune system and reduce your risk of getting sick.",
            "What about physical exercise?",
            "Regular physical exercise can also help strengthen your immune system and improve your overall health. Just be sure to talk to your doctor before starting any new exercise regimen.",
            "Thank you for your advice, Medi.",
            "You're welcome. Remember to take good care of yourself and follow your doctor's recommendations.",
            "Can I still get meningitis even if I make these lifestyle changes?"
        ],
        "knowledge": "Meningitis Meningitis  Microbiological culture of the sample is more sensitive  but results can take up to 48 hours to become available.  The type of white blood cell predominantly present  indicates whether meningitis is bacterial  or viral , although at the beginning of the disease this is not always a reliable indicator.  Less commonly, eosinophils predominate, suggesting parasitic or fungal etiology, among others. The concentration of glucose in CSF is normally above 40% of that in blood.  In bacterial meningitis it is typically lower; the CSF glucose level is therefore divided by the blood glucose .  A ratio ≤0. 4 is indicative of bacterial meningitis; in the newborn, glucose levels in CSF are normally higher, and a ratio below 0 Meningitis Meningitis",
        "response": "Although making these lifestyle changes can reduce your risk of getting meningitis, it is still possible to get the infection. It's important to seek medical attention as soon as possible if you experience any symptoms of meningitis."
    },
    {
        "dialog": [
            "Hi Medi, I think I have meningitis, what should I do?",
            "Let's assess your symptoms. What are your symptoms?",
            "I have a severe headache, stiff neck, and fever",
            "It is possible that you have meningitis. You should see a doctor immediately",
            "What are the types of meningitis?",
            "There are bacterial, viral, and fungal meningitis",
            "How can we determine which type of meningitis I have?",
            "The type of white blood cell that is present in your cerebrospinal fluid can determine which type of meningitis you have",
            "Okay, thank you Medi"
        ],
        "knowledge": "Meningitis Meningitis  Microbiological culture of the sample is more sensitive  but results can take up to 48 hours to become available.  The type of white blood cell predominantly present  indicates whether meningitis is bacterial  or viral , although at the beginning of the disease this is not always a reliable indicator.  Less commonly, eosinophils predominate, suggesting parasitic or fungal etiology, among others. The concentration of glucose in CSF is normally above 40% of that in blood.  In bacterial meningitis it is typically lower; the CSF glucose level is therefore divided by the blood glucose .  A ratio ≤0. 4 is indicative of bacterial meningitis; in the newborn, glucose levels in CSF are normally higher, and a ratio below 0 Meningitis Meningitis",
        "response": "You're welcome. Remember to seek medical attention immediately"
    },
    {
        "dialog": [
            "Hey Medi, I underwent a spinal tap procedure. What should I do now?",
            "After a spinal tap, you should get plenty of rest and drink lots of fluids",
            "What kind of fluids should I drink?",
            "You should drink plenty of water and juices to stay hydrated",
            "What about aftercare? Are there any specific things I should do?",
            "You should avoid strenuous physical activities for at least a day after the procedure",
            "Okay, thanks Medi",
            "You're welcome. Be sure to follow your doctor's instructions for any specific aftercare advice"
        ],
        "knowledge": "Meningitis Meningitis  Microbiological culture of the sample is more sensitive  but results can take up to 48 hours to become available.  The type of white blood cell predominantly present  indicates whether meningitis is bacterial  or viral , although at the beginning of the disease this is not always a reliable indicator.  Less commonly, eosinophils predominate, suggesting parasitic or fungal etiology, among others. The concentration of glucose in CSF is normally above 40% of that in blood.  In bacterial meningitis it is typically lower; the CSF glucose level is therefore divided by the blood glucose .  A ratio ≤0. 4 is indicative of bacterial meningitis; in the newborn, glucose levels in CSF are normally higher, and a ratio below 0 Meningitis Meningitis",
        "response": "You're welcome. Take care of yourself"
    },
    {
        "dialog": [
            "Hi Medi, I have a question about meningitis",
            "Sure, what would you like to know?",
            "What is the difference between bacterial and viral meningitis?",
            "Bacterial meningitis is usually more severe and can be life-threatening, while viral meningitis is often less severe and resolves on its own",
            "Can meningitis be prevented?",
            "Vaccines are available for some types of meningitis, such as bacterial meningitis. Maintaining good hygiene, especially hand hygiene, can also help prevent the spread of meningitis",
            "Thank you, Medi. That's really helpful",
            "You're welcome. Don't hesitate to ask if you have any more questions!"
        ],
        "knowledge": "Meningitis Meningitis  Microbiological culture of the sample is more sensitive  but results can take up to 48 hours to become available.  The type of white blood cell predominantly present  indicates whether meningitis is bacterial  or viral , although at the beginning of the disease this is not always a reliable indicator.  Less commonly, eosinophils predominate, suggesting parasitic or fungal etiology, among others. The concentration of glucose in CSF is normally above 40% of that in blood.  In bacterial meningitis it is typically lower; the CSF glucose level is therefore divided by the blood glucose .  A ratio ≤0. 4 is indicative of bacterial meningitis; in the newborn, glucose levels in CSF are normally higher, and a ratio below 0 Meningitis Meningitis",
        "response": "You're welcome. Take care of yourself"
    },
    {
        "dialog": [
            "Hi Medi, I'm experiencing some symptoms, can you help me?",
            "Of course! Please describe the symptoms you are experiencing.",
            "I have a bad headache, a stiff neck, and a fever.",
            "Those symptoms could indicate meningitis. Have you sought medical attention?",
            "No not yet. Is there anything I can do in the meantime?",
            "I would recommend seeking medical attention immediately.",
            "Okay, thank you for your help, Medi.",
            "You're welcome. Take care."
        ],
        "knowledge": "Meningitis Meningitis  Microbiological culture of the sample is more sensitive  but results can take up to 48 hours to become available.  The type of white blood cell predominantly present  indicates whether meningitis is bacterial  or viral , although at the beginning of the disease this is not always a reliable indicator.  Less commonly, eosinophils predominate, suggesting parasitic or fungal etiology, among others. The concentration of glucose in CSF is normally above 40% of that in blood.  In bacterial meningitis it is typically lower; the CSF glucose level is therefore divided by the blood glucose .  A ratio ≤0. 4 is indicative of bacterial meningitis; in the newborn, glucose levels in CSF are normally higher, and a ratio below 0 Meningitis Meningitis",
        "response": "You should seek medical attention immediately as your symptoms could indicate meningitis."
    },
    {
        "dialog": [
            "Hello Medi, I have some questions about meningitis.",
            "Sure, I'll do my best to answer your questions.",
            "What are some common symptoms of meningitis?",
            "Common symptoms include fever, headache, a stiff neck, and a sensitivity to light.",
            "What causes meningitis?",
            "Meningitis can be caused by a bacterial or viral infection.",
            "How is meningitis diagnosed?",
            "Meningitis can be diagnosed through a spinal tap to test for the presence of bacteria or viruses in the fluid surrounding the brain and spinal cord.",
            "Thank you, Medi. That was very helpful."
        ],
        "knowledge": "Meningitis Meningitis  Microbiological culture of the sample is more sensitive  but results can take up to 48 hours to become available.  The type of white blood cell predominantly present  indicates whether meningitis is bacterial  or viral , although at the beginning of the disease this is not always a reliable indicator.  Less commonly, eosinophils predominate, suggesting parasitic or fungal etiology, among others. The concentration of glucose in CSF is normally above 40% of that in blood.  In bacterial meningitis it is typically lower; the CSF glucose level is therefore divided by the blood glucose .  A ratio ≤0. 4 is indicative of bacterial meningitis; in the newborn, glucose levels in CSF are normally higher, and a ratio below 0 Meningitis Meningitis",
        "response": "I'm glad I could help. Take care."
    },
    {
        "dialog": [
            "Hi Medi, I've recently had meningitis. Do you have any advice for my recovery?",
            "Yes, I'm happy to help. It's important to rest and avoid strenuous activity.",
            "What should I eat to help with my recovery?",
            "It's important to eat a healthy, balanced diet with plenty of fruits and vegetables.",
            "Are there any foods I should avoid?",
            "You should avoid sugary and processed foods as they can weaken your immune system.",
            "What about physical therapy?",
            "Physical therapy can help with muscle weakness and stiffness caused by meningitis.",
            "Thank you, Medi. That was very helpful."
        ],
        "knowledge": "Meningitis Meningitis  Microbiological culture of the sample is more sensitive  but results can take up to 48 hours to become available.  The type of white blood cell predominantly present  indicates whether meningitis is bacterial  or viral , although at the beginning of the disease this is not always a reliable indicator.  Less commonly, eosinophils predominate, suggesting parasitic or fungal etiology, among others. The concentration of glucose in CSF is normally above 40% of that in blood.  In bacterial meningitis it is typically lower; the CSF glucose level is therefore divided by the blood glucose .  A ratio ≤0. 4 is indicative of bacterial meningitis; in the newborn, glucose levels in CSF are normally higher, and a ratio below 0 Meningitis Meningitis",
        "response": "I'm glad I could help. Take care."
    },
    {
        "dialog": [
            "Hello Medi, I have a headache and I don't feel well.",
            "Hi, sorry to hear that. Can you tell me more about your symptoms?",
            "Yes, I feel dizzy, nauseous, and my neck is stiff.",
            "Based on your symptoms, it's possible that you have meningitis. You should see a doctor immediately.",
            "Oh, no. What is meningitis? Is it serious?",
            "Meningitis is an inflammation of the protective membranes that surround the brain and spinal cord. It can be serious and even life-threatening.",
            "What causes meningitis?",
            "There are different causes of meningitis such as bacterial, viral, or fungal infections, but a doctor can determine the cause.",
            "What should I do next?"
        ],
        "knowledge": "Meningitis Meningitis  Microbiological culture of the sample is more sensitive  but results can take up to 48 hours to become available.  The type of white blood cell predominantly present  indicates whether meningitis is bacterial  or viral , although at the beginning of the disease this is not always a reliable indicator.  Less commonly, eosinophils predominate, suggesting parasitic or fungal etiology, among others. The concentration of glucose in CSF is normally above 40% of that in blood.  In bacterial meningitis it is typically lower; the CSF glucose level is therefore divided by the blood glucose .  A ratio ≤0. 4 is indicative of bacterial meningitis; in the newborn, glucose levels in CSF are normally higher, and a ratio below 0 Meningitis Meningitis",
        "response": "You should go see a doctor immediately and tell them about your symptoms."
    },
    {
        "dialog": [
            "Hi Medi, can you explain what meningitis is?",
            "Certainly, meningitis is an inflammation of the protective membranes that surround the brain and spinal cord.",
            "What are the symptoms of meningitis?",
            "The symptoms can include fever, headache, neck stiffness, nausea, vomiting, and sensitivity to light.",
            "Is meningitis contagious?",
            "Yes, meningitis can be contagious, so it's important to take precautions if you're around someone who has it.",
            "How can meningitis be treated?",
            "Treatment depends on the cause of the meningitis, but it usually involves antibiotics and supportive care.",
            "Can meningitis be prevented?"
        ],
        "knowledge": "Meningitis Meningitis Meningitis can be caused by a bacterial, viral, or fungal infection.  Symptoms include fever, headache, neck stiffness, nausea, vomiting, and sensitivity to light.  Treatment depends on the cause of the meningitis, but it usually involves antibiotics and supportive care.  Meningitis can be contagious, so it's important to take precautions if you're around someone who has it.  There are vaccines available to prevent some types of bacterial meningitis, such as meningococcal meningitis.",
        "response": "Yes, there are vaccines available to prevent some types of bacterial meningitis, such as meningococcal meningitis."
    },
    {
        "dialog": [
            "Hello Medi, I just had a spinal tap for suspected meningitis. What should I do now?",
            "Hi, it's good that you got tested. You should rest and drink plenty of fluids. You may also need to take antibiotics depending on the test results.",
            "Will I need to stay in the hospital?",
            "It depends on the cause and severity of the meningitis, but hospitalization may be necessary for some cases.",
            "Can I do anything to prevent meningitis?",
            "Yes, good hygiene such as washing your hands, covering your mouth when coughing or sneezing, and avoiding close contact with people who are sick can help prevent the spread of meningitis.",
            "Is there anything I should avoid doing?",
            "If you have meningitis, you should avoid close contact with others until your symptoms improve and you are no longer contagious.",
            "Thank you for your help, Medi."
        ],
        "knowledge": "Meningitis Meningitis  Microbiological culture of the sample is more sensitive  but results can take up to 48 hours to become available.  The type of white blood cell predominantly present  indicates whether meningitis is bacterial  or viral , although at the beginning of the disease this is not always a reliable indicator.  Less commonly, eosinophils predominate, suggesting parasitic or fungal etiology, among others. The concentration of glucose in CSF is normally above 40% of that in blood.  In bacterial meningitis it is typically lower; the CSF glucose level is therefore divided by the blood glucose .  A ratio ≤0. 4 is indicative of bacterial meningitis; in the newborn, glucose levels in CSF are normally higher, and a ratio below 0 Meningitis Meningitis",
        "response": "You're welcome. I hope you feel better soon and get the proper treatment for your meningitis."
    },
    {
        "dialog": [
            "Hi Medi, I have a terrible headache and I'm feeling quite sick.",
            "Oh no, I'm sorry to hear that. Can you describe your symptoms in more detail?",
            "I have a fever, chills, a stiff neck, and sensitivity to light.",
            "Based on your symptoms, it could be meningitis. Have you seen a doctor?",
            "No, I haven't seen one yet. What should I do?",
            "You should seek medical attention immediately. Meningitis can be very serious and requires prompt treatment.",
            "Okay, I'll go see a doctor right away. Thanks, Medi.",
            "You're welcome. I hope you feel better soon."
        ],
        "knowledge": "Meningitis Meningitis  Microbiological culture of the sample is more sensitive  but results can take up to 48 hours to become available.  The type of white blood cell predominantly present  indicates whether meningitis is bacterial  or viral , although at the beginning of the disease this is not always a reliable indicator.  Less commonly, eosinophils predominate, suggesting parasitic or fungal etiology, among others. The concentration of glucose in CSF is normally above 40% of that in blood.  In bacterial meningitis it is typically lower; the CSF glucose level is therefore divided by the blood glucose .  A ratio ≤0. 4 is indicative of bacterial meningitis; in the newborn, glucose levels in CSF are normally higher, and a ratio below 0 Meningitis Meningitis",
        "response": "You're welcome. It's important to seek medical attention immediately in cases like this. "
    },
    {
        "dialog": [
            "Hi Medi, I have a question about meningitis.",
            "Sure, I'm here to help. What would you like to know?",
            "What are the symptoms of meningitis?",
            "The symptoms of meningitis can vary depending on the cause, but some common symptoms include fever, headache, nausea, vomiting, sensitivity to light, and a stiff neck. Rash and confusion may also occur. ",
            "How is meningitis diagnosed?",
            "Meningitis is diagnosed by collecting a sample of cerebrospinal fluid through a lumbar puncture. The fluid is then tested in a laboratory to determine the cause of the meningitis.",
            "What is the treatment for meningitis?",
            "The treatment for meningitis depends on the cause. Bacterial meningitis is treated with antibiotics, while viral meningitis is treated with supportive care like rest, fluids, and pain relief.",
            "Thanks for the information, Medi. It's good to know what to look out for."
        ],
        "knowledge": "Meningitis Meningitis  Microbiological culture of the sample is more sensitive  but results can take up to 48 hours to become available.  The type of white blood cell predominantly present  indicates whether meningitis is bacterial  or viral , although at the beginning of the disease this is not always a reliable indicator.  Less commonly, eosinophils predominate, suggesting parasitic or fungal etiology, among others. The concentration of glucose in CSF is normally above 40% of that in blood.  In bacterial meningitis it is typically lower; the CSF glucose level is therefore divided by the blood glucose .  A ratio ≤0. 4 is indicative of bacterial meningitis; in the newborn, glucose levels in CSF are normally higher, and a ratio below 0 Meningitis Meningitis",
        "response": "You're welcome, it's always good to be informed and aware of the symptoms and treatments for different diseases."
    },
    {
        "dialog": [
            "Hi Medi, I recently had meningitis and I'm wondering what I can do to help with my recovery.",
            "I'm sorry to hear that you've been through that. Some lifestyle changes may help in your recovery, such as getting plenty of rest and staying hydrated.",
            "Are there any specific foods or supplements that can help?",
            "There's no specific diet or supplement that has been proven to help with meningitis recovery. However, a healthy and balanced diet can help support your immune system and overall health.",
            "What about physical activity and exercise?",
            "Physical activity and exercise can also be beneficial, but you should consult with your doctor first to make sure you are ready for it. They may recommend starting with light exercises and gradually increasing the intensity.",
            "Thanks for the information, Medi. I'll make sure to take care of myself and follow my doctor's advice.",
            "You're welcome. It's important to take care of yourself during your recovery. If you have any further questions, feel free to ask."
        ],
        "knowledge": "Meningitis Meningitis  Microbiological culture of the sample is more sensitive  but results can take up to 48 hours to become available.  The type of white blood cell predominantly present  indicates whether meningitis is bacterial  or viral , although at the beginning of the disease this is not always a reliable indicator.  Less commonly, eosinophils predominate, suggesting parasitic or fungal etiology, among others. The concentration of glucose in CSF is normally above 40% of that in blood.  In bacterial meningitis it is typically lower; the CSF glucose level is therefore divided by the blood glucose .  A ratio ≤0. 4 is indicative of bacterial meningitis; in the newborn, glucose levels in CSF are normally higher, and a ratio below 0 Meningitis Meningitis",
        "response": "You're welcome. It's important to take care of yourself during your recovery and follow your doctor's advice. "
    },
    {
        "dialog": [
            "Hi Medi, I'm not feeling well. I have a headache and a high fever.",
            "I'm sorry to hear that. Let me ask you some questions to help identify the problem.",
            "Okay.",
            "Have you experienced any other symptoms?",
            "I've been feeling very tired and nauseous.",
            "I see. Based on your symptoms, it's possible that you have bacterial meningitis.",
            "What should I do?",
            "You should go to the hospital immediately for a proper diagnosis and treatment.",
            "Okay, thank you."
        ],
        "knowledge": "Meningitis Meningitis  Microbiological culture of the sample is more sensitive  but results can take up to 48 hours to become available.  The type of white blood cell predominantly present  indicates whether meningitis is bacterial  or viral , although at the beginning of the disease this is not always a reliable indicator.  Less commonly, eosinophils predominate, suggesting parasitic or fungal etiology, among others. The concentration of glucose in CSF is normally above 40% of that in blood.  In bacterial meningitis it is typically lower; the CSF glucose level is therefore divided by the blood glucose .  A ratio ≤0. 4 is indicative of bacterial meningitis; in the newborn, glucose levels in CSF are normally higher, and a ratio below 0 Meningitis Meningitis",
        "response": "It's possible that you have bacterial meningitis. You should go to the hospital immediately for a proper diagnosis and treatment."
    },
    {
        "dialog": [
            "Hi Medi, can you explain what bacterial meningitis is?",
            "Sure. Bacterial meningitis is an inflammation of the membranes that surround the brain and spinal cord.",
            "What causes it?",
            "It's caused by bacteria that infect the fluid surrounding the brain and spinal cord.",
            "What are the symptoms?",
            "The symptoms include fever, headache, stiff neck, and a rash. In severe cases, it can cause seizures and even lead to death.",
            "Is it treatable?",
            "Yes, it's treatable with antibiotics, but it's important to get treatment as soon as possible.",
            "Thank you for the information."
        ],
        "knowledge": "Meningitis Meningitis  Microbiological culture of the sample is more sensitive  but results can take up to 48 hours to become available.  The type of white blood cell predominantly present  indicates whether meningitis is bacterial  or viral , although at the beginning of the disease this is not always a reliable indicator.  Less commonly, eosinophils predominate, suggesting parasitic or fungal etiology, among others. The concentration of glucose in CSF is normally above 40% of that in blood.  In bacterial meningitis it is typically lower; the CSF glucose level is therefore divided by the blood glucose .  A ratio ≤0. 4 is indicative of bacterial meningitis; in the newborn, glucose levels in CSF are normally higher, and a ratio below 0 Meningitis Meningitis",
        "response": "Bacterial meningitis is an inflammation of the membranes that surround the brain and spinal cord. It's caused by bacteria that infect the fluid surrounding the brain and spinal cord. The symptoms include fever, headache, stiff neck, and a rash. In severe cases, it can cause seizures and even lead to death. It's treatable with antibiotics, but it's important to get treatment as soon as possible."
    },
    {
        "dialog": [
            "Hi Medi, I recently had a spinal tap to test for meningitis. What should I expect in terms of recovery?",
            "After a spinal tap, it's common to experience a headache for a few days.",
            "Is there anything I can do to alleviate the pain?",
            "Yes, you can rest and drink plenty of fluids. Over-the-counter pain medication like acetaminophen or ibuprofen can also help.",
            "Are there any other symptoms I should watch out for?",
            "If you develop a fever or experience any signs of infection, such as redness, swelling or discharge at the puncture site, or if you experience severe pain or headaches, you should contact your doctor immediately.",
            "Okay, thank you for the information.",
            "You're welcome. I hope you feel better soon."
        ],
        "knowledge": "Meningitis Meningitis  Microbiological culture of the sample is more sensitive  but results can take up to 48 hours to become available.  The type of white blood cell predominantly present  indicates whether meningitis is bacterial  or viral , although at the beginning of the disease this is not always a reliable indicator.  Less commonly, eosinophils predominate, suggesting parasitic or fungal etiology, among others. The concentration of glucose in CSF is normally above 40% of that in blood.  In bacterial meningitis it is typically lower; the CSF glucose level is therefore divided by the blood glucose .  A ratio ≤0. 4 is indicative of bacterial meningitis; in the newborn, glucose levels in CSF are normally higher, and a ratio below 0 Meningitis Meningitis",
        "response": "After a spinal tap, it's common to experience a headache for a few days. You can rest and drink plenty of fluids, and over-the-counter pain medication like acetaminophen or ibuprofen can also help. If you develop a fever or experience any signs of infection, such as redness, swelling or discharge at the puncture site, or if you experience severe pain or headaches, you should contact your doctor immediately."
    },
    {
        "dialog": [
            "Hi Medi, I don't feel well. I have a headache and my neck is stiff",
            "Hello there. You might have meningitis. Can you describe your symptoms more?",
            "I also have a fever and I am sensitive to light",
            "Based on your symptoms, you might have bacterial meningitis.",
            "What should I do now?",
            "You should immediately see a doctor and get a microbiological culture of your sample taken",
            "How long does it take to get the culture result?",
            "It can take up to 48 hours to become available.",
            "What is the ratio of CSF glucose level in bacterial meningitis?"
        ],
        "knowledge": "Meningitis Meningitis  Microbiological culture of the sample is more sensitive  but results can take up to 48 hours to become available.  The type of white blood cell predominantly present  indicates whether meningitis is bacterial  or viral , although at the beginning of the disease this is not always a reliable indicator.  Less commonly, eosinophils predominate, suggesting parasitic or fungal etiology, among others. The concentration of glucose in CSF is normally above 40% of that in blood.  In bacterial meningitis it is typically lower; the CSF glucose level is therefore divided by the blood glucose .  A ratio ≤0. 4 is indicative of bacterial meningitis; in the newborn, glucose levels in CSF are normally higher, and a ratio below 0 Meningitis Meningitis",
        "response": "The CSF glucose level of bacterial meningitis is typically lower. It is divided by the blood glucose and a ratio ≤0.4 is indicative of bacterial meningitis."
    },
    {
        "dialog": [
            "Hi Medi, I am curious about meningitis",
            "Hello. I am glad that you are interested in meningitis. What do you want to know?",
            "What are the symptoms of meningitis?",
            "The symptoms of meningitis include a severe headache, fever, neck stiffness, sensitivity to light and confusion.",
            "How does someone get meningitis?",
            "Meningitis is usually caused by a bacterial or viral infection. It can be contracted from someone else who is infected through respiratory or throat secretions.",
            "Is meningitis contagious?",
            "Yes, it can be contagious. You should avoid close contact with anyone who is infected.",
            "What should someone do if they think they have meningitis?"
        ],
        "knowledge": "Meningitis Meningitis  Microbiological culture of the sample is more sensitive  but results can take up to 48 hours to become available.  The type of white blood cell predominantly present  indicates whether meningitis is bacterial  or viral , although at the beginning of the disease this is not always a reliable indicator.  Less commonly, eosinophils predominate, suggesting parasitic or fungal etiology, among others. The concentration of glucose in CSF is normally above 40% of that in blood.  In bacterial meningitis it is typically lower; the CSF glucose level is therefore divided by the blood glucose .  A ratio ≤0. 4 is indicative of bacterial meningitis; in the newborn, glucose levels in CSF are normally higher, and a ratio below 0 Meningitis Meningitis",
        "response": "Someone who thinks they have meningitis should immediately see a doctor for proper diagnosis and treatment."
    },
    {
        "dialog": [
            "Hi Medi, I just had a lumbar puncture for meningitis. What should I do next?",
            "Hello. After a lumbar puncture, you should rest for a few hours and avoid excessive physical activity for the next few days.",
            "Is there anything I should avoid eating or drinking?",
            "You should avoid drinking alcohol, caffeine, and smoking for the next few days.",
            "What kind of diet should I have?",
            "You should eat healthy and balanced meals that include fruits, vegetables, and lean proteins. Avoid excessive sugar and processed foods.",
            "Should I avoid physical activity?",
            "You should avoid high-intensity physical activity for a few days, but light exercise such as walking is recommended.",
            "Thank you for your help. I have one more question. What causes bacterial meningitis?"
        ],
        "knowledge": "Meningitis Meningitis  Microbiological culture of the sample is more sensitive  but results can take up to 48 hours to become available.  The type of white blood cell predominantly present  indicates whether meningitis is bacterial  or viral , although at the beginning of the disease this is not always a reliable indicator.  Less commonly, eosinophils predominate, suggesting parasitic or fungal etiology, among others. The concentration of glucose in CSF is normally above 40% of that in blood.  In bacterial meningitis it is typically lower; the CSF glucose level is therefore divided by the blood glucose .  A ratio ≤0. 4 is indicative of bacterial meningitis; in the newborn, glucose levels in CSF are normally higher, and a ratio below 0 Meningitis Meningitis",
        "response": "Bacterial meningitis is caused by a bacterial infection. The bacteria can be spread through respiratory or throat secretions."
    },
    {
        "dialog": [
            "Hello Medi, I have a terrible headache and my nose is running.",
            "I'm sorry to hear that. Can you tell me more about your symptoms?",
            "I feel very weak and have a fever. My neck is also stiff.",
            "Based on your symptoms, it is possible that you have meningitis.",
            "What is meningitis?",
            "Meningitis is an inflammation of the protective membranes around the brain and spinal cord.",
            "How is meningitis diagnosed?",
            "A microbiological culture of the sample is more sensitive, but results can take up to 48 hours to become available.",
            "What other symptoms should I look out for?"
        ],
        "knowledge": "Meningitis Meningitis  Microbiological culture of the sample is more sensitive but results can take up to 48 hours to become available. The type of white blood cell predominantly present indicates whether meningitis is bacterial or viral, although at the beginning of the disease this is not always a reliable indicator. Less commonly, eosinophils predominate, suggesting parasitic or fungal etiology, among others. The concentration of glucose in CSF is normally above 40% of that in blood. In bacterial meningitis it is typically lower; the CSF glucose level is therefore divided by the blood glucose. A ratio ≤0.4 is indicative of bacterial meningitis; in the newborn, glucose levels in CSF are normally higher, and a ratio below 0 Meningitis Meningitis",
        "response": "Symptoms of meningitis include fever, headaches, stiff neck, and sensitivity to light. It is important to seek medical attention immediately."
    },
    {
        "dialog": [
            "Hello Medi, I was recently diagnosed with meningitis. What should I do now?",
            "I'm sorry to hear that. It's important to rest and take any medications prescribed by your doctor.",
            "Can I still go to work or school?",
            "No, it's important to stay home and avoid contact with others to prevent the spread of the disease.",
            "How long will it take for me to recover?",
            "The recovery time can vary, but it usually takes several weeks to fully recover.",
            "What should I do to prevent getting meningitis again?",
            "It's important to practice good hygiene, such as washing your hands regularly and avoiding close contact with people who are sick.",
            "Can I still do physical activities?"
        ],
        "knowledge": "Meningitis Meningitis  Microbiological culture of the sample is more sensitive but results can take up to 48 hours to become available. The type of white blood cell predominantly present indicates whether meningitis is bacterial or viral, although at the beginning of the disease this is not always a reliable indicator. Less commonly, eosinophils predominate, suggesting parasitic or fungal etiology, among others. The concentration of glucose in CSF is normally above 40% of that in blood. In bacterial meningitis it is typically lower; the CSF glucose level is therefore divided by the blood glucose. A ratio ≤0.4 is indicative of bacterial meningitis; in the newborn, glucose levels in CSF are normally higher, and a ratio below 0 Meningitis Meningitis",
        "response": "It's important to rest and take medications prescribed by your doctor. Avoid close contact with others and practice good hygiene to prevent getting meningitis again. It's also important to avoid physical activities until your doctor gives you the okay."
    },
    {
        "dialog": [
            "Hello Medi, I recently had a spinal tap to check for meningitis. What should I do next?",
            "It's important to rest and avoid physical activities for at least a day after the procedure.",
            "Can I eat and drink normally?",
            "Yes, you can eat and drink normally, but it's important to drink plenty of water to stay hydrated.",
            "Are there any side effects of the procedure?",
            "Some people may experience headache or back pain after the procedure.",
            "How can I relieve the pain?",
            "You can take over-the-counter pain medications or apply a warm compress to the affected area.",
            "When should I contact my doctor?"
        ],
        "knowledge": "Meningitis Meningitis  Microbiological culture of the sample is more sensitive but results can take up to 48 hours to become available. The type of white blood cell predominantly present indicates whether meningitis is bacterial or viral, although at the beginning of the disease this is not always a reliable indicator. Less commonly, eosinophils predominate, suggesting parasitic or fungal etiology, among others. The concentration of glucose in CSF is normally above 40% of that in blood. In bacterial meningitis it is typically lower; the CSF glucose level is therefore divided by the blood glucose. A ratio ≤0.4 is indicative of bacterial meningitis; in the newborn, glucose levels in CSF are normally higher, and a ratio below 0 Meningitis Meningitis",
        "response": "It's important to rest and avoid physical activities for at least a day after the procedure. You can take pain medications or apply a warm compress to relieve any pain. If you experience severe or worsening symptoms, contact your doctor immediately."
    }
]