[
    {
        "dialog": [
            "Hello Medi, I feel chest pain.",
            "Hi, can you describe your chest pain in more detail?",
            "It's like a pressure or squeezing sensation, and it's lasted for a few minutes.",
            "Based on your symptoms, you may be experiencing pericarditis or myocarditis.",
            "What are those?",
            "Pericarditis is inflammation of the sac-like membrane that surrounds your heart. Myocarditis is inflammation of the heart muscle. Both can cause chest pain and complications affecting the cardiovascular system.",
            "What should I do?",
            "You should seek medical attention immediately.",
            "Okay, I will. Thank you."
        ],
        "knowledge": "Influenza Influenza Complications affecting the cardiovascular system are rare and include pericarditis, fulminant myocarditis with a fast, slow, or irregular heartbeat, and exacerbation of pre-existing cardiovascular disease. Inflammation or swelling of muscles accompanied by muscle tissue breaking down occurs rarely, usually in children, which presents as extreme tenderness and muscle pain in the legs and a reluctance to walk for 2–3 days. Influenza can affect pregnancy, including causing smaller neonatal size, increased risk of premature birth, and an increased risk of child death shortly before or after birth. Neurological complications have been associated with influenza on rare occasions, including aseptic meningitis, encephalitis, disseminated encephalomyelitis, transverse myelitis, and Guillain–Barré syndrome. Additionally, febrile seizures and Reye syndrome can occur, most commonly in children. Influenza-associated encephalopathy can occur directly from central nervous system infection from the presence of the virus in blood and presents as sudden onset of fever with convulsions, followed by rapid progression to coma. An atypical form of encephalitis called encephalitis lethargica, characterized by headache, drowsiness, and coma, may rarely occur sometime after infection Influenza Influenza",
        "response": "You should seek medical attention immediately."
    },
    {
        "dialog": [
            "Hi Medi, can you tell me more about the complications of influenza?",
            "Sure, what would you like to know?",
            "What are the neurological complications of influenza?",
            "On rare occasions, influenza can cause aseptic meningitis, encephalitis, disseminated encephalomyelitis, transverse myelitis, and Guillain–Barré syndrome.",
            "What about febrile seizures and Reye syndrome?",
            "Yes, those can also occur, especially in children.",
            "What is influenza-associated encephalopathy?",
            "It is a rare complication that occurs directly from central nervous system infection from the presence of the virus in blood. It presents as sudden onset of fever with convulsions, followed by rapid progression to coma.",
            "Wow, that's scary. Thanks for the information."
        ],
        "knowledge": "Influenza Influenza The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion. These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose. Coughing is the most common symptom. Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children. The standard influenza symptoms typically last for 2-8 days. A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "You're welcome. Do you have any other questions?"
    },
    {
        "dialog": [
            "Hello Medi, I just underwent a medical procedure. What should I do next?",
            "Hi, it's important to follow your doctor's instructions for post-procedure care. What was the procedure?",
            "I had surgery for my heart.",
            "After heart surgery, it's important to follow a healthy lifestyle with a balanced diet and regular physical activity to reduce the risk of complications and improve your overall health. You should also avoid smoking and excessive alcohol consumption.",
            "What kind of physical activity should I do?",
            "Your doctor will provide specific recommendations based on your individual needs and condition. Generally, light to moderate exercise is recommended, such as walking, cycling, or swimming.",
            "What should I eat?",
            "You should focus on a diet that is rich in fruits, vegetables, lean protein, and whole grains. Avoid processed foods and excessive sugar and salt intake.",
            "Thank you for the advice, Medi."
        ],
        "knowledge": "Influenza Influenza Complications affecting the cardiovascular system are rare and include pericarditis, fulminant myocarditis with a fast, slow, or irregular heartbeat, and exacerbation of pre-existing cardiovascular disease. Inflammation or swelling of muscles accompanied by muscle tissue breaking down occurs rarely, usually in children, which presents as extreme tenderness and muscle pain in the legs and a reluctance to walk for 2–3 days. Influenza can affect pregnancy, including causing smaller neonatal size, increased risk of premature birth, and an increased risk of child death shortly before or after birth. Neurological complications have been associated with influenza on rare occasions, including aseptic meningitis, encephalitis, disseminated encephalomyelitis, transverse myelitis, and Guillain–Barré syndrome. Additionally, febrile seizures and Reye syndrome can occur, most commonly in children. Influenza-associated encephalopathy can occur directly from central nervous system infection from the presence of the virus in blood and presents as sudden onset of fever with convulsions, followed by rapid progression to coma. An atypical form of encephalitis called encephalitis lethargica, characterized by headache, drowsiness, and coma, may rarely occur sometime after infection Influenza Influenza",
        "response": "You're welcome. Take care of yourself and follow your doctor's instructions for post-procedure care."
    },
    {
        "dialog": [
            "Hi Medi, I have a racing heartbeat and chest pain. What could it be?",
            "It could be a complication affecting the cardiovascular system. Please provide more details.",
            "I feel short of breath and dizzy too.",
            "It's better to see a doctor immediately. It could be serious.",
            "What do you think the cause could be?",
            "It could be pericarditis, myocarditis, or an exacerbation of pre-existing cardiovascular disease.",
            "Can I do anything to alleviate the symptoms?",
            "Please rest and avoid physical activity. Seek medical attention as soon as possible.",
            "Thank you for your advice, Medi."
        ],
        "knowledge": "Influenza Influenza Complications affecting the cardiovascular system are rare and include pericarditis, fulminant myocarditis with a fast, slow, or irregular heartbeat, and exacerbation of pre-existing cardiovascular disease.",
        "response": "Please see a doctor immediately. It could be serious."
    },
    {
        "dialog": [
            "Hi Medi, I have a question about influenza.",
            "Of course! Please ask away.",
            "Can influenza affect pregnancy?",
            "Yes, it can cause smaller neonatal size, an increased risk of premature birth, and an increased risk of child death shortly before or after birth.",
            "What about neurological complications?",
            "Neurological complications have been associated with influenza on rare occasions, including aseptic meningitis, encephalitis, disseminated encephalomyelitis, transverse myelitis, and Guillain–Barré syndrome.",
            "Is it common in children?",
            "Febrile seizures and Reye syndrome can occur, most commonly in children.",
            "Thank you for the information, Medi."
        ],
        "knowledge": "Influenza Influenza Influenza can affect pregnancy, including causing smaller neonatal size, increased risk of premature birth, and an increased risk of child death shortly before or after birth.  Neurological complications have been associated with influenza on rare occasions, including aseptic meningitis, encephalitis, disseminated encephalomyelitis, transverse myelitis, and Guillain–Barré syndrome.  Additionally, febrile seizures and Reye syndrome can occur, most commonly in children.",
        "response": "You're welcome. If you have any more questions, don't hesitate to ask."
    },
    {
        "dialog": [
            "Hi Medi, I recently had a medical procedure. What should I do now?",
            "That's great. Did your doctor give you any advice?",
            "Yes, my doctor told me to take it easy for a while. What kind of physical activity is safe?",
            "It depends on the type of procedure. You should consult your doctor to get a better idea.",
            "What about my diet?",
            "If your procedure involves the digestive system, you should eat light foods that are easy to digest. Again, consult your doctor for more specifics.",
            "What about my lifestyle?",
            "It's important to avoid stress, get enough sleep, and take any medications as prescribed.",
            "Thank you, Medi. That's very helpful."
        ],
        "knowledge": "Influenza Influenza Influenza-associated encephalopathy can occur directly from central nervous system infection from the presence of the virus in blood and presents as sudden onset of fever with convulsions, followed by rapid progression to coma.  An atypical form of encephalitis called encephalitis lethargica, characterized by headache, drowsiness, and coma, may rarely occur sometime after infection.",
        "response": "You're welcome. Remember to follow your doctor's advice and take it easy for a while."
    },
    {
        "dialog": [
            "Hi Medi, I have a sore throat and a fever.",
            "I am sorry to hear that. Can you tell me more about your symptoms?",
            "I have a headache, runny nose, and a dry cough.",
            "Based on your symptoms, it seems like you have Influenza.",
            "What should I do now?",
            "You can take plenty of fluids and rest. If it gets worse, you can see a doctor.",
            "Is there any complication related to Influenza?",
            "Yes, it can cause complications affecting the cardiovascular system, but they are rare.",
            "Alright, thanks for your help, Medi."
        ],
        "knowledge": "Influenza Influenza  Complications affecting the cardiovascular system are rare and include pericarditis, fulminant myocarditis with a fast, slow, or irregular heartbeat, and exacerbation of pre-existing cardiovascular disease.  Inflammation or swelling of muscles accompanied by muscle tissue breaking down occurs rarely, usually in children, which presents as extreme tenderness and muscle pain in the legs and a reluctance to walk for 2–3 days. Influenza can affect pregnancy, including causing smaller neonatal size, increased risk of premature birth, and an increased risk of child death shortly before or after birth.  Neurological complications have been associated with influenza on rare occasions, including aseptic meningitis, encephalitis, disseminated encephalomyelitis, transverse myelitis, and Guillain–Barré syndrome.  Additionally, febrile seizures and Reye syndrome can occur, most commonly in children.  Influenza-associated encephalopathy can occur directly from central nervous system infection from the presence of the virus in blood and presents as sudden onset of fever with convulsions, followed by rapid progression to coma.  An atypical form of encephalitis called encephalitis lethargica, characterized by headache, drowsiness, and coma, may rarely occur sometime after infection Influenza Influenza",
        "response": "Yes, rare complications affecting the cardiovascular system, inflammation of muscles, and neurological problems can occur."
    },
    {
        "dialog": [
            "Hello Medi, I would like to know more about Influenza.",
            "Sure, I can help you with that. What would you like to know?",
            "What is Influenza?",
            "Influenza is a respiratory illness caused by the influenza virus.",
            "How is it spread?",
            "It is spread through the air when an infected person coughs or sneezes.",
            "What are the symptoms?",
            "Symptoms include fever, cough, sore throat, runny or stuffy nose, body aches, headache, chills, and fatigue.",
            "Can Influenza affect pregnancy?"
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "Influenza is a respiratory illness caused by the influenza virus and is spread through the air. Symptoms include fever, cough, sore throat, runny or stuffy nose, and body aches."
    },
    {
        "dialog": [
            "Hi Medi, I just had a flu shot. What should I do now?",
            "It is recommended that you rest and take plenty of fluids.",
            "Can I exercise?",
            "It is better to avoid strenuous exercise for a few days.",
            "What about my diet?",
            "A balanced diet with plenty of vitamins and vegetables can help your immune system.",
            "Is there any complications I should be aware of?",
            "Complications affecting the cardiovascular system are rare",
            "Thank you for your advice, Medi."
        ],
        "knowledge": "Influenza Influenza  Complications affecting the cardiovascular system are rare and include pericarditis, fulminant myocarditis with a fast, slow, or irregular heartbeat, and exacerbation of pre-existing cardiovascular disease.  Inflammation or swelling of muscles accompanied by muscle tissue breaking down occurs rarely, usually in children, which presents as extreme tenderness and muscle pain in the legs and a reluctance to walk for 2–3 days. Influenza can affect pregnancy, including causing smaller neonatal size, increased risk of premature birth, and an increased risk of child death shortly before or after birth.  Neurological complications have been associated with influenza on rare occasions, including aseptic meningitis, encephalitis, disseminated encephalomyelitis, transverse myelitis, and Guillain–Barré syndrome.  Additionally, febrile seizures and Reye syndrome can occur, most commonly in children.  Influenza-associated encephalopathy can occur directly from central nervous system infection from the presence of the virus in blood and presents as sudden onset of fever with convulsions, followed by rapid progression to coma.  An atypical form of encephalitis called encephalitis lethargica, characterized by headache, drowsiness, and coma, may rarely occur sometime after infection Influenza Influenza",
        "response": "Complications affecting the cardiovascular system are rare, but it is better to avoid strenuous exercise for a few days after the flu shot."
    },
    {
        "dialog": [
            "Hello Medi, I am having a fast and irregular heartbeat",
            "You may have pericarditis or fulminant myocarditis. Please seek medical attention immediately",
            "What is pericarditis or fulminant myocarditis?",
            "Pericarditis is inflammation of the pericardium, the sac that surrounds the heart. Fulminant myocarditis is a severe form of myocarditis, which is inflammation of the heart muscle, and can cause rapid heart failure. ",
            "What causes these conditions?",
            "Pericarditis can be caused by a viral or bacterial infection, injury, autoimmune disorder or cancer. The cause of fulminant myocarditis is often unknown but it can be triggered by a viral infection or autoimmune disorder.",
            "What are the treatments available for these conditions?",
            "Treatment depends on the cause of the condition and may include medication, supportive care to prevent complications and in severe cases, surgery.",
            "Thanks for your help Medi. I will go to see a doctor now."
        ],
        "knowledge": "Influenza Influenza  Complications affecting the cardiovascular system are rare and include pericarditis, fulminant myocarditis with a fast, slow, or irregular heartbeat, and exacerbation of pre-existing cardiovascular disease.  Inflammation or swelling of muscles accompanied by muscle tissue breaking down occurs rarely, usually in children, which presents as extreme tenderness and muscle pain in the legs and a reluctance to walk for 2–3 days. Influenza can affect pregnancy, including causing smaller neonatal size, increased risk of premature birth, and an increased risk of child death shortly before or after birth.  Neurological complications have been associated with influenza on rare occasions, including aseptic meningitis, encephalitis, disseminated encephalomyelitis, transverse myelitis, and Guillain–Barré syndrome.  Additionally, febrile seizures and Reye syndrome can occur, most commonly in children.  Influenza-associated encephalopathy can occur directly from central nervous system infection from the presence of the virus in blood and presents as suddent onset of fever with convulsions, followed by rapid progression to coma.  An atypical form of encephalitis called encephalitis lethargica, characterized by headache, drowsiness, and coma, may rarely occur sometime after infection Influenza Influenza",
        "response": "You're welcome, I hope you feel better soon. Don't hesitate to seek medical attention immediately if your condition worsens."
    },
    {
        "dialog": [
            "Hi Medi, I have a question about influenza",
            "Sure, I am here to help.",
            "Does influenza affect pregnancy?",
            "Yes, influenza can affect pregnancy by causing smaller neonatal size, increased risk of premature birth, and an increased risk of child death shortly before or after birth.",
            "What are some of the rare neurological complications associated with influenza?",
            "Rare neurological complications include aseptic meningitis, encephalitis, disseminated encephalomyelitis, transverse myelitis, and Guillain–Barré syndrome.",
            "What is the difference between febrile seizures and Reye syndrome?",
            "Febrile seizures are seizures that occur in children with high fever while Reye syndrome is a rare but serious condition that affects mainly children and teenagers and can cause brain damage and liver failure.",
            "Thanks for the explanation, Medi. Can influenza-associated encephalopathy occur in adults?"
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "You're welcome. Don't hesitate to ask me if you have any more questions about influenza."
    },
    {
        "dialog": [
            "Hi Medi, I have just undergone a medical procedure and want advice on my diet and exercise",
            "Sure, I am here to help.",
            "What type of medical procedure did you undergo?",
            "I had a laparoscopic surgery to remove my gallbladder due to gallstones.",
            "You should reduce your fat intake and increase your fiber intake",
            "Why should I reduce my fat intake?",
            "Since your gallbladder has been removed, your body may have difficulty digesting fat. Eating too much fat can cause symptoms such as diarrhea and bloating.",
            "How much fiber should I consume?",
            "You should aim for at least 25 grams of fiber per day. Fiber can help regulate bowel movements and prevent constipation."
        ],
        "knowledge": "Influenza Influenza  Complications affecting the cardiovascular system are rare and include pericarditis, fulminant myocarditis with a fast, slow, or irregular heartbeat, and exacerbation of pre-existing cardiovascular disease.  Inflammation or swelling of muscles accompanied by muscle tissue breaking down occurs rarely, usually in children, which presents as extreme tenderness and muscle pain in the legs and a reluctance to walk for 2–3 days. Influenza can affect pregnancy, including causing smaller neonatal size, increased risk of premature birth, and an increased risk of child death shortly before or after birth.  Neurological complications have been associated with influenza on rare occasions, including aseptic meningitis, encephalitis, disseminated encephalomyelitis, transverse myelitis, and Guillain–Barré syndrome.  Additionally, febrile seizures and Reye syndrome can occur, most commonly in children.  Influenza-associated encephalopathy can occur directly from central nervous system infection from the presence of the virus in blood and presents as suddent onset of fever with convulsions, followed by rapid progression to coma.  An atypical form of encephalitis called encephalitis lethargica, characterized by headache, drowsiness, and coma, may rarely occur sometime after infection Influenza Influenza",
        "response": "You're welcome. I hope this advice helps you recover quickly after your surgery."
    },
    {
        "dialog": [
            "Hello Medi, I am experiencing pain in my chest",
            "Hi there, chest pain can be a serious symptom, do you feel any other symptoms?",
            "Yes, I feel short of breath and my heart is racing",
            "Based on your symptoms, you may be experiencing a cardiovascular problem, I recommend visiting a doctor immediately",
            "I am scared, what kind of problems can it be?",
            "Complications affecting the cardiovascular system are rare and include pericarditis, fulminant myocarditis with a fast, slow, or irregular heartbeat, and exacerbation of pre-existing cardiovascular disease",
            "I see. What can I do to prevent these complications in the future?",
            "It's important to maintain a healthy lifestyle and regularly visit a doctor for check-ups",
            "Thank you, Medi, you have been very helpful"
        ],
        "knowledge": "Influenza Influenza  Complications affecting the cardiovascular system are rare and include pericarditis, fulminant myocarditis with a fast, slow, or irregular heartbeat, and exacerbation of pre-existing cardiovascular disease.  Inflammation or swelling of muscles accompanied by muscle tissue breaking down occurs rarely, usually in children, which presents as extreme tenderness and muscle pain in the legs and a reluctance to walk for 2–3 days. Influenza can affect pregnancy, including causing smaller neonatal size, increased risk of premature birth, and an increased risk of child death shortly before or after birth.  Neurological complications have been associated with influenza on rare occasions, including aseptic meningitis, encephalitis, disseminated encephalomyelitis, transverse myelitis, and Guillain–Barré syndrome.  Additionally, febrile seizures and Reye syndrome can occur, most commonly in children.  Influenza-associated encephalopathy can occur directly from central nervous system infection from the presence of the virus in blood and presents as suddent onset of fever with convulsions, followed by rapid progression to coma.  An atypical form of encephalitis called encephalitis lethargica, characterized by headache, drowsiness, and coma, may rarely occur sometime after infection Influenza Influenza",
        "response": "You're welcome. Remember that taking care of your health is important to prevent future complications"
    },
    {
        "dialog": [
            "Hi Medi, I just found out that one of my coworkers tested positive for the flu",
            "Hello, Influenza can be highly contagious, have you had any symptoms?",
            "No, not yet, but I'm worried about getting sick, what can I do to protect myself?",
            "There are a few things you can do. First, make sure to wash your hands frequently and avoid contact with sick individuals. Additionally, getting the flu vaccine can also help protect you from the virus",
            "Thank you for the advice, Medi. I will make sure to take these precautions",
            "Remember that prevention is key, especially during flu season",
            "I will, thanks again, Medi"
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "You're welcome. Stay safe and take care of yourself"
    },
    {
        "dialog": [
            "Hi Medi, I just had a medical procedure done and I'm looking for some advice",
            "Hello, what kind of procedure did you have?",
            "I just had surgery and I'm wondering how I can take care of myself while I recover",
            "It's important to rest and take it easy for a while, and make sure to follow your doctor's instructions for care and medication",
            "What about my diet and exercise?",
            "You should focus on eating healthy foods that are easy to digest and avoid any strenuous activities for a while",
            "How long should I rest?",
            "The amount of rest required depends on the type of surgery you had, so be sure to consult with your doctor",
            "Okay, thank you for the advice, Medi"
        ],
        "knowledge": "Influenza Influenza  Complications affecting the cardiovascular system are rare and include pericarditis, fulminant myocarditis with a fast, slow, or irregular heartbeat, and exacerbation of pre-existing cardiovascular disease.  Inflammation or swelling of muscles accompanied by muscle tissue breaking down occurs rarely, usually in children, which presents as extreme tenderness and muscle pain in the legs and a reluctance to walk for 2–3 days. Influenza can affect pregnancy, including causing smaller neonatal size, increased risk of premature birth, and an increased risk of child death shortly before or after birth.  Neurological complications have been associated with influenza on rare occasions, including aseptic meningitis, encephalitis, disseminated encephalomyelitis, transverse myelitis, and Guillain–Barré syndrome.  Additionally, febrile seizures and Reye syndrome can occur, most commonly in children.  Influenza-associated encephalopathy can occur directly from central nervous system infection from the presence of the virus in blood and presents as suddent onset of fever with convulsions, followed by rapid progression to coma.  An atypical form of encephalitis called encephalitis lethargica, characterized by headache, drowsiness, and coma, may rarely occur sometime after infection Influenza Influenza",
        "response": "You're welcome. Remember to take it easy and follow your doctor's instructions for a successful recovery"
    }
]