[
    {
        "dialog": [
            "Hello Medi, I feel uncomfortable and have a headache.",
            "Hi, I can help. What other symptoms do you have?",
            "I feel tired and a little bit dizzy.",
            "Okay, based on your symptoms, you may have a mild case of encephalitis.",
            "What is encephalitis?",
            "Encephalitis is an inflammation of the brain tissue caused by a viral infection.",
            "What should I do now?",
            "You should see a doctor if your symptoms worsen, or if you develop a fever, seizures, or a rash.",
            "Thank you for your advice."
        ],
        "knowledge": "Encephalitis Encephalitis 4 cases per 100,000 people per year. In tropical countries, the incidence is 6.34 per 100,000 people per year. The number of cases of encephalitis has not changed much over time, with about 250,000 cases a year from 2005 to 2015 in the US. Approximately seven per 100,000 people were hospitalized for encephalitis in the US during this time. In 2015, encephalitis was estimated to have affected 4.3 million people and resulted in 150,000 deaths worldwide Encephalitis Encephalitis",
        "response": "Encephalitis is an inflammation of the brain tissue caused by a viral infection."
    },
    {
        "dialog": [
            "Hi Medi, can you tell me about the symptoms of encephalitis?",
            "Of course. Encephalitis symptoms include fever, headache, fatigue, confusion, seizures, and hallucinations.",
            "Is it a common condition?",
            "No, it's a relatively rare condition, with only 4 cases per 100,000 people per year.",
            "What are the causes of encephalitis?",
            "Encephalitis is usually caused by a viral infection, such as herpes simplex virus or West Nile virus.",
            "Is there a treatment for encephalitis?",
            "Yes, treatment involves antiviral medication and supportive care to manage symptoms.",
            "Thank you for the information."
        ],
        "knowledge": "Encephalitis Encephalitis 4 cases per 100,000 people per year. In tropical countries, the incidence is 6.34 per 100,000 people per year. The number of cases of encephalitis has not changed much over time, with about 250,000 cases a year from 2005 to 2015 in the US. Approximately seven per 100,000 people were hospitalized for encephalitis in the US during this time. In 2015, encephalitis was estimated to have affected 4.3 million people and resulted in 150,000 deaths worldwide Encephalitis Encephalitis",
        "response": "Encephalitis symptoms include fever, headache, fatigue, confusion, seizures, and hallucinations."
    },
    {
        "dialog": [
            "Hi Medi, I recently had encephalitis. What can I do to recover?",
            "Hi, it's important to rest as much as possible and take any medication prescribed by your doctor.",
            "Can I do anything else to help my recovery?",
            "Yes, you should eat a balanced diet, drink plenty of fluids, and avoid alcohol and caffeine.",
            "What about exercise?",
            "You should avoid strenuous exercise, but gentle exercise such as walking or yoga can be helpful.",
            "Are there any long-term effects of encephalitis?",
            "In some cases, encephalitis can cause long-term neurological problems such as memory loss or difficulty with coordination.",
            "Thank you for your advice."
        ],
        "knowledge": "Encephalitis Encephalitis 4 cases per 100,000 people per year. In tropical countries, the incidence is 6.34 per 100,000 people per year. The number of cases of encephalitis has not changed much over time, with about 250,000 cases a year from 2005 to 2015 in the US. Approximately seven per 100,000 people were hospitalized for encephalitis in the US during this time. In 2015, encephalitis was estimated to have affected 4.3 million people and resulted in 150,000 deaths worldwide Encephalitis Encephalitis",
        "response": "Resting, taking medication, eating a balanced diet, and avoiding alcohol and caffeine can help with encephalitis recovery."
    },
    {
        "dialog": [
            "Hi Medi, I'm feeling very sick.",
            "Hello, I am here to help you. Can you please tell me your symptoms?",
            "I have a headache, high fever and vomiting.",
            "Based on your symptoms, it seems like you might have encephalitis.",
            "What is encephalitis?",
            "It is the inflammation of the brain, caused by a viral infection.",
            "What should I do?",
            "You should rest and take the prescribed medication by the doctor. It is essential to keep yourself hydrated.",
            "Thanks, what are the chances of recovery?"
        ],
        "knowledge": "Encephalitis Encephalitis 4 cases per 100,000 people per year.  In tropical countries, the incidence is 6. 34 per 100,000 people per year.  The number of cases of encephalitis has not changed much over time, with about 250,000 cases a year from 2005 to 2015 in the US.  Approximately seven per 100,000 people were hospitalized for encephalitis in the US during this time.  In 2015, encephalitis was estimated to have affected 4. 3 million people and resulted in 150,000 deaths worldwide Encephalitis Encephalitis",
        "response": "It depends on the severity of the disease and the cause of inflammation. A doctor can give you a better idea of your chances of recovery."
    },
    {
        "dialog": [
            "Hi Medi, can you tell me more about encephalitis?",
            "Of course, encephalitis is the inflammation of the brain caused by a viral infection.",
            "Is it contagious?",
            "Yes, it can be contagious. It spreads from one person to another through contact with infected bodily fluids.",
            "What are the symptoms of encephalitis?",
            "The symptoms of encephalitis include fever, headache, confusion, seizures, and sometimes coma.",
            "Can it be prevented?",
            "Yes, some forms of encephalitis can be prevented through vaccination.",
            "Thanks, Is there anything else that I should know?"
        ],
        "knowledge": "Encephalitis Encephalitis 4 cases per 100,000 people per year.  In tropical countries, the incidence is 6. 34 per 100,000 people per year.  The number of cases of encephalitis has not changed much over time, with about 250,000 cases a year from 2005 to 2015 in the US.  Approximately seven per 100,000 people were hospitalized for encephalitis in the US during this time.  In 2015, encephalitis was estimated to have affected 4. 3 million people and resulted in 150,000 deaths worldwide Encephalitis Encephalitis",
        "response": "It is essential to seek medical help if you experience any symptoms of encephalitis as it can be life-threatening."
    },
    {
        "dialog": [
            "Hi Medi, I underwent a medical procedure to treat encephalitis. Can you tell me how to take care of myself?",
            "Hello, it's great to hear that you are taking care of yourself. Can you tell me more about your procedure so that I can give you more specific advice?",
            "I went through a lumbar puncture to diagnose the cause of encephalitis.",
            "It's essential to rest for the next few days. You should avoid any intense physical exercise. Drink plenty of fluids to stay hydrated.",
            "What kind of diet should I follow?",
            "It's essential to eat a healthy and balanced diet. You should include plenty of fruits and vegetables in your diet.",
            "Thanks. Anything else I should keep in mind?",
            "It's essential to monitor your symptoms and call your doctor if any new symptoms appear.",
            "Thanks a lot, Medi."
        ],
        "knowledge": "Encephalitis Encephalitis 4 cases per 100,000 people per year.  In tropical countries, the incidence is 6. 34 per 100,000 people per year.  The number of cases of encephalitis has not changed much over time, with about 250,000 cases a year from 2005 to 2015 in the US.  Approximately seven per 100,000 people were hospitalized for encephalitis in the US during this time.  In 2015, encephalitis was estimated to have affected 4. 3 million people and resulted in 150,000 deaths worldwide Encephalitis Encephalitis",
        "response": "You're welcome. It's essential to take care of yourself after a medical procedure. Follow the doctor's instructions carefully and monitor your symptoms."
    },
    {
        "dialog": [
            "Hello Medi, I am worried about encephalitis. What are the symptoms?",
            "Hi, symptoms of encephalitis include fever, headache, confusion, seizures, and loss of consciousness.",
            "I see. How is it diagnosed?",
            "Doctors usually diagnose encephalitis by doing a physical exam and ordering blood tests and a spinal tap.",
            "What are the treatments available for encephalitis?",
            "Treatment of encephalitis depends on the cause and severity of the illness. It may include antiviral medications, corticosteroids, and supportive care.",
            "Is there any way to prevent encephalitis?",
            "You can reduce your risk of encephalitis by getting vaccinated, avoiding mosquito bites, and practicing good hygiene.",
            "Thank you for your help, Medi. I appreciate it."
        ],
        "knowledge": "Encephalitis Encephalitis 4 cases per 100,000 people per year. In tropical countries, the incidence is 6.34 per 100,000 people per year. The number of cases of encephalitis has not changed much over time, with about 250,000 cases a year from 2005 to 2015 in the US. Approximately seven per 100,000 people were hospitalized for encephalitis in the US during this time. In 2015, encephalitis was estimated to have affected 4.3 million people and resulted in 150,000 deaths worldwide Encephalitis Encephalitis",
        "response": "You're welcome. Is there anything else you would like to know about encephalitis?"
    },
    {
        "dialog": [
            "Hello Medi, I just recovered from encephalitis. What lifestyle changes should I make?",
            "Hi, it's great that you've recovered. It's important to get plenty of rest and follow a healthy diet. Regular exercise can also be beneficial.",
            "What kind of diet should I follow?",
            "You should eat a balanced diet that includes plenty of fruits, vegetables, and whole grains. Avoid foods that are high in sugar and saturated fat.",
            "Is there anything I should avoid?",
            "You should avoid alcohol and drugs that can affect your central nervous system. Also, avoid close contact with sick people who may have infections that can cause encephalitis.",
            "Thank you for your help, Medi. I will follow your advice.",
            "You're welcome. Don't hesitate to contact me if you have any further questions or concerns."
        ],
        "knowledge": "Encephalitis Encephalitis 4 cases per 100,000 people per year. In tropical countries, the incidence is 6.34 per 100,000 people per year. The number of cases of encephalitis has not changed much over time, with about 250,000 cases a year from 2005 to 2015 in the US. Approximately seven per 100,000 people were hospitalized for encephalitis in the US during this time. In 2015, encephalitis was estimated to have affected 4.3 million people and resulted in 150,000 deaths worldwide Encephalitis Encephalitis",
        "response": "Glad to be of help. Let me know if you have any other questions."
    },
    {
        "dialog": [
            "Hello Medi, I am concerned about the incidence of encephalitis. Is it common?",
            "Hi, encephalitis is relatively rare, with 4 cases per 100,000 people per year in the US and 6.34 per 100,000 people per year in tropical countries.",
            "How has the incidence of encephalitis changed over time?",
            "The number of cases of encephalitis has not changed much over time, with about 250,000 cases a year from 2005 to 2015 in the US.",
            "Are there any risk factors for encephalitis?",
            "Factors that can increase your risk of encephalitis include age, weakened immune system, and exposure to mosquitoes and ticks.",
            "Thank you for your help, Medi. That's very informative.",
            "You're welcome. Let me know if you have any other questions or concerns."
        ],
        "knowledge": "Encephalitis Encephalitis 4 cases per 100,000 people per year. In tropical countries, the incidence is 6.34 per 100,000 people per year. The number of cases of encephalitis has not changed much over time, with about 250,000 cases a year from 2005 to 2015 in the US. Approximately seven per 100,000 people were hospitalized for encephalitis in the US during this time. In 2015, encephalitis was estimated to have affected 4.3 million people and resulted in 150,000 deaths worldwide Encephalitis Encephalitis",
        "response": "You're welcome. Feel free to ask me anything else about encephalitis."
    },
    {
        "dialog": [
            "Hello Medi, I'm having a terrible headache",
            "Hi, I am here to help you. Can you tell me more about the headache?",
            "It's a sharp pain in the forehead and temple area",
            "Okay, it seems like a tension headache. Have you been under a lot of stress lately?",
            "Yes, I have been working non-stop for the past few weeks",
            "I understand. You can try some relaxation techniques like deep breathing and yoga to alleviate the pain",
            "Okay, I'll give it a try. Thanks, Medi",
            "You're welcome. Let me know if it persists"
        ],
        "knowledge": "Tension Headache Tension Headache Tension-type headaches are the most common headaches among adults. Tension headaches are usually caused by muscle contractions in the head and neck regions. They may also be caused due to stress, anxiety, poor posture, and lack of sleep. The pain of a tension headache is usually described as a constant band-like pain around the forehead or the back of the head. Tension headaches can be treated with over-the-counter pain medication and relaxation techniques such as deep breathing and yoga. Tension Headache Tension Headache",
        "response": "You have a tension headache. You can try some relaxation techniques like deep breathing and yoga to alleviate the pain."
    },
    {
        "dialog": [
            "Hi Medi, I want to know about encephalitis",
            "Sure, I can help with that. What would you like to know?",
            "What are the symptoms of encephalitis?",
            "The common symptoms of encephalitis include fever, headache, confusion, seizures, and muscle weakness.",
            "Who is at risk for encephalitis?",
            "Anyone can get encephalitis, but children and older adults are at a higher risk.",
            "How is encephalitis treated?",
            "There is no specific treatment for encephalitis, but antiviral medications and corticosteroids may be used to reduce inflammation in the brain.",
            "Thank you, Medi. That's very helpful"
        ],
        "knowledge": "Encephalitis Encephalitis Encephalitis is a rare but serious condition that causes inflammation in the brain. The condition is usually caused by a viral infection, but it may also be caused by a bacterial infection or an autoimmune condition. The common symptoms of encephalitis include fever, headache, confusion, seizures, and muscle weakness. Anyone can get encephalitis, but children and older adults are at a higher risk. There is no specific treatment for encephalitis, but antiviral medications and corticosteroids may be used to reduce inflammation in the brain. Encephalitis Encephalitis",
        "response": "Encephalitis is a rare but serious condition that causes inflammation in the brain. It is usually caused by a viral infection, but it may also be caused by a bacterial infection or an autoimmune condition. The common symptoms of encephalitis include fever, headache, confusion, seizures, and muscle weakness."
    },
    {
        "dialog": [
            "Hi Medi, I just had surgery and I want to know what I can do to recover faster",
            "Hello, congratulations on completing the surgery. What type of surgery did you have?",
            "I had a gallbladder removal surgery",
            "Great. To recover faster, you should rest and avoid any strenuous activities that may put pressure on your incision.",
            "What should I eat to aid my recovery?",
            "You should eat foods that are easy to digest and rich in protein for tissue repair. Some examples are chicken, fish, eggs, and milk.",
            "What about physical therapy?",
            "It's not necessary for gallbladder removal surgery, but you can start light exercises like walking after a few days of rest.",
            "Thank you, Medi. I appreciate your advice"
        ],
        "knowledge": "Gallbladder Removal Surgery Gallbladder Removal Surgery Gallbladder removal surgery is also known as cholecystectomy. It is usually performed to treat gallstones or gallbladder inflammation. To recover faster, you should rest and avoid any strenuous activities that may put pressure on your incision. You should eat foods that are easy to digest and rich in protein for tissue repair. Some examples are chicken, fish, eggs, and milk. Physical therapy is not necessary for gallbladder removal surgery, but you can start light exercises like walking after a few days of rest. Gallbladder Removal Surgery Gallbladder Removal Surgery",
        "response": "To recover faster, you should rest and avoid any strenuous activities that may put pressure on your incision. You should eat foods that are easy to digest and rich in protein for tissue repair. Physical therapy is not necessary for gallbladder removal surgery, but you can start light exercises like walking after a few days of rest."
    },
    {
        "dialog": [
            "Hi Medi, I'm not feeling well, can you help me?",
            "Sure, what's bothering you?",
            "I have a headache and fever",
            "How long have you had these symptoms?",
            "I just started feeling sick this morning",
            "It's likely you have a viral illness, rest and stay hydrated",
            "Do I need to take any medicine?",
            "Not unless your fever gets too high or you start experiencing other symptoms",
            "Okay, thank you. How long should I expect to feel sick? "
        ],
        "knowledge": "Viral Illness Viral Illness Many viral illnesses cause symptoms like headache and fever. Symptoms usually last 1-2 weeks but can last up to several weeks. Treatment includes rest and staying hydrated. Symptoms can usually be managed at home. ",
        "response": "Symptoms usually last 1-2 weeks but can last up to several weeks. Treatment includes rest and staying hydrated. Symptoms can usually be managed at home."
    },
    {
        "dialog": [
            "Hey Medi, I have a question about encephalitis.",
            "Sure, what would you like to know?",
            "How common is encephalitis?",
            "Encephalitis has about 4 cases per 100,000 people per year. In tropical countries, the incidence is 6.34 per 100,000 people per year.",
            "Has the number of cases changed over time?",
            "No, the number of cases has not changed much over time, with about 250,000 cases a year from 2005 to 2015 in the US",
            "Is it a serious disease?",
            "Encephalitis can be serious, leading to hospitalization and even death in severe cases",
            "Wow, that's scary. How many people are hospitalized for encephalitis in the US?"
        ],
        "knowledge": "Encephalitis Encephalitis 4 cases per 100,000 people per year.  In tropical countries, the incidence is 6. 34 per 100,000 people per year.  The number of cases of encephalitis has not changed much over time, with about 250,000 cases a year from 2005 to 2015 in the US.  Approximately seven per 100,000 people were hospitalized for encephalitis in the US during this time.  In 2015, encephalitis was estimated to have affected 4. 3 million people and resulted in 150,000 deaths worldwide Encephalitis Encephalitis",
        "response": "Encephalitis can be serious, leading to hospitalization and even death in severe cases. Approximately seven per 100,000 people were hospitalized for encephalitis in the US during this time"
    },
    {
        "dialog": [
            "Hi Medi, I just had surgery and I'm not sure what to expect in my recovery",
            "What kind of surgery did you have?",
            "I had my appendix removed",
            "Recovery time for appendix removal varies but is typically around 2-4 weeks",
            "What can I do to help my recovery?",
            "Rest and avoid strenuous activity. Drink plenty of fluids and eat a balanced diet to promote healing",
            "Can I return to work soon?",
            "It depends on your job and how you are feeling. You should discuss this with your doctor",
            "Okay, thanks for the information. What kind of physical activity can I do?"
        ],
        "knowledge": "Appendectomy Appendectomy Recovery time for appendix removal varies but is typically around 2-4 weeks. Rest and avoid strenuous activity. Drink plenty of fluids and eat a balanced diet to promote healing. Light walking is encouraged but heavy lifting and other strenuous activity should be avoided for a few weeks. Returning to work depends on your job and how you are feeling. You should discuss returning to work with your doctor",
        "response": "Recovery time for appendix removal varies but is typically around 2-4 weeks. Rest and avoid strenuous activity. Drink plenty of fluids and eat a balanced diet to promote healing. Light walking is encouraged but heavy lifting and other strenuous activity should be avoided for a few weeks. Returning to work depends on your job and how you are feeling. You should discuss returning to work with your doctor"
    },
    {
        "dialog": [
            "Hello Medi, I have a severe headache.",
            "Hi there. Can you describe the pain and its location?",
            "It's a sharp pain in the back of my head and neck.",
            "Based on what you said it seems like tension headaches.",
            "What are tension headaches, Medi?",
            "Tension headaches are the most common type of headache characterized by mild to moderate pain in the head and neck.",
            "What should I do to relieve the pain?",
            "Meditation, yoga, and relaxation techniques can help, or over-the-counter pain relievers.",
            "Thanks, Medi. How long does a tension headache last?"
        ],
        "knowledge": "Tension headaches Tension headaches Tension headaches are the most common type of headache characterized by mild to moderate pain in the head and neck.  They are usually caused by stress or tension. They can last from 30 minutes to several days, and they can be chronic or episodic.  Common treatments for tension headaches include over-the-counter pain relievers, such as aspirin or ibuprofen and relaxation techniques. Tension headaches can be prevented by avoiding triggers such as stress, poor posture, and dehydration.  ",
        "response": "Tension headaches can last from 30 minutes to several days and can be relieved by meditation, yoga, relaxation techniques, or over-the-counter pain relievers."
    },
    {
        "dialog": [
            "Hello Medi. I have a fever and a cough.",
            "Hello. How long have you had a fever and cough?",
            "It started yesterday and it's getting worse today.",
            "Based on your symptoms, it's possible you have the flu, also known as influenza.",
            "What is the flu, Medi?",
            "The flu is a contagious respiratory illness caused by the influenza virus. It is typically characterized by fever, cough, sore throat, body aches, and fatigue.",
            "What should I do now?",
            "Rest, drink plenty of fluids, and take over-the-counter pain relievers. If your symptoms worsen, seek medical attention.",
            "Thank you, Medi. What can I do to prevent the flu?"
        ],
        "knowledge": "Influenza Influenza The flu is a contagious respiratory illness caused by the influenza virus. It is typically characterized by fever, cough, sore throat, body aches, and fatigue. The flu is spread from person to person through respiratory droplets when an infected person talks, coughs, or sneezes. The flu can be prevented by getting a flu vaccine, washing your hands frequently, and avoiding close contact with people who are sick. The flu can be treated with over-the-counter pain relievers, rest, and fluids. If your symptoms worsen, seek medical attention. ",
        "response": "The flu is a contagious respiratory illness caused by the influenza virus and can be prevented by getting a flu vaccine, washing your hands frequently, and avoiding close contact with people who are sick."
    },
    {
        "dialog": [
            "Hello Medi, I just got back from the hospital after having surgery.",
            "Hello, how are you feeling now?",
            "I'm feeling a bit sore and I'm not sure what I can do to speed up my recovery.",
            "It's normal to be sore after surgery. You should take it easy and avoid any strenuous activities.",
            "Is there any recommended diet for me during recovery, Medi?",
            "Foods rich in protein and vitamins can help speed up the recovery process. Avoid foods that are high in sugar and fat.",
            "Thanks for the advice, Medi. Is there anything else I should do?",
            "Avoid smoking and alcohol as they can slow down the recovery process and follow your doctor's advice on medication and check-ups.",
            "Thanks, Medi. How long does recovery usually take?"
        ],
        "knowledge": "Surgery recovery Surgery recovery Recovery from surgery can take anywhere from a few days to a few months, depending on the type of surgery. During this time, it is important to get plenty of rest and avoid any strenuous activities. A healthy diet rich in protein and vitamins can help speed up the recovery process. Avoiding foods that are high in sugar and fat can also help. Smoking and alcohol should be avoided as they can slow down the recovery process. It is important to follow your doctor's advice on medication and check-ups during your recovery.",
        "response": "Recovery from surgery can take anywhere from a few days to a few months depending on the type of surgery. It's important to get plenty of rest, follow a healthy diet, avoid smoking and alcohol and follow your doctor's advice on medication and check-ups."
    },
    {
        "dialog": [
            "Hi Medi, I'm feeling very unwell and have a headache",
            "I'm sorry to hear that. Can you tell me more about your symptoms?",
            "My head hurts so bad, and I feel very dizzy and disoriented",
            "Based on your symptoms, it's possible that you have encephalitis. You should see a doctor immediately",
            "Encephalitis? What is that?",
            "Encephalitis is a serious inflammation of the brain that can cause severe headaches, fever, and confusion.",
            "How is encephalitis treated?",
            "Treatment usually involves antiviral medication and supportive care in a hospital",
            "Thank you, Medi. I'll go see a doctor as soon as possible"
        ],
        "knowledge": "Encephalitis Encephalitis 4 cases per 100,000 people per year.  In tropical countries, the incidence is 6. 34 per 100,000 people per year.  The number of cases of encephalitis has not changed much over time, with about 250,000 cases a year from 2005 to 2015 in the US.  Approximately seven per 100,000 people were hospitalized for encephalitis in the US during this time.  In 2015, encephalitis was estimated to have affected 4. 3 million people and resulted in 150,000 deaths worldwide Encephalitis Encephalitis",
        "response": "Encephalitis is a serious inflammation of the brain that can cause severe headaches, fever, and confusion. Treatment usually involves antiviral medication and supportive care in a hospital."
    },
    {
        "dialog": [
            "Hi Medi, I have a question about encephalitis",
            "Sure, I'd be happy to help. What's your question?",
            "What are the symptoms of encephalitis?",
            "The symptoms of encephalitis can include fever, headache, nausea, vomiting, sensitivity to light, stiff neck, confusion, and seizures.",
            "What causes encephalitis?",
            "Encephalitis can be caused by a variety of infectious agents, including viruses, bacteria, fungi, and parasites.",
            "Is encephalitis contagious?",
            "Some forms of encephalitis, such as herpes simplex encephalitis, are contagious, while others are not.",
            "Thank you for your help, Medi"
        ],
        "knowledge": "Encephalitis Encephalitis 4 cases per 100,000 people per year.  In tropical countries, the incidence is 6. 34 per 100,000 people per year.  The number of cases of encephalitis has not changed much over time, with about 250,000 cases a year from 2005 to 2015 in the US.  Approximately seven per 100,000 people were hospitalized for encephalitis in the US during this time.  In 2015, encephalitis was estimated to have affected 4. 3 million people and resulted in 150,000 deaths worldwide Encephalitis Encephalitis",
        "response": "The symptoms of encephalitis can include fever, headache, nausea, vomiting, sensitivity to light, stiff neck, confusion, and seizures. Encephalitis can be caused by a variety of infectious agents, including viruses, bacteria, fungi, and parasites. Some forms of encephalitis, such as herpes simplex encephalitis, are contagious, while others are not."
    },
    {
        "dialog": [
            "Hi Medi, I recently had treatment for encephalitis. What lifestyle changes should I make?",
            "After treatment, it's important to get plenty of rest and to avoid stress. You should also eat a healthy diet and get regular exercise",
            "What kind of diet should I follow?",
            "You should focus on eating plenty of fruits, vegetables, and whole grains, and limit your intake of processed foods and sugar",
            "How much exercise do I need?",
            "You should aim for at least 30 minutes of moderate exercise, such as walking or cycling, on most days of the week",
            "Can I return to my regular activities?",
            "It's important to check with your doctor before returning to work or other activities to ensure that you have fully recovered",
            "Thank you, Medi. That's very helpful"
        ],
        "knowledge": "Encephalitis Encephalitis 4 cases per 100,000 people per year.  In tropical countries, the incidence is 6. 34 per 100,000 people per year.  The number of cases of encephalitis has not changed much over time, with about 250,000 cases a year from 2005 to 2015 in the US.  Approximately seven per 100,000 people were hospitalized for encephalitis in the US during this time.  In 2015, encephalitis was estimated to have affected 4. 3 million people and resulted in 150,000 deaths worldwide Encephalitis Encephalitis",
        "response": "After treatment, it's important to get plenty of rest and to avoid stress. You should also eat a healthy diet and get regular exercise. You should focus on eating plenty of fruits, vegetables, and whole grains, and limit your intake of processed foods and sugar. You should aim for at least 30 minutes of moderate exercise, such as walking or cycling, on most days of the week. It's important to check with your doctor before returning to work or other activities to ensure that you have fully recovered"
    },
    {
        "dialog": [
            "Hi Medi, I think I have encephalitis. Do you have any idea?",
            "What are your symptoms?",
            "I have a fever, headache, and nausea.",
            "It's better to see a doctor right away.",
            "But what should I do while waiting for medical assistance?",
            "Take a rest and drink plenty of water, and avoid light or noise.",
            "Can encephalitis be cured, Medi?",
            "Yes, it can. However, the treatment depends on the type of encephalitis and your condition.",
            "What should I do to prevent encephalitis?"
        ],
        "knowledge": "Encephalitis Encephalitis 4 cases per 100,000 people per year.  In tropical countries, the incidence is 6. 34 per 100,000 people per year.  The number of cases of encephalitis has not changed much over time, with about 250,000 cases a year from 2005 to 2015 in the US.  Approximately seven per 100,000 people were hospitalized for encephalitis in the US during this time.  In 2015, encephalitis was estimated to have affected 4. 3 million people and resulted in 150,000 deaths worldwide Encephalitis Encephalitis",
        "response": "The best way to prevent encephalitis is to avoid mosquito bites, which are the common cause of viral encephalitis, and to practice good hand hygiene and avoid close contact with sick people."
    },
    {
        "dialog": [
            "Hi Medi, I have some questions about encephalitis.",
            "Okay, what do you want to know?",
            "What are the different types of encephalitis?",
            "There are two types of encephalitis: primary and secondary.",
            "What is the difference between primary and secondary encephalitis?",
            "Primary encephalitis occurs when a virus directly infects the brain and spinal cord, while secondary encephalitis occurs when a virus first infects another part of the body before spreading to the brain and spinal cord.",
            "Is encephalitis contagious, Medi?",
            "Some types of encephalitis are contagious, such as herpes encephalitis, but others are not.",
            "What are the most common causes of encephalitis?"
        ],
        "knowledge": "Encephalitis Encephalitis 4 cases per 100,000 people per year.  In tropical countries, the incidence is 6. 34 per 100,000 people per year.  The number of cases of encephalitis has not changed much over time, with about 250,000 cases a year from 2005 to 2015 in the US.  Approximately seven per 100,000 people were hospitalized for encephalitis in the US during this time.  In 2015, encephalitis was estimated to have affected 4. 3 million people and resulted in 150,000 deaths worldwide Encephalitis Encephalitis",
        "response": "The most common causes of encephalitis are viruses, such as herpes simplex virus, enteroviruses, and West Nile virus, but some cases can also be caused by bacteria, fungi, or parasites."
    },
    {
        "dialog": [
            "Hi Medi, I just got out of the hospital after being treated for encephalitis. What should I do now?",
            "I'm glad to hear you're doing better. Follow your doctor's advice and take it easy for a while.",
            "What about my diet and physical activity?",
            "Your diet should include plenty of fruits and vegetables, whole grains, lean protein, and healthy fats, and limit your intake of processed foods, saturated and trans fats, and added sugars. As for physical activity, start slowly and build up gradually, and avoid activities that could cause head injuries.",
            "Is there anything else I should keep in mind?",
            "Make sure you get enough rest and sleep, and take care of your mental health too. If you experience any new symptoms or concerns, don't hesitate to contact your doctor.",
            "Thank you, Medi. Your advice is very helpful.",
            "You're welcome. I'm always here to help.",
            "Goodbye."
        ],
        "knowledge": "Encephalitis Encephalitis 4 cases per 100,000 people per year.  In tropical countries, the incidence is 6. 34 per 100,000 people per year.  The number of cases of encephalitis has not changed much over time, with about 250,000 cases a year from 2005 to 2015 in the US.  Approximately seven per 100,000 people were hospitalized for encephalitis in the US during this time.  In 2015, encephalitis was estimated to have affected 4. 3 million people and resulted in 150,000 deaths worldwide Encephalitis Encephalitis",
        "response": "Take care of yourself and don't hesitate to contact your doctor if you experience any new symptoms or concerns. Good luck!"
    },
    {
        "dialog": [
            "Hi Medi, I think I have encephalitis. What should I do?",
            "What symptoms do you have?",
            "I have a severe headache, fever, and confusion.",
            "Based on the symptoms, it is highly recommended to seek medical attention immediately.",
            "What is encephalitis?",
            "Encephalitis is an inflammation of the brain, often caused by a viral infection.",
            "Can it be cured?",
            "Treatment depends on the cause and severity, but it can be treated with antiviral medication if caught early.",
            "Thank you for your help, Medi. "
        ],
        "knowledge": "Encephalitis Encephalitis 4 cases per 100,000 people per year.  In tropical countries, the incidence is 6. 34 per 100,000 people per year.  The number of cases of encephalitis has not changed much over time, with about 250,000 cases a year from 2005 to 2015 in the US.  Approximately seven per 100,000 people were hospitalized for encephalitis in the US during this time.  In 2015, encephalitis was estimated to have affected 4. 3 million people and resulted in 150,000 deaths worldwide Encephalitis Encephalitis",
        "response": "You're welcome. Don't hesitate to seek medical attention. Early treatment is important."
    },
    {
        "dialog": [
            "Medi, what are the common symptoms of encephalitis?",
            "The most common symptoms include fever, headache, and confusion.",
            "Can encephalitis be spread from person to person?",
            "It is typically not contagious except for a few specific viruses that can spread through mosquito or tick bites.",
            "What are the long-term effects of encephalitis?",
            "The long-term effects depend on the severity and type of encephalitis. Some may have no lasting effects, while others may have permanent brain damage.",
            "Is there a vaccine to prevent encephalitis?",
            "There are vaccines available for some types of encephalitis, such as Japanese encephalitis and tick-borne encephalitis.",
            "Thank you for your answers, Medi."
        ],
        "knowledge": "Encephalitis Encephalitis 4 cases per 100,000 people per year.  In tropical countries, the incidence is 6. 34 per 100,000 people per year.  The number of cases of encephalitis has not changed much over time, with about 250,000 cases a year from 2005 to 2015 in the US.  Approximately seven per 100,000 people were hospitalized for encephalitis in the US during this time.  In 2015, encephalitis was estimated to have affected 4. 3 million people and resulted in 150,000 deaths worldwide Encephalitis Encephalitis",
        "response": "You're welcome. Don't hesitate to contact a medical professional if you experience any symptoms."
    },
    {
        "dialog": [
            "Hi Medi, I recently had encephalitis and was wondering what I should do now.",
            "How are you feeling now?",
            "I am feeling better, but I am concerned about what to do next.",
            "It is important to rest and take care of yourself during the recovery process.",
            "What lifestyle changes can I make to prevent encephalitis from happening again?",
            "Maintaining good hygiene can help prevent the spread of some types of encephalitis. Avoiding mosquito and tick bites can also help prevent encephalitis caused by those specific viruses.",
            "Can I return to my normal activities?",
            "It's best to consult with your doctor before returning to any strenuous activities.",
            "Thank you for your advice, Medi."
        ],
        "knowledge": "Encephalitis Encephalitis 4 cases per 100,000 people per year.  In tropical countries, the incidence is 6. 34 per 100,000 people per year.  The number of cases of encephalitis has not changed much over time, with about 250,000 cases a year from 2005 to 2015 in the US.  Approximately seven per 100,000 people were hospitalized for encephalitis in the US during this time.  In 2015, encephalitis was estimated to have affected 4. 3 million people and resulted in 150,000 deaths worldwide Encephalitis Encephalitis",
        "response": "You're welcome. Take care of yourself and follow your doctor's advice for a smooth and safe recovery."
    },
    {
        "dialog": [
            "Hi Medi, I am worried about encephalitis.",
            "Hello, I can help you with that. What's concerning you?",
            "I just read about it and I'm curious about the number of cases it has.",
            "Encephalitis has about 4 cases per 100,000 people annually.",
            "That's not too bad. But I also read that the number of cases has not changed a lot over time.",
            "Yes, that's true. There have been about 250,000 cases per year from 2005 to 2015 in the US.",
            "What about hospitalization rates?",
            "Around seven per 100,000 people were hospitalized in the US during this time.",
            "What's the global impact of encephalitis, Medi?"
        ],
        "knowledge": "Encephalitis Encephalitis 4 cases per 100,000 people per year.  In tropical countries, the incidence is 6. 34 per 100,000 people per year.  The number of cases of encephalitis has not changed much over time, with about 250,000 cases a year from 2005 to 2015 in the US.  Approximately seven per 100,000 people were hospitalized for encephalitis in the US during this time.  In 2015, encephalitis was estimated to have affected 4. 3 million people and resulted in 150,000 deaths worldwide Encephalitis Encephalitis",
        "response": "Encephalitis has affected 4.3 million people and resulted in 150,000 deaths worldwide, according to an estimate in 2015."
    },
    {
        "dialog": [
            "Hey Medi, do you have any information about encephalitis?",
            "Of course, I have all the information you need. What would you like to know?",
            "I'm wondering if there are any specific symptoms of encephalitis.",
            "Yes, some common symptoms include fever, headache, confusion, seizures, and sensitivity to light.",
            "What causes encephalitis?",
            "Encephalitis can be caused by a viral, bacterial, or fungal infection.",
            "How is encephalitis treated, Medi?",
            "Treatment depends on the cause of the infection. It may include antiviral or antibiotic medications.",
            "Is there anything I can do to prevent encephalitis?"
        ],
        "knowledge": "Encephalitis Encephalitis 4 cases per 100,000 people per year.  In tropical countries, the incidence is 6. 34 per 100,000 people per year.  The number of cases of encephalitis has not changed much over time, with about 250,000 cases a year from 2005 to 2015 in the US.  Approximately seven per 100,000 people were hospitalized for encephalitis in the US during this time.  In 2015, encephalitis was estimated to have affected 4. 3 million people and resulted in 150,000 deaths worldwide Encephalitis Encephalitis",
        "response": "There's no guaranteed way to prevent encephalitis, but taking measures to avoid mosquito bites and practicing good hygiene can help reduce the risk of infection."
    },
    {
        "dialog": [
            "Hi Medi, I just had a spinal tap. What should I do after the procedure?",
            "Hello, after a spinal tap, it's important to lie still for a while to avoid a headache.",
            "How long should I lay still?",
            "You should rest for at least an hour after the procedure.",
            "What kind of activities should I avoid?",
            "You should avoid any strenuous activity for the next 24 hours, including heavy lifting and exercise.",
            "What about my diet?",
            "You can eat and drink normally after the procedure, but avoid alcohol and caffeine for the next 24 hours.",
            "Are there any other things I should watch out for, Medi?"
        ],
        "knowledge": "Spinal tap Spinal tap A spinal tap, also known as a lumbar puncture, is a medical procedure used to collect cerebrospinal fluid (CSF) for analysis.  It involves inserting a needle into the lower back and withdrawing fluid from the spinal canal.  After the procedure, it is recommended to lie still for at least an hour to avoid a headache.  Strenuous activity should be avoided for the next 24 hours to prevent complications.  Normal eating and drinking is allowed after the procedure, but alcohol and caffeine should be avoided for the next 24 hours. Spinal tap Spinal tap",
        "response": "You should watch out for any signs of infection, such as fever or redness around the injection site. If you experience any of these symptoms, contact your doctor immediately."
    }
]