[
    {
        "dialog": [
            "Hello Medi, I'm feeling very sick today. Can you help me?",
            "Of course, I'm here to help. Can you tell me some of your symptoms?",
            "I've been feeling nauseous since this morning and I have a headache.",
            "Have you been experiencing any other symptoms?",
            "I've also been feeling really tired, and I think I have a fever.",
            "Based on your symptoms, it sounds like you might have the flu. I recommend that you take some rest and drink plenty of fluids.",
            "Do I need to take any medication?",
            "You can take some over-the-counter medication to help with your symptoms, but it's important to rest and drink plenty of fluids.",
            "Thank you Medi, I'll follow your advice."
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "It's possible that you have the flu. You should take some rest and drink plenty of fluids to help with your symptoms."
    },
    {
        "dialog": [
            "Hi Medi, I'm worried that I might have hepatitis C. What should I do?",
            "I recommend that you get tested for hepatitis C as soon as possible.",
            "What are the symptoms of hepatitis C?",
            "Symptoms can include fatigue, joint pain, abdominal pain, itchy skin, and jaundice.",
            "How is hepatitis C transmitted?",
            "Hepatitis C is most commonly transmitted through contact with infected blood. This can happen through sharing needles, getting a tattoo or piercing with unsterilized equipment, or receiving a blood transfusion before 1992.",
            "Is there a treatment for hepatitis C?",
            "Yes, there are several antiviral medications that are recommended for the treatment of chronic hepatitis C.",
            "What are some ways to prevent hepatitis C?"
        ],
        "knowledge": "Hepatitis Hepatitis  Antiviral medications are recommended in all with chronic hepatitis C, except those with conditions that limit their life expectancy.  There is no specific treatment for NASH; physical activity, a healthy diet, and weight loss are recommended.  Autoimmune hepatitis may be treated with medications to suppress the immune system.  A liver transplant may be an option in both acute and chronic liver failure. Worldwide in 2015, hepatitis A occurred in about 114 million people, chronic hepatitis B affected about 343 million people and chronic hepatitis C about 142 million people.  In the United States, NASH affects about 11 million people and alcoholic hepatitis affects about 5 million people.  Hepatitis results in more than a million deaths a year, most of which occur indirectly from liver scarring or liver cancer Hepatitis Hepatitis",
        "response": "It's important that you get tested for hepatitis C as soon as possible. Symptoms can include fatigue, joint pain, abdominal pain, itchy skin, and jaundice. There are antiviral medications that are recommended for the treatment of chronic hepatitis C. To prevent hepatitis C, avoid sharing needles or other personal items, practice safe sex, and get vaccinated for hepatitis A and B."
    },
    {
        "dialog": [
            "Hi Medi, I just had a liver transplant. What should I do to take care of myself?",
            "Congratulations on your successful transplant. It's important to follow your doctor's instructions carefully.",
            "What should I eat?",
            "It's important to eat a healthy and balanced diet, with plenty of fruits and vegetables. Your doctor might recommend that you avoid certain foods or take supplements.",
            "Can I exercise?",
            "It's important to exercise regularly, but you should talk to your doctor first to make sure that you don't overexert yourself.",
            "Do I need to take any medication?",
            "You will need to take medication to prevent your body from rejecting the new liver. It's important to take your medication exactly as prescribed by your doctor.",
            "Thanks Medi. I'll make sure to follow my doctor's instructions."
        ],
        "knowledge": "Hepatitis Hepatitis  Antiviral medications are recommended in all with chronic hepatitis C, except those with conditions that limit their life expectancy.  There is no specific treatment for NASH; physical activity, a healthy diet, and weight loss are recommended.  Autoimmune hepatitis may be treated with medications to suppress the immune system.  A liver transplant may be an option in both acute and chronic liver failure. Worldwide in 2015, hepatitis A occurred in about 114 million people, chronic hepatitis B affected about 343 million people and chronic hepatitis C about 142 million people.  In the United States, NASH affects about 11 million people and alcoholic hepatitis affects about 5 million people.  Hepatitis results in more than a million deaths a year, most of which occur indirectly from liver scarring or liver cancer Hepatitis Hepatitis",
        "response": "After a liver transplant, it's important to follow your doctor's instructions carefully, eat a healthy and balanced diet with plenty of fruits and vegetables, exercise regularly with your doctor's permission, and take medication to prevent your body from rejecting the new liver."
    },
    {
        "dialog": [
            "Hello Medi, I have been diagnosed with chronic hepatitis C.",
            "I'm sorry to hear that. What are your symptoms?",
            "I feel very tired all the time, my appetite has decreased, and I have joint pain.",
            "Antiviral medications are recommended in all cases of chronic hepatitis C, except those with conditions that limit their life expectancy.",
            "What about my diet and lifestyle? Do I need to make changes?",
            "Yes, it's recommended to have a healthy diet and regular physical activity.",
            "Are there any foods I should avoid?",
            "It's best to avoid alcohol and fatty or fried foods.",
            "Thank you for the advice, Medi. What are the chances of a complete cure?"
        ],
        "knowledge": "Hepatitis Hepatitis  Antiviral medications are recommended in all with chronic hepatitis C, except those with conditions that limit their life expectancy.  There is no specific treatment for NASH; physical activity, a healthy diet, and weight loss are recommended.  Autoimmune hepatitis may be treated with medications to suppress the immune system.  A liver transplant may be an option in both acute and chronic liver failure. Worldwide in 2015, hepatitis A occurred in about 114 million people, chronic hepatitis B affected about 343 million people and chronic hepatitis C about 142 million people.  In the United States, NASH affects about 11 million people and alcoholic hepatitis affects about 5 million people.  Hepatitis results in more than a million deaths a year, most of which occur indirectly from liver scarring or liver cancer Hepatitis Hepatitis",
        "response": "The cure rate for chronic hepatitis C depends on the type of medication and the duration of treatment. It's best to discuss this with your doctor."
    },
    {
        "dialog": [
            "Hello Medi, I have a question about autoimmune hepatitis.",
            "Sure, I'll do my best to help. What's your question?",
            "What are the symptoms of autoimmune hepatitis and how is it treated?",
            "The symptoms of autoimmune hepatitis are fatigue, abdominal discomfort, joint pain, and jaundice. It can be treated with medications to suppress the immune system.",
            "Are there any lifestyle changes that can help?",
            "It's important to have a healthy diet and regular physical activity to maintain liver health.",
            "Can it lead to liver failure?",
            "Yes, if left untreated it can lead to cirrhosis and liver failure.",
            "Thank you for the information, Medi. Is it a common disease?"
        ],
        "knowledge": "Hepatitis Hepatitis  Antiviral medications are recommended in all with chronic hepatitis C, except those with conditions that limit their life expectancy.  There is no specific treatment for NASH; physical activity, a healthy diet, and weight loss are recommended.  Autoimmune hepatitis may be treated with medications to suppress the immune system.  A liver transplant may be an option in both acute and chronic liver failure. Worldwide in 2015, hepatitis A occurred in about 114 million people, chronic hepatitis B affected about 343 million people and chronic hepatitis C about 142 million people.  In the United States, NASH affects about 11 million people and alcoholic hepatitis affects about 5 million people.  Hepatitis results in more than a million deaths a year, most of which occur indirectly from liver scarring or liver cancer Hepatitis Hepatitis",
        "response": "Autoimmune hepatitis is relatively rare, affecting about 100,000 people in the United States."
    },
    {
        "dialog": [
            "Hello Medi, I recently had a liver transplant and I'm not sure what I should do now.",
            "Congratulations on your transplant. What are your concerns?",
            "I'm worried about my diet and physical activity level. What should I do?",
            "It's important to have a healthy diet and exercise regularly, but you should consult with your doctor about specific recommendations.",
            "Are there any foods I should avoid?",
            "It's best to avoid alcohol and fatty or fried foods.",
            "What about physical activity? Are there any restrictions?",
            "You should avoid strenuous activities for a few months after the transplant, but light exercise is recommended.",
            "Thank you for the advice, Medi. Can I return to work?"
        ],
        "knowledge": "Hepatitis Hepatitis  Antiviral medications are recommended in all with chronic hepatitis C, except those with conditions that limit their life expectancy.  There is no specific treatment for NASH; physical activity, a healthy diet, and weight loss are recommended.  Autoimmune hepatitis may be treated with medications to suppress the immune system.  A liver transplant may be an option in both acute and chronic liver failure. Worldwide in 2015, hepatitis A occurred in about 114 million people, chronic hepatitis B affected about 343 million people and chronic hepatitis C about 142 million people.  In the United States, NASH affects about 11 million people and alcoholic hepatitis affects about 5 million people.  Hepatitis results in more than a million deaths a year, most of which occur indirectly from liver scarring or liver cancer Hepatitis Hepatitis",
        "response": "You may be able to return to work after a few months of recovery, but it's best to discuss this with your doctor to determine what's best for you."
    },
    {
        "dialog": [
            "Hi Medi, I am feeling really tired and having dark urine.",
            "Hi there, sorry to hear that. What other symptoms are you experiencing?",
            "I also have yellowing of the skin and eyes.",
            "Based on your symptoms, it's possible that you have hepatitis. You should see a doctor as soon as possible.",
            "What kind of hepatitis could it be?",
            "There are several types of hepatitis, but based on your symptoms it could be hepatitis A or B.",
            "How can it be treated?",
            "That depends on the type of hepatitis. Antiviral medications are usually recommended for chronic hepatitis C, while for hepatitis B, medications to suppress the virus are used. For hepatitis A, the symptoms usually resolve within a few weeks without any specific treatment.",
            "Alright, I will schedule an appointment with my doctor. Thanks for your help, Medi."
        ],
        "knowledge": "Hepatitis Hepatitis  Antiviral medications are recommended in all with chronic hepatitis C, except those with conditions that limit their life expectancy.  There is no specific treatment for NASH; physical activity, a healthy diet, and weight loss are recommended.  Autoimmune hepatitis may be treated with medications to suppress the immune system.  A liver transplant may be an option in both acute and chronic liver failure. Worldwide in 2015, hepatitis A occurred in about 114 million people, chronic hepatitis B affected about 343 million people and chronic hepatitis C about 142 million people.  In the United States, NASH affects about 11 million people and alcoholic hepatitis affects about 5 million people.  Hepatitis results in more than a million deaths a year, most of which occur indirectly from liver scarring or liver cancer Hepatitis Hepatitis",
        "response": "You're welcome. It's important to get medical attention as soon as possible, especially if it's hepatitis A or B."
    },
    {
        "dialog": [
            "Medi, can you tell me more about hepatitis C?",
            "Sure, what would you like to know?",
            "I heard that hepatitis C is a chronic disease. What does that mean?",
            "Yes, chronic hepatitis C is a long-term infection of the liver caused by the hepatitis C virus. It can last for many years and cause damage to the liver over time.",
            "What are the symptoms of chronic hepatitis C?",
            "Many people with chronic hepatitis C have no symptoms. However, some may experience fatigue, joint pain, abdominal pain, and loss of appetite.",
            "Is there a cure for chronic hepatitis C?",
            "Yes, there are several medications available that can cure chronic hepatitis C. They are usually taken for several weeks or months, depending on the specific medication and the severity of the infection.",
            "Thanks for the information, Medi."
        ],
        "knowledge": "Hepatitis Hepatitis  Antiviral medications are recommended in all with chronic hepatitis C, except those with conditions that limit their life expectancy.  There is no specific treatment for NASH; physical activity, a healthy diet, and weight loss are recommended.  Autoimmune hepatitis may be treated with medications to suppress the immune system.  A liver transplant may be an option in both acute and chronic liver failure. Worldwide in 2015, hepatitis A occurred in about 114 million people, chronic hepatitis B affected about 343 million people and chronic hepatitis C about 142 million people.  In the United States, NASH affects about 11 million people and alcoholic hepatitis affects about 5 million people.  Hepatitis results in more than a million deaths a year, most of which occur indirectly from liver scarring or liver cancer Hepatitis Hepatitis",
        "response": "You're welcome, always happy to help. I hope this information was useful to you."
    },
    {
        "dialog": [
            "Hello Medi, I recently underwent a liver transplant surgery.",
            "Hi there, how are you feeling after the surgery?",
            "I'm feeling good, but I'm not sure what I should be doing in terms of my diet and physical activity.",
            "After a liver transplant, it's important to follow a healthy and balanced diet to support your recovery and prevent complications. You should also engage in regular physical activity to maintain your overall health and well-being.",
            "What kind of foods should I be eating?",
            "You should focus on eating plenty of fruits, vegetables, whole grains, lean protein, and low-fat dairy products. It's also important to limit your intake of saturated and trans fats, as well as sodium.",
            "How much physical activity should I be doing?",
            "You should aim for at least 30 minutes of moderate-intensity physical activity, such as brisk walking or cycling, on most days of the week. Be sure to check with your doctor before starting any exercise program.",
            "Thanks for the advice, Medi."
        ],
        "knowledge": "Hepatitis Hepatitis  Antiviral medications are recommended in all with chronic hepatitis C, except those with conditions that limit their life expectancy.  There is no specific treatment for NASH; physical activity, a healthy diet, and weight loss are recommended.  Autoimmune hepatitis may be treated with medications to suppress the immune system.  A liver transplant may be an option in both acute and chronic liver failure. Worldwide in 2015, hepatitis A occurred in about 114 million people, chronic hepatitis B affected about 343 million people and chronic hepatitis C about 142 million people.  In the United States, NASH affects about 11 million people and alcoholic hepatitis affects about 5 million people.  Hepatitis results in more than a million deaths a year, most of which occur indirectly from liver scarring or liver cancer Hepatitis Hepatitis",
        "response": "You're welcome. I'm glad I could help. Remember to follow your doctor's advice and take care of yourself."
    },
    {
        "dialog": [
            "Hello, Medi. I have some symptoms and I need your help.",
            "Hi there, please tell me your symptoms so I can assist you.",
            "I feel tired all the time, and I have abdominal pain and nausea.",
            "How long have you been experiencing these symptoms?",
            "About a week now.",
            "Based on your symptoms, it could be possible that you have Hepatitis. Have you been exposed to the virus?",
            "I am not sure, what should I do now?",
            "You should get tested for Hepatitis to confirm the diagnosis.",
            "What is the treatment for Hepatitis?"
        ],
        "knowledge": "Hepatitis Hepatitis Antiviral medications are recommended in all with chronic hepatitis C, except those with conditions that limit their life expectancy. There is no specific treatment for NASH; physical activity, a healthy diet, and weight loss are recommended. Autoimmune hepatitis may be treated with medications to suppress the immune system. A liver transplant may be an option in both acute and chronic liver failure. Worldwide in 2015, hepatitis A occurred in about 114 million people, chronic hepatitis B affected about 343 million people and chronic hepatitis C about 142 million people. In the United States, NASH affects about 11 million people and alcoholic hepatitis affects about 5 million people. Hepatitis results in more than a million deaths a year, most of which occur indirectly from liver scarring or liver cancer Hepatitis Hepatitis",
        "response": "The treatment depends on the type of Hepatitis. If it is Hepatitis A, it usually goes away on its own. For Hepatitis B and C, antiviral medications are recommended."
    },
    {
        "dialog": [
            "Hi Medi, can you tell me about the symptoms of Hepatitis B?",
            "Certainly, the symptoms of Hepatitis B include nausea, vomiting, abdominal pain, joint pain, and jaundice.",
            "How is Hepatitis B transmitted?",
            "It is primarily transmitted through bodily fluids, such as blood, semen, and vaginal secretions. It can also be transmitted from mother to child during childbirth.",
            "Is there a way to prevent Hepatitis B?",
            "Yes, getting vaccinated against Hepatitis B is the best way to prevent it.",
            "Can I still get Hepatitis B even if I've been vaccinated?",
            "It is possible, but the vaccine greatly reduces the risk of contracting it.",
            "What should I do if I think I have been exposed to Hepatitis B?"
        ],
        "knowledge": "Hepatitis Hepatitis Antiviral medications are recommended in all with chronic hepatitis C, except those with conditions that limit their life expectancy. There is no specific treatment for NASH; physical activity, a healthy diet, and weight loss are recommended. Autoimmune hepatitis may be treated with medications to suppress the immune system. A liver transplant may be an option in both acute and chronic liver failure. Worldwide in 2015, hepatitis A occurred in about 114 million people, chronic hepatitis B affected about 343 million people and chronic hepatitis C about 142 million people. In the United States, NASH affects about 11 million people and alcoholic hepatitis affects about 5 million people. Hepatitis results in more than a million deaths a year, most of which occur indirectly from liver scarring or liver cancer Hepatitis Hepatitis",
        "response": "If you think you've been exposed to Hepatitis B, you should get tested and vaccinated as soon as possible."
    },
    {
        "dialog": [
            "Hello, Medi. I've just recovered from Hepatitis C. What lifestyle changes should I make to prevent a recurrence?",
            "Congratulations on your recovery. To maintain good health and prevent a recurrence of the disease, you should follow a healthy diet, exercise regularly, and avoid alcohol and smoking.",
            "What types of food should I eat?",
            "You should eat more fruits, vegetables, whole grains, and lean proteins. Limit your intake of processed foods, sugar, and saturated fats.",
            "How much exercise should I do?",
            "You should aim to do at least 30 minutes of moderate exercise, such as brisk walking, every day.",
            "Can I drink alcohol?",
            "No, you should avoid alcohol completely as it can damage your liver.",
            "Thank you for your advice, Medi. I will follow your recommendations."
        ],
        "knowledge": "Hepatitis Hepatitis Antiviral medications are recommended in all with chronic hepatitis C, except those with conditions that limit their life expectancy. There is no specific treatment for NASH; physical activity, a healthy diet, and weight loss are recommended. Autoimmune hepatitis may be treated with medications to suppress the immune system. A liver transplant may be an option in both acute and chronic liver failure. Worldwide in 2015, hepatitis A occurred in about 114 million people, chronic hepatitis B affected about 343 million people and chronic hepatitis C about 142 million people. In the United States, NASH affects about 11 million people and alcoholic hepatitis affects about 5 million people. Hepatitis results in more than a million deaths a year, most of which occur indirectly from liver scarring or liver cancer Hepatitis Hepatitis",
        "response": "You're welcome. Following these lifestyle changes can greatly improve your liver health and prevent a recurrence of Hepatitis C."
    },
    {
        "dialog": [
            "Hello Medi, I have been diagnosed with chronic hepatitis C.",
            "I understand, antiviral medications are recommended for this type of hepatitis.",
            "What options do I have if antiviral medications do not work for me?",
            "A liver transplant may be an option in both acute and chronic liver failure.",
            "What lifestyle changes can I make to improve my condition?",
            "Physical activity, a healthy diet, and weight loss are recommended.",
            "Is there anything else I can do to prevent the disease from worsening?",
            "Avoid alcohol and ask your doctor about getting vaccinated for hepatitis A and B.",
            "Thank you for your advice, Medi. What is the prognosis for chronic hepatitis C?"
        ],
        "knowledge": "Hepatitis Hepatitis  Antiviral medications are recommended in all with chronic hepatitis C, except those with conditions that limit their life expectancy.  There is no specific treatment for NASH; physical activity, a healthy diet, and weight loss are recommended.  Autoimmune hepatitis may be treated with medications to suppress the immune system.  A liver transplant may be an option in both acute and chronic liver failure. Worldwide in 2015, hepatitis A occurred in about 114 million people, chronic hepatitis B affected about 343 million people and chronic hepatitis C about 142 million people.  In the United States, NASH affects about 11 million people and alcoholic hepatitis affects about 5 million people.  Hepatitis results in more than a million deaths a year, most of which occur indirectly from liver scarring or liver cancer Hepatitis Hepatitis",
        "response": "Prognosis for chronic hepatitis C varies, but with proper treatment and lifestyle changes, it is possible to slow or stop liver damage and prevent complications."
    },
    {
        "dialog": [
            "Hello Medi, I have been diagnosed with NASH.",
            "I see, there is no specific treatment for NASH, but lifestyle changes can help.",
            "What lifestyle changes can I make to improve my condition?",
            "Physical activity, a healthy diet, and weight loss are recommended.",
            "How much weight should I lose?",
            "Losing 3-5% of your body weight can improve liver health, but aim for 7-10% for best results.",
            "What is the prognosis for NASH?",
            "Without proper treatment and lifestyle changes, NASH can lead to cirrhosis and liver failure.",
            "Thank you for your advice, Medi. What is the risk of developing NASH?"
        ],
        "knowledge": "Hepatitis Hepatitis  Antiviral medications are recommended in all with chronic hepatitis C, except those with conditions that limit their life expectancy.  There is no specific treatment for NASH; physical activity, a healthy diet, and weight loss are recommended.  Autoimmune hepatitis may be treated with medications to suppress the immune system.  A liver transplant may be an option in both acute and chronic liver failure. Worldwide in 2015, hepatitis A occurred in about 114 million people, chronic hepatitis B affected about 343 million people and chronic hepatitis C about 142 million people.  In the United States, NASH affects about 11 million people and alcoholic hepatitis affects about 5 million people.  Hepatitis results in more than a million deaths a year, most of which occur indirectly from liver scarring or liver cancer Hepatitis Hepatitis",
        "response": "The risk of developing NASH is higher in those who are overweight or have type 2 diabetes, high cholesterol, or high triglycerides. Talk to your doctor about managing these risk factors."
    },
    {
        "dialog": [
            "Hello Medi, I just had a liver transplant.",
            "Congratulations! After a transplant, it is important to take care of your new liver.",
            "What lifestyle changes can I make to improve my condition?",
            "Physical activity, a healthy diet, and avoiding alcohol are recommended.",
            "What type of exercise can I do?",
            "Light exercise, such as walking, is a good start. Talk to your doctor about what exercises are safe for you.",
            "What should I eat after a transplant?",
            "A diet low in fat and sodium and high in fiber and protein is recommended. Talk to a dietitian for personalized advice.",
            "Thank you for your advice, Medi. How often will I need follow-up appointments?"
        ],
        "knowledge": "Hepatitis Hepatitis  Antiviral medications are recommended in all with chronic hepatitis C, except those with conditions that limit their life expectancy.  There is no specific treatment for NASH; physical activity, a healthy diet, and weight loss are recommended.  Autoimmune hepatitis may be treated with medications to suppress the immune system.  A liver transplant may be an option in both acute and chronic liver failure. Worldwide in 2015, hepatitis A occurred in about 114 million people, chronic hepatitis B affected about 343 million people and chronic hepatitis C about 142 million people.  In the United States, NASH affects about 11 million people and alcoholic hepatitis affects about 5 million people.  Hepatitis results in more than a million deaths a year, most of which occur indirectly from liver scarring or liver cancer Hepatitis Hepatitis",
        "response": "Follow-up appointments will depend on your individual situation, but expect to see your doctor and transplant team frequently in the first year following your transplant."
    },
    {
        "dialog": [
            "Hello Medi, I have a concern about hepatitis C.",
            "No problem. I am here to help you. What's your symptom?",
            "I feel so tired and have no energy, and I have pain in my abdomen and dark urine.",
            "I see. You might have hepatitis C. You should see a doctor to diagnose it.",
            "What treatment should I have?",
            "Antiviral medication is recommended if you have chronic hepatitis C.",
            "Is there any situation that I should not use antiviral medication?",
            "Those with conditions that limit their life expectancy are not recommended to use antiviral medication.",
            "How can I prevent hepatitis C from happening to myself?"
        ],
        "knowledge": "Hepatitis Hepatitis  Antiviral medications are recommended in all with chronic hepatitis C, except those with conditions that limit their life expectancy.  There is no specific treatment for NASH; physical activity, a healthy diet, and weight loss are recommended.  Autoimmune hepatitis may be treated with medications to suppress the immune system.  A liver transplant may be an option in both acute and chronic liver failure. Worldwide in 2015, hepatitis A occurred in about 114 million people, chronic hepatitis B affected about 343 million people and chronic hepatitis C about 142 million people.  In the United States, NASH affects about 11 million people and alcoholic hepatitis affects about 5 million people.  Hepatitis results in more than a million deaths a year, most of which occur indirectly from liver scarring or liver cancer Hepatitis Hepatitis",
        "response": "You can prevent hepatitis C by avoiding coming into contact with blood that is infected with the hepatitis C virus, such as not sharing needles or razors and practicing safe sex."
    },
    {
        "dialog": [
            "Hello Medi, can you help me with my autoimmune hepatitis?",
            "Of course. What questions do you have about your autoimmune hepatitis?",
            "What treatment should I have?",
            "Autoimmune hepatitis may be treated with medications to suppress the immune system.",
            "What are the symptoms of autoimmune hepatitis?",
            "The symptoms of autoimmune hepatitis include fatigue, abdominal discomfort, joint pain, and jaundice.",
            "What is the cause of autoimmune hepatitis?",
            "The cause of autoimmune hepatitis is unknown. It may be caused by a combination of genetic and environmental factors.",
            "Can I have a liver transplant for autoimmune hepatitis?"
        ],
        "knowledge": "Hepatitis Hepatitis  Antiviral medications are recommended in all with chronic hepatitis C, except those with conditions that limit their life expectancy.  There is no specific treatment for NASH; physical activity, a healthy diet, and weight loss are recommended.  Autoimmune hepatitis may be treated with medications to suppress the immune system.  A liver transplant may be an option in both acute and chronic liver failure. Worldwide in 2015, hepatitis A occurred in about 114 million people, chronic hepatitis B affected about 343 million people and chronic hepatitis C about 142 million people.  In the United States, NASH affects about 11 million people and alcoholic hepatitis affects about 5 million people.  Hepatitis results in more than a million deaths a year, most of which occur indirectly from liver scarring or liver cancer Hepatitis Hepatitis",
        "response": "Yes, a liver transplant may be an option for both acute and chronic liver failure caused by autoimmune hepatitis."
    },
    {
        "dialog": [
            "Hello Medi, I have NASH. Can you give me advice for my lifestyle?",
            "Sure. I can give you advice for your lifestyle. What do you want to know?",
            "What kind of diet should I have?",
            "A healthy diet with more vegetables and less sugar is recommended for NASH.",
            "What about physical activity?",
            "Physical activity is recommended for NASH. It can help reduce liver fat and improve liver function.",
            "Are there any medications for NASH?",
            "There is no specific treatment for NASH. Lifestyle changes such as healthy diet and physical activity are recommended.",
            "How many people are affected by NASH in the United States?"
        ],
        "knowledge": "Hepatitis Hepatitis  Antiviral medications are recommended in all with chronic hepatitis C, except those with conditions that limit their life expectancy.  There is no specific treatment for NASH; physical activity, a healthy diet, and weight loss are recommended.  Autoimmune hepatitis may be treated with medications to suppress the immune system.  A liver transplant may be an option in both acute and chronic liver failure. Worldwide in 2015, hepatitis A occurred in about 114 million people, chronic hepatitis B affected about 343 million people and chronic hepatitis C about 142 million people.  In the United States, NASH affects about 11 million people and alcoholic hepatitis affects about 5 million people.  Hepatitis results in more than a million deaths a year, most of which occur indirectly from liver scarring or liver cancer Hepatitis Hepatitis",
        "response": "In the United States, NASH affects about 11 million people."
    },
    {
        "dialog": [
            "Hi Medi, I've been diagnosed with chronic hepatitis C, what should I do?",
            "Antiviral medications are recommended in all with chronic hepatitis C, except those with conditions that limit their life expectancy",
            "Are there any side effects of antiviral medications?",
            "Yes, but newer medications have fewer side effects. You can discuss with your doctor",
            "Can I still exercise with chronic hepatitis C?",
            "Yes, you can exercise, it's beneficial. But you should avoid contact sports",
            "Can I still eat my favorite food?",
            "Of course, you can eat anything, but you should avoid or limit alcohol consumption",
            "How long it will take for me to recover, Medi?"
        ],
        "knowledge": "Hepatitis Hepatitis  Antiviral medications are recommended in all with chronic hepatitis C, except those with conditions that limit their life expectancy.  There is no specific treatment for NASH; physical activity, a healthy diet, and weight loss are recommended.  Autoimmune hepatitis may be treated with medications to suppress the immune system.  A liver transplant may be an option in both acute and chronic liver failure. Worldwide in 2015, hepatitis A occurred in about 114 million people, chronic hepatitis B affected about 343 million people and chronic hepatitis C about 142 million people.  In the United States, NASH affects about 11 million people and alcoholic hepatitis affects about 5 million people.  Hepatitis results in more than a million deaths a year, most of which occur indirectly from liver scarring or liver cancer Hepatitis Hepatitis",
        "response": "It depends on several factors such as your age, health conditions, viral genotype, and other treatments you may have received before. You need to consult with your doctor for an accurate estimate."
    },
    {
        "dialog": [
            "Hi Medi, can you explain to me what is autoimmune hepatitis?",
            "Autoimmune hepatitis is a chronic disease in which your body's immune system attacks your liver.",
            "What are the symptoms of autoimmune hepatitis?",
            "Fatigue, abdominal discomfort, joint pain, jaundice, itchy skin, spider angiomas, nausea, and vomiting",
            "How is autoimmune hepatitis treated?",
            "It can be treated with medications to suppress the immune system. You need to consult with your doctor for an accurate diagnosis and treatment plan",
            "Can autoimmune hepatitis be cured?",
            "There is no cure for autoimmune hepatitis, but treatment can help manage the disease and prevent further liver damage",
            "Can I still work with autoimmune hepatitis?"
        ],
        "knowledge": "Hepatitis Hepatitis  Antiviral medications are recommended in all with chronic hepatitis C, except those with conditions that limit their life expectancy.  There is no specific treatment for NASH; physical activity, a healthy diet, and weight loss are recommended.  Autoimmune hepatitis may be treated with medications to suppress the immune system.  A liver transplant may be an option in both acute and chronic liver failure. Worldwide in 2015, hepatitis A occurred in about 114 million people, chronic hepatitis B affected about 343 million people and chronic hepatitis C about 142 million people.  In the United States, NASH affects about 11 million people and alcoholic hepatitis affects about 5 million people.  Hepatitis results in more than a million deaths a year, most of which occur indirectly from liver scarring or liver cancer Hepatitis Hepatitis",
        "response": "It depends on the severity of the disease and your ability to perform your work. You should consult with your employer and your doctor for any necessary accommodations."
    },
    {
        "dialog": [
            "Hi Medi, I was recently diagnosed with NASH. What should I do?",
            "There is no specific treatment for NASH, but physical activity, a healthy diet, and weight loss are recommended",
            "What should I include in my healthy diet to manage NASH?",
            "You should include more vegetables, fruits, whole grains, lean protein, and healthy fats in your diet. You should avoid or limit saturated and trans fats, added sugars, and refined carbohydrates",
            "Can I still have alcohol with NASH?",
            "It's recommended to avoid or limit alcohol consumption if you have NASH",
            "Can I still have snacks with NASH?",
            "Yes, you can have snacks, but you should choose healthy snacks, such as fruits, nuts, and vegetables",
            "Can physical activity improve my NASH?"
        ],
        "knowledge": "Hepatitis Hepatitis  Antiviral medications are recommended in all with chronic hepatitis C, except those with conditions that limit their life expectancy.  There is no specific treatment for NASH; physical activity, a healthy diet, and weight loss are recommended.  Autoimmune hepatitis may be treated with medications to suppress the immune system.  A liver transplant may be an option in both acute and chronic liver failure. Worldwide in 2015, hepatitis A occurred in about 114 million people, chronic hepatitis B affected about 343 million people and chronic hepatitis C about 142 million people.  In the United States, NASH affects about 11 million people and alcoholic hepatitis affects about 5 million people.  Hepatitis results in more than a million deaths a year, most of which occur indirectly from liver scarring or liver cancer Hepatitis Hepatitis",
        "response": "Yes, you should avoid smoking, get enough sleep, and manage stress. You should also follow up with your doctor regularly and take any prescribed medications as directed."
    },
    {
        "dialog": [
            "Hi Medi, I think I have hepatitis. What should I do?",
            "Firstly, you should get a blood test to confirm hepatitis and to find out which type of hepatitis you have.",
            "What will happen then?",
            "Depending on the type of hepatitis, antiviral medications or other treatments may be recommended to you.",
            "What about the chronic hepatitis C?",
            "Antiviral medications are recommended in all with chronic hepatitis C, except those with conditions that limit their life expectancy.",
            "What if I don't have chronic hepatitis C?",
            "It depends on which type of hepatitis you have and your overall health, but I recommend seeing a doctor as soon as possible.",
            "How can I prevent hepatitis? "
        ],
        "knowledge": "Hepatitis Hepatitis  Antiviral medications are recommended in all with chronic hepatitis C, except those with conditions that limit their life expectancy.  There is no specific treatment for NASH; physical activity, a healthy diet, and weight loss are recommended.  Autoimmune hepatitis may be treated with medications to suppress the immune system.  A liver transplant may be an option in both acute and chronic liver failure. Worldwide in 2015, hepatitis A occurred in about 114 million people, chronic hepatitis B affected about 343 million people and chronic hepatitis C about 142 million people.  In the United States, NASH affects about 11 million people and alcoholic hepatitis affects about 5 million people.  Hepatitis results in more than a million deaths a year, most of which occur indirectly from liver scarring or liver cancer Hepatitis Hepatitis",
        "response": "You can prevent hepatitis by practicing good hygiene, avoiding risky behaviors such as sharing needles, having unprotected sex, or drinking contaminated water, and getting vaccinated."
    },
    {
        "dialog": [
            "Hi Medi, I recently had a liver transplant. What should I do now?",
            "Firstly, you need to take immunosuppressive medications to prevent your body from rejecting the new liver.",
            "What else should I do?",
            "It's important to follow a healthy lifestyle, including a balanced diet, regular physical activity, and avoiding alcohol and smoking.",
            "Can I return to my previous job?",
            "It depends on the type of job and your overall health. Your doctor will give you advice on when you can return to work.",
            "What about traveling?",
            "You can travel, but you need to take precautions against infections and you should bring all your medications with you.",
            "What if I have any complications or side effects?"
        ],
        "knowledge": "Hepatitis Hepatitis  Antiviral medications are recommended in all with chronic hepatitis C, except those with conditions that limit their life expectancy.  There is no specific treatment for NASH; physical activity, a healthy diet, and weight loss are recommended.  Autoimmune hepatitis may be treated with medications to suppress the immune system.  A liver transplant may be an option in both acute and chronic liver failure. Worldwide in 2015, hepatitis A occurred in about 114 million people, chronic hepatitis B affected about 343 million people and chronic hepatitis C about 142 million people.  In the United States, NASH affects about 11 million people and alcoholic hepatitis affects about 5 million people.  Hepatitis results in more than a million deaths a year, most of which occur indirectly from liver scarring or liver cancer Hepatitis Hepatitis",
        "response": "You're welcome. If you have any other questions or concerns, feel free to contact your doctor or me again."
    },
    {
        "dialog": [
            "Hey Medi, I have been diagnosed with autoimmune hepatitis. What's next?",
            "You will need medications to suppress your immune system and reduce inflammation in your liver.",
            "What are the side effects of these medications?",
            "These medications can have side effects such as increased risk of infection, weight gain, and bone loss.",
            "Is there anything else I can do to support my liver health?",
            "Yes, physical activity, a healthy diet, and avoiding alcohol and smoking can help support your liver health.",
            "Should I avoid certain foods?",
            "You should avoid fatty, fried, or processed foods and consume more fruits, vegetables, and whole grains.",
            "What if my autoimmune hepatitis progresses?"
        ],
        "knowledge": "Hepatitis Hepatitis  Antiviral medications are recommended in all with chronic hepatitis C, except those with conditions that limit their life expectancy.  There is no specific treatment for NASH; physical activity, a healthy diet, and weight loss are recommended.  Autoimmune hepatitis may be treated with medications to suppress the immune system.  A liver transplant may be an option in both acute and chronic liver failure. Worldwide in 2015, hepatitis A occurred in about 114 million people, chronic hepatitis B affected about 343 million people and chronic hepatitis C about 142 million people.  In the United States, NASH affects about 11 million people and alcoholic hepatitis affects about 5 million people.  Hepatitis results in more than a million deaths a year, most of which occur indirectly from liver scarring or liver cancer Hepatitis Hepatitis",
        "response": "You're welcome. If you have any other questions or concerns, feel free to contact your doctor or me again."
    },
    {
        "dialog": [
            "Hi Medi, I think I might have Hepatitis. What should I do?",
            "Hello! What are your symptoms?",
            "I have been experiencing abdominal pain and fatigue lately.",
            "Based on the symptoms you have described, you might have Hepatitis C. You should get tested to confirm it.",
            "Is Hepatitis treatable?",
            "Yes, antiviral medications are recommended in all with chronic hepatitis C, except those with conditions that limit their life expectancy.",
            "What if I have NASH? Is there any specific treatment?",
            "There is no specific treatment for NASH but physical activity, a healthy diet, and weight loss are recommended.",
            "Thanks, Medi. How can I prevent Hepatitis?"
        ],
        "knowledge": "Hepatitis Hepatitis  Antiviral medications are recommended in all with chronic hepatitis C, except those with conditions that limit their life expectancy.  There is no specific treatment for NASH; physical activity, a healthy diet, and weight loss are recommended.  Autoimmune hepatitis may be treated with medications to suppress the immune system.  A liver transplant may be an option in both acute and chronic liver failure. Worldwide in 2015, hepatitis A occurred in about 114 million people, chronic hepatitis B affected about 343 million people and chronic hepatitis C about 142 million people.  In the United States, NASH affects about 11 million people and alcoholic hepatitis affects about 5 million people.  Hepatitis results in more than a million deaths a year, most of which occur indirectly from liver scarring or liver cancer Hepatitis Hepatitis",
        "response": "You can reduce the risk of getting Hepatitis by avoiding exposure to infected blood, sharing of needles and having unprotected sex."
    }
]