[
    {
        "dialog": [
            "Hi Medi, I am feeling very sick. Can you help me?",
            "I will do my best to help you. Can you tell me your symptoms?",
            "I have a fever, headache, and feel very tired. My throat is sore and my nose is running.",
            "Based on your symptoms, it looks like you may have contracted the flu.",
            "How can I treat this flu?",
            "You can treat it by taking antiviral medications and getting plenty of rest and fluids.",
            "Thanks for your advice, Medi. I will do that.",
            "You're welcome. If your symptoms worsen or persist, please seek medical attention.",
            "Okay, I will do that. Thank you again."
        ],
        "knowledge": "Influenza Influenza The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "You're welcome. If your symptoms worsen or persist, please seek medical attention."
    },
    {
        "dialog": [
            "Hi Medi, I have a question about hepatitis.",
            "Sure, what would you like to know?",
            "What are the common symptoms of hepatitis?",
            "The common symptoms of hepatitis include fever, fatigue, loss of appetite, nausea, vomiting, abdominal pain, dark urine, and jaundice.",
            "How is hepatitis transmitted?",
            "Hepatitis can be transmitted through contact with infected blood or bodily fluids, sharing needles or other injection equipment, unprotected sex, and from mother to child during childbirth.",
            "How can hepatitis be prevented?",
            "Hepatitis can be prevented by practicing safe sex, not sharing needles or other injection equipment, getting vaccinated, and maintaining good hygiene and sanitation practices.",
            "Thank you for your information, Medi. It's very helpful."
        ],
        "knowledge": "Hepatitis Hepatitis After such an eruption, the patient soon raves, becomes angry, talks nonsense and barks like a dog.  Given the poor sanitary conditions of war, infectious jaundice played a large role as a major cause of mortality among troops in the Napoleonic Wars, the American Revolutionary War, and both World Wars.  During World War II, estimates of soldiers affected by hepatitis were upwards of 10 million. During World War II, soldiers received vaccines against diseases such as yellow fever, but these vaccines were stabilized with human serum, presumably contaminated with hepatitis viruses, which often created epidemics of hepatitis.  It was suspected these epidemics were due to a separate infectious agent, and not due to the yellow fever virus itself, after noting 89 cases of jaundice in the months after vaccination out of a total 3,100 patients that were vaccinated.   After changing the seed virus strain, no cases of jaundice were observed in the subsequent 8,000 vaccinations. A New York University researcher named Saul Krugman continued this research into the 1950s and 1960s, most infamously with his experiments on mentally disabled children at the Willowbrook State School in New York, a crowded urban facility where hepatitis infections were highly endemic to the student body Hepatitis Hepatitis",
        "response": "You're welcome. If you have any further questions, don't hesitate to ask."
    },
    {
        "dialog": [
            "Hi Medi, I recently had a medical procedure. Can you give me advice on my diet?",
            "Sure, what kind of procedure did you have?",
            "I had a minor procedure on my leg.",
            "In terms of diet, it's important to eat a balanced diet with plenty of protein, healthy fats, and complex carbohydrates. You should also include plenty of fruits and vegetables in your diet.",
            "What kind of physical activity can I do after the procedure?",
            "You should avoid any strenuous physical activity for at least a few days after the procedure. You can start with light exercises like walking or gentle stretching.",
            "Any advice on lifestyle changes?",
            "It's important to avoid smoking, limit alcohol consumption, and get plenty of rest and relaxation.",
            "Thanks for your advice, Medi. I will keep that in mind."
        ],
        "knowledge": "Minor Procedure Minor Procedure Minor medical procedures can refer to any medical intervention that is minimally invasive.  This can include procedures such as catheterization, biopsies, and endoscopies.  After any medical procedure, it's important to take care of yourself and follow any instructions given to you by your healthcare provider.  This may include recommendations on diet, physical activity, and lifestyle changes.  It's important to follow these recommendations to ensure a smooth recovery Minor Procedure Minor Procedure",
        "response": "You're welcome. If you have any further questions, don't hesitate to ask."
    },
    {
        "dialog": [
            "Hello Medi, I have some symptoms of Hepatitis.",
            "I understand, can you tell me your symptoms?",
            "I have a fever, headache, fatigue, nausea, and my skin and eyes are yellow.",
            "Based on your symptoms, you could have acute or chronic hepatitis.",
            "What should I do next?",
            "You should go to the hospital for further examination and tests to determine the exact type and severity of hepatitis.",
            "Is there anything I can do to prevent hepatitis?",
            "Yes, you can get vaccinated, practice good hygiene, avoid sharing personal items like razors and toothbrushes, and avoid drinking contaminated water or food.",
            "How effective is the vaccine?"
        ],
        "knowledge": "Hepatitis Hepatitis After such an eruption, the patient soon raves, becomes angry, talks nonsense and barks like a dog. \"Given the poor sanitary conditions of war, infectious jaundice played a large role as a major cause of mortality among troops in the Napoleonic Wars, the American Revolutionary War, and both World Wars.  During World War II, estimates of soldiers affected by hepatitis were upwards of 10 million. During World War II, soldiers received vaccines against diseases such as yellow fever, but these vaccines were stabilized with human serum, presumably contaminated with hepatitis viruses, which often created epidemics of hepatitis.  It was suspected these epidemics were due to a separate infectious agent, and not due to the yellow fever virus itself, after noting 89 cases of jaundice in the months after vaccination out of a total 3,100 patients that were vaccinated.   After changing the seed virus strain, no cases of jaundice were observed in the subsequent 8,000 vaccinations. A New York University researcher named Saul Krugman continued this research into the 1950s and 1960s, most infamously with his experiments on mentally disabled children at the Willowbrook State School in New York, a crowded urban facility where hepatitis infections were highly endemic to the student body Hepatitis Hepatitis",
        "response": "The vaccine is very effective in preventing hepatitis, with over 90% efficacy in preventing hepatitis B and 95% efficacy in preventing hepatitis A."
    },
    {
        "dialog": [
            "Hi Medi, I had a medical procedure for my hepatitis. Can you give me some advice on my lifestyle and diet?",
            "Of course, what kind of procedure did you have?",
            "I had a liver transplant.",
            "After a liver transplant, it is important to follow a healthy diet and lifestyle to maintain the health of your new liver.",
            "What kind of diet do you recommend?",
            "You should eat a well-balanced diet with plenty of fruits, vegetables, whole grains, and lean protein. You should also avoid foods that are high in saturated fats, salt, and sugar.",
            "What about physical exercise?",
            "Regular physical activity is also important for maintaining a healthy weight, reducing the risk of other health problems, and improving your overall quality of life. You should consult with your doctor before beginning any exercise program.",
            "Are there any specific foods or activities I should avoid?"
        ],
        "knowledge": "Hepatitis Hepatitis After such an eruption, the patient soon raves, becomes angry, talks nonsense and barks like a dog. \"Given the poor sanitary conditions of war, infectious jaundice played a large role as a major cause of mortality among troops in the Napoleonic Wars, the American Revolutionary War, and both World Wars.  During World War II, estimates of soldiers affected by hepatitis were upwards of 10 million. During World War II, soldiers received vaccines against diseases such as yellow fever, but these vaccines were stabilized with human serum, presumably contaminated with hepatitis viruses, which often created epidemics of hepatitis.  It was suspected these epidemics were due to a separate infectious agent, and not due to the yellow fever virus itself, after noting 89 cases of jaundice in the months after vaccination out of a total 3,100 patients that were vaccinated.   After changing the seed virus strain, no cases of jaundice were observed in the subsequent 8,000 vaccinations. A New York University researcher named Saul Krugman continued this research into the 1950s and 1960s, most infamously with his experiments on mentally disabled children at the Willowbrook State School in New York, a crowded urban facility where hepatitis infections were highly endemic to the student body Hepatitis Hepatitis",
        "response": "You're welcome. Remember that maintaining a healthy diet and lifestyle is essential for the long-term success of your liver transplant."
    },
    {
        "dialog": [
            "Hi Medi, can you explain why hepatitis is so common in military personnel?",
            "Sure, poor sanitary conditions during wartime can increase the risk of infectious diseases, including hepatitis. Additionally, some vaccines given to military personnel have been contaminated with hepatitis viruses, leading to epidemics of hepatitis.",
            "That's interesting. Is there anything being done to prevent hepatitis in the military?",
            "Yes, the military has implemented measures to improve sanitation and hygiene in the field. Vaccines are also routinely given to military personnel to protect against hepatitis and other infectious diseases.",
            "Are there any other factors that increase the risk of hepatitis in military personnel?",
            "Yes, the close living quarters and communal settings of military life can also increase the risk of hepatitis transmission. It is important for military personnel to practice good hygiene and take other precautions to prevent the spread of infectious diseases.",
            "Thanks for the information, Medi."
        ],
        "knowledge": "Hepatitis Hepatitis After such an eruption, the patient soon raves, becomes angry, talks nonsense and barks like a dog. \"Given the poor sanitary conditions of war, infectious jaundice played a large role as a major cause of mortality among troops in the Napoleonic Wars, the American Revolutionary War, and both World Wars.  During World War II, estimates of soldiers affected by hepatitis were upwards of 10 million. During World War II, soldiers received vaccines against diseases such as yellow fever, but these vaccines were stabilized with human serum, presumably contaminated with hepatitis viruses, which often created epidemics of hepatitis.  It was suspected these epidemics were due to a separate infectious agent, and not due to the yellow fever virus itself, after noting 89 cases of jaundice in the months after vaccination out of a total 3,100 patients that were vaccinated.   After changing the seed virus strain, no cases of jaundice were observed in the subsequent 8,000 vaccinations. A New York University researcher named Saul Krugman continued this research into the 1950s and 1960s, most infamously with his experiments on mentally disabled children at the Willowbrook State School in New York, a crowded urban facility where hepatitis infections were highly endemic to the student body Hepatitis Hepatitis",
        "response": "You're welcome. It's important to take precautions to prevent the spread of hepatitis, especially in communal settings like the military."
    },
    {
        "dialog": [
            "Hi Medi, I think I might have Hepatitis, can you help me?",
            "Sure, what symptoms are you experiencing?",
            "I have a rash eruption and I am becoming angry and talking nonsense",
            "Those are common symptoms of Hepatitis. You need to see a healthcare professional immediately.",
            "I have been vaccinated for yellow fever, is it possible that I still got Hepatitis from the vaccine?",
            "Yes, during World War II, soldiers received vaccines against diseases such as yellow fever, but these vaccines were stabilized with human serum, presumably contaminated with hepatitis viruses, which often created epidemics of hepatitis.",
            "What can I do to prevent this from happening again?",
            "Be aware of the vaccines you are given and if they contain human serum, ask for an alternative.",
            "Thank you, Medi. I will definitely keep that in mind."
        ],
        "knowledge": "Hepatitis Hepatitis After such an eruption, the patient soon raves, becomes angry, talks nonsense and barks like a dog. Given the poor sanitary conditions of war, infectious jaundice played a large role as a major cause of mortality among troops in the Napoleonic Wars, the American Revolutionary War, and both World Wars. During World War II, estimates of soldiers affected by hepatitis were upwards of 10 million. During World War II, soldiers received vaccines against diseases such as yellow fever, but these vaccines were stabilized with human serum, presumably contaminated with hepatitis viruses, which often created epidemics of hepatitis. It was suspected these epidemics were due to a separate infectious agent, and not due to the yellow fever virus itself, after noting 89 cases of jaundice in the months after vaccination out of a total 3,100 patients that were vaccinated. After changing the seed virus strain, no cases of jaundice were observed in the subsequent 8,000 vaccinations. A New York University researcher named Saul Krugman continued this research into the 1950s and 1960s, most infamously with his experiments on mentally disabled children at the Willowbrook State School in New York, a crowded urban facility where hepatitis infections were highly endemic to the student body Hepatitis Hepatitis",
        "response": "You're welcome. Remember to always check the vaccines you're given and ask for alternatives if they contain human serum."
    },
    {
        "dialog": [
            "Hi Medi, I just got tested for Hepatitis, can you explain to me what it is?",
            "Sure, Hepatitis is an inflammation of the liver that can be caused by viruses, alcohol, drugs, and autoimmune diseases",
            "What are the symptoms of Hepatitis?",
            "The symptoms can include fatigue, fever, abdominal pain, loss of appetite, and jaundice",
            "What is jaundice?",
            "Jaundice is a yellowing of the skin and the whites of the eyes that occurs when the liver is unable to break down bilirubin, a waste product in the blood",
            "How is Hepatitis treated?",
            "The treatment depends on the cause of Hepatitis. For viral Hepatitis, antiviral medications and lifestyle changes can help. For alcoholic Hepatitis, abstaining from alcohol is key. For autoimmune Hepatitis, corticosteroids may be prescribed.",
            "Thank you for the explanation, Medi. It's very helpful."
        ],
        "knowledge": "Hepatitis HepatitisHepatitis is an inflammation of the liver that can be caused by viruses, alcohol, drugs, and autoimmune diseases. There are five main types of viral hepatitis: A, B, C, D, and E. Symptoms can include fatigue, fever, abdominal pain, loss of appetite, and jaundice. Jaundice is a yellowing of the skin and the whites of the eyes that occurs when the liver is unable to break down bilirubin, a waste product in the blood. Treatment depends on the cause of hepatitis. For viral hepatitis, antiviral medications and lifestyle changes can help. For alcoholic hepatitis, abstaining from alcohol is key. For autoimmune hepatitis, corticosteroids may be prescribed. Hepatitis Hepatitis",
        "response": "You're welcome. I am glad to help."
    },
    {
        "dialog": [
            "Hi Medi, I just had a medical procedure. Can you advise me on what to do next?",
            "Of course, what procedure did you have?",
            "I had a liver biopsy to check for Hepatitis",
            "It's important to rest for the first 24 hours after a liver biopsy. Avoid heavy lifting and strenuous activities for 1 week. Avoid alcohol for at least 24 hours and follow any instructions given by your healthcare provider.",
            "What about my diet?",
            "It's important to eat a healthy diet and drink plenty of fluids after a biopsy. Avoid fatty, greasy, or fried foods and eat small meals throughout the day instead of large meals",
            "Can I exercise?",
            "You can do light exercise such as walking, but avoid anything strenuous for 1 week",
            "Thank you, Medi. I appreciate your advice."
        ],
        "knowledge": "Hepatitis Hepatitis After such an eruption, the patient soon raves, becomes angry, talks nonsense and barks like a dog. Given the poor sanitary conditions of war, infectious jaundice played a large role as a major cause of mortality among troops in the Napoleonic Wars, the American Revolutionary War, and both World Wars. During World War II, estimates of soldiers affected by hepatitis were upwards of 10 million. During World War II, soldiers received vaccines against diseases such as yellow fever, but these vaccines were stabilized with human serum, presumably contaminated with hepatitis viruses, which often created epidemics of hepatitis. It was suspected these epidemics were due to a separate infectious agent, and not due to the yellow fever virus itself, after noting 89 cases of jaundice in the months after vaccination out of a total 3,100 patients that were vaccinated. After changing the seed virus strain, no cases of jaundice were observed in the subsequent 8,000 vaccinations. A New York University researcher named Saul Krugman continued this research into the 1950s and 1960s, most infamously with his experiments on mentally disabled children at the Willowbrook State School in New York, a crowded urban facility where hepatitis infections were highly endemic to the student body Hepatitis Hepatitis",
        "response": "You're welcome. Take care and follow the advice given by your healthcare provider."
    },
    {
        "dialog": [
            "Hello Medi, I am experiencing symptoms of hepatitis",
            "What are your symptoms?",
            "I have a rash, and I feel like I'm going mad, I can't control myself",
            "Hepatitis is a possibility, have you seen a doctor yet?",
            "Yes, I have just been diagnosed with it, what should I do?",
            "You should rest a lot and avoid alcohol and drugs, also have a healthy diet",
            "Is there anything I can take to relieve the symptoms?",
            "Antiviral medication may be prescribed by your doctor depending on the severity",
            "Thank you, Medi. What are some long-term effects of hepatitis?"
        ],
        "knowledge": "Hepatitis Hepatitis After such an eruption, the patient soon raves, becomes angry, talks nonsense and barks like a dog. Given the poor sanitary conditions of war, infectious jaundice played a large role as a major cause of mortality among troops in the Napoleonic Wars, the American Revolutionary War, and both World Wars.  During World War II, estimates of soldiers affected by hepatitis were upwards of 10 million. During World War II, soldiers received vaccines against diseases such as yellow fever, but these vaccines were stabilized with human serum, presumably contaminated with hepatitis viruses, which often created epidemics of hepatitis.  It was suspected these epidemics were due to a separate infectious agent, and not due to the yellow fever virus itself, after noting 89 cases of jaundice in the months after vaccination out of a total 3,100 patients that were vaccinated.   After changing the seed virus strain, no cases of jaundice were observed in the subsequent 8,000 vaccinations. A New York University researcher named Saul Krugman continued this research into the 1950s and 1960s, most infamously with his experiments on mentally disabled children at the Willowbrook State School in New York, a crowded urban facility where hepatitis infections were highly endemic to the student body Hepatitis Hepatitis",
        "response": "Long-term effects may include chronic liver disease, cirrhosis, liver cancer, and even liver failure."
    },
    {
        "dialog": [
            "Hello Medi, I have some questions about hepatitis",
            "Of course, what would you like to know?",
            "What causes hepatitis?",
            "Hepatitis can be caused by viruses, alcohol, drugs, and autoimmune diseases",
            "What are the different types of hepatitis?",
            "There are five main types: A, B, C, D and E.",
            "Are hepatitis B and C curable?",
            "It is possible to cure hepatitis B and C with antiviral medication",
            "Is hepatitis contagious?"
        ],
        "knowledge": "Hepatitis Hepatitis After such an eruption, the patient soon raves, becomes angry, talks nonsense and barks like a dog. Given the poor sanitary conditions of war, infectious jaundice played a large role as a major cause of mortality among troops in the Napoleonic Wars, the American Revolutionary War, and both World Wars.  During World War II, estimates of soldiers affected by hepatitis were upwards of 10 million. During World War II, soldiers received vaccines against diseases such as yellow fever, but these vaccines were stabilized with human serum, presumably contaminated with hepatitis viruses, which often created epidemics of hepatitis.  It was suspected these epidemics were due to a separate infectious agent, and not due to the yellow fever virus itself, after noting 89 cases of jaundice in the months after vaccination out of a total 3,100 patients that were vaccinated.   After changing the seed virus strain, no cases of jaundice were observed in the subsequent 8,000 vaccinations. A New York University researcher named Saul Krugman continued this research into the 1950s and 1960s, most infamously with his experiments on mentally disabled children at the Willowbrook State School in New York, a crowded urban facility where hepatitis infections were highly endemic to the student body Hepatitis Hepatitis",
        "response": "Yes, hepatitis is contagious through blood or body fluids such as semen and vaginal fluid."
    },
    {
        "dialog": [
            "Hello Medi, I recently had a hepatitis procedure, what should I do?",
            "What kind of procedure did you have?",
            "I had a liver biopsy to determine the severity of my hepatitis",
            "You should rest for at least 24 hours after the procedure and avoid any strenuous activities, also avoid driving a car or operating machinery, and drink plenty of fluids",
            "Can I take any medication to relieve the pain?",
            "Yes, your doctor may prescribe painkillers or recommend over-the-counter medication such as acetaminophen",
            "What about my diet?",
            "You should avoid alcohol, fatty foods and stick to a healthy diet with plenty of fruits and vegetables",
            "Got it. How often should I have a liver biopsy?"
        ],
        "knowledge": "Hepatitis Hepatitis After such an eruption, the patient soon raves, becomes angry, talks nonsense and barks like a dog. Given the poor sanitary conditions of war, infectious jaundice played a large role as a major cause of mortality among troops in the Napoleonic Wars, the American Revolutionary War, and both World Wars.  During World War II, estimates of soldiers affected by hepatitis were upwards of 10 million. During World War II, soldiers received vaccines against diseases such as yellow fever, but these vaccines were stabilized with human serum, presumably contaminated with hepatitis viruses, which often created epidemics of hepatitis.  It was suspected these epidemics were due to a separate infectious agent, and not due to the yellow fever virus itself, after noting 89 cases of jaundice in the months after vaccination out of a total 3,100 patients that were vaccinated.   After changing the seed virus strain, no cases of jaundice were observed in the subsequent 8,000 vaccinations. A New York University researcher named Saul Krugman continued this research into the 1950s and 1960s, most infamously with his experiments on mentally disabled children at the Willowbrook State School in New York, a crowded urban facility where hepatitis infections were highly endemic to the student body Hepatitis Hepatitis",
        "response": "It depends on the severity of your hepatitis and your doctor's recommendations, usually it is done every few months or as needed."
    },
    {
        "dialog": [
            "Hello Medi, I have some symptoms and need your help.",
            "Of course, I'm here to help you. What are your symptoms?",
            "I feel very tired and have a fever. My skin and eyes are yellow.",
            "Hmm, based on your symptoms, it seems that you have jaundice that is caused by hepatitis.",
            "What is hepatitis?",
            "Hepatitis is an inflammation of the liver caused by a viral infection or exposure to harmful substances such as alcohol or drugs.",
            "How can I treat it?",
            "It depends on the cause of your hepatitis. You should see a doctor for proper diagnosis and treatment.",
            "I see. Thank you, Medi."
        ],
        "knowledge": "Hepatitis Hepatitis After such an eruption, the patient soon raves, becomes angry, talks nonsense and barks like a dog. 'Given the poor sanitary conditions of war, infectious jaundice played a large role as a major cause of mortality among troops in the Napoleonic Wars, the American Revolutionary War, and both World Wars.  During World War II, estimates of soldiers affected by hepatitis were upwards of 10 million. During World War II, soldiers received vaccines against diseases such as yellow fever, but these vaccines were stabilized with human serum, presumably contaminated with hepatitis viruses, which often created epidemics of hepatitis.  It was suspected these epidemics were due to a separate infectious agent, and not due to the yellow fever virus itself, after noting 89 cases of jaundice in the months after vaccination out of a total 3,100 patients that were vaccinated.   After changing the seed virus strain, no cases of jaundice were observed in the subsequent 8,000 vaccinations. A New York University researcher named Saul Krugman continued this research into the 1950s and 1960s, most infamously with his experiments on mentally disabled children at the Willowbrook State School in New York, a crowded urban facility where hepatitis infections were highly endemic to the student body Hepatitis Hepatitis",
        "response": "You're welcome. Don't hesitate to see a doctor for proper diagnosis and treatment."
    },
    {
        "dialog": [
            "Hi Medi, I have some questions about hepatitis.",
            "Of course, I'm here to provide you with information about hepatitis. What do you want to know?",
            "What are the types of hepatitis?",
            "There are five types of hepatitis: A, B, C, D, and E.",
            "How do you get hepatitis?",
            "You can get hepatitis from contaminated food or water, sharing needles or other drug paraphernalia, unprotected sex with an infected partner, or from mother to baby during childbirth.",
            "Is there a vaccine for hepatitis?",
            "Yes, there are vaccines for hepatitis A and B that can help prevent infection.",
            "I see. Thank you, Medi."
        ],
        "knowledge": "Hepatitis Hepatitis After such an eruption, the patient soon raves, becomes angry, talks nonsense and barks like a dog. 'Given the poor sanitary conditions of war, infectious jaundice played a large role as a major cause of mortality among troops in the Napoleonic Wars, the American Revolutionary War, and both World Wars.  During World War II, estimates of soldiers affected by hepatitis were upwards of 10 million. During World War II, soldiers received vaccines against diseases such as yellow fever, but these vaccines were stabilized with human serum, presumably contaminated with hepatitis viruses, which often created epidemics of hepatitis.  It was suspected these epidemics were due to a separate infectious agent, and not due to the yellow fever virus itself, after noting 89 cases of jaundice in the months after vaccination out of a total 3,100 patients that were vaccinated.   After changing the seed virus strain, no cases of jaundice were observed in the subsequent 8,000 vaccinations. A New York University researcher named Saul Krugman continued this research into the 1950s and 1960s, most infamously with his experiments on mentally disabled children at the Willowbrook State School in New York, a crowded urban facility where hepatitis infections were highly endemic to the student body Hepatitis Hepatitis",
        "response": "You're welcome. Don't hesitate to see a doctor if you feel you may have hepatitis."
    },
    {
        "dialog": [
            "Hello Medi, I recently had a medical procedure and need advice on my diet and physical activity.",
            "Sure, I'm here to provide you with that information. What medical procedure did you have?",
            "I had a liver biopsy.",
            "After a liver biopsy, you should avoid any heavy lifting or strenuous physical activity for at least one week and avoid alcohol for at least 24 hours. You should also eat a light meal before your biopsy and avoid fatty or greasy foods for a few days after the procedure. It's important to drink plenty of fluids to help flush the contrast dye from your body.",
            "What kind of physical activity should I do?",
            "You should avoid any heavy lifting or strenuous physical activity for at least one week after your biopsy, but light exercise such as walking is encouraged.",
            "What should I eat?",
            "You should eat a light meal before your biopsy and avoid fatty or greasy foods for a few days after the procedure. Stick to a healthy, balanced diet rich in fruits, vegetables, and whole grains to promote healing.",
            "Thank you, Medi. That's very helpful."
        ],
        "knowledge": "Hepatitis Hepatitis After such an eruption, the patient soon raves, becomes angry, talks nonsense and barks like a dog. 'Given the poor sanitary conditions of war, infectious jaundice played a large role as a major cause of mortality among troops in the Napoleonic Wars, the American Revolutionary War, and both World Wars.  During World War II, estimates of soldiers affected by hepatitis were upwards of 10 million. During World War II, soldiers received vaccines against diseases such as yellow fever, but these vaccines were stabilized with human serum, presumably contaminated with hepatitis viruses, which often created epidemics of hepatitis.  It was suspected these epidemics were due to a separate infectious agent, and not due to the yellow fever virus itself, after noting 89 cases of jaundice in the months after vaccination out of a total 3,100 patients that were vaccinated.   After changing the seed virus strain, no cases of jaundice were observed in the subsequent 8,000 vaccinations. A New York University researcher named Saul Krugman continued this research into the 1950s and 1960s, most infamously with his experiments on mentally disabled children at the Willowbrook State School in New York, a crowded urban facility where hepatitis infections were highly endemic to the student body Hepatitis Hepatitis",
        "response": "You're welcome. Don't hesitate to contact your doctor if you have any concerns or questions about your recovery."
    },
    {
        "dialog": [
            "Hello Medi, I have some symptoms and I want to know what I am suffering from.",
            "Please tell me what your symptoms are so I can help you better.",
            "I feel very tired and nauseous, my stomach hurts and I have a fever.",
            "Based on your symptoms, you may have viral hepatitis. You should consult with a doctor to confirm the diagnosis.",
            "What is viral hepatitis and how can I get it?",
            "Viral hepatitis is an infection of the liver caused by viruses. You can get it from contaminated food or water, contact with infected blood, or sexual contact with an infected person.",
            "Is there a way to prevent it?",
            "Yes, you can prevent it by practicing good hygiene, avoiding contact with infected blood, using a condom during sexual intercourse, and getting vaccinated if available.",
            "Thank you Medi, I will go to the doctor for a diagnosis."
        ],
        "knowledge": "Hepatitis Hepatitis After such an eruption, the patient soon raves, becomes angry, talks nonsense and barks like a dog. \"Given the poor sanitary conditions of war, infectious jaundice played a large role as a major cause of mortality among troops in the Napoleonic Wars, the American Revolutionary War, and both World Wars.  During World War II, estimates of soldiers affected by hepatitis were upwards of 10 million. During World War II, soldiers received vaccines against diseases such as yellow fever, but these vaccines were stabilized with human serum, presumably contaminated with hepatitis viruses, which often created epidemics of hepatitis.  It was suspected these epidemics were due to a separate infectious agent, and not due to the yellow fever virus itself, after noting 89 cases of jaundice in the months after vaccination out of a total 3,100 patients that were vaccinated.   After changing the seed virus strain, no cases of jaundice were observed in the subsequent 8,000 vaccinations. A New York University researcher named Saul Krugman continued this research into the 1950s and 1960s, most infamously with his experiments on mentally disabled children at the Willowbrook State School in New York, a crowded urban facility where hepatitis infections were highly endemic to the student body Hepatitis Hepatitis",
        "response": "You're welcome. Don't forget to follow up with your doctor."
    },
    {
        "dialog": [
            "Hi Medi, I just had a medical procedure and I want to know what I should do for a fast recovery.",
            "What kind of procedure did you have? Knowing this will help me better advise you.",
            "I had surgery on my knee for a torn ligament.",
            "After your surgery, you should rest, ice your knee, and keep it elevated. You should also take your pain medication as prescribed and keep your wound clean and dry.",
            "How long will it take for me to recover?",
            "Recovery time varies depending on the individual and the type of surgery. Your doctor will give you a better estimate based on your specific case.",
            "Are there any exercises I can do after surgery?",
            "Yes, your doctor will provide you with some exercises to help with your recovery. It's important to follow their advice and not overdo it.",
            "Thank you for your advice, Medi."
        ],
        "knowledge": "Medical Procedure Medical Procedure A medical procedure is a course of action intended to achieve a result in the delivery of healthcare treatment. A medical procedure with the intention of determining, measuring, or diagnosing a patient condition or parameter is also called a medical test. A medical procedure with the intended therapeutic effect of improving a condition is also called a medical intervention. A surgical procedure is a medical procedure involving an incision with instruments; performed to repair damage or arrest disease in a living body. Medical Procedure Medical Procedure",
        "response": "You're welcome. I hope you have a speedy recovery."
    },
    {
        "dialog": [
            "Hello Medi, I want to know more about the vaccine for hepatitis.",
            "Sure, I can help with that. What specifically do you want to know?",
            "I want to know how the vaccine works and if it's effective.",
            "The vaccine works by introducing a small amount of the virus into your body, which triggers your immune system to produce antibodies to fight the virus. It's been found to be highly effective in preventing hepatitis B, with at least a 90% success rate.",
            "Are there any side effects?",
            "The vaccine is generally safe, but some people may experience mild side effects such as soreness at the injection site, fever, and fatigue.",
            "Can anyone get the vaccine?",
            "Most people can get the vaccine, but it's not recommended for those who have had an allergic reaction to a previous dose or have a severe allergy to yeast.",
            "Thank you for your help, Medi."
        ],
        "knowledge": "Hepatitis Vaccine Hepatitis Vaccine The hepatitis B vaccine is a vaccine that prevents hepatitis B. The first dose is recommended within 24 hours of birth with either two or three more doses given after that. This includes those with poor immune function such as from HIV/AIDS and those born premature. It is also recommended for healthcare workers to be vaccinated. In healthy people routine immunization results in more than 90% of people being protected. In some countries, the vaccine is also recommended for at-risk groups such as adults with high-risk sexual behavior, injection drug users, and healthcare workers who are not otherwise immune. Hepatitis Vaccine Hepatitis Vaccine",
        "response": "You're welcome. If you have any other questions, feel free to ask."
    },
    {
        "dialog": [
            "Hi Medi, I think I have hepatitis. What should I do?",
            "Hello! Could you please tell me about your symptoms?",
            "I have fever, fatigue, abdominal pain, and dark urine.",
            "Okay! Based on your symptoms, it can be hepatitis. I suggest you see a doctor and get some tests.",
            "Can you tell me more about hepatitis?",
            "Hepatitis is an inflammation of the liver that can be caused by various factors such as viruses, toxins, and alcohol. Hepatitis A, B, and C viruses are the most common causes of viral hepatitis.",
            "How can I prevent hepatitis?",
            "You can prevent hepatitis by getting vaccinated, practicing good hygiene, avoiding risky behaviors, and not sharing needles or razors with others.",
            "Thank you, Medi. What is the treatment for hepatitis?"
        ],
        "knowledge": "Hepatitis Hepatitis After such an eruption, the patient soon raves, becomes angry, talks nonsense, and barks like a dog. Given the poor sanitary conditions of war, infectious jaundice played a large role as a major cause of mortality among troops in the Napoleonic Wars, the American Revolutionary War, and both World Wars. During World War II, estimates of soldiers affected by hepatitis were upwards of 10 million. During World War II, soldiers received vaccines against diseases such as yellow fever, but these vaccines were stabilized with human serum, presumably contaminated with hepatitis viruses, which often created epidemics of hepatitis. It was suspected these epidemics were due to a separate infectious agent, and not due to the yellow fever virus itself, after noting 89 cases of jaundice in the months after vaccination out of a total 3,100 patients that were vaccinated. After changing the seed virus strain, no cases of jaundice were observed in the subsequent 8,000 vaccinations. A New York University researcher named Saul Krugman continued this research into the 1950s and 1960s, most infamously with his experiments on mentally disabled children at the Willowbrook State School in New York, a crowded urban facility where hepatitis infections were highly endemic to the student body Hepatitis Hepatitis",
        "response": "The treatment for hepatitis depends on the type and severity of hepatitis. Some cases resolve on their own, while others may require antiviral medications or a liver transplant."
    },
    {
        "dialog": [
            "Hi Medi, I want to know more about jaundice. What is it?",
            "Hello! Jaundice is a symptom of many liver diseases, including hepatitis. It is caused by a buildup of bilirubin, a waste product of red blood cells that is normally processed by the liver.",
            "What are the symptoms of jaundice?",
            "The symptoms of jaundice include yellowing of the skin and whites of the eyes, dark urine, pale stools, fatigue, and abdominal pain.",
            "What causes jaundice?",
            "Jaundice can be caused by various factors such as viral hepatitis, alcohol abuse, and liver damage from medications or toxins.",
            "Can jaundice be prevented?",
            "Yes, jaundice can be prevented by maintaining a healthy lifestyle, avoiding alcohol and drugs, getting vaccinated for hepatitis, and avoiding exposure to toxins.",
            "Thank you, Medi. How is jaundice treated?"
        ],
        "knowledge": "Hepatitis Hepatitis After such an eruption, the patient soon raves, becomes angry, talks nonsense, and barks like a dog. Given the poor sanitary conditions of war, infectious jaundice played a large role as a major cause of mortality among troops in the Napoleonic Wars, the American Revolutionary War, and both World Wars. During World War II, estimates of soldiers affected by hepatitis were upwards of 10 million. During World War II, soldiers received vaccines against diseases such as yellow fever, but these vaccines were stabilized with human serum, presumably contaminated with hepatitis viruses, which often created epidemics of hepatitis. It was suspected these epidemics were due to a separate infectious agent, and not due to the yellow fever virus itself, after noting 89 cases of jaundice in the months after vaccination out of a total 3,100 patients that were vaccinated. After changing the seed virus strain, no cases of jaundice were observed in the subsequent 8,000 vaccinations. A New York University researcher named Saul Krugman continued this research into the 1950s and 1960s, most infamously with his experiments on mentally disabled children at the Willowbrook State School in New York, a crowded urban facility where hepatitis infections were highly endemic to the student body Hepatitis Hepatitis",
        "response": "Jaundice is treated by addressing its underlying cause. Treatment may include medications, lifestyle changes, and avoiding alcohol and drugs."
    },
    {
        "dialog": [
            "Hi Medi, I recently had a liver biopsy. What should I do now?",
            "Hello! After a liver biopsy, you should take it easy for a few days and avoid any strenuous activities or heavy lifting.",
            "How should I care for the biopsy site?",
            "You should keep the biopsy site clean and dry and avoid swimming or soaking in water for a few days.",
            "What should I watch for after the biopsy?",
            "You should watch for any signs of infection such as fever, chills, or redness and swelling at the biopsy site.",
            "Can you give me some advice on my diet after the biopsy?",
            "Yes, a healthy diet is important after a liver biopsy. You should avoid alcohol and fatty foods and focus on eating a balanced diet with plenty of fruits, vegetables, and lean proteins.",
            "Thank you, Medi. Can I resume my normal activities after the biopsy?"
        ],
        "knowledge": "Hepatitis Hepatitis After such an eruption, the patient soon raves, becomes angry, talks nonsense, and barks like a dog. Given the poor sanitary conditions of war, infectious jaundice played a large role as a major cause of mortality among troops in the Napoleonic Wars, the American Revolutionary War, and both World Wars. During World War II, estimates of soldiers affected by hepatitis were upwards of 10 million. During World War II, soldiers received vaccines against diseases such as yellow fever, but these vaccines were stabilized with human serum, presumably contaminated with hepatitis viruses, which often created epidemics of hepatitis. It was suspected these epidemics were due to a separate infectious agent, and not due to the yellow fever virus itself, after noting 89 cases of jaundice in the months after vaccination out of a total 3,100 patients that were vaccinated. After changing the seed virus strain, no cases of jaundice were observed in the subsequent 8,000 vaccinations. A New York University researcher named Saul Krugman continued this research into the 1950s and 1960s, most infamously with his experiments on mentally disabled children at the Willowbrook State School in New York, a crowded urban facility where hepatitis infections were highly endemic to the student body Hepatitis Hepatitis",
        "response": "You should avoid any strenuous activities or heavy lifting for a few days after the biopsy, but other activities can be resumed as normal."
    },
    {
        "dialog": [
            "Hello Medi, I am feeling very sick and nauseous.",
            "Hi there, sorry to hear that. Can you tell me more about your symptoms?",
            "I have been feeling nauseous for a few days and have also been experiencing abdominal pain.",
            "I see. Have you been eating anything unusual or have any known food allergies?",
            "Not that I can think of. I've been trying to eat healthy and haven't had any new foods.",
            "Okay, it's possible that you have gastroenteritis. I suggest you rest and drink plenty of fluids.",
            "Thank you, Medi. Should I go see a doctor?",
            "If your symptoms persist or worsen, it's best to see a doctor for further evaluation.",
            "Okay, I will keep that in mind. Thank you for your help."
        ],
        "knowledge": "Gastroenteritis Gastroenteritis is an inflammation of the stomach and intestines that typically results in vomiting and diarrhea. It is caused by a viral or bacterial infection, often spread through contaminated food or water. Symptoms can include nausea, vomiting, diarrhea, abdominal pain and cramps, fever, chills, and muscle aches. Treatment typically involves rest and hydration, and in some cases, medication to relieve symptoms. If symptoms persist or worsen, it is important to seek medical attention.",
        "response": "You're welcome. If your symptoms persist or worsen, it's best to see a doctor for further evaluation."
    },
    {
        "dialog": [
            "Hi Medi, I have been experiencing fatigue and joint pain lately.",
            "Hello there. Can you tell me more about your symptoms?",
            "I have been feeling very tired lately and have also been having pain in my wrists and knees.",
            "I see. How long have you been experiencing these symptoms?",
            "For about a week now.",
            "Based on your symptoms, it's possible that you have rheumatoid arthritis. I suggest you see a doctor for further evaluation.",
            "What is rheumatoid arthritis?",
            "Rheumatoid arthritis is a chronic autoimmune disorder that causes inflammation and pain in the joints. It can lead to stiffness, swelling, and difficulty with movement. It's important to see a doctor for proper diagnosis and treatment.",
            "Okay, I will make an appointment with my doctor. Thank you for your help."
        ],
        "knowledge": "Rheumatoid Arthritis Rheumatoid arthritis is a chronic autoimmune disorder that causes inflammation and pain in the joints. It can lead to stiffness, swelling, and difficulty with movement. The cause of rheumatoid arthritis is unknown, but it is thought to involve a combination of genetic and environmental factors. There is currently no cure for rheumatoid arthritis, but treatment options can help manage symptoms and slow the progression of the disease. These include medication, physical therapy, and lifestyle changes. It's important to see a doctor for proper diagnosis and treatment.",
        "response": "Rheumatoid arthritis is a chronic autoimmune disorder that causes inflammation and pain in the joints. It's important to see a doctor for proper diagnosis and treatment."
    },
    {
        "dialog": [
            "Hey Medi, I recently had a medical procedure and was wondering if you had any advice for my recovery.",
            "Of course, I'm happy to help. Can you tell me what procedure you had?",
            "I had a minor surgery on my knee.",
            "Okay, after any surgery, it's important to rest and allow your body to heal. I suggest you avoid strenuous activity and follow your doctor's instructions.",
            "How long should I expect to be in recovery?",
            "It depends on the type of surgery and your individual healing process. Your doctor should be able to give you a better estimate.",
            "Are there any exercises or stretches I can do to help with my recovery?",
            "Yes, your doctor may recommend physical therapy exercises or stretches to help improve your range of motion and strengthen your muscles.",
            "Okay, I will be sure to follow their instructions. Thank you for your help, Medi."
        ],
        "knowledge": "Recovery from Surgery Recovery from surgery can vary based on the type of procedure and the individual's healing process. In general, it's important to rest and allow your body to heal, and to follow your doctor's instructions for recovery. This may include avoiding strenuous activity, taking medication as prescribed, and attending physical therapy or follow-up appointments. Your doctor may recommend exercises or stretches to help improve your range of motion and strengthen your muscles. It's important to be patient and allow yourself time to recover properly.",
        "response": "Your doctor may recommend physical therapy exercises or stretches to help improve your range of motion and strengthen your muscles. It's important to follow their instructions and allow yourself time to recover properly."
    }
]