[
    {
        "dialog": [
            "Hi Medi, I am feeling unwell and I think I might have the flu",
            "I am sorry to hear that, what are your symptoms?",
            "I have a sore throat, coughing, and I am feeling really tired",
            "Based on your symptoms, it's quite possible that you have the flu",
            "What should I do to feel better?",
            "You should rest, drink plenty of fluids, and take over-the-counter pain medication like paracetamol",
            "Is there anything else I should be aware of?",
            "If you have a fever that lasts more than three days, or if your symptoms become worse, you should see a doctor",
            "Thank you. How can I prevent the flu in the future?"
        ],
        "knowledge": "Influenza Influenza The reported number of influenza cases is usually much lower than the actual number of cases. During seasonal epidemics, it is estimated that about 80% of otherwise healthy people who have a cough or sore throat have the flu. Approximately 30–40% of people hospitalized for influenza develop pneumonia, and about 5% of all severe pneumonia cases in hospitals are due to influenza, which is also the most common cause of ARDS in adults. In children, influenza is one of the two most common causes of ARDS, the other being the respiratory syncytial virus. About 3–5% of children each year develop otitis media due to influenza. Adults who develop organ failure from influenza and children who have PIM scores and acute renal failure have higher rates of mortality. During seasonal influenza, mortality is concentrated in the very young and the elderly, whereas during flu pandemics, young adults are often affected at a high rate Influenza Influenza",
        "response": "You can prevent the flu by getting an annual flu shot and practicing good hygiene, such as washing your hands regularly."
    },
    {
        "dialog": [
            "Hello Medi, I have a question about the flu",
            "Sure, what would you like to know?",
            "Can you explain to me the difference between the flu and a cold?",
            "The flu and a cold are both respiratory illnesses, but they are caused by different viruses. The flu is usually more severe than a cold, and it can cause more serious complications like pneumonia",
            "What are the symptoms of a cold?",
            "The symptoms of a cold are usually milder than the flu. You might have a runny nose, sneezing, and a sore throat, but you won't usually have a high fever or body aches like you would with the flu",
            "Thank you, that's helpful. Is there anything I can do to treat a cold?",
            "You should rest, drink plenty of fluids, and take over-the-counter medication like paracetamol to relieve your symptoms",
            "Got it. How long does a cold usually last?"
        ],
        "knowledge": "Influenza Influenza The reported number of influenza cases is usually much lower than the actual number of cases. During seasonal epidemics, it is estimated that about 80% of otherwise healthy people who have a cough or sore throat have the flu. Approximately 30–40% of people hospitalized for influenza develop pneumonia, and about 5% of all severe pneumonia cases in hospitals are due to influenza, which is also the most common cause of ARDS in adults. In children, influenza is one of the two most common causes of ARDS, the other being the respiratory syncytial virus. About 3–5% of children each year develop otitis media due to influenza. Adults who develop organ failure from influenza and children who have PIM scores and acute renal failure have higher rates of mortality. During seasonal influenza, mortality is concentrated in the very young and the elderly, whereas during flu pandemics, young adults are often affected at a high rate Influenza Influenza",
        "response": "You're welcome. If you have any other questions, feel free to ask"
    },
    {
        "dialog": [
            "Hi Medi, I recently had the flu and I'm wondering if there's anything I can do to build up my immunity",
            "Yes, there are a few things you can do to boost your immune system",
            "What are they?",
            "You can eat a healthy diet, get regular exercise, and make sure you're getting enough sleep. It's also a good idea to avoid stress and get vaccinated against the flu each year",
            "That's good to know. Are there any specific foods that can help boost my immune system?",
            "Yes, foods that are high in vitamin C, vitamin D, and zinc can all help support your immune system. This includes things like citrus fruits, leafy greens, and nuts and seeds",
            "Thanks for the information. Is there anything I should avoid doing?",
            "You should try to avoid smoking and drinking too much alcohol, as these things can weaken your immune system",
            "Got it. Thanks for your help, Medi"
        ],
        "knowledge": "Influenza Influenza The reported number of influenza cases is usually much lower than the actual number of cases. During seasonal epidemics, it is estimated that about 80% of otherwise healthy people who have a cough or sore throat have the flu. Approximately 30–40% of people hospitalized for influenza develop pneumonia, and about 5% of all severe pneumonia cases in hospitals are due to influenza, which is also the most common cause of ARDS in adults. In children, influenza is one of the two most common causes of ARDS, the other being the respiratory syncytial virus. About 3–5% of children each year develop otitis media due to influenza. Adults who develop organ failure from influenza and children who have PIM scores and acute renal failure have higher rates of mortality. During seasonal influenza, mortality is concentrated in the very young and the elderly, whereas during flu pandemics, young adults are often affected at a high rate Influenza Influenza",
        "response": "You're welcome. I'm glad I could help"
    },
    {
        "dialog": [
            "Hello Medi, I am not feeling well. My throat hurts and I have a cough.",
            "I'm sorry to hear that. It sounds like you may have the flu.",
            "What should I do? I'm really worried.",
            "It's important to get plenty of rest, drink plenty of fluids, and take over-the-counter pain relievers as needed.",
            "Should I see a doctor?",
            "It's not always necessary, but you should see a doctor if your symptoms worsen or you develop a high fever.",
            "Okay, thank you for your help Medi.",
            "You're welcome. Take care and get plenty of rest.",
            "How can I prevent the flu in the future?"
        ],
        "knowledge": "Influenza Influenza  The reported number of influenza cases is usually much lower than the actual number of cases. During seasonal epidemics, it is estimated that about 80% of otherwise healthy people who have a cough or sore throat have the flu.  Approximately 30–40% of people hospitalized for influenza develop pneumonia, and about 5% of all severe pneumonia cases in hospitals are due to influenza, which is also the most common cause of ARDS in adults.  In children, influenza is one of the two most common causes of ARDS, the other being the respiratory syncytial virus.  About 3–5% of children each year develop otitis media due to influenza.  Adults who develop organ failure from influenza and children who have PIM scores and acute renal failure have higher rates of mortality.  During seasonal influenza, mortality is concentrated in the very young and the elderly, whereas during flu pandemics, young adults are often affected at a high rate Influenza Influenza",
        "response": "You can prevent the flu in the future by getting an annual flu vaccine, washing your hands regularly, and avoiding close contact with individuals who have flu-like symptoms."
    },
    {
        "dialog": [
            "Hi Medi, I have a sore throat and a fever. Do I have the flu?",
            "It's possible, but there are many different illnesses that can cause those symptoms. Do you have any other symptoms?",
            "Yes, I also have a cough and body aches.",
            "Based on those symptoms, it's likely that you have the flu.",
            "What should I do?",
            "It's important to get plenty of rest, drink plenty of fluids, and take over-the-counter pain relievers as needed.",
            "Should I see a doctor?",
            "You should see a doctor if your symptoms worsen or you develop a high fever.",
            "Thank you for your help Medi. I'll take your advice."
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "The flu is very contagious, especially in the first 3-4 days after symptoms begin. You can spread the virus to others even if you don't feel sick."
    },
    {
        "dialog": [
            "Hello Medi, I just got over the flu. How can I stay healthy?",
            "It's important to practice good hygiene, such as washing your hands regularly and covering your mouth and nose when you cough or sneeze.",
            "What about my diet?",
            "Your diet should include plenty of fruits and vegetables, whole grains, lean protein, and healthy fats.",
            "What kind of exercise should I do?",
            "Moderate exercise, such as brisk walking or cycling, is a great way to stay healthy. You should aim for at least 30 minutes of exercise per day.",
            "Thank you for your advice, Medi.",
            "You're welcome. Take care and stay healthy.",
            "How long should I wait before I get the flu vaccine?"
        ],
        "knowledge": "Influenza Influenza  The reported number of influenza cases is usually much lower than the actual number of cases. During seasonal epidemics, it is estimated that about 80% of otherwise healthy people who have a cough or sore throat have the flu.  Approximately 30–40% of people hospitalized for influenza develop pneumonia, and about 5% of all severe pneumonia cases in hospitals are due to influenza, which is also the most common cause of ARDS in adults.  In children, influenza is one of the two most common causes of ARDS, the other being the respiratory syncytial virus.  About 3–5% of children each year develop otitis media due to influenza.  Adults who develop organ failure from influenza and children who have PIM scores and acute renal failure have higher rates of mortality.  During seasonal influenza, mortality is concentrated in the very young and the elderly, whereas during flu pandemics, young adults are often affected at a high rate Influenza Influenza",
        "response": "You should get the flu vaccine as soon as it becomes available in your area, which is usually in the fall."
    },
    {
        "dialog": [
            "Hi Medi, I am coughing and feeling tired",
            "Hi, sorry to hear that. How long have you been coughing?",
            "I have been coughing for about two days",
            "Do you also have a fever or sore throat?",
            "Yes, I have a slight fever and sore throat",
            "It seems like you might have the flu. I would recommend resting and drinking fluids",
            "Thanks, but is there anything else I can do to relieve my symptoms?",
            "You can take over-the-counter medicine for fever and pain relief",
            "What kind of medicine do you recommend?"
        ],
        "knowledge": "Influenza Influenza  The reported number of influenza cases is usually much lower than the actual number of cases. During seasonal epidemics, it is estimated that about 80% of otherwise healthy people who have a cough or sore throat have the flu.  Approximately 30–40% of people hospitalized for influenza develop pneumonia, and about 5% of all severe pneumonia cases in hospitals are due to influenza, which is also the most common cause of ARDS in adults.  In children, influenza is one of the two most common causes of ARDS, the other being the respiratory syncytial virus.  About 3–5% of children each year develop otitis media due to influenza.  Adults who develop organ failure from influenza and children who have PIM scores and acute renal failure have higher rates of mortality.  During seasonal influenza, mortality is concentrated in the very young and the elderly, whereas during flu pandemics, young adults are often affected at a high rate Influenza Influenza",
        "response": "I recommend taking over-the-counter medicine for fever and pain relief"
    },
    {
        "dialog": [
            "Hi Medi, I have a question about flu",
            "Hi, what would you like to know?",
            "What are common symptoms of the flu?",
            "Common symptoms of the flu include fever, cough, sore throat, runny or stuffy nose, body aches, headache, chills, and fatigue",
            "What should I do if I suspect I have the flu?",
            "If you suspect you have the flu, you should stay home, rest, and drink plenty of fluids. You should also avoid close contact with other people to prevent spreading the virus",
            "What else can I do to prevent getting the flu?",
            "You can also get a flu vaccine, practice good hand hygiene, and avoid close contact with sick people",
            "When is the flu season?"
        ],
        "knowledge": "Influenza Influenza  The reported number of influenza cases is usually much lower than the actual number of cases. During seasonal epidemics, it is estimated that about 80% of otherwise healthy people who have a cough or sore throat have the flu.  Approximately 30–40% of people hospitalized for influenza develop pneumonia, and about 5% of all severe pneumonia cases in hospitals are due to influenza, which is also the most common cause of ARDS in adults.  In children, influenza is one of the two most common causes of ARDS, the other being the respiratory syncytial virus.  About 3–5% of children each year develop otitis media due to influenza.  Adults who develop organ failure from influenza and children who have PIM scores and acute renal failure have higher rates of mortality.  During seasonal influenza, mortality is concentrated in the very young and the elderly, whereas during flu pandemics, young adults are often affected at a high rate Influenza Influenza",
        "response": "Flu season typically runs from October to May, with peak activity in December to February"
    },
    {
        "dialog": [
            "Hi Medi, I recently recovered from the flu, what should I do now?",
            "Hi, I'm glad to hear you're feeling better. It's important to continue to rest and drink plenty of fluids",
            "What about physical activity?",
            "You can gradually increase your physical activity as you start to feel better, but don't overdo it. Listen to your body and rest if you start to feel tired",
            "What about my diet?",
            "It's important to eat a healthy, balanced diet to help your body recover. You should also avoid alcohol and tobacco, as they can weaken your immune system",
            "Thanks, what else can I do to prevent getting sick again?",
            "You can also practice good hand hygiene, avoid close contact with sick people, and get a flu vaccine for next season",
            "When should I get the flu vaccine?"
        ],
        "knowledge": "Influenza Influenza  The reported number of influenza cases is usually much lower than the actual number of cases. During seasonal epidemics, it is estimated that about 80% of otherwise healthy people who have a cough or sore throat have the flu.  Approximately 30–40% of people hospitalized for influenza develop pneumonia, and about 5% of all severe pneumonia cases in hospitals are due to influenza, which is also the most common cause of ARDS in adults.  In children, influenza is one of the two most common causes of ARDS, the other being the respiratory syncytial virus.  About 3–5% of children each year develop otitis media due to influenza.  Adults who develop organ failure from influenza and children who have PIM scores and acute renal failure have higher rates of mortality.  During seasonal influenza, mortality is concentrated in the very young and the elderly, whereas during flu pandemics, young adults are often affected at a high rate Influenza Influenza",
        "response": "You should get the flu vaccine before flu season starts, which is typically in October"
    },
    {
        "dialog": [
            "Hello Medi, I'm feeling unwell and I'm not sure what's wrong.",
            "I'm sorry to hear that. Could you please describe your symptoms?",
            "I have a fever, cough, and body aches.",
            "Based on your symptoms, it's possible that you have the flu.",
            "What should I do?",
            "It's important to rest, stay hydrated, and take over-the-counter medication for your symptoms.",
            "Okay, thank you. How can I prevent getting the flu in the future?",
            "Washing your hands frequently and getting a flu shot annually can help prevent getting the flu.",
            "Thank you, Medi."
        ],
        "knowledge": "Influenza Influenza  The reported number of influenza cases is usually much lower than the actual number of cases. During seasonal epidemics, it is estimated that about 80% of otherwise healthy people who have a cough or sore throat have the flu.  Approximately 30–40% of people hospitalized for influenza develop pneumonia, and about 5% of all severe pneumonia cases in hospitals are due to influenza, which is also the most common cause of ARDS in adults.  In children, influenza is one of the two most common causes of ARDS, the other being the respiratory syncytial virus.  About 3–5% of children each year develop otitis media due to influenza.  Adults who develop organ failure from influenza and children who have PIM scores and acute renal failure have higher rates of mortality.  During seasonal influenza, mortality is concentrated in the very young and the elderly, whereas during flu pandemics, young adults are often affected at a high rate Influenza Influenza",
        "response": "You're welcome. Please take care and get plenty of rest to help you recover from the flu."
    },
    {
        "dialog": [
            "Hello Medi, I've been feeling really tired lately and I'm not sure why.",
            "I'm sorry to hear that. Could you give me some more information about your fatigue?",
            "I feel like I don't have any energy, even if I get enough sleep. I've also been experiencing headaches and muscle pain.",
            "There are many possible causes of fatigue, but given your other symptoms, it's possible that you have the flu.",
            "What should I do?",
            "It's important to rest and stay hydrated. You can also take over-the-counter medication for your symptoms.",
            "Thank you, Medi. How long will it take for me to feel better?",
            "It varies from person to person, but most people recover from the flu within a week to 10 days.",
            "Okay, thank you for your help."
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "You're welcome. Remember to take care of yourself and rest as much as possible to help you feel better."
    },
    {
        "dialog": [
            "Hello Medi, I was recently hospitalized for pneumonia and I'm not sure how to prevent it from happening again.",
            "I'm sorry to hear that. Could you tell me more about your hospitalization?",
            "I was diagnosed with pneumonia and had to stay in the hospital for a week. The doctors said it was caused by the flu.",
            "Given your recent hospitalization, it's important to take good care of yourself. This includes getting plenty of rest, staying hydrated, and taking any medication prescribed by your doctor.",
            "What else can I do to prevent getting pneumonia again?",
            "Getting a flu shot annually can help prevent getting the flu, which is a common cause of pneumonia. It's also important to practice good hygiene by washing your hands frequently and avoiding close contact with sick people.",
            "Thank you, Medi. Can you recommend any exercises or dietary changes that could help prevent another hospitalization?",
            "It's important to discuss any lifestyle changes with your doctor, as they can provide personalized recommendations based on your health needs.",
            "Okay, I will do that. Thank you for your help, Medi."
        ],
        "knowledge": "Influenza Influenza  The reported number of influenza cases is usually much lower than the actual number of cases. During seasonal epidemics, it is estimated that about 80% of otherwise healthy people who have a cough or sore throat have the flu.  Approximately 30–40% of people hospitalized for influenza develop pneumonia, and about 5% of all severe pneumonia cases in hospitals are due to influenza, which is also the most common cause of ARDS in adults.  In children, influenza is one of the two most common causes of ARDS, the other being the respiratory syncytial virus.  About 3–5% of children each year develop otitis media due to influenza.  Adults who develop organ failure from influenza and children who have PIM scores and acute renal failure have higher rates of mortality.  During seasonal influenza, mortality is concentrated in the very young and the elderly, whereas during flu pandemics, young adults are often affected at a high rate Influenza Influenza",
        "response": "You're welcome. Remember to discuss any lifestyle changes with your doctor to help prevent another hospitalization."
    },
    {
        "dialog": [
            "Hi Medi, I have been experiencing cough and sore throat for a few days.",
            "I see, have you had a fever, runny nose, or fatigue?",
            "Yes, I have a fever and feel exhausted all the time.",
            "Based on your symptoms, you may have influenza. You should rest and drink plenty of fluids",
            "Do I need any medicine?",
            "If your symptoms persist or worsen, you should see a doctor for antiviral medication",
            "Okay, I will rest and drink plenty of fluids.",
            "That's good, take care of yourself and get well soon.",
            "Thanks, Medi. By the way, how many people usually get the flu every year?"
        ],
        "knowledge": "Influenza Influenza The reported number of influenza cases is usually much lower than the actual number of cases. During seasonal epidemics, it is estimated that about 80% of otherwise healthy people who have a cough or sore throat have the flu.  Approximately 30–40% of people hospitalized for influenza develop pneumonia, and about 5% of all severe pneumonia cases in hospitals are due to influenza, which is also the most common cause of ARDS in adults.  In children, influenza is one of the two most common causes of ARDS, the other being the respiratory syncytial virus.  About 3–5% of children each year develop otitis media due to influenza.  Adults who develop organ failure from influenza and children who have PIM scores and acute renal failure have higher rates of mortality.  During seasonal influenza, mortality is concentrated in the very young and the elderly, whereas during flu pandemics, young adults are often affected at a high rate Influenza Influenza",
        "response": "During seasonal epidemics, it is estimated that about 80% of otherwise healthy people who have a cough or sore throat have the flu."
    },
    {
        "dialog": [
            "Hi Medi, my mother was recently diagnosed with influenza. What should I do?",
            "I'm sorry to hear that. Have you been in close contact with her?",
            "Yes, I have. I'm worried that I might catch it too.",
            "It's possible. You should monitor your own symptoms and wash your hands frequently",
            "Is there anything else I can do to protect myself?",
            "You can also wear a mask, avoid touching your face, and stay away from others if you feel sick",
            "Okay, thank you for your advice. What are the most common complications of influenza?",
            "The most common complications are pneumonia, bronchitis, and sinus and ear infections",
            "I see. I'll be sure to take extra precautions. Thanks, Medi."
        ],
        "knowledge": "Influenza Influenza The reported number of influenza cases is usually much lower than the actual number of cases. During seasonal epidemics, it is estimated that about 80% of otherwise healthy people who have a cough or sore throat have the flu.  Approximately 30–40% of people hospitalized for influenza develop pneumonia, and about 5% of all severe pneumonia cases in hospitals are due to influenza, which is also the most common cause of ARDS in adults.  In children, influenza is one of the two most common causes of ARDS, the other being the respiratory syncytial virus.  About 3–5% of children each year develop otitis media due to influenza.  Adults who develop organ failure from influenza and children who have PIM scores and acute renal failure have higher rates of mortality.  During seasonal influenza, mortality is concentrated in the very young and the elderly, whereas during flu pandemics, young adults are often affected at a high rate Influenza Influenza",
        "response": "The most common complications are pneumonia, bronchitis, and sinus and ear infections."
    },
    {
        "dialog": [
            "Medi, I just recovered from influenza. What should I do to prevent getting sick again?",
            "I'm glad to hear that you've recovered. The best way to prevent getting the flu is to get vaccinated every year",
            "I see. Is there anything else I can do?",
            "You can also practice good hygiene by washing your hands frequently and avoiding close contact with sick people",
            "Okay, that makes sense. What about my diet and exercise?",
            "A healthy diet and regular exercise can also help boost your immune system and reduce your risk of getting sick",
            "Great, thank you for your advice. How effective is the flu vaccine?",
            "The effectiveness of the flu vaccine varies each year, but it can reduce your risk of getting the flu by up to 60%",
            "I understand. I'll be sure to get vaccinated and take care of myself. Thanks, Medi."
        ],
        "knowledge": "Influenza Influenza The reported number of influenza cases is usually much lower than the actual number of cases. During seasonal epidemics, it is estimated that about 80% of otherwise healthy people who have a cough or sore throat have the flu.  Approximately 30–40% of people hospitalized for influenza develop pneumonia, and about 5% of all severe pneumonia cases in hospitals are due to influenza, which is also the most common cause of ARDS in adults.  In children, influenza is one of the two most common causes of ARDS, the other being the respiratory syncytial virus.  About 3–5% of children each year develop otitis media due to influenza.  Adults who develop organ failure from influenza and children who have PIM scores and acute renal failure have higher rates of mortality.  During seasonal influenza, mortality is concentrated in the very young and the elderly, whereas during flu pandemics, young adults are often affected at a high rate Influenza Influenza",
        "response": "The effectiveness of the flu vaccine varies each year, but it can reduce your risk of getting the flu by up to 60%."
    },
    {
        "dialog": [
            "Hello Medi, I have a sore throat and cough, can you help me?",
            "Certainly, let me ask a few questions. How long have you been experiencing these symptoms?",
            "It’s been 3 days",
            "Do you have a fever?",
            "No, I don’t think so.",
            "Are you experiencing headaches or body aches? ",
            "Yes, I have a headache.",
            "Based on your symptoms, you may have the flu. I suggest you rest and drink plenty of fluids.",
            "What else can I do to alleviate my symptoms?"
        ],
        "knowledge": "Influenza Influenza  The reported number of influenza cases is usually much lower than the actual number of cases. During seasonal epidemics, it is estimated that about 80% of otherwise healthy people who have a cough or sore throat have the flu.  Approximately 30–40% of people hospitalized for influenza develop pneumonia, and about 5% of all severe pneumonia cases in hospitals are due to influenza, which is also the most common cause of ARDS in adults.  In children, influenza is one of the two most common causes of ARDS, the other being the respiratory syncytial virus.  About 3–5% of children each year develop otitis media due to influenza.  Adults who develop organ failure from influenza and children who have PIM scores and acute renal failure have higher rates of mortality.  During seasonal influenza, mortality is concentrated in the very young and the elderly, whereas during flu pandemics, young adults are often affected at a high rate Influenza Influenza",
        "response": "Rest and drink plenty of fluids. If your symptoms persist, see a doctor."
    },
    {
        "dialog": [
            "Hi Medi, I have recovered from the flu. Can you give me advice on how to prevent it?",
            "Certainly, do you mind if I ask you a few questions first?",
            "Not at all.",
            "Did you get a flu shot?",
            "No, I didn't.",
            "It's highly recommended to get a flu shot every year to help prevent getting the flu.",
            "What else can I do besides getting a flu shot?",
            "You should regularly wash your hands, avoid touching your face, avoid close contact with people who are sick, and cover your nose and mouth when you cough or sneeze.",
            "Thank you for the advice, Medi."
        ],
        "knowledge": "Influenza Influenza  The reported number of influenza cases is usually much lower than the actual number of cases. During seasonal epidemics, it is estimated that about 80% of otherwise healthy people who have a cough or sore throat have the flu.  Approximately 30–40% of people hospitalized for influenza develop pneumonia, and about 5% of all severe pneumonia cases in hospitals are due to influenza, which is also the most common cause of ARDS in adults.  In children, influenza is one of the two most common causes of ARDS, the other being the respiratory syncytial virus.  About 3–5% of children each year develop otitis media due to influenza.  Adults who develop organ failure from influenza and children who have PIM scores and acute renal failure have higher rates of mortality.  During seasonal influenza, mortality is concentrated in the very young and the elderly, whereas during flu pandemics, young adults are often affected at a high rate Influenza Influenza",
        "response": "You're welcome. Let me know if you have any more questions."
    },
    {
        "dialog": [
            "Hey Medi, I was recently hospitalized with pneumonia caused by the flu. How can I prevent this from happening again?",
            "I'm sorry to hear that. May I ask if you got a flu shot?",
            "No, I didn't. I've never had a flu shot before.",
            "It's highly recommended to get a flu shot every year to help prevent getting the flu and pneumonia caused by the flu.",
            "What else can I do to prevent getting the flu?",
            "You should regularly wash your hands, avoid touching your face, avoid close contact with people who are sick, and cover your nose and mouth when you cough or sneeze.",
            "Thank you for the advice, Medi.",
            "You're welcome. Do you have any other questions?",
            "No, thank you. You've been very helpful."
        ],
        "knowledge": "Influenza Influenza  The reported number of influenza cases is usually much lower than the actual number of cases. During seasonal epidemics, it is estimated that about 80% of otherwise healthy people who have a cough or sore throat have the flu.  Approximately 30–40% of people hospitalized for influenza develop pneumonia, and about 5% of all severe pneumonia cases in hospitals are due to influenza, which is also the most common cause of ARDS in adults.  In children, influenza is one of the two most common causes of ARDS, the other being the respiratory syncytial virus.  About 3–5% of children each year develop otitis media due to influenza.  Adults who develop organ failure from influenza and children who have PIM scores and acute renal failure have higher rates of mortality.  During seasonal influenza, mortality is concentrated in the very young and the elderly, whereas during flu pandemics, young adults are often affected at a high rate Influenza Influenza",
        "response": "You're welcome and I'm glad to have been of help! If you have any other questions, feel free to ask!"
    },
    {
        "dialog": [
            "Hi Medi, I am feeling very sick",
            "Hi, what are your symptoms?",
            "I have a fever, headache, and a cough",
            "Based on your symptoms, you may have the flu",
            "What should I do?",
            "You should rest and drink plenty of fluids. If your symptoms do not improve or worsen, please see a doctor",
            "Is the flu dangerous?",
            "It can be dangerous for certain groups such as the elderly, children, and those with underlying health conditions",
            "Thanks for your help, Medi"
        ],
        "knowledge": "Influenza Influenza  The reported number of influenza cases is usually much lower than the actual number of cases. During seasonal epidemics, it is estimated that about 80% of otherwise healthy people who have a cough or sore throat have the flu.  Approximately 30–40% of people hospitalized for influenza develop pneumonia, and about 5% of all severe pneumonia cases in hospitals are due to influenza, which is also the most common cause of ARDS in adults.  In children, influenza is one of the two most common causes of ARDS, the other being the respiratory syncytial virus.  About 3–5% of children each year develop otitis media due to influenza.  Adults who develop organ failure from influenza and children who have PIM scores and acute renal failure have higher rates of mortality.  During seasonal influenza, mortality is concentrated in the very young and the elderly, whereas during flu pandemics, young adults are often affected at a high rate Influenza Influenza",
        "response": "You're welcome, please take care of yourself and seek medical attention if your symptoms don't improve or worsen."
    },
    {
        "dialog": [
            "Hi Medi, how can I prevent getting the flu?",
            "Hi, getting a flu shot can greatly reduce your chances of getting the flu",
            "What else can I do?",
            "You can also practice good hygiene such as washing your hands frequently and avoiding close contact with sick people",
            "Can a healthy person still get the flu?",
            "Yes, but the symptoms are usually less severe and the illness may not last as long",
            "Thanks for your advice, Medi",
            "You're welcome. Stay safe and healthy"
        ],
        "knowledge": "Influenza Influenza  The reported number of influenza cases is usually much lower than the actual number of cases. During seasonal epidemics, it is estimated that about 80% of otherwise healthy people who have a cough or sore throat have the flu.  Approximately 30–40% of people hospitalized for influenza develop pneumonia, and about 5% of all severe pneumonia cases in hospitals are due to influenza, which is also the most common cause of ARDS in adults.  In children, influenza is one of the two most common causes of ARDS, the other being the respiratory syncytial virus.  About 3–5% of children each year develop otitis media due to influenza.  Adults who develop organ failure from influenza and children who have PIM scores and acute renal failure have higher rates of mortality.  During seasonal influenza, mortality is concentrated in the very young and the elderly, whereas during flu pandemics, young adults are often affected at a high rate Influenza Influenza",
        "response": "You're welcome. Remember to practice good hygiene and get a flu shot if possible."
    },
    {
        "dialog": [
            "Hi Medi, I recently had the flu and I want to know how to prevent getting it again",
            "Hi, getting a flu shot is still the best way to prevent getting the flu",
            "What else can I do?",
            "You can also practice good hygiene such as washing your hands frequently and avoiding close contact with sick people",
            "Is there anything else I can do to boost my immune system?",
            "Getting enough sleep, eating a healthy diet, and exercising regularly can also help boost your immune system",
            "Thanks for your help, Medi",
            "You're welcome, stay healthy"
        ],
        "knowledge": "Influenza Influenza  The reported number of influenza cases is usually much lower than the actual number of cases. During seasonal epidemics, it is estimated that about 80% of otherwise healthy people who have a cough or sore throat have the flu.  Approximately 30–40% of people hospitalized for influenza develop pneumonia, and about 5% of all severe pneumonia cases in hospitals are due to influenza, which is also the most common cause of ARDS in adults.  In children, influenza is one of the two most common causes of ARDS, the other being the respiratory syncytial virus.  About 3–5% of children each year develop otitis media due to influenza.  Adults who develop organ failure from influenza and children who have PIM scores and acute renal failure have higher rates of mortality.  During seasonal influenza, mortality is concentrated in the very young and the elderly, whereas during flu pandemics, young adults are often affected at a high rate Influenza Influenza",
        "response": "You're welcome, take care of yourself and remember to get a flu shot every year."
    },
    {
        "dialog": [
            "Hi there Medi, I have a sore throat and a cough.",
            "I'm here to help, tell me what other symptoms you have",
            "I don't have a fever, but I feel tired and my body aches",
            "It sounds like you might have the flu. Rest and drink plenty of fluids.",
            "Should I take any medication for the cough and sore throat?",
            "Over-the-counter medications may help alleviate symptoms. Talk to your pharmacist.",
            "Thank you, Medi. What else can I do to feel better?",
            "Make sure you get plenty of rest, stay hydrated, and avoid contact with others to prevent the spread of the flu",
            "Got it. Thanks for your help!"
        ],
        "knowledge": "Influenza Influenza The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "Based on your symptoms, it's likely that you have the flu. Rest and hydrate, and avoid contact with others to prevent the spread. Over-the-counter medications may help alleviate symptoms."
    },
    {
        "dialog": [
            "Hey Medi, I'm concerned about getting the flu. What can I do to prevent it?",
            "The best way to prevent the flu is to get vaccinated every year",
            "What if I can't get the flu shot?",
            "You can also avoid close contact with sick people and wash your hands frequently",
            "What are some other precautions I can take?",
            "Cover your mouth and nose when you cough or sneeze, and avoid touching your face",
            "Got it. Is there anything else I should know?",
            "Stay home if you're sick and avoid contact with others to prevent the spread of the virus",
            "Thanks for the advice, Medi!"
        ],
        "knowledge": "Influenza Influenza The reported number of influenza cases is usually much lower than the actual number of cases. During seasonal epidemics, it is estimated that about 80% of otherwise healthy people who have a cough or sore throat have the flu.  Approximately 30–40% of people hospitalized for influenza develop pneumonia, and about 5% of all severe pneumonia cases in hospitals are due to influenza, which is also the most common cause of ARDS in adults.  In children, influenza is one of the two most common causes of ARDS, the other being the respiratory syncytial virus.  About 3–5% of children each year develop otitis media due to influenza.  Adults who develop organ failure from influenza and children who have PIM scores and acute renal failure have higher rates of mortality.  During seasonal influenza, mortality is concentrated in the very young and the elderly, whereas during flu pandemics, young adults are often affected at a high rate Influenza Influenza",
        "response": "The best way to prevent the flu is to get vaccinated every year. You can also avoid close contact with sick people, wash your hands frequently, cover your mouth and nose when you cough or sneeze, and avoid touching your face."
    },
    {
        "dialog": [
            "Hi Medi, I just recovered from the flu. What can I do to prevent getting sick again?",
            "It's important to continue practicing good hygiene, such as washing your hands frequently",
            "What about my diet? Are there any foods I should eat to help prevent getting sick?",
            "Eating a healthy and balanced diet with plenty of fruits and vegetables can help boost your immune system",
            "What else can I do to stay healthy?",
            "Getting enough sleep, exercising regularly, and managing stress can also help boost your immune system",
            "Thanks for the advice, Medi. Are there any supplements I should take?",
            "Consult with your doctor or a registered dietitian before taking any supplements",
            "Okay, I'll do that. Thanks for your help!"
        ],
        "knowledge": "Influenza Influenza The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "Maintaining good hygiene, eating a healthy and balanced diet, getting enough sleep, exercising regularly, and managing stress can help boost your immune system and prevent getting sick again."
    },
    {
        "dialog": [
            "Hi, Medi. I'm not feeling well. I have a sore throat and cough.",
            "I'm sorry to hear that. Based on your symptoms, it seems like you might have the flu.",
            "What should I do now?",
            "You should rest and drink plenty of fluids. You can also take over-the-counter medications to manage your symptoms.",
            "How long does it usually last?",
            "The symptoms usually last for about a week. But if you have a fever or difficulty breathing, you should seek medical attention.",
            "Okay, thank you. Is there anything else I should be aware of?",
            "During seasonal influenza, mortality is concentrated in the very young and the elderly. So if you have any underlying conditions or you are in one of these age groups, you should be extra careful.",
            "Got it. Thanks for your help, Medi."
        ],
        "knowledge": "Influenza Influenza The reported number of influenza cases is usually much lower than the actual number of cases. During seasonal epidemics, it is estimated that about 80% of otherwise healthy people who have a cough or sore throat have the flu. Approximately 30–40% of people hospitalized for influenza develop pneumonia, and about 5% of all severe pneumonia cases in hospitals are due to influenza, which is also the most common cause of ARDS in adults. In children, influenza is one of the two most common causes of ARDS, the other being the respiratory syncytial virus. About 3–5% of children each year develop otitis media due to influenza. Adults who develop organ failure from influenza and children who have PIM scores and acute renal failure have higher rates of mortality. During seasonal influenza, mortality is concentrated in the very young and the elderly, whereas during flu pandemics, young adults are often affected at a high rate Influenza Influenza",
        "response": "You're welcome. Take care of yourself and stay safe."
    },
    {
        "dialog": [
            "Hi, Medi. I have a question about the flu.",
            "Sure, I'm here to help. What do you want to know?",
            "Is the flu a serious illness?",
            "Yes, it can be. While most people recover from the flu without any complications, some people, especially those with underlying health issues or weakened immune systems, are at risk of developing serious complications such as pneumonia.",
            "How can I prevent getting the flu?",
            "The best way to prevent getting the flu is to get vaccinated every year. You should also practice good hygiene by washing your hands frequently and avoiding close contact with people who are sick.",
            "What should I do if I get the flu?",
            "If you get the flu, you should rest and drink plenty of fluids. You can also take over-the-counter medications to manage your symptoms. If your symptoms are severe or you have a fever, you should seek medical attention.",
            "Thank you for the information, Medi."
        ],
        "knowledge": "Influenza Influenza The reported number of influenza cases is usually much lower than the actual number of cases. During seasonal epidemics, it is estimated that about 80% of otherwise healthy people who have a cough or sore throat have the flu. Approximately 30–40% of people hospitalized for influenza develop pneumonia, and about 5% of all severe pneumonia cases in hospitals are due to influenza, which is also the most common cause of ARDS in adults. In children, influenza is one of the two most common causes of ARDS, the other being the respiratory syncytial virus. About 3–5% of children each year develop otitis media due to influenza. Adults who develop organ failure from influenza and children who have PIM scores and acute renal failure have higher rates of mortality. During seasonal influenza, mortality is concentrated in the very young and the elderly, whereas during flu pandemics, young adults are often affected at a high rate Influenza Influenza",
        "response": "You're welcome. Stay healthy and take care."
    },
    {
        "dialog": [
            "Hi Medi, I recently recovered from the flu. What should I do to prevent getting it again?",
            "Hi, good to hear that you're feeling better now. The best way to prevent getting the flu again is to get vaccinated every year.",
            "I see. Is there anything else I can do to boost my immune system?",
            "Yes, there are many things you can do to boost your immune system such as getting enough sleep, eating a healthy diet, exercising regularly, and reducing stress.",
            "What kind of foods should I eat to boost my immune system?",
            "You should eat a balanced diet that includes plenty of fruits and vegetables, whole grains, and lean proteins. Foods rich in vitamins C and D, and zinc are particularly good for your immune system.",
            "Thanks for the advice, Medi. Is there anything else I should know?",
            "You're welcome. Just remember to practice good hygiene by washing your hands frequently and avoiding close contact with people who are sick.",
            "I will. Thanks again, Medi."
        ],
        "knowledge": "Influenza Influenza The reported number of influenza cases is usually much lower than the actual number of cases. During seasonal epidemics, it is estimated that about 80% of otherwise healthy people who have a cough or sore throat have the flu. Approximately 30–40% of people hospitalized for influenza develop pneumonia, and about 5% of all severe pneumonia cases in hospitals are due to influenza, which is also the most common cause of ARDS in adults. In children, influenza is one of the two most common causes of ARDS, the other being the respiratory syncytial virus. About 3–5% of children each year develop otitis media due to influenza. Adults who develop organ failure from influenza and children who have PIM scores and acute renal failure have higher rates of mortality. During seasonal influenza, mortality is concentrated in the very young and the elderly, whereas during flu pandemics, young adults are often affected at a high rate Influenza Influenza",
        "response": "You're welcome. Stay healthy and take care."
    }
]