[
    {
        "dialog": [
            "Hi, Medi. I am experiencing some symptoms and I need your help",
            "Hi, I'm here to help. Can you tell me about your symptoms?",
            "I feel thirsty all the time and have to urinate frequently",
            "These are common symptoms of diabetes. Have you checked your blood sugar?",
            "No, I haven't. What should I do?",
            "You should go to your doctor to check your blood sugar levels. Diabetes can be controlled with medication and lifestyle changes.",
            "Is there anything else that I should do?",
            "You should eat a healthy diet and exercise regularly. These can help improve your blood sugar levels.",
            "Thank you for your advice, Medi. I will make an appointment with my doctor"
        ],
        "knowledge": "Diabetes Diabetes  Type 2 makes up about 90% of the cases.  Some data indicate rates are roughly equal in women and men, but male excess in diabetes has been found in many populations with higher type 2 incidence, possibly due to sex-related differences in insulin sensitivity, consequences of obesity and regional body fat deposition, and other contributing factors such as high blood pressure, tobacco smoking, and alcohol intake. The WHO estimates that diabetes resulted in 1. 5 million deaths in 2012, making it the 8th leading cause of death.  However another 2. 2 million deaths worldwide were attributable to high blood glucose and the increased risks of cardiovascular disease and other associated complications , which often lead to premature death and are often listed as the underlying cause on death certificates rather than diabetes.  For example, in 2017, the International Diabetes Federation  estimated that diabetes resulted in 4 Diabetes Diabetes",
        "response": "You're welcome. It's important to have your blood sugar levels checked by a doctor. Good luck with your appointment!"
    },
    {
        "dialog": [
            "Hello Medi. Can you tell me more about diabetes type 2?",
            "Sure, what would you like to know?",
            "How does it differ from type 1 diabetes?",
            "Type 2 diabetes is the most common type of diabetes. It occurs when the body becomes resistant to insulin or doesn't make enough insulin. Type 1 diabetes, on the other hand, is an autoimmune disease in which the body does not produce insulin.",
            "What are the risk factors for type 2 diabetes?",
            "Some of the risk factors for type 2 diabetes include being overweight or obese, having a family history of diabetes, and being physically inactive.",
            "Can type 2 diabetes be prevented?",
            "Yes, type 2 diabetes can be prevented by maintaining a healthy weight, exercising regularly, and eating a healthy diet.",
            "Thank you, Medi. That was very helpful"
        ],
        "knowledge": "Diabetes Diabetes  Type 2 makes up about 90% of the cases.  Some data indicate rates are roughly equal in women and men, but male excess in diabetes has been found in many populations with higher type 2 incidence, possibly due to sex-related differences in insulin sensitivity, consequences of obesity and regional body fat deposition, and other contributing factors such as high blood pressure, tobacco smoking, and alcohol intake. The WHO estimates that diabetes resulted in 1. 5 million deaths in 2012, making it the 8th leading cause of death.  However another 2. 2 million deaths worldwide were attributable to high blood glucose and the increased risks of cardiovascular disease and other associated complications , which often lead to premature death and are often listed as the underlying cause on death certificates rather than diabetes.  For example, in 2017, the International Diabetes Federation  estimated that diabetes resulted in 4 Diabetes Diabetes",
        "response": "You're welcome. I'm glad I could help. If you have any other questions, feel free to ask."
    },
    {
        "dialog": [
            "Hi Medi, I just had a medical procedure. What do I need to do for my recovery?",
            "Hi! What kind of procedure did you have done?",
            "I had a surgery for my knee.",
            "After surgery, it's important to follow your doctor's instructions for recovery. You may need to rest for a few days and avoid physical activity. ",
            "What about my diet?",
            "Make sure to eat a healthy diet that is high in protein and low in fat. This will help your body heal faster.",
            "What type of physical exercise can I do?",
            "You can start with gentle exercises, such as walking, as recommended by your doctor. As you recover, you can gradually increase the intensity and duration of your exercise.",
            "Thank you, Medi. I will follow these guidelines for my recovery."
        ],
        "knowledge": "Diabetes Diabetes  Type 2 makes up about 90% of the cases.  Some data indicate rates are roughly equal in women and men, but male excess in diabetes has been found in many populations with higher type 2 incidence, possibly due to sex-related differences in insulin sensitivity, consequences of obesity and regional body fat deposition, and other contributing factors such as high blood pressure, tobacco smoking, and alcohol intake. The WHO estimates that diabetes resulted in 1. 5 million deaths in 2012, making it the 8th leading cause of death.  However another 2. 2 million deaths worldwide were attributable to high blood glucose and the increased risks of cardiovascular disease and other associated complications , which often lead to premature death and are often listed as the underlying cause on death certificates rather than diabetes.  For example, in 2017, the International Diabetes Federation  estimated that diabetes resulted in 4 Diabetes Diabetes",
        "response": "You're welcome. I hope your recovery goes smoothly. Take care!"
    },
    {
        "dialog": [
            "Hi Medi, I feel thirsty all the time, could you help me find out what's happening?",
            "Sure, let me ask you some questions. Do you have to pee more often than usual?",
            "Yes, I do. How did you know?",
            "You may have high blood sugar levels which is a sign of diabetes. I suggest you see your doctor as soon as possible.",
            "Thanks for the advice! What should I do before seeing the doctor?",
            "You should drink a lot of water and eat healthy food. Avoid sugary drinks and processed food.",
            "Got it. What kind of food should I eat?",
            "You can eat foods with low glycemic index such as whole grains, vegetables, and lean protein.",
            "Thank you so much, Medi! I'll follow your advice and see the doctor tomorrow."
        ],
        "knowledge": "Diabetes Diabetes  Type 2 makes up about 90% of the cases.  Some data indicate rates are roughly equal in women and men, but male excess in diabetes has been found in many populations with higher type 2 incidence, possibly due to sex-related differences in insulin sensitivity, consequences of obesity and regional body fat deposition, and other contributing factors such as high blood pressure, tobacco smoking, and alcohol intake. The WHO estimates that diabetes resulted in 1.5 million deaths in 2012, making it the 8th leading cause of death.  However, another 2.2 million deaths worldwide were attributable to high blood glucose and the increased risks of cardiovascular disease and other associated complications, which often lead to premature death and are often listed as the underlying cause on death certificates rather than diabetes.  For example, in 2017, the International Diabetes Federation estimated that diabetes resulted in 4 Diabetes Diabetes",
        "response": "You should see your doctor as soon as possible as your symptoms suggest high blood sugar levels, which is a sign of diabetes."
    },
    {
        "dialog": [
            "Hi, Medi! Can you give me some information about type 2 diabetes?",
            "Sure, what would you like to know?",
            "What causes type 2 diabetes?",
            "Type 2 diabetes is primarily due to lifestyle factors and genetics. A sedentary lifestyle, unhealthy eating habits, and obesity can increase the risk of developing type 2 diabetes.",
            "What are the symptoms of type 2 diabetes?",
            "The symptoms of type 2 diabetes include frequent urination, increased thirst, blurred vision, fatigue, and slow healing of cuts and wounds.",
            "How can it be diagnosed and treated?",
            "Diagnosis can be made through a blood test. Treatment includes lifestyle changes, such as diet and physical exercise, and medication.",
            "Thank you, Medi. That was really helpful."
        ],
        "knowledge": "Diabetes Diabetes  Type 2 makes up about 90% of the cases.  Some data indicate rates are roughly equal in women and men, but male excess in diabetes has been found in many populations with higher type 2 incidence, possibly due to sex-related differences in insulin sensitivity, consequences of obesity and regional body fat deposition, and other contributing factors such as high blood pressure, tobacco smoking, and alcohol intake. The WHO estimates that diabetes resulted in 1.5 million deaths in 2012, making it the 8th leading cause of death.  However, another 2.2 million deaths worldwide were attributable to high blood glucose and the increased risks of cardiovascular disease and other associated complications, which often lead to premature death and are often listed as the underlying cause on death certificates rather than diabetes.  For example, in 2017, the International Diabetes Federation estimated that diabetes resulted in 4 Diabetes Diabetes",
        "response": "Type 2 diabetes is primarily due to lifestyle factors and genetics. Diagnosis can be made through a blood test and treatment includes lifestyle changes and medication."
    },
    {
        "dialog": [
            "Hi, Medi! I just had a medical procedure. Do you have any advice for me?",
            "Sure, it depends on the type of procedure you had. Can you tell me more about it?",
            "I had a gastric bypass surgery.",
            "Oh, I see. After gastric bypass surgery, you should follow a strict diet. You should eat small frequent meals and avoid high-fat and high-sugar foods. Drinking enough water and taking multivitamins is also important.",
            "What kind of physical exercise should I do?",
            "You should start with low-impact exercises such as walking and swimming. Gradually increase the intensity and duration as you get stronger.",
            "How about mental health?",
            "Mental health is also important after the surgery. You may experience depression and anxiety, so it's important to seek support from friends, family, or a mental health professional.",
            "Thank you, Medi. I'll keep that in mind."
        ],
        "knowledge": "Diabetes Diabetes  Type 2 makes up about 90% of the cases.  Some data indicate rates are roughly equal in women and men, but male excess in diabetes has been found in many populations with higher type 2 incidence, possibly due to sex-related differences in insulin sensitivity, consequences of obesity and regional body fat deposition, and other contributing factors such as high blood pressure, tobacco smoking, and alcohol intake. The WHO estimates that diabetes resulted in 1.5 million deaths in 2012, making it the 8th leading cause of death.  However, another 2.2 million deaths worldwide were attributable to high blood glucose and the increased risks of cardiovascular disease and other associated complications, which often lead to premature death and are often listed as the underlying cause on death certificates rather than diabetes.  For example, in 2017, the International Diabetes Federation estimated that diabetes resulted in 4 Diabetes Diabetes",
        "response": "After gastric bypass surgery, it's important to follow a strict diet, start with low-impact exercises, and seek support from mental health professionals."
    },
    {
        "dialog": [
            "Hi Medi, I am worried that I might have diabetes type 2.",
            "I understand how you feel, Have you experienced any symptoms?",
            "I have been feeling thirsty a lot and have to urinate often.",
            "These are symptoms that may indicate diabetes type 2.",
            "What should I do next?",
            "I suggest you visit your doctor and have your blood sugar level checked.",
            "If I have diabetes type 2, what will happen next?",
            "The doctor will recommend a treatment plan which may involve lifestyle changes or medication.",
            "Can I still eat sweets if I have diabetes type 2?"
        ],
        "knowledge": "Diabetes Diabetes  Type 2 makes up about 90% of the cases.  Some data indicate rates are roughly equal in women and men, but male excess in diabetes has been found in many populations with higher type 2 incidence, possibly due to sex-related differences in insulin sensitivity, consequences of obesity and regional body fat deposition, and other contributing factors such as high blood pressure, tobacco smoking, and alcohol intake. The WHO estimates that diabetes resulted in 1. 5 million deaths in 2012, making it the 8th leading cause of death.  However another 2. 2 million deaths worldwide were attributable to high blood glucose and the increased risks of cardiovascular disease and other associated complications , which often lead to premature death and are often listed as the underlying cause on death certificates rather than diabetes.  For example, in 2017, the International Diabetes Federation  estimated that diabetes resulted in 4 Diabetes Diabetes",
        "response": "It is best to avoid sugary foods as much as possible if you have diabetes type 2."
    },
    {
        "dialog": [
            "Hello Medi, I just had a medical procedure done",
            "That's great. What was the procedure about?",
            "I had a gastric bypass surgery to help with my obesity.",
            "Great! It is a good decision to have the surgery. How are you feeling now?",
            "I am feeling okay but I am not sure what to eat now. I am worried about what to eat to maintain my new weight.",
            "That's understandable. After surgery, you should follow a strict diet plan recommended by your surgeon.",
            "What should be included in the diet plan?",
            "You should eat plenty of protein and fiber-rich fruits and vegetables, while avoiding high-calorie and high-fat foods.",
            "What kind of exercise should I do?"
        ],
        "knowledge": "Obesity Obesity Obesity is a complex public health and policy problem because of its prevalence, costs, and health effects.  As such, managing it requires changes in the wider societal context and effort by communities, local authorities, and governments.  Public health efforts seek to understand and correct the environmental factors responsible for the increasing prevalence of obesity in the population.  Solutions look at changing the factors that cause excess food energy consumption and inhibit physical activity.  Efforts include federally reimbursed meal programs in schools, limiting direct junk food marketing to children, and decreasing access to sugar-sweetened beverages in schools.  The World Health Organization recommends the taxing of sugary drinks.  When constructing urban environments, efforts have been made to increase access to parks and to develop pedestrian routes Obesity Obesity",
        "response": "I recommend starting with light exercise such as walking and increasing the intensity over time, while maintaining a diet that is high in protein and fiber-rich fruits and vegetables and low in high-calorie and high-fat foods."
    },
    {
        "dialog": [
            "Hi Medi, I am curious about the causes of diabetes.",
            "Sure, I can help you with that. What would you like to know?",
            "What are some of the causes of type 2 diabetes?",
            "Type 2 diabetes is primarily due to lifestyle factors, such as poor diet and lack of physical activity, as well as genetics.",
            "What are some of the risk factors?",
            "Risk factors include obesity, a sedentary lifestyle, high blood pressure, and a family history of diabetes.",
            "How can it be prevented?",
            "Most cases of type 2 diabetes can be prevented by maintaining a healthy weight, exercising regularly, and eating a balanced diet.",
            "Is it curable?"
        ],
        "knowledge": "Diabetes Diabetes  The defective responsiveness of body tissues to insulin is believed to involve the insulin receptor.  However, the specific defects are not known.  Diabetes mellitus cases due to a known defect are classified separately.  Type 2 diabetes is the most common type of diabetes mellitus accounting for 95% of diabetes.  Many people with type 2 diabetes have evidence of prediabetes  before meeting the criteria for type 2 diabetes.  The progression of prediabetes to overt type 2 diabetes can be slowed or reversed by lifestyle changes or medications that improve insulin sensitivity or reduce the liver's glucose production. Type 2 diabetes is primarily due to lifestyle factors and genetics Diabetes Diabetes",
        "response": "While type 2 diabetes is not curable, it can be managed through lifestyle changes and medication."
    },
    {
        "dialog": [
            "Hey Medi, I'm worried about diabetes type 2.",
            "Sure, I can help you with that. What do you want to know ?",
            "What are the main causes of diabetes type 2?",
            "Lifestyle factors and genetics are the two main reasons for diabetes type 2.",
            "How can we reduce the risk of getting diabetes type 2 ?",
            "We can prevent it by lifestyle changes or medications that improve insulin sensitivity or reduce the liver's glucose production.",
            "What are the symptoms of diabetes type 2?",
            "Fatigue, frequent urination, increased thirst and hunger, blurred vision, and slow-healing sores are some symptoms of diabetes type 2.",
            "Alright, thanks for your help, Medi."
        ],
        "knowledge": "Diabetes Diabetes  Type 2 makes up about 90% of the cases.  Some data indicate rates are roughly equal in women and men, but male excess in diabetes has been found in many populations with higher type 2 incidence, possibly due to sex-related differences in insulin sensitivity, consequences of obesity and regional body fat deposition, and other contributing factors such as high blood pressure, tobacco smoking, and alcohol intake. The WHO estimates that diabetes resulted in 1. 5 million deaths in 2012, making it the 8th leading cause of death.  However another 2. 2 million deaths worldwide were attributable to high blood glucose and the increased risks of cardiovascular disease and other associated complications , which often lead to premature death and are often listed as the underlying cause on death certificates rather than diabetes.  For example, in 2017, the International Diabetes Federation  estimated that diabetes resulted in 4 Diabetes Diabetes",
        "response": "You're welcome. Let me know if you have any other questions."
    },
    {
        "dialog": [
            "Hi Medi, I don't feel well today, can you help me ?",
            "Of course, what symptoms do you have?",
            "I have a fever, cough, and fatigue.",
            "How long have you had these symptoms?",
            "I have been feeling this way for 2 days.",
            "Have you been traveling recently or come into contact with someone who has been sick?",
            "No, I haven't. I'm not sure what's causing this.",
            "Based on your symptoms, you may have the flu. It is best to contact your doctor and follow their advice.",
            "Okay, thank you for your help."
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "You're welcome. I hope you feel better soon."
    },
    {
        "dialog": [
            "Hey Medi, I used to be obese, can you give me some advice on how to stay healthy?",
            "Of course, maintaining a healthy lifestyle is key. What areas would you like to focus on?",
            "I'm interested in knowing how I can balance my diet.",
            "Eating less sugar and increasing your intake of fruits, vegetables, and vitamins can help balance your diet.",
            "What are some other things I can do to stay healthy?",
            "Exercising regularly and getting enough sleep are important. Also, try to reduce stress in your life.",
            "Are there any other tips you can suggest?",
            "Learning about portion control and how to read food labels can also be helpful.",
            "Thanks for your help, Medi."
        ],
        "knowledge": "Obesity Obesity Obesity is a complex public health and policy problem because of its prevalence, costs, and health effects.  As such, managing it requires changes in the wider societal context and effort by communities, local authorities, and governments.  Public health efforts seek to understand and correct the environmental factors responsible for the increasing prevalence of obesity in the population.  Solutions look at changing the factors that cause excess food energy consumption and inhibit physical activity.  Efforts include federally reimbursed meal programs in schools, limiting direct junk food marketing to children, and decreasing access to sugar-sweetened beverages in schools.  The World Health Organization recommends the taxing of sugary drinks.  When constructing urban environments, efforts have been made to increase access to parks and to develop pedestrian routes Obesity Obesity",
        "response": "You're welcome. I'm here to help anytime."
    },
    {
        "dialog": [
            "Hi Medi, I have some symptoms of diabetes. Can you help?",
            "Sure, what are your symptoms?",
            "I feel thirsty all the time and have to urinate frequently.",
            "These are common symptoms of diabetes. You need to check your blood sugar level.",
            "What should I do if it is high?",
            "You need to change your diet, exercise more, and take medication as prescribed by your doctor.",
            "Okay, thanks. What kind of food should I avoid?",
            "You should avoid foods high in sugar and carbohydrates, such as candy, soda, and white bread.",
            "Got it. Thanks for your help!"
        ],
        "knowledge": "Diabetes Diabetes  Type 2 makes up about 90% of the cases.  Some data indicate rates are roughly equal in women and men, but male excess in diabetes has been found in many populations with higher type 2 incidence, possibly due to sex-related differences in insulin sensitivity, consequences of obesity and regional body fat deposition, and other contributing factors such as high blood pressure, tobacco smoking, and alcohol intake. The WHO estimates that diabetes resulted in 1.5 million deaths in 2012, making it the 8th leading cause of death.  However another 2.2 million deaths worldwide were attributable to high blood glucose and the increased risks of cardiovascular disease and other associated complications , which often lead to premature death and are often listed as the underlying cause on death certificates rather than diabetes.  For example, in 2017, the International Diabetes Federation estimated that diabetes resulted in 4 Diabetes Diabetes",
        "response": "You're welcome! Keep in mind that it's important to follow your doctor's instructions and monitor your blood sugar regularly."
    },
    {
        "dialog": [
            "Hi Medi, can you tell me more about diabetes?",
            "Of course! What would you like to know?",
            "What causes diabetes?",
            "The exact cause of diabetes is not known, but genetics and lifestyle factors such as obesity and lack of physical activity are thought to play a role.",
            "What are the symptoms of diabetes?",
            "The symptoms of diabetes include increased thirst and urination, fatigue, blurred vision, and slow-healing wounds.",
            "How is diabetes treated?",
            "Diabetes is typically treated with a combination of medication, lifestyle changes, and monitoring of blood sugar levels.",
            "Thanks for the information, Medi!"
        ],
        "knowledge": "Diabetes Diabetes  Type 2 makes up about 90% of the cases.  Some data indicate rates are roughly equal in women and men, but male excess in diabetes has been found in many populations with higher type 2 incidence, possibly due to sex-related differences in insulin sensitivity, consequences of obesity and regional body fat deposition, and other contributing factors such as high blood pressure, tobacco smoking, and alcohol intake. The WHO estimates that diabetes resulted in 1.5 million deaths in 2012, making it the 8th leading cause of death.  However another 2.2 million deaths worldwide were attributable to high blood glucose and the increased risks of cardiovascular disease and other associated complications , which often lead to premature death and are often listed as the underlying cause on death certificates rather than diabetes.  For example, in 2017, the International Diabetes Federation estimated that diabetes resulted in 4 Diabetes Diabetes",
        "response": "You're welcome! Let me know if you have any other questions."
    },
    {
        "dialog": [
            "Hi Medi, I just had a medical procedure done. What can I do to improve my health?",
            "Congratulations on completing your medical procedure! What type of procedure did you have?",
            "I had surgery to remove a tumor on my pancreas.",
            "That's a serious procedure. You should focus on resting and allowing your body to heal.",
            "What about my diet and exercise?",
            "You should follow a healthy diet that includes plenty of fruits and vegetables and limits processed foods and sugar. You can gradually increase your physical activity, but be careful not to overdo it.",
            "What about drinking alcohol?",
            "It's best to avoid alcohol until your doctor gives you the green light.",
            "Thanks for the advice, Medi!"
        ],
        "knowledge": "Diabetes Diabetes  Type 2 makes up about 90% of the cases.  Some data indicate rates are roughly equal in women and men, but male excess in diabetes has been found in many populations with higher type 2 incidence, possibly due to sex-related differences in insulin sensitivity, consequences of obesity and regional body fat deposition, and other contributing factors such as high blood pressure, tobacco smoking, and alcohol intake. The WHO estimates that diabetes resulted in 1.5 million deaths in 2012, making it the 8th leading cause of death.  However another 2.2 million deaths worldwide were attributable to high blood glucose and the increased risks of cardiovascular disease and other associated complications , which often lead to premature death and are often listed as the underlying cause on death certificates rather than diabetes.  For example, in 2017, the International Diabetes Federation estimated that diabetes resulted in 4 Diabetes Diabetes",
        "response": "You're welcome! Take care and be sure to follow your doctor's instructions for a successful recovery."
    },
    {
        "dialog": [
            "Hi Medi, I think I have some symptoms related to diabetes type 2.",
            "Can you tell me more about your symptoms?",
            "I usually feel thirsty, hungry, tired, and I need to urinate more often.",
            "These symptoms are commonly related to high blood sugar. You should consult a doctor.",
            "But what should I do before seeing a doctor?",
            "You can start by controlling your diet and reducing sugar intake. It is important to eat healthy and do regular exercise.",
            "Got it. What type of food should I avoid?",
            "You should avoid sugary drinks and processed foods. Focus on eating more vegetables and fruits.",
            "Thanks, Medi. One more question, can stress be a factor that triggers diabetes?"
        ],
        "knowledge": "Diabetes Diabetes  Type 2 makes up about 90% of the cases.  Some data indicate rates are roughly equal in women and men, but male excess in diabetes has been found in many populations with higher type 2 incidence, possibly due to sex-related differences in insulin sensitivity, consequences of obesity and regional body fat deposition, and other contributing factors such as high blood pressure, tobacco smoking, and alcohol intake. The WHO estimates that diabetes resulted in 1. 5 million deaths in 2012, making it the 8th leading cause of death.  However another 2. 2 million deaths worldwide were attributable to high blood glucose and the increased risks of cardiovascular disease and other associated complications , which often lead to premature death and are often listed as the underlying cause on death certificates rather than diabetes.  For example, in 2017, the International Diabetes Federation  estimated that diabetes resulted in 4 Diabetes Diabetes",
        "response": "No, stress itself does not cause diabetes, but it can raise blood sugar levels."
    },
    {
        "dialog": [
            "Hi Medi, I am curious about diabetes. Can you explain it to me?",
            "Sure, diabetes is a disease in which the body cannot produce or properly use insulin.",
            "What is insulin and what is its function in the body?",
            "Insulin is a hormone produced by the pancreas that regulates blood sugar levels and allows the body to use sugar for energy.",
            "I see. What are the symptoms of diabetes?",
            "The symptoms of diabetes include frequent urination, excessive thirst, hunger, fatigue, blurred vision, and slow healing wounds.",
            "Can diabetes be cured?",
            "No, there is no cure for diabetes, but it can be managed with a healthy lifestyle and medication.",
            "Is diabetes type 2 more common than type 1?"
        ],
        "knowledge": "Diabetes Diabetes  The defective responsiveness of body tissues to insulin is believed to involve the insulin receptor.  However, the specific defects are not known.  Diabetes mellitus cases due to a known defect are classified separately.  Type 2 diabetes is the most common type of diabetes mellitus accounting for 95% of diabetes.  Many people with type 2 diabetes have evidence of prediabetes  before meeting the criteria for type 2 diabetes.  The progression of prediabetes to overt type 2 diabetes can be slowed or reversed by lifestyle changes or medications that improve insulin sensitivity or reduce the liver's glucose production. Type 2 diabetes is primarily due to lifestyle factors and genetics Diabetes Diabetes",
        "response": "Yes, type 2 diabetes is more common than type 1 diabetes."
    },
    {
        "dialog": [
            "Hi Medi, I just underwent a medical procedure, and I want to know how I can improve my health.",
            "What kind of procedure did you have?",
            "I had a surgery for my heart disease.",
            "After surgery, it is important to rest and follow your doctor's instructions. You should also make lifestyle changes such as eating a healthy diet and doing regular exercise.",
            "What kind of food should I eat?",
            "You should eat a diet rich in fruits, vegetables, whole grains, and lean proteins. Avoid processed foods and saturated fats.",
            "Can I still eat sweets?",
            "You should limit your sugar intake and avoid sugary drinks. Instead, you can have fruit for a natural source of sugar.",
            "Got it. What kind of exercise should I do?"
        ],
        "knowledge": "Heart disease Heart disease  Heart disease refers to a variety of conditions that affect the heart, such as coronary artery disease, heart failure, and arrhythmias.  Risk factors for heart disease include high blood pressure, high cholesterol, smoking, diabetes, obesity, and family history.  Preventive measures include a healthy diet, regular exercise, not smoking, and managing other health conditions such as diabetes and high blood pressure.",
        "response": "Yes, heart disease can be prevented by maintaining a healthy lifestyle and managing risk factors such as high blood pressure, high cholesterol, and diabetes."
    },
    {
        "dialog": [
            "Hi Medi, I have some symptoms and I need some advice.",
            "Hello! Please tell me your symptoms and I will do my best to help you.",
            "I am feeling thirsty all the time and I feel like I am going to the bathroom frequently.",
            "Okay. Based on your symptoms, it could be Diabetes type 2. But we need to run some tests to be sure.",
            "What kind of tests do I need to get done?",
            "You need to get your blood sugar level tested and an A1C test to measure your average blood glucose over the past 2-3 months.",
            "Do I need to fast before the test?",
            "Yes, you need to fast for at least 8 hours before the test.",
            "Okay, thank you for your help. I will get the tests done."
        ],
        "knowledge": "Diabetes Diabetes  Type 2 makes up about 90% of the cases.  Some data indicate rates are roughly equal in women and men, but male excess in diabetes has been found in many populations with higher type 2 incidence, possibly due to sex-related differences in insulin sensitivity, consequences of obesity and regional body fat deposition, and other contributing factors such as high blood pressure, tobacco smoking, and alcohol intake. The WHO estimates that diabetes resulted in 1. 5 million deaths in 2012, making it the 8th leading cause of death.  However another 2. 2 million deaths worldwide were attributable to high blood glucose and the increased risks of cardiovascular disease and other associated complications , which often lead to premature death and are often listed as the underlying cause on death certificates rather than diabetes.  For example, in 2017, the International Diabetes Federation  estimated that diabetes resulted in 4 Diabetes Diabetes",
        "response": "You're welcome! Please get the tests done and I'll be here to help you understand the results."
    },
    {
        "dialog": [
            "Hi Medi, I have a family history of type 2 diabetes. What can I do to prevent it?",
            "Hi! That's a good question. The best way to prevent type 2 diabetes is through a healthy diet and regular physical activity.",
            "Can you give me some examples of healthy food?",
            "Sure! You should eat a lot of fruits, vegetables, and whole grains. Avoid processed foods and sugary drinks.",
            "Okay, and what kind of physical activity do I need?",
            "You should aim for at least 30 minutes of moderate exercise most days of the week. Walking, swimming, and cycling are all great options.",
            "Got it. Is there anything else I should be doing?",
            "Maintaining a healthy weight is also important. Regular check-ups with your doctor can help catch any potential problems early on.",
            "Thanks for the advice, Medi. I'll start making changes right away."
        ],
        "knowledge": "Diabetes Diabetes  Type 2 makes up about 90% of the cases.  Some data indicate rates are roughly equal in women and men, but male excess in diabetes has been found in many populations with higher type 2 incidence, possibly due to sex-related differences in insulin sensitivity, consequences of obesity and regional body fat deposition, and other contributing factors such as high blood pressure, tobacco smoking, and alcohol intake. The WHO estimates that diabetes resulted in 1. 5 million deaths in 2012, making it the 8th leading cause of death.  However another 2. 2 million deaths worldwide were attributable to high blood glucose and the increased risks of cardiovascular disease and other associated complications , which often lead to premature death and are often listed as the underlying cause on death certificates rather than diabetes.  For example, in 2017, the International Diabetes Federation  estimated that diabetes resulted in 4 Diabetes Diabetes",
        "response": "You're welcome! Making healthy changes is a great way to prevent type 2 diabetes. Keep up the good work!"
    },
    {
        "dialog": [
            "Hi Medi, I was diagnosed with type 2 diabetes. What should I be doing now?",
            "Hi! I'm sorry to hear that. The first thing you should do is get a referral to a registered dietitian.",
            "What will the dietitian do?",
            "The dietitian will help you create a meal plan that works for you and help you understand how different foods affect your blood sugar levels.",
            "Okay, what else?",
            "You should also be monitoring your blood sugar levels regularly and taking any medications prescribed by your doctor.",
            "What about physical activity?",
            "Physical activity is important as well. Aim for at least 30 minutes of moderate exercise most days of the week.",
            "Thank you for the advice, Medi. This is all overwhelming, but I know I can do it with the right support."
        ],
        "knowledge": "Diabetes Diabetes  Type 2 makes up about 90% of the cases.  Some data indicate rates are roughly equal in women and men, but male excess in diabetes has been found in many populations with higher type 2 incidence, possibly due to sex-related differences in insulin sensitivity, consequences of obesity and regional body fat deposition, and other contributing factors such as high blood pressure, tobacco smoking, and alcohol intake. The WHO estimates that diabetes resulted in 1. 5 million deaths in 2012, making it the 8th leading cause of death.  However another 2. 2 million deaths worldwide were attributable to high blood glucose and the increased risks of cardiovascular disease and other associated complications , which often lead to premature death and are often listed as the underlying cause on death certificates rather than diabetes.  For example, in 2017, the International Diabetes Federation  estimated that diabetes resulted in 4 Diabetes Diabetes",
        "response": "You're welcome! It can be overwhelming at first, but with the right support and dedication, you can manage your diabetes and live a healthy life."
    },
    {
        "dialog": [
            "Hello Medi, I am concerned about my risks of developing diabetes type 2.",
            "Okay, I can help you with that. What is your family history of diabetes?",
            "My father has type 2 diabetes",
            "That means you are at higher risk of developing type 2 diabetes. Do you have a balanced diet?",
            "I don't eat vegetables and fruits regularly and I drink soda a lot.",
            "That's not healthy. I suggest you should improve your diet immediately and do more physical excercises.",
            "What kinds of physical activities do you recommend?",
            "You can try walking, jogging, or cycling for at least 30 minutes a day.",
            "Thanks, Medi. How about my risk of developing diabetes type 2 now?"
        ],
        "knowledge": "Diabetes Diabetes Type 2 diabetes is influenced by both genetic and environmental factors. The risk of developing type 2 diabetes increases with age, obesity, and lack of physical activity. If you have a family history of diabetes, you are at a higher risk of developing type 2 diabetes. Maintaining a balanced diet and regular physical activity can help reduce the risk of developing type 2 diabetes.",
        "response": "By improving your lifestyle and doing more physical excercises, your risk of developing diabetes type 2 will be decreased."
    },
    {
        "dialog": [
            "Hi, Medi. I have been diagnosed with diabetes type 2 and I don't know what to do.",
            "Okay, I am here to help you. What is your current blood sugar levels?",
            "My fasting blood sugar level is 150 mg/dL",
            "That's high. Do you know how to control your blood sugar levels?",
            "No, I don't know",
            "You can start by modifying your diet and doing more physical exercises. Also, you need to take medications to manage your blood sugar levels.",
            "What kind of diet is good for me?",
            "You should eat foods with low glycemic index such as whole grains, fruits, vegetables, and lean protein. Avoid sugary foods and drinks.",
            "Thanks, how about physical activities?"
        ],
        "knowledge": "Diabetes Diabetes Uncontrolled blood sugar levels can lead to serious complications such as cardiovascular disease, nerve damage, kidney damage, and eye damage. It can also increase the risk of infections and slow the healing process. It is important to manage blood sugar levels through medication, diet, and exercise to prevent these complications.",
        "response": "If you don't control your blood sugar levels, it can lead to serious complications such as cardiovascular disease, nerve damage, kidney damage, and eye damage."
    },
    {
        "dialog": [
            "Hi, Medi. I have just undergone surgery to remove a tumor in my pancreas and I want to know how to take care of myself now.",
            "I am glad to hear that the surgery was successful. Do you have any dietary restrictions?",
            "Yes, I am not allowed to eat fatty foods and I need to limit my sugar intake.",
            "Okay, you should follow your doctor's instructions carefully. Did your doctor recommend any physical activities?",
            "Yes, I am allowed to do light exercises such as walking.",
            "That's good. You should gradually increase your physical activity as you recover from the surgery. How about your medication?",
            "I need to take insulin injections every day. Do I need to monitor my blood sugar levels?",
            "Yes, it is important to monitor your blood sugar levels regularly to prevent complications.",
            "Thanks, Medi. What are the potential complications of surgery on the pancreas?"
        ],
        "knowledge": "Diabetes Diabetes Surgery on the pancreas can cause complications such as bleeding, infection, and damage to nearby organs. It is important to follow your doctor's instructions carefully and contact your doctor immediately if you experience any symptoms such as fever, abdominal pain, or difficulty breathing. If you are taking insulin injections, it is important to monitor your blood sugar levels regularly to prevent complications.",
        "response": "What are the potential complications of surgery on the pancreas?"
    },
    {
        "dialog": [
            "Hi Medi, I have some symptoms and I suspect I might have diabetes.",
            "Hello! Can you tell me about your symptoms?",
            "I am thirsty all the time, my vision is blurred, and I am urinating frequently.",
            "Based on your symptoms, it's possible that you have diabetes. You should see a doctor to get a proper diagnosis.",
            "Is there anything I can do in the meantime?",
            "Yes, you can try to reduce your sugar intake and increase your physical activity.",
            "Okay, I will try that. What are the long-term effects of having diabetes?",
            "Diabetes can lead to many complications such as kidney damage, nerve damage, and eye problems. It's important to manage it properly.",
            "Thank you for your help, Medi!"
        ],
        "knowledge": "Diabetes Diabetes Type 2 makes up about 90% of the cases. Some data indicate rates are roughly equal in women and men, but male excess in diabetes has been found in many populations with higher type 2 incidence, possibly due to sex-related differences in insulin sensitivity, consequences of obesity and regional body fat deposition, and other contributing factors such as high blood pressure, tobacco smoking, and alcohol intake. The WHO estimates that diabetes resulted in 1.5 million deaths in 2012, making it the 8th leading cause of death. However, another 2.2 million deaths worldwide were attributable to high blood glucose and the increased risks of cardiovascular disease and other associated complications, which often lead to premature death and are often listed as the underlying cause on death certificates rather than diabetes. For example, in 2017, the International Diabetes Federation estimated that diabetes resulted in 4 Diabetes Diabetes",
        "response": "You're welcome! Remember to see a doctor to confirm the diagnosis."
    },
    {
        "dialog": [
            "Hey Medi, can you explain to me what diabetes is?",
            "Of course! Diabetes is a condition where your body is unable to properly regulate blood sugar levels.",
            "What are the different types of diabetes?",
            "There are two main types: Type 1 diabetes, where the body does not produce enough insulin, and Type 2 diabetes, where the body is unable to use insulin properly.",
            "What are some risk factors for Type 2 diabetes?",
            "Some risk factors include obesity, high blood pressure, and a sedentary lifestyle.",
            "How can you manage diabetes?",
            "You can manage diabetes by monitoring your blood sugar levels, eating a healthy diet, exercising regularly, and taking any medications prescribed by your doctor.",
            "Thanks for the information, Medi! Do you have any advice for a healthy diet?"
        ],
        "knowledge": "Diabetes Diabetes The defective responsiveness of body tissues to insulin is believed to involve the insulin receptor. However, the specific defects are not known. Diabetes mellitus cases due to a known defect are classified separately. Type 2 diabetes is the most common type of diabetes mellitus, accounting for 95% of diabetes. Many people with type 2 diabetes have evidence of prediabetes before meeting the criteria for type 2 diabetes. The progression of prediabetes to overt type 2 diabetes can be slowed or reversed by lifestyle changes or medications that improve insulin sensitivity or reduce the liver's glucose production. Type 2 diabetes is primarily due to lifestyle factors and genetics Diabetes Diabetes",
        "response": "You're welcome! Remember to always check with your doctor for personalized dietary advice."
    },
    {
        "dialog": [
            "Hi Medi, I just had a medical procedure done. Do you have any advice for my recovery?",
            "Of course! What type of procedure did you have?",
            "I had surgery to remove a tumor.",
            "After surgery, it's important to get plenty of rest and follow your doctor's instructions for pain management. You should also try to move around a little bit each day to help prevent blood clots.",
            "Okay, I will make sure to do that. What about my diet?",
            "Your doctor will likely give you specific instructions for your diet, but in general, it's important to eat plenty of protein and drink lots of water to help with healing.",
            "Got it, thank you. When can I resume normal activities?",
            "It's important to follow your doctor's instructions for activity after surgery, but in general, you should avoid heavy lifting and strenuous activity for a few weeks.",
            "Thanks for your help, Medi!"
        ],
        "knowledge": "Diabetes Diabetes Type 2 makes up about 90% of the cases. Some data indicate rates are roughly equal in women and men, but male excess in diabetes has been found in many populations with higher type 2 incidence, possibly due to sex-related differences in insulin sensitivity, consequences of obesity and regional body fat deposition, and other contributing factors such as high blood pressure, tobacco smoking, and alcohol intake. The WHO estimates that diabetes resulted in 1.5 million deaths in 2012, making it the 8th leading cause of death. However, another 2.2 million deaths worldwide were attributable to high blood glucose and the increased risks of cardiovascular disease and other associated complications, which often lead to premature death and are often listed as the underlying cause on death certificates rather than diabetes. For example, in 2017, the International Diabetes Federation estimated that diabetes resulted in 4 Diabetes Diabetes",
        "response": "You're welcome! Remember to always follow your doctor's instructions for a safe recovery."
    }
]