[
    {
        "dialog": [
            "Hi Medi, I have some concerns about high blood pressure during pregnancy.",
            "Sure, I can help you with that. Please tell me more about it.",
            "I'm 6 months pregnant and my blood pressure has been high lately.",
            "Okay. High blood pressure in pregnancy can be classified as pre-existing hypertension, gestational hypertension, or pre-eclampsia. Have you been diagnosed with any of these?",
            "I'm not sure. What are the differences between them?",
            "Pre-existing hypertension is high blood pressure that exists before pregnancy or is diagnosed before 20 weeks of pregnancy. Gestational hypertension is high blood pressure that develops after 20 weeks of pregnancy. Pre-eclampsia is a serious condition of the second half of pregnancy and following delivery characterized by increased blood pressure and the presence of protein in the urine. Have you experienced any other symptoms?",
            "I've had headaches and swelling in my legs.",
            "Based on your symptoms, it's possible that you have pre-eclampsia. You should consult with your doctor as soon as possible to confirm the diagnosis and get proper treatment.",
            "Thank you for your advice, Medi. I will make an appointment with my doctor right away."
        ],
        "knowledge": "Hypertension Hypertension High blood pressure in pregnancy can be classified as pre-existing hypertension, gestational hypertension, or pre-eclampsia. Pre-eclampsia is a serious condition of the second half of pregnancy and following delivery characterized by increased blood pressure and the presence of protein in the urine. It occurs in about 5% of pregnancies and is responsible for approximately 16% of all maternal deaths globally. Pre-eclampsia also doubles the risk of death of the baby around the time of birth. Usually, there are no symptoms in pre-eclampsia and it is detected by routine screening. When symptoms of pre-eclampsia occur, the most common are headache, visual disturbance, vomiting, pain over the stomach, and swelling. Pre-eclampsia can occasionally progress to a life-threatening condition called eclampsia, which is a hypertensive emergency and has several serious complications including vision loss, brain swelling, seizures, kidney failure, pulmonary edema, and disseminated intravascular coagulation  Hypertension Hypertension",
        "response": "You're welcome. I hope everything goes well with your doctor's appointment."
    },
    {
        "dialog": [
            "Hello Medi, can you tell me more about pre-eclampsia?",
            "Of course. Pre-eclampsia is a serious condition of the second half of pregnancy and following delivery characterized by increased blood pressure and the presence of protein in the urine. It can cause various complications for both the mother and the baby.",
            "What are the symptoms of pre-eclampsia?",
            "Usually, there are no symptoms in pre-eclampsia and it is detected by routine screening. When symptoms of pre-eclampsia occur, the most common are headache, visual disturbance, vomiting, pain over the stomach, and swelling.",
            "Is there a way to prevent pre-eclampsia?",
            "Unfortunately, there is no known way to prevent pre-eclampsia. However, regular prenatal care and monitoring of blood pressure and urine protein levels can help detect and manage the condition early on.",
            "What are the risks of pre-eclampsia?",
            "Pre-eclampsia can cause various complications such as premature delivery, low birth weight, placental abruption, and maternal organ damage. It also doubles the risk of death of the baby around the time of birth.",
            "Thank you for the information, Medi."
        ],
        "knowledge": "Hypertension Hypertension High blood pressure in pregnancy can be classified as pre-existing hypertension, gestational hypertension, or pre-eclampsia. Pre-eclampsia is a serious condition of the second half of pregnancy and following delivery characterized by increased blood pressure and the presence of protein in the urine. It occurs in about 5% of pregnancies and is responsible for approximately 16% of all maternal deaths globally. Pre-eclampsia also doubles the risk of death of the baby around the time of birth. Usually, there are no symptoms in pre-eclampsia and it is detected by routine screening. When symptoms of pre-eclampsia occur, the most common are headache, visual disturbance, vomiting, pain over the stomach, and swelling. Pre-eclampsia can occasionally progress to a life-threatening condition called eclampsia, which is a hypertensive emergency and has several serious complications including vision loss, brain swelling, seizures, kidney failure, pulmonary edema, and disseminated intravascular coagulation  Hypertension Hypertension",
        "response": "You're welcome. Let me know if you have any more questions about it."
    },
    {
        "dialog": [
            "Hi Medi, I recently had a baby and was diagnosed with pre-eclampsia. What should I do to manage my blood pressure now?",
            "Congratulations on your baby! To manage your blood pressure, you should first consult with your doctor to create a personalized treatment plan. In general, lifestyle changes such as regular exercise and a healthy diet can help lower blood pressure. You may also need to take medication if your blood pressure is still high.",
            "What kind of medication can I take while breastfeeding?",
            "It depends on the medication and your individual situation. Some medications are safe to take while breastfeeding, while others are not. Your doctor can advise you on which medications are safe and effective for you.",
            "What about my diet? Are there any foods I should avoid?",
            "You should avoid foods that are high in sodium and saturated fats, as these can increase blood pressure. Instead, focus on eating a balanced diet that includes plenty of fruits, vegetables, whole grains, and lean proteins.",
            "Thanks, Medi. I will follow your advice and consult with my doctor.",
            "You're welcome. I hope it helps."
        ],
        "knowledge": "Hypertension Hypertension High blood pressure in pregnancy can be classified as pre-existing hypertension, gestational hypertension, or pre-eclampsia. Pre-eclampsia is a serious condition of the second half of pregnancy and following delivery characterized by increased blood pressure and the presence of protein in the urine. It occurs in about 5% of pregnancies and is responsible for approximately 16% of all maternal deaths globally. Pre-eclampsia also doubles the risk of death of the baby around the time of birth. Usually, there are no symptoms in pre-eclampsia and it is detected by routine screening. When symptoms of pre-eclampsia occur, the most common are headache, visual disturbance, vomiting, pain over the stomach, and swelling. Pre-eclampsia can occasionally progress to a life-threatening condition called eclampsia, which is a hypertensive emergency and has several serious complications including vision loss, brain swelling, seizures, kidney failure, pulmonary edema, and disseminated intravascular coagulation  Hypertension Hypertension",
        "response": "You're welcome. I hope everything goes well with your treatment plan and your new baby."
    },
    {
        "dialog": [
            "Hi Medi, I am pregnant and my blood pressure is high.",
            "Hi, I am here to help you. Can you tell me more about your blood pressure?",
            "I don't know much except it's high. What does that mean?",
            "High blood pressure during pregnancy can lead to serious complications. We will need to monitor it closely.",
            "What are the complications?",
            "Pre-eclampsia is a serious condition that can develop due to high blood pressure during pregnancy and it can be life-threatening for both the mother and baby.",
            "What should I do to manage it?",
            "You should rest, avoid salt, and limit your physical activity. We should also monitor your blood pressure regularly.",
            "Okay, thanks for your help."
        ],
        "knowledge": "Hypertension Hypertension  High blood pressure in pregnancy can be classified as pre-existing hypertension, gestational hypertension, or pre-eclampsia. Pre-eclampsia is a serious condition of the second half of pregnancy and following delivery characterised by increased blood pressure and the presence of protein in the urine.  It occurs in about 5% of pregnancies and is responsible for approximately 16% of all maternal deaths globally.  Pre-eclampsia also doubles the risk of death of the baby around the time of birth.  Usually there are no symptoms in pre-eclampsia and it is detected by routine screening.  When symptoms of pre-eclampsia occur the most common are headache, visual disturbance , vomiting, pain over the stomach, and swelling.  Pre-eclampsia can occasionally progress to a life-threatening condition called eclampsia, which is a hypertensive emergency and has several serious complications including vision loss, brain swelling, seizures, kidney failure, pulmonary edema, and disseminated intravascular coagulation  Hypertension Hypertension",
        "response": "You're welcome. Take care and contact me if you have any further symptoms or concerns."
    },
    {
        "dialog": [
            "Hello Medi, can you tell me more about pre-eclampsia?",
            "Yes, of course. Pre-eclampsia is a serious condition that can occur during pregnancy, usually after the 20th week. It is characterized by high blood pressure and protein in the urine.",
            "What are the symptoms?",
            "It is often asymptomatic, but when symptoms occur they include headaches, visual changes, abdominal pain, and swelling in the hands and feet.",
            "Is there any way to prevent it?",
            "Unfortunately, there is no guaranteed way to prevent pre-eclampsia. However, attending all prenatal appointments and monitoring your blood pressure can help to detect it early.",
            "What are the treatment options?",
            "The only cure for pre-eclampsia is delivery of the baby. However, we will close monitor your blood pressure, administer medication, and potentially deliver the baby early if necessary.",
            "Okay, thank you for your explanation."
        ],
        "knowledge": "Hypertension Hypertension  High blood pressure in pregnancy can be classified as pre-existing hypertension, gestational hypertension, or pre-eclampsia. Pre-eclampsia is a serious condition of the second half of pregnancy and following delivery characterised by increased blood pressure and the presence of protein in the urine.  It occurs in about 5% of pregnancies and is responsible for approximately 16% of all maternal deaths globally.  Pre-eclampsia also doubles the risk of death of the baby around the time of birth.  Usually there are no symptoms in pre-eclampsia and it is detected by routine screening.  When symptoms of pre-eclampsia occur the most common are headache, visual disturbance , vomiting, pain over the stomach, and swelling.  Pre-eclampsia can occasionally progress to a life-threatening condition called eclampsia, which is a hypertensive emergency and has several serious complications including vision loss, brain swelling, seizures, kidney failure, pulmonary edema, and disseminated intravascular coagulation  Hypertension Hypertension",
        "response": "You're welcome. Take care and contact me if you have any further symptoms or concerns."
    },
    {
        "dialog": [
            "Hi Medi, I recently had a baby and was diagnosed with pre-eclampsia. What should I do now?",
            "Hi, I am sorry to hear that. Did you have any complications during delivery?",
            "No, everything went smoothly. But I am worried about my future health.",
            "It's important to monitor your blood pressure closely and attend all follow-up appointments. You should also make lifestyle changes like exercising regularly and eating a healthy diet.",
            "Are there any medications I should take?",
            "We may prescribe medication to help lower your blood pressure if it remains high. It's important to take any medication as prescribed and attend all follow-up appointments.",
            "What are the potential long-term effects of pre-eclampsia?",
            "Pre-eclampsia can increase your risk of developing high blood pressure and heart disease later in life. We will monitor your health regularly to prevent any potential complications.",
            "Okay, thank you for your advice."
        ],
        "knowledge": "Hypertension Hypertension  High blood pressure in pregnancy can be classified as pre-existing hypertension, gestational hypertension, or pre-eclampsia. Pre-eclampsia is a serious condition of the second half of pregnancy and following delivery characterised by increased blood pressure and the presence of protein in the urine.  It occurs in about 5% of pregnancies and is responsible for approximately 16% of all maternal deaths globally.  Pre-eclampsia also doubles the risk of death of the baby around the time of birth.  Usually there are no symptoms in pre-eclampsia and it is detected by routine screening.  When symptoms of pre-eclampsia occur the most common are headache, visual disturbance , vomiting, pain over the stomach, and swelling.  Pre-eclampsia can occasionally progress to a life-threatening condition called eclampsia, which is a hypertensive emergency and has several serious complications including vision loss, brain swelling, seizures, kidney failure, pulmonary edema, and disseminated intravascular coagulation  Hypertension Hypertension",
        "response": "You're welcome. Take care and contact me if you have any further symptoms or concerns."
    },
    {
        "dialog": [
            "Hey Medi, I am seven months pregnant and I have some concerns about high blood pressure.",
            "Sure, I can help you with that. What specific questions do you have?",
            "What are the types of high blood pressure during pregnancy?",
            "There are three types: pre-existing hypertension, gestational hypertension, and pre-eclampsia.",
            "What is pre-eclampsia and what are its symptoms?",
            "Pre-eclampsia is a serious condition characterized by high blood pressure and protein in the urine. Symptoms include headache, visual disturbance, vomiting, pain over the stomach, and swelling.",
            "What should I do if I think I have pre-eclampsia?",
            "You should contact your doctor right away and follow their instructions. They may recommend monitoring, medication, or in severe cases, delivery of the baby.",
            "Thanks a lot for your help, Medi."
        ],
        "knowledge": "Hypertension Hypertension  High blood pressure in pregnancy can be classified as pre-existing hypertension, gestational hypertension, or pre-eclampsia. Pre-eclampsia is a serious condition of the second half of pregnancy and following delivery characterised by increased blood pressure and the presence of protein in the urine.  It occurs in about 5% of pregnancies and is responsible for approximately 16% of all maternal deaths globally.  Pre-eclampsia also doubles the risk of death of the baby around the time of birth.  Usually there are no symptoms in pre-eclampsia and it is detected by routine screening.  When symptoms of pre-eclampsia occur the most common are headache, visual disturbance , vomiting, pain over the stomach, and swelling.  Pre-eclampsia can occasionally progress to a life-threatening condition called eclampsia, which is a hypertensive emergency and has several serious complications including vision loss, brain swelling, seizures, kidney failure, pulmonary edema, and disseminated intravascular coagulation  Hypertension Hypertension",
        "response": "You're welcome. I'm glad I could help you with your concerns."
    },
    {
        "dialog": [
            "Hi, Medi. I had a C-section a month ago. Can you recommend any exercises or diet plan for me to follow?",
            "Sure, congratulations on the birth of your baby. How are you feeling?",
            "I am feeling much better, but I would like to start exercising and eating healthy.",
            "That's great to hear. You should start with some light exercises such as pelvic tilts, kegels, and walking. As for your diet, focus on eating nutrient-dense foods such as fruits, vegetables, lean proteins, and whole grains.",
            "What should I avoid in my diet?",
            "You should avoid processed foods, sugary drinks, and high-fat foods. Also, stay hydrated by drinking plenty of water throughout the day.",
            "How much physical activity should I do?",
            "Start with 10-15 minutes of light physical activity, such as walking, and gradually increase the duration and intensity based on how you feel. Listen to your body and don't push yourself too hard.",
            "Thanks for the advice, Medi."
        ],
        "knowledge": "C-section C-section  After a C-section, it's important to gradually return to physical activity. Start with light exercises such as pelvic tilts, kegels, and walking. As for your diet, focus on eating nutrient-dense foods such as fruits, vegetables, lean proteins, and whole grains. You should avoid processed foods, sugary drinks, and high-fat foods. Also, stay hydrated by drinking plenty of water throughout the day  C-section C-section",
        "response": "You're welcome. Let me know if you have any other questions."
    },
    {
        "dialog": [
            "Hi, Medi. I have been struggling with obesity for a while now. What lifestyle changes do you recommend?",
            "Hello, I am happy to hear that you want to make a change. My advice is to start with small changes such as reducing your sugar intake, eating more vegetables and fruits, and doing physical activity.",
            "What kind of physical activity do you suggest?",
            "Start with a physical activity that you enjoy such as walking, jogging, or cycling for at least 30 minutes a day, 5 days a week. You can also incorporate strength training 2-3 times a week to build muscle and increase your metabolism.",
            "Are there any particular foods that I should avoid?",
            "Yes, you should avoid processed foods, sugary drinks, and high-fat foods. Instead, focus on nutrient-dense foods such as fruits, vegetables, whole grains, and lean proteins.",
            "How many calories should I consume in a day?",
            "It depends on your age, weight, and activity level. Your doctor or a registered dietitian can help you determine the right amount of calories you should consume in a day.",
            "Thanks for your help, Medi."
        ],
        "knowledge": "Obesity Obesity Obesity is a complex public health and policy problem because of its prevalence, costs, and health effects.  As such, managing it requires changes in the wider societal context and effort by communities, local authorities, and governments.  Public health efforts seek to understand and correct the environmental factors responsible for the increasing prevalence of obesity in the population.  Solutions look at changing the factors that cause excess food energy consumption and inhibit physical activity.  Efforts include federally reimbursed meal programs in schools, limiting direct junk food marketing to children, and decreasing access to sugar-sweetened beverages in schools.  The World Health Organization recommends the taxing of sugary drinks.  When constructing urban environments, efforts have been made to increase access to parks and to develop pedestrian routes Obesity Obesity",
        "response": "You're welcome. Good luck on your journey to a healthier lifestyle."
    },
    {
        "dialog": [
            "Hello Medi, I have some symptoms and I need your help.",
            "Sure, I'm here to help. What are your symptoms?",
            "I have been experiencing headaches, visual disturbance, and pain over my stomach.",
            "Okay, these symptoms may be signs of pre-eclampsia. You should see a doctor as soon as possible.",
            "What is pre-eclampsia?",
            "Pre-eclampsia is a serious condition characterized by high blood pressure and protein in the urine. It can be dangerous for both you and your baby.",
            "What causes pre-eclampsia?",
            "The exact cause is unknown, but it may be related to problems with the placenta or blood vessels in the uterus.",
            "Is there anything I can do to prevent pre-eclampsia?"
        ],
        "knowledge": "Hypertension Hypertension  High blood pressure in pregnancy can be classified as pre-existing hypertension, gestational hypertension, or pre-eclampsia. Pre-eclampsia is a serious condition of the second half of pregnancy and following delivery characterised by increased blood pressure and the presence of protein in the urine.  It occurs in about 5% of pregnancies and is responsible for approximately 16% of all maternal deaths globally.  Pre-eclampsia also doubles the risk of death of the baby around the time of birth.  Usually there are no symptoms in pre-eclampsia and it is detected by routine screening.  When symptoms of pre-eclampsia occur the most common are headache, visual disturbance , vomiting, pain over the stomach, and swelling.  Pre-eclampsia can occasionally progress to a life-threatening condition called eclampsia, which is a hypertensive emergency and has several serious complications including vision loss, brain swelling, seizures, kidney failure, pulmonary edema, and disseminated intravascular coagulation  Hypertension Hypertension",
        "response": "Unfortunately, there is no way to prevent pre-eclampsia, but you can reduce your risk by attending all your prenatal appointments and monitoring your blood pressure regularly."
    },
    {
        "dialog": [
            "Hello Medi, can you explain the difference between pre-existing hypertension and gestational hypertension?",
            "Pre-existing hypertension is high blood pressure that existed before pregnancy. Gestational hypertension is high blood pressure that develops during pregnancy.",
            "Are there any symptoms of gestational hypertension?",
            "Usually, there are no symptoms. It is detected by routine screening during pregnancy.",
            "Is gestational hypertension harmful to me or my baby?",
            "It can be if not properly managed. It increases the risk of pre-eclampsia, premature birth, and low birth weight for the baby.",
            "What can I do to manage gestational hypertension?",
            "You should attend all your prenatal appointments, monitor your blood pressure regularly, and follow any treatment plan prescribed by your doctor.",
            "What kind of treatment is available for gestational hypertension?"
        ],
        "knowledge": "Hypertension Hypertension  High blood pressure in pregnancy can be classified as pre-existing hypertension, gestational hypertension, or pre-eclampsia. Pre-eclampsia is a serious condition of the second half of pregnancy and following delivery characterised by increased blood pressure and the presence of protein in the urine.  It occurs in about 5% of pregnancies and is responsible for approximately 16% of all maternal deaths globally.  Pre-eclampsia also doubles the risk of death of the baby around the time of birth.  Usually there are no symptoms in pre-eclampsia and it is detected by routine screening.  When symptoms of pre-eclampsia occur the most common are headache, visual disturbance , vomiting, pain over the stomach, and swelling.  Pre-eclampsia can occasionally progress to a life-threatening condition called eclampsia, which is a hypertensive emergency and has several serious complications including vision loss, brain swelling, seizures, kidney failure, pulmonary edema, and disseminated intravascular coagulation  Hypertension Hypertension",
        "response": "Your doctor may prescribe medication to lower your blood pressure if necessary. Additionally, they may recommend lifestyle changes such as reducing salt intake and increasing physical activity."
    },
    {
        "dialog": [
            "Hello Medi, I recently had a medical procedure related to pre-eclampsia and I'm wondering if there are any lifestyle changes I should make.",
            "Yes, there are some lifestyle changes you can make to reduce your risk of developing pre-eclampsia again.",
            "What are those changes?",
            "You can try to maintain a healthy weight, eat a balanced diet that is low in salt, stay active, and reduce stress.",
            "Are there any specific types of exercise I should do or avoid?",
            "Low-impact exercises such as walking, swimming, and prenatal yoga are generally safe during pregnancy. However, you should consult with your doctor before starting any exercise program.",
            "What kind of diet should I follow?",
            "You should eat a balanced diet that includes plenty of fruits, vegetables, lean protein, and whole grains. Avoid processed foods and foods high in salt or sugar.",
            "Thank you, Medi. I will make those changes to my lifestyle."
        ],
        "knowledge": "Hypertension Hypertension  High blood pressure in pregnancy can be classified as pre-existing hypertension, gestational hypertension, or pre-eclampsia. Pre-eclampsia is a serious condition of the second half of pregnancy and following delivery characterised by increased blood pressure and the presence of protein in the urine.  It occurs in about 5% of pregnancies and is responsible for approximately 16% of all maternal deaths globally.  Pre-eclampsia also doubles the risk of death of the baby around the time of birth.  Usually there are no symptoms in pre-eclampsia and it is detected by routine screening.  When symptoms of pre-eclampsia occur the most common are headache, visual disturbance , vomiting, pain over the stomach, and swelling.  Pre-eclampsia can occasionally progress to a life-threatening condition called eclampsia, which is a hypertensive emergency and has several serious complications including vision loss, brain swelling, seizures, kidney failure, pulmonary edema, and disseminated intravascular coagulation  Hypertension Hypertension",
        "response": "You're welcome. Remember to always consult with your doctor before making any significant changes to your diet or exercise routine."
    },
    {
        "dialog": [
            "Hello Medi, I am pregnant and I have high blood pressure.",
            "Okay, let me know more about your symptoms.",
            "I have a headache, vomiting and stomach pain.",
            "I think you may have pre-eclampsia. You should seek medical help immediately.",
            "What is pre-eclampsia?",
            "It is a serious condition that occurs in the second half of pregnancy and following delivery characterized by increased blood pressure and the presence of protein in the urine.",
            "What are the treatments for pre-eclampsia?",
            "The treatment is delivery of the baby, but if the baby is not ready for delivery, we may control the high blood pressure or give corticosteroids to help the baby's lungs mature.",
            "Should I be worried about the baby's health?"
        ],
        "knowledge": "Hypertension Hypertension  High blood pressure in pregnancy can be classified as pre-existing hypertension, gestational hypertension, or pre-eclampsia. Pre-eclampsia is a serious condition of the second half of pregnancy and following delivery characterized by increased blood pressure and the presence of protein in the urine.  It occurs in about 5% of pregnancies and is responsible for approximately 16% of all maternal deaths globally.  Pre-eclampsia also doubles the risk of death of the baby around the time of birth.  Usually there are no symptoms in pre-eclampsia and it is detected by routine screening.  When symptoms of pre-eclampsia occur the most common are headache, visual disturbance , vomiting, pain over the stomach, and swelling.  Pre-eclampsia can occasionally progress to a life-threatening condition called eclampsia, which is a hypertensive emergency and has several serious complications including vision loss, brain swelling, seizures, kidney failure, pulmonary edema, and disseminated intravascular coagulation  Hypertension Hypertension",
        "response": "I suggest you seek medical help immediately because you may have pre-eclampsia."
    },
    {
        "dialog": [
            "Hello Medi, what are the symptoms of pre-eclampsia?",
            "Usually there are no symptoms in pre-eclampsia and it is detected by routine screening.",
            "What kind of screening is required?",
            "You should have your blood pressure checked regularly and a urine test. We should be careful about the presence of protein in your urine.",
            "Why is protein in urine a concern?",
            "The presence of protein in the urine is an indicator of pre-eclampsia. It may lead to serious complications for both the mother and baby.",
            "Is there anything I can do to prevent this condition?",
            "You can reduce your risk of pre-eclampsia by having regular prenatal care, managing your blood pressure, and avoiding smoking and drinking alcohol.",
            "What should I do if I have pre-eclampsia?"
        ],
        "knowledge": "Hypertension Hypertension  High blood pressure in pregnancy can be classified as pre-existing hypertension, gestational hypertension, or pre-eclampsia. Pre-eclampsia is a serious condition of the second half of pregnancy and following delivery characterized by increased blood pressure and the presence of protein in the urine.  It occurs in about 5% of pregnancies and is responsible for approximately 16% of all maternal deaths globally.  Pre-eclampsia also doubles the risk of death of the baby around the time of birth.  Usually there are no symptoms in pre-eclampsia and it is detected by routine screening.  When symptoms of pre-eclampsia occur the most common are headache, visual disturbance , vomiting, pain over the stomach, and swelling.  Pre-eclampsia can occasionally progress to a life-threatening condition called eclampsia, which is a hypertensive emergency and has several serious complications including vision loss, brain swelling, seizures, kidney failure, pulmonary edema, and disseminated intravascular coagulation  Hypertension Hypertension",
        "response": "You can reduce your risk of pre-eclampsia by having regular prenatal care, managing your blood pressure, and avoiding smoking and drinking alcohol."
    },
    {
        "dialog": [
            "Hello Medi, I had a medical procedure to remove my gallbladder.",
            "Okay, let me know more about your current condition after the procedure.",
            "I have some abdominal pain and diarrhea.",
            "It is normal to have some abdominal pain and diarrhea after a gallbladder removal procedure. It will usually go away in a few days.",
            "What kind of diet should I follow after this procedure?",
            "You should have a low-fat diet and avoid spicy or greasy foods for a few days after the procedure.",
            "Can I do physical exercises after the procedure?",
            "You can start doing light physical exercises after a few days, but you should avoid heavy lifting or strenuous activities for a few weeks.",
            "How long does it take to fully recover from this procedure?"
        ],
        "knowledge": "Cholecystectomy Cholecystectomy  Cholecystectomy is the surgical removal of the gallbladder. It is a common treatment for symptomatic gallstones and other gallbladder conditions.  Most people experience some abdominal pain and diarrhea after a cholecystectomy, but these symptoms usually go away in a few days.  Patients are usually advised to have a low-fat diet and avoid spicy or greasy foods for a few days after the procedure.  Light physical activities can be resumed after a few days, but heavy lifting or strenuous activities should be avoided for a few weeks.  The overall recovery time varies depending on the patient's overall health status and the complexity of the procedure Cholecystectomy Cholecystectomy",
        "response": "It usually takes a few weeks to fully recover from a gallbladder removal procedure, but it may vary depending on your overall health condition and the complexity of the procedure."
    },
    {
        "dialog": [
            "Hi Medi, I'm worried about my blood pressure during pregnancy.",
            "Hi there! I'm here to help. What are your specific concerns?",
            "I'm not sure if I'm at risk of developing pre-eclampsia. What is it?",
            "Pre-eclampsia is a serious condition characterized by high blood pressure and protein in the urine. It can occur in the second half of pregnancy and following delivery.",
            "What are the symptoms of pre-eclampsia that I should look out for?",
            "Symptoms include headache, visual disturbance, vomiting, pain over the stomach, and swelling. However, regular screening is the best way to detect it.",
            "What should I do if I have pre-eclampsia?",
            "If you have pre-eclampsia, your doctor will advise you on managing the symptoms. You may need bed rest and medication, or you may need to give birth if your condition is severe.",
            "How can I prevent pre-eclampsia?"
        ],
        "knowledge": "Hypertension Hypertension  High blood pressure in pregnancy can be classified as pre-existing hypertension, gestational hypertension, or pre-eclampsia. Pre-eclampsia is a serious condition of the second half of pregnancy and following delivery characterised by increased blood pressure and the presence of protein in the urine.  It occurs in about 5% of pregnancies and is responsible for approximately 16% of all maternal deaths globally.  Pre-eclampsia also doubles the risk of death of the baby around the time of birth.  Usually there are no symptoms in pre-eclampsia and it is detected by routine screening.  When symptoms of pre-eclampsia occur the most common are headache, visual disturbance , vomiting, pain over the stomach, and swelling.  Pre-eclampsia can occasionally progress to a life-threatening condition called eclampsia, which is a hypertensive emergency and has several serious complications including vision loss, brain swelling, seizures, kidney failure, pulmonary edema, and disseminated intravascular coagulation  Hypertension Hypertension",
        "response": "There is no surefire way to prevent pre-eclampsia, but making sure to attend all prenatal appointments and follow your doctor's advice can help reduce your risk."
    },
    {
        "dialog": [
            "Medi, I recently had a baby and I'm worried about my diet.",
            "Hi there! Congrats on being a new mom! What specific concerns do you have about your diet?",
            "I want to know what foods are best for me as a new mother.",
            "As a new mother, it's important to have a balanced diet that includes plenty of protein, calcium, and iron. Foods like lean meats, spinach, dairy, and fortified cereals can help meet these needs.",
            "What about breastfeeding?",
            "Breastfeeding is a great way to provide your baby with all the nutrients they need, so it's important to maintain a healthy diet while breastfeeding. Drinking plenty of water and eating foods rich in omega-3 fatty acids, like salmon, can also help promote healthy milk production.",
            "What should I avoid while breastfeeding?",
            "While breastfeeding, it's best to avoid alcohol and limit caffeine intake. Certain foods, like spicy or gassy foods, may also affect your baby's digestion and should be eaten in moderation.",
            "Thanks for the advice, Medi. What about exercise?"
        ],
        "knowledge": "Postpartum Nutrition Postpartum Nutrition  As a new mother, nutrition is important for both you and your baby. It's recommended to have a balanced diet with plenty of protein, calcium, and iron. Breastfeeding is a great way to provide your baby with all the nutrients they need, so it's important to maintain a healthy diet while breastfeeding. Drinking plenty of water and eating foods rich in omega-3 fatty acids can also help promote healthy milk production. Certain foods, like spicy or gassy foods, may also affect your baby's digestion and should be eaten in moderation. Postpartum exercise is also important, but it's important to wait until you've been cleared by your doctor before starting.",
        "response": "It's important to wait until you've been cleared by your doctor before starting postpartum exercise. Once you have the green light, light activities like walking or yoga are great ways to ease back into exercise."
    },
    {
        "dialog": [
            "Hello Medi, I recently gave birth and I'm looking for ways to get back in shape.",
            "Hi there! Congratulations on your new baby! What specifically are you looking for in terms of getting back in shape?",
            "I want to focus on losing weight and toning my muscles.",
            "To lose weight, it's important to create a calorie deficit through diet and exercise. Incorporating strength training exercises, like lifting weights, can help tone muscles and boost metabolism. Additionally, getting regular exercise can help improve mood and reduce stress, which can be especially important for new mothers.",
            "What about diet?",
            "A healthy diet that's rich in whole foods, like fruits, vegetables, and lean proteins, can help you lose weight and improve overall health. It's also important to stay hydrated and limit your intake of processed foods and added sugars.",
            "What types of exercises should I avoid?",
            "As a new mother, it's important to avoid high-impact exercises that could cause injury, like running or jumping. Instead, focus on low-impact exercises, like walking or swimming, and gradually increase intensity as you build strength.",
            "Thanks for the tips, Medi. What about sleep?"
        ],
        "knowledge": "Postpartum Exercise Postpartum Exercise  Getting back in shape after giving birth can take time, but it's important to prioritize physical activity for both physical and mental health. Incorporating strength training exercises, like lifting weights, can help tone muscles and boost metabolism. Additionally, getting regular exercise can help improve mood and reduce stress, which can be especially important for new mothers. It's important to avoid high-impact exercises that could cause injury, like running or jumping, and instead focus on low-impact exercises. A healthy diet that's rich in whole foods can also help you lose weight and improve overall health. Staying hydrated and limiting your intake of processed foods and added sugars is also important.",
        "response": "Sleep is important for overall health, but it can be difficult to come by as a new mother. Try to sneak in sleep whenever you can, even if it's just a quick nap during the day. Enlisting the help of a partner or family member can also help give you more time for rest."
    },
    {
        "dialog": [
            "Hi Medi, I am pregnant and worried about high blood pressure. What should I do?",
            "Hello, High blood pressure can be classified as pre-existing hypertension or gestational hypertension with preeclampsia being a serious condition  ",
            "So what is pre-eclampsia?",
            "It's a serious condition of the second half of pregnancy and following delivery characterised by increased blood pressure and the presence of protein in the urine. ",
            "What are the symptoms of pre-eclampsia?",
            "Usually there are no symptoms in pre-eclampsia and it is detected by routine screening. When symptoms occur the most common are headache, visual disturbance, vomiting, pain over the stomach, and swelling.",
            "What should I do to prevent pre-eclampsia?",
            "You could prevent pre-eclampsia by maintaining a healthy lifestyle, including regular prenatal care and monitoring and medication if necessary.",
            "Thanks Medi. If I have any concerns, can I talk to you again?"
        ],
        "knowledge": "Hypertension Hypertension High blood pressure in pregnancy can be classified as pre-existing hypertension, gestational hypertension, or pre-eclampsia. Pre-eclampsia is a serious condition of the second half of pregnancy and following delivery characterised by increased blood pressure and the presence of protein in the urine. It occurs in about 5% of pregnancies and is responsible for approximately 16% of all maternal deaths globally. Pre-eclampsia also doubles the risk of death of the baby around the time of birth. Usually there are no symptoms in pre-eclampsia and it is detected by routine screening. When symptoms of pre-eclampsia occur the most common are headache, visual disturbance, vomiting, pain over the stomach, and swelling. Pre-eclampsia can occasionally progress to a life-threatening condition called eclampsia, which is a hypertensive emergency and has several serious complications including vision loss, brain swelling, seizures, kidney failure, pulmonary edema, and disseminated intravascular coagulation Hypertension Hypertension",
        "response": "Yes, sure. I am always here to help you 24/7. You can ask me anything regarding your health anytime."
    },
    {
        "dialog": [
            "Hi Medi, I have some questions about pre-eclampsia.",
            "Hello, I am happy to answer your questions about pre-eclampsia.",
            "Can pre-eclampsia cause any complications?",
            "Yes, pre-eclampsia can progress to a life-threatening condition called eclampsia, which has several serious complications including vision loss, brain swelling, seizures, kidney failure, pulmonary edema, and disseminated intravascular coagulation.",
            "What are the causes of pre-eclampsia?",
            "The exact cause of pre-eclampsia is unknown, but it is believed that it could be related to the placenta and how it interacts with the mother's blood vessels.",
            "Am I at higher risk of getting pre-eclampsia?",
            "You are at higher risk of getting pre-eclampsia if you are having your first baby, over 35 years old, overweight, having twins, or have a pre-existing medical condition such as high blood pressure, diabetes, or kidney disease.",
            "Thanks Medi. I am relieved to know more about pre-eclampsia."
        ],
        "knowledge": "Hypertension Hypertension High blood pressure in pregnancy can be classified as pre-existing hypertension, gestational hypertension, or pre-eclampsia. Pre-eclampsia is a serious condition of the second half of pregnancy and following delivery characterised by increased blood pressure and the presence of protein in the urine. It occurs in about 5% of pregnancies and is responsible for approximately 16% of all maternal deaths globally. Pre-eclampsia also doubles the risk of death of the baby around the time of birth. Usually there are no symptoms in pre-eclampsia and it is detected by routine screening. When symptoms of pre-eclampsia occur the most common are headache, visual disturbance, vomiting, pain over the stomach, and swelling. Pre-eclampsia can occasionally progress to a life-threatening condition called eclampsia, which is a hypertensive emergency and has several serious complications including vision loss, brain swelling, seizures, kidney failure, pulmonary edema, and disseminated intravascular coagulation Hypertension Hypertension",
        "response": "I am happy to help you anytime. Stay healthy!"
    },
    {
        "dialog": [
            "Hi Medi, I had a cesarean delivery. What should I do to take care of myself?",
            "Hello, congratulations! You need to take extra care of yourself after a caesarean delivery.",
            "What kind of care should I take?",
            "You should rest and get plenty of sleep. Avoid lifting anything heavy, such as your baby or other children, for at least four to six weeks after delivery. Also, avoid driving until you are no longer taking any narcotic pain medication.",
            "How about doing physical activity?",
            "You can gradually increase your physical activity. Start with short walks and light stretching exercises and gradually increase the duration and intensity of your activity. Consult with your healthcare provider before starting any new exercise routine.",
            "Should I pay attention to my diet?",
            "Yes, it is important to eat a healthy diet including plenty of fruits, vegetables, and whole grains. Also, drink plenty of water and avoid alcohol and caffeine. Consult with your healthcare provider before starting any new diet.",
            "Thanks Medi. I appreciate your advice."
        ],
        "knowledge": "Cesarean delivery Cesarean delivery A cesarean delivery is a surgical procedure used to deliver a baby through incisions in the abdomen and uterus. Cesarean deliveries are performed when a vaginal delivery is not possible or safe for the mother or baby. After a cesarean delivery, the new mother needs to take extra care of herself. She should rest and get plenty of sleep, avoid lifting anything heavy, such as her baby or other children, for at least four to six weeks after delivery, and avoid driving until she is no longer taking any narcotic pain medication. She should gradually increase her physical activity, starting with short walks and light stretching exercises and gradually increasing the duration and intensity of her activity. A healthy diet including plenty of fruits, vegetables, and whole grains is also important. She should drink plenty of water and avoid alcohol and caffeine. Cesarean delivery Cesarean delivery",
        "response": "You are welcome. I am always here to help you. Stay healthy!"
    },
    {
        "dialog": [
            "Hello Medi, I think I might have pre-eclampsia",
            "What are your symptoms?",
            "I have a headache and my vision is blurry",
            "These symptoms may indicate pre-eclampsia. You should see a doctor immediately",
            "What are the risks of pre-eclampsia to my baby?",
            "Pre-eclampsia doubles the risk of death of the baby around the time of birth",
            "What can I do to prevent pre-eclampsia?",
            "The cause of pre-eclampsia is unknown and there is no way to prevent it. But, attending antenatal care appointments is important to detect it early.",
            "Thank you for your help, Medi."
        ],
        "knowledge": "Hypertension Hypertension  High blood pressure in pregnancy can be classified as pre-existing hypertension, gestational hypertension, or pre-eclampsia. Pre-eclampsia is a serious condition of the second half of pregnancy and following delivery characterised by increased blood pressure and the presence of protein in the urine.  It occurs in about 5% of pregnancies and is responsible for approximately 16% of all maternal deaths globally.  Pre-eclampsia also doubles the risk of death of the baby around the time of birth.  Usually there are no symptoms in pre-eclampsia and it is detected by routine screening.  When symptoms of pre-eclampsia occur the most common are headache, visual disturbance , vomiting, pain over the stomach, and swelling.  Pre-eclampsia can occasionally progress to a life-threatening condition called eclampsia, which is a hypertensive emergency and has several serious complications including vision loss, brain swelling, seizures, kidney failure, pulmonary edema, and disseminated intravascular coagulation  Hypertension Hypertension",
        "response": "You're welcome."
    },
    {
        "dialog": [
            "Hello Medi, I have a question about hypertension in pregnancy",
            "How can I assist you?",
            "What are the types of hypertension in pregnancy?",
            "There are pre-existing hypertension, gestational hypertension, and pre-eclampsia",
            "What is pre-eclampsia?",
            "It is a serious condition characterised by increased blood pressure and the presence of protein in the urine. It can result in several serious complications",
            "How is pre-eclampsia diagnosed?",
            "It is detected by routine screening as usually there are no symptoms in pre-eclampsia",
            "Thank you for the explanation, Medi."
        ],
        "knowledge": "Hypertension Hypertension  High blood pressure in pregnancy can be classified as pre-existing hypertension, gestational hypertension, or pre-eclampsia. Pre-eclampsia is a serious condition of the second half of pregnancy and following delivery characterised by increased blood pressure and the presence of protein in the urine.  It occurs in about 5% of pregnancies and is responsible for approximately 16% of all maternal deaths globally.  Pre-eclampsia also doubles the risk of death of the baby around the time of birth.  Usually there are no symptoms in pre-eclampsia and it is detected by routine screening.  When symptoms of pre-eclampsia occur the most common are headache, visual disturbance , vomiting, pain over the stomach, and swelling.  Pre-eclampsia can occasionally progress to a life-threatening condition called eclampsia, which is a hypertensive emergency and has several serious complications including vision loss, brain swelling, seizures, kidney failure, pulmonary edema, and disseminated intravascular coagulation  Hypertension Hypertension",
        "response": "You're welcome."
    },
    {
        "dialog": [
            "Hi Medi, I just had a caesarean section. What should I do for my recovery?",
            "Congratulations on your new baby! A caesarean section requires a longer recovery time than vaginal birth. Take enough rest and follow your doctor's advice.",
            "Can I do any physical exercise?",
            "In the initial days, focus on rest. After that, begin with gentle exercises such as walking and pelvic floor exercises",
            "What should my diet be like?",
            "Eat a healthy and balanced diet with plenty of protein, iron, and calcium. Drink plenty of water and avoid processed foods.",
            "Thank you for your advice, Medi.",
            "You're welcome. Take care."
        ],
        "knowledge": "Hypertension Hypertension  High blood pressure in pregnancy can be classified as pre-existing hypertension, gestational hypertension, or pre-eclampsia. Pre-eclampsia is a serious condition of the second half of pregnancy and following delivery characterised by increased blood pressure and the presence of protein in the urine.  It occurs in about 5% of pregnancies and is responsible for approximately 16% of all maternal deaths globally.  Pre-eclampsia also doubles the risk of death of the baby around the time of birth.  Usually there are no symptoms in pre-eclampsia and it is detected by routine screening.  When symptoms of pre-eclampsia occur the most common are headache, visual disturbance , vomiting, pain over the stomach, and swelling.  Pre-eclampsia can occasionally progress to a life-threatening condition called eclampsia, which is a hypertensive emergency and has several serious complications including vision loss, brain swelling, seizures, kidney failure, pulmonary edema, and disseminated intravascular coagulation  Hypertension Hypertension",
        "response": "You're welcome."
    },
    {
        "dialog": [
            "Hello Medi, I am pregnant and worried about my blood pressure",
            "Hi, as a chatbot medical supporter, I can help you. What's your blood pressure measurement?",
            "It's been 140/90 mmHg for the past few days.",
            "Based on your blood pressure, you might have gestational hypertension. You should consult your doctor immediately.",
            "What are the symptoms of gestational hypertension?",
            "Most people have no symptoms, but some have severe headaches, blurred vision, or swelling.",
            "What can happen if I ignore it?",
            "If left untreated, it can lead to preeclampsia, a serious condition that can harm you and your baby.",
            "What can I do to prevent it?"
        ],
        "knowledge": "Hypertension Hypertension  High blood pressure in pregnancy can be classified as pre-existing hypertension, gestational hypertension, or pre-eclampsia. Pre-eclampsia is a serious condition of the second half of pregnancy and following delivery characterised by increased blood pressure and the presence of protein in the urine.  It occurs in about 5% of pregnancies and is responsible for approximately 16% of all maternal deaths globally.  Pre-eclampsia also doubles the risk of death of the baby around the time of birth.  Usually there are no symptoms in pre-eclampsia and it is detected by routine screening.  When symptoms of pre-eclampsia occur the most common are headache, visual disturbance , vomiting, pain over the stomach, and swelling.  Pre-eclampsia can occasionally progress to a life-threatening condition called eclampsia, which is a hypertensive emergency and has several serious complications including vision loss, brain swelling, seizures, kidney failure, pulmonary edema, and disseminated intravascular coagulation  Hypertension Hypertension",
        "response": "You can prevent it by eating a healthy diet, exercising regularly, and monitoring your blood pressure regularly."
    },
    {
        "dialog": [
            "Hi Medi, I just had a C-section. Can you please tell me how to take care of myself?",
            "Hi, I'm here to help. Firstly, you should get plenty of rest and avoid strenuous activities. How are your incisions?",
            "They are sore and painful. What can I do to ease the pain?",
            "You can take pain medications prescribed by your doctor. Also, apply an ice pack or heating pad to your incision.",
            "What is the best way to prevent an infection?",
            "You should keep your incision clean and dry. Change your bandages regularly and avoid touching the area with dirty hands.",
            "When can I resume normal activities?",
            "You should avoid heavy lifting or strenuous activities for at least six weeks. Consult your doctor before starting any exercise routine.",
            "Thank you, Medi. One last question, is it normal to feel emotional after a C-section?"
        ],
        "knowledge": "C-section C-section  A cesarean section, also known as a C-section, is a surgical procedure used to deliver a baby.  After a C-section, women may feel tired, sore, and have difficulty moving around for several days.  It is normal to feel emotional after a C-section, which is a major surgery.  Some women may experience postpartum depression or anxiety.  It is important to discuss your feelings with your doctor or a mental health professional if you are struggling with emotional issues after a C-section.",
        "response": "Yes, it is normal to feel emotional after a C-section. But if you are struggling with emotional issues, it is important to discuss your feelings with your doctor or a mental health professional."
    },
    {
        "dialog": [
            "Hi Medi, I had gestational diabetes during my pregnancy. What should I do now?",
            "Hi, I'm here to help. Firstly, you should continue monitoring your blood sugar levels. Have you checked them recently?",
            "Yes, I checked them yesterday. They were a bit higher than normal.",
            "That's a sign that your diabetes may still be present. You should continue following a healthy diet and exercising regularly.",
            "Will I have diabetes forever?",
            "Not necessarily. Most women's blood sugar levels return to normal after giving birth. However, you are at risk for developing diabetes in the future.",
            "What can I do to prevent it?",
            "You should continue following a healthy lifestyle, such as eating a balanced diet, exercising regularly, and maintaining a healthy weight. You should also get regular check-ups with your doctor.",
            "Thank you for your advice, Medi. One more question, what are the symptoms of diabetes?"
        ],
        "knowledge": "Diabetes Diabetes  Diabetes is a chronic disease that affects how your body processes blood sugar (glucose).  There are three main types of diabetes: type 1, type 2, and gestational diabetes.  Gestational diabetes is a type of diabetes that develops during pregnancy.  Most women's blood sugar levels return to normal after giving birth, but women who have had gestational diabetes are at risk for developing type 2 diabetes later in life.  Symptoms of diabetes include increased thirst, frequent urination, hunger, fatigue, blurred vision, and slow healing of wounds or sores.  However, many people with diabetes have no symptoms.  It is important to get regular check-ups with your doctor to monitor your blood sugar levels.  Diabetes Diabetes",
        "response": "Symptoms of diabetes include increased thirst, frequent urination, hunger, fatigue, blurred vision, and slow healing of wounds or sores. But many people with diabetes have no symptoms."
    }
]