[
    {
        "dialog": [
            "Hello Medi, I'm feeling unwell and I have a headache.",
            "Hi, sorry to hear that. Can you describe your headache?",
            "It feels like a pounding pain on the sides of my head.",
            "How long have you been experiencing this headache?",
            "It started yesterday and has continued until today.",
            "Have you taken any medication for it?",
            "No, I haven’t. I’m worried it might be something serious.",
            "Based on your symptoms, it might just be a tension headache. Try taking acetaminophen and get enough rest.",
            "Okay, thank you for your advice, Medi. I hope I feel better soon."
        ],
        "knowledge": "Headache Headache Headaches can be classified into types, such as tension headache, migraine headache, cluster headache, and medication overuse headache. Tension headaches are the most common type of primary headache and are often caused by stress. They are usually mild to moderate in intensity and are characterized by a pressing or tightening sensation around the head. Migraines are another common type of headache and are usually more severe than tension headaches. They are often accompanied by other symptoms, such as nausea, vomiting, and sensitivity to light. Cluster headaches are a rare type of headache that occur in clusters, usually at the same time of day for several weeks or months. They are characterized by severe pain behind one eye and can be very debilitating. Medication overuse headache is a headache caused by overuse of medication for headaches. Headache Headache",
        "response": "Based on your symptoms, your headache might just be a tension headache. Try taking acetaminophen and get enough rest."
    },
    {
        "dialog": [
            "Hi Medi, I'm curious about encephalitis. What is it exactly?",
            "Encephalitis is inflammation of the brain, usually caused by a viral infection.",
            "What are some symptoms of encephalitis?",
            "Symptoms of encephalitis include fever, headache, confusion, drowsiness, seizures, and sometimes, hallucinations or personality changes.",
            "Is encephalitis contagious?",
            "It can be contagious if it is caused by a virus that can be spread from person to person.",
            "How is it diagnosed and treated?",
            "It can be diagnosed through a physical exam, blood tests, and imaging tests. Treatment usually involves antiviral medications and supportive care, such as rest, pain relief, and hydration.",
            "Thanks for the information, Medi. I appreciate it."
        ],
        "knowledge": "Encephalitis Encephalitis Encephalitis is inflammation of the brain, usually caused by a viral infection. It can also be caused by bacterial or fungal infections, but these are less common. The symptoms of encephalitis can vary widely, depending on the cause and severity of the inflammation. Common symptoms include fever, headache, confusion, drowsiness, seizures, and sometimes, hallucinations or personality changes. Encephalitis can be diagnosed through a physical exam, blood tests, and imaging tests. Treatment usually involves antiviral medications and supportive care, such as rest, pain relief, and hydration. Encephalitis Encephalitis",
        "response": "Encephalitis is inflammation of the brain, usually caused by a viral infection. Symptoms include fever, headache, confusion, drowsiness, seizures, and sometimes, hallucinations or personality changes. It can be diagnosed through a physical exam, blood tests, and imaging tests. Treatment usually involves antiviral medications and supportive care, such as rest, pain relief, and hydration."
    },
    {
        "dialog": [
            "Hello Medi, I just got out of the hospital after being treated for encephalitis. What should I do now?",
            "I'm glad you're feeling better. It's important to continue taking any medications prescribed by your doctor.",
            "What about my diet and exercise regime?",
            "You should aim to eat a healthy, balanced diet that includes plenty of fruits, vegetables, and whole grains. Avoid high-fat, high-sugar, and processed foods as much as possible.",
            "What types of exercise are recommended?",
            "Regular exercise is important for a healthy recovery. Start with low-impact activities such as walking, yoga, or swimming, and gradually increase the intensity and duration as you feel more comfortable.",
            "What about rest?",
            "Getting enough rest is also important. Make sure you get plenty of sleep and avoid overexerting yourself.",
            "Thanks, Medi. I appreciate your advice."
        ],
        "knowledge": "Encephalitis Encephalitis Recovery from encephalitis can take some time, and it's important to continue taking any medications prescribed by your doctor. In addition to medication, a healthy, balanced diet that includes plenty of fruits, vegetables, and whole grains can help support the recovery process. Avoid high-fat, high-sugar, and processed foods as much as possible. Regular exercise is also important, but start with low-impact activities such as walking, yoga, or swimming, and gradually increase the intensity and duration as you feel more comfortable. Getting enough rest is also important. Make sure you get plenty of sleep and avoid overexerting yourself. Encephalitis Encephalitis",
        "response": "After being treated for encephalitis, it's important to continue taking any medications prescribed by your doctor. Aim to eat a healthy, balanced diet that includes plenty of fruits, vegetables, and whole grains, and avoid high-fat, high-sugar, and processed foods as much as possible. Regular exercise is important, but start with low-impact activities such as walking, yoga, or swimming, and gradually increase the intensity and duration as you feel more comfortable. Getting enough rest is also important. Make sure you get plenty of sleep and avoid overexerting yourself."
    },
    {
        "dialog": [
            "Hello Medi, I think I might have encephalitis.",
            "I'm here to help you. What are your symptoms?",
            "I've been experiencing severe headaches, fever, and some confusion.",
            "These are signs of encephalitis. You should see a doctor immediately and get a check-up.",
            "Is there anything else I can do to alleviate the symptoms?",
            "Rest is important, and you should avoid taking any non-prescription drugs. Drink plenty of fluids and keep yourself hydrated.",
            "What do you think causes encephalitis?",
            "Encephalitis can be caused by viruses or bacteria, and sometimes it can develop after a previous infection. It's important to take care of yourself and be cautious of your surroundings.",
            "Thanks for your help Medi."
        ],
        "knowledge": "Encephalitis Encephalitis  Herpes simplex encephalitis has an incidence of 2–4 per million of the population per year. Encephalitis with meningitis is known as meningoencephalitis, while encephalitis with involvement of the spinal cord is known as encephalomyelitis. The word is from Ancient Greek ἐγκέφαλος, enképhalos \"brain\", composed of ἐν, en, \"in\" and κεφαλή, kephalé, \"head\", and the medical suffix -itis \"inflammation\".  Encephalitis Encephalitis",
        "response": "You're welcome. Please don't hesitate to see a doctor immediately and get a check-up. It's important to take care of yourself and be cautious of your surroundings."
    },
    {
        "dialog": [
            "Hello Medi, can you tell me more about encephalitis?",
            "Sure, I'm here to help. What would you like to know?",
            "What is encephalitis caused by?",
            "Encephalitis can be caused by viruses or bacteria, and sometimes it can develop following a previous infection.",
            "What are the symptoms of encephalitis?",
            "The symptoms of encephalitis can include fever, severe headaches, confusion, seizures, and hallucinations.",
            "How can encephalitis be treated?",
            "Treatment for encephalitis depends on the underlying cause. Antiviral or antibiotics may be prescribed depending on the root cause of the condition. Hospitalization is also a common option for severe cases.",
            "Thanks for the information, Medi."
        ],
        "knowledge": "Encephalitis Encephalitis  Herpes simplex encephalitis has an incidence of 2–4 per million of the population per year. Encephalitis with meningitis is known as meningoencephalitis, while encephalitis with involvement of the spinal cord is known as encephalomyelitis. The word is from Ancient Greek ἐγκέφαλος, enképhalos \"brain\", composed of ἐν, en, \"in\" and κεφαλή, kephalé, \"head\", and the medical suffix -itis \"inflammation\".  Encephalitis Encephalitis",
        "response": "You're welcome. Let me know if you have any further questions."
    },
    {
        "dialog": [
            "Hello Medi, I just underwent a spinal tap to diagnose encephalitis. What should I do now?",
            "I'm here to help you. How are you feeling after the procedure?",
            "I'm feeling a little lightheaded and dizzy, and I have a headache.",
            "It's normal to feel that way after a spinal tap. You should rest and take it easy for the next few days.",
            "What should I eat and drink after the procedure?",
            "You should drink plenty of water and other fluids to stay hydrated. Avoid any alcohol and caffeine. Eat foods that are easy on your stomach.",
            "What kind of physical activities can I do after the procedure?",
            "You should avoid lifting heavy objects and any strenuous physical activities. Walking and light stretching are okay if you feel up to it.",
            "Thanks for your help, Medi."
        ],
        "knowledge": "Encephalitis Encephalitis  Herpes simplex encephalitis has an incidence of 2–4 per million of the population per year. Encephalitis with meningitis is known as meningoencephalitis, while encephalitis with involvement of the spinal cord is known as encephalomyelitis. The word is from Ancient Greek ἐγκέφαλος, enképhalos \"brain\", composed of ἐν, en, \"in\" and κεφαλή, kephalé, \"head\", and the medical suffix -itis \"inflammation\".  Encephalitis Encephalitis",
        "response": "You're welcome. Let me know if you have any more questions."
    },
    {
        "dialog": [
            "Hi Medi, I've been experiencing a headache for a few days.",
            "Hi there, I'm here to help. Can you describe your headache?",
            "My head hurts all over, and it's really intense.",
            "I see. Have you tried taking any pain relievers?",
            "Yes, but it only helps for a short while.",
            "Okay, I suggest you get enough rest and drink plenty of fluids",
            "Alright, I'll do that. Thank you, Medi.",
            "You're welcome. If it persists, seek medical attention.",
            "Okay, I will. Bye!"
        ],
        "knowledge": "Headache Headache  A headache is pain in any region of the head.  Headaches may occur on one or both sides of the head, be isolated to a certain location, radiate across the head from one point, or have a vise-like quality.  A headache may appear as a sharp pain, a throbbing sensation or a dull ache.  Headaches can develop gradually or suddenly and may last from less than an hour to several days.  Common causes of headaches include stress, tension, restlessness, sinusitis, migraines, and dehydration.  Headaches are usually harmless and can be treated with simple painkillers. Headache Headache",
        "response": "Sure, if your headache persists, please consult a doctor."
    },
    {
        "dialog": [
            "Hello Medi, I have a question about encephalitis.",
            "Sure, what's the question?",
            "What is the most common type of encephalitis?",
            "The most common type of encephalitis is Herpes simplex encephalitis",
            "What are the symptoms of encephalitis?",
            "Symptoms include headache, fever, confusion, seizures, and problems with speech or hearing.",
            "How is encephalitis diagnosed?",
            "Encephalitis is diagnosed by a combination of clinical presentation, blood tests, and radiological studies.",
            "I see. Thank you, Medi."
        ],
        "knowledge": "Encephalitis Encephalitis  Herpes simplex encephalitis has an incidence of 2–4 per million of the population per year. Encephalitis with meningitis is known as meningoencephalitis, while encephalitis with involvement of the spinal cord is known as encephalomyelitis. The word is from Ancient Greek ἐγκέφαλος, enképhalos 'brain', composed of ἐν, en, 'in' and κεφαλή, kephalé, 'head', and the medical suffix -itis 'inflammation'.  Encephalitis Encephalitis",
        "response": "You're welcome. Don't hesitate to ask if you have any other questions."
    },
    {
        "dialog": [
            "Hi Medi, I just had spinal encephalitis. Can you give me some advice on what to do now?",
            "Sure, I can help. Getting enough rest and avoiding stress is important",
            "What should I change in my diet?",
            "Eating a well-balanced diet with plenty of fruits and vegetables can help",
            "Are there any exercises that can help me?",
            "It's best to consult with your doctor, but gentle exercises like yoga or walking may be beneficial",
            "Are there any medications I should take?",
            "Your doctor may prescribe antiviral medications or corticosteroids to reduce inflammation",
            "I see. Thank you, Medi."
        ],
        "knowledge": "Encephalitis Encephalitis  Herpes simplex encephalitis has an incidence of 2–4 per million of the population per year. Encephalitis with meningitis is known as meningoencephalitis, while encephalitis with involvement of the spinal cord is known as encephalomyelitis. The word is from Ancient Greek ἐγκέφαλος, enképhalos 'brain', composed of ἐν, en, 'in' and κεφαλή, kephalé, 'head', and the medical suffix -itis 'inflammation'.  Encephalitis Encephalitis",
        "response": "You're welcome. Take care of yourself and follow your doctor's instructions for a speedy recovery."
    },
    {
        "dialog": [
            "Hey Medi, I've been feeling really dizzy lately.",
            "Hi there, can you tell me more about your symptoms?",
            "I feel like everything is spinning around me, especially when I move my head.",
            "That sounds like vertigo. Have you been experiencing any nausea or vomiting?",
            "Yes, I've felt nauseous a few times, but I haven't thrown up.",
            "It's possible that you have benign paroxysmal positional vertigo. I recommend seeing a doctor for a proper diagnosis.",
            "Is there anything I can do in the meantime?",
            "Try to avoid sudden head movements, and sit up slowly in the mornings. If the symptoms persist, seek medical attention.",
            "Thank you, Medi. I'll keep that in mind."
        ],
        "knowledge": "Vertigo Vertigo  Vertigo is the sensation of spinning or dizziness that can cause a person to feel unsteady or lose their balance.  It is often caused by an inner ear problem that affects balance.  Other causes include migraines, head injuries, and certain medications.  Symptoms include spinning, tilting, swaying, unbalanced, or being pulled to one side.  Nausea and vomiting may also accompany vertigo.  Benign paroxysmal positional vertigo (BPPV) is a common type of vertigo caused by a problem in the inner ear.  It is more common in older adults.  Other types of vertigo are less common.  Treatment for vertigo depends on the underlying cause. Vertigo Vertigo",
        "response": "Based on your symptoms, there's a possibility that you have benign paroxysmal positional vertigo. I recommend seeing a doctor for a proper diagnosis."
    },
    {
        "dialog": [
            "Hi Medi, I'm a bit confused about encephalitis. Can you explain more about it?",
            "Of course, encephalitis is inflammation of the brain usually caused by a viral infection.",
            "What are the symptoms?",
            "Symptoms can include fever, headache, confusion, seizures, and even coma in severe cases.",
            "How is it treated?",
            "Treatment often involves antiviral medications or corticosteroids to reduce inflammation in the brain.",
            "Is there anything I can do to prevent it?",
            "Encephalitis can be prevented by practicing good hygiene, such as washing your hands regularly and avoiding close contact with people who are sick. Make sure to get vaccinated against any viruses that can cause encephalitis.",
            "Thank you for explaining, Medi."
        ],
        "knowledge": "Encephalitis Encephalitis  Encephalitis is inflammation of the brain usually caused by a viral infection.  Symptoms include fever, headache, confusion, seizures, and even coma in severe cases.  Other symptoms may include personality changes, speech or hearing problems, or vision problems.  Encephalitis can be caused by a variety of viruses, including herpes simplex virus, West Nile virus, and Japanese encephalitis virus.  Treatment often involves antiviral medications or corticosteroids to reduce inflammation in the brain.  Encephalitis can be prevented by practicing good hygiene, such as washing your hands regularly and avoiding close contact with people who are sick.  Vaccines are available against some of the viruses that can cause encephalitis. Encephalitis Encephalitis",
        "response": "Thank you for explaining encephalitis to me. Can you tell me more about the different viruses that can cause it?"
    },
    {
        "dialog": [
            "Hey Medi, I just had a lumbar puncture and I'm not sure what I should do now.",
            "Hi there, after a lumbar puncture, it's important to rest for a few hours and drink plenty of fluids.",
            "Are there any activities I should avoid?",
            "You should avoid any strenuous physical activity for at least 24 hours after the procedure.",
            "How can I manage the pain at the puncture site?",
            "You may experience some discomfort at the site of the puncture for a few days. Over-the-counter pain medication, such as acetaminophen or ibuprofen, can help with the pain.",
            "What about the risks of the procedure?",
            "The risks of a lumbar puncture include headache, infection, bleeding, and nerve damage, but these are rare.",
            "Thank you for the advice, Medi."
        ],
        "knowledge": "Lumbar puncture Lumbar puncture  A lumbar puncture, also known as a spinal tap, is a medical procedure used to collect cerebrospinal fluid (CSF) for diagnostic testing or to relieve pressure on the brain.  The procedure involves inserting a thin needle into the lower back to access the CSF.  After a lumbar puncture, it is important to rest for a few hours and drink plenty of fluids.  Strenuous activity should be avoided for at least 24 hours after the procedure.  You may experience some discomfort at the site of the puncture for a few days.  Over-the-counter pain medication, such as acetaminophen or ibuprofen, can help with the pain.  The risks of a lumbar puncture include headache, infection, bleeding, and nerve damage, but these are rare. Lumbar puncture Lumbar puncture",
        "response": "Thank you for the advice. Can you tell me more about the risks associated with a lumbar puncture?"
    },
    {
        "dialog": [
            "Hi Medi, I have a terrible headache and I don't know what to do.",
            "Hi there, I will help you with that. Can you explain your headache?",
            "It's a throbbing pain on the side of my head.",
            "Okay, how long have you been experiencing this headache?",
            "It started about two hours ago and it has been getting worse.",
            "I see. Do you have any other symptoms like nausea or dizziness?",
            "Yes, I feel very nauseous and I've been experiencing some dizziness too.",
            "Based on your description, it sounds like you might be experiencing a migraine headache. Have you had migraines before?",
            "Yes, I have had them occasionally in the past."
        ],
        "knowledge": "Migraine Migraine Migraine is a neurological condition that can cause severe headaches, visual disturbances, and other symptoms. Migraines are typically characterized by a throbbing or pulsing headache that is localized to one side of the head. Other symptoms of a migraine can include nausea, vomiting, dizziness, sensitivity to light or sound, and visual disturbances such as flashing lights or blind spots. The exact cause of migraines is not known, but it is thought to be related to changes in the levels of certain chemicals in the brain. Migraines can be triggered by a variety of factors, including stress, lack of sleep, certain foods, and hormonal changes. Migraine Migraine",
        "response": "I have had migraines before, but this one feels worse. Thank you for your advice, I appreciate it."
    },
    {
        "dialog": [
            "Hi Medi, I'm recovering from encephalitis and I was wondering if there are any lifestyle changes I should make to aid in my recovery.",
            "Hello there. I'm glad to hear you're recovering. Yes, there are some lifestyle changes that can help with your recovery. What concerns do you have?",
            "I'm worried about my diet. Are there any foods that can help speed up my recovery?",
            "A healthy and balanced diet is key to your recovery. You should focus on eating foods that are high in nutrients and antioxidants such as fruits, vegetables, whole grains, and lean protein. Avoid processed foods and limit your intake of sugar, salt and saturated fats.",
            "That makes sense. What about exercise? Should I be doing any specific types of physical activity?",
            "Moderate exercise can be beneficial for your recovery, but it's important to consult with your doctor first. Some exercises that may be helpful include yoga, swimming, or low-impact aerobics. It's important to start slowly and gradually increase the intensity of your exercise as your body allows.",
            "Thank you for your advice, Medi. I will make sure to keep these things in mind.",
            "You're welcome. Remember that getting plenty of rest and reducing stress is also important for your recovery.",
            "That's great to know. Thank you so much for your help."
        ],
        "knowledge": "Encephalitis Encephalitis Encephalitis is a condition characterized by inflammation of the brain. The most common cause of encephalitis is infection with a virus, although it can also be caused by bacteria, fungi, or parasites. Symptoms of encephalitis can include fever, headache, confusion, seizures, and difficulty speaking or moving. Treatment for encephalitis typically involves antiviral or antibiotic medications to address the underlying infection. In addition, lifestyle changes such as getting plenty of rest, reducing stress, eating a healthy diet, and getting regular exercise can also help with recovery. Encephalitis Encephalitis",
        "response": "Thank you for the helpful advice. I will definitely focus on eating a healthy diet and gradually increasing my exercise routine."
    },
    {
        "dialog": [
            "Hey Medi, I just had a lumbar puncture and I'm not sure what I should do after the procedure.",
            "Hi there. Lumbar punctures can be uncomfortable, but they are generally safe and straightforward. What concerns do you have?",
            "I'm worried about what I should do after the procedure. Should I be resting or can I go about my day as usual?",
            "It's generally recommended that you rest for a few hours after the procedure. You should also avoid any heavy lifting or strenuous activity for at least a day or two to prevent any complications.",
            "Okay, that makes sense. What about my diet? Is there anything I should avoid?",
            "There are generally no dietary restrictions after a lumbar puncture, but it's important to drink plenty of fluids to prevent dehydration.",
            "I see. And what about pain management? Should I be taking any medications for the pain?",
            "It's common to experience some discomfort or mild pain after the procedure. You can take over-the-counter pain relievers such as acetaminophen or ibuprofen to help with the pain. However, if you experience severe or persistent pain, you should contact your doctor.",
            "That's good to know. Thank you for your advice, Medi."
        ],
        "knowledge": "Lumbar puncture Lumbar puncture A lumbar puncture, also known as a spinal tap, is a medical procedure that involves inserting a needle into the spinal canal in the lower back to collect cerebrospinal fluid for analysis. The procedure is typically performed to diagnose or rule out conditions such as meningitis, encephalitis, or multiple sclerosis. After the procedure, it's important to rest for a few hours and avoid any heavy lifting or strenuous activity for at least a day or two. There are generally no dietary restrictions after a lumbar puncture, but it's important to drink plenty of fluids to prevent dehydration. Pain after the procedure is common and can be managed with over-the-counter pain relievers. Lumbar puncture Lumbar puncture",
        "response": "Thank you for the helpful advice, Medi. I will make sure to rest and avoid any heavy lifting for a day or two after the procedure."
    },
    {
        "dialog": [
            "Hi Medi, I've been having a headache for two days now.",
            "Hello! I'm here to help you. Can you describe your headache, please?",
            "It's a dull pain in the back of my head.",
            "Any other symptoms?",
            "I've been feeling nauseous and have been vomiting a lot.",
            "I suggest you to visit the doctor, as it might be encephalitis.",
            "What is encephalitis?",
            "It is inflammation of the brain, caused by a viral infection. It can be serious or even life-threatening.",
            "Thanks, Medi. I'll book an appointment."
        ],
        "knowledge": "Encephalitis Encephalitis  Herpes simplex encephalitis has an incidence of 2–4 per million of the population per year. Encephalitis with meningitis is known as meningoencephalitis, while encephalitis with involvement of the spinal cord is known as encephalomyelitis. The word is from Ancient Greek ἐγκέφαλος, enképhalos 'brain', composed of ἐν, en, 'in' and κεφαλή, kephalé, 'head', and the medical suffix -itis 'inflammation'.  Encephalitis Encephalitis",
        "response": "What are the symptoms of encephalitis, Medi?"
    },
    {
        "dialog": [
            "Hi Medi, can you explain what meningoencephalitis is?",
            "Hi there! Meningoencephalitis is inflammation of both the brain and the meninges.",
            "What are the symptoms of meningoencephalitis?",
            "The symptoms include fever, headache, and a stiff neck. You might also experience confusion, drowsiness or even seizures.",
            "What causes meningoencephalitis?",
            "Meningoencephalitis can be caused by viruses, bacteria or fungi.",
            "Thanks, Medi. That was very helpful.",
            "You're welcome. Anything else you'd like to know?"
        ],
        "knowledge": "Encephalitis Encephalitis  Herpes simplex encephalitis has an incidence of 2–4 per million of the population per year. Encephalitis with meningitis is known as meningoencephalitis, while encephalitis with involvement of the spinal cord is known as encephalomyelitis. The word is from Ancient Greek ἐγκέφαλος, enképhalos 'brain', composed of ἐν, en, 'in' and κεφαλή, kephalé, 'head', and the medical suffix -itis 'inflammation'.  Encephalitis Encephalitis",
        "response": "What are the treatments for meningoencephalitis, Medi?"
    },
    {
        "dialog": [
            "Hi Medi, I just had a spinal tap and it was really uncomfortable. Do you have any advice?",
            "Hello! Yes, spinal taps can be uncomfortable. It's normal to feel a headache afterwards. The best thing you can do is stay lying down for a few hours afterwards.",
            "How long does it take to recover from a spinal tap?",
            "Usually, it takes a few days to recover. In the meantime, you should avoid any heavy lifting or strenuous activities. It's also important to drink plenty of fluids.",
            "Is there anything else I should do to recover?",
            "You can also try taking over-the-counter pain relievers like acetaminophen or ibuprofen. If you experience any unusual symptoms, such as a fever or severe headache, you should contact your doctor.",
            "Thank you for your help, Medi.",
            "You're welcome. Take care!"
        ],
        "knowledge": "Encephalitis Encephalitis  Herpes simplex encephalitis has an incidence of 2–4 per million of the population per year. Encephalitis with meningitis is known as meningoencephalitis, while encephalitis with involvement of the spinal cord is known as encephalomyelitis. The word is from Ancient Greek ἐγκέφαλος, enképhalos 'brain', composed of ἐν, en, 'in' and κεφαλή, kephalé, 'head', and the medical suffix -itis 'inflammation'.  Encephalitis Encephalitis",
        "response": "What is the difference between encephalitis and meningitis, Medi?"
    },
    {
        "dialog": [
            "Hello Medi, I have a headache and a high fever.",
            "I am sorry to hear that. How long have you had these symptoms?",
            "It started yesterday and it's been getting worse since then.",
            "Based on your symptoms, it seems like you might have encephalitis. You should see a doctor as soon as possible.",
            "What is encephalitis?",
            "Encephalitis is an inflammation of the brain, usually caused by a viral infection. It can be a serious condition and requires medical attention.",
            "What kind of treatments are available for encephalitis?",
            "The treatment for encephalitis depends on the cause and severity of the condition. It can include antiviral medications, corticosteroids, and supportive care.",
            "Thank you, Medi. I will see a doctor immediately."
        ],
        "knowledge": "Encephalitis Encephalitis  Herpes simplex encephalitis has an incidence of 2–4 per million of the population per year. Encephalitis with meningitis is known as meningoencephalitis, while encephalitis with involvement of the spinal cord is known as encephalomyelitis. The word is from Ancient Greek ἐγκέφαλος, enképhalos \"brain\", composed of ἐν, en, \"in\" and κεφαλή, kephalé, \"head\", and the medical suffix -itis \"inflammation\".  Encephalitis Encephalitis",
        "response": "You're welcome. I hope you get better soon!"
    },
    {
        "dialog": [
            "Hello Medi, what is encephalitis?",
            "Encephalitis is an inflammation of the brain, usually caused by a viral infection.",
            "What are the symptoms of encephalitis?",
            "The symptoms of encephalitis can include fever, headache, confusion, seizures, and weakness or numbness in one or more parts of the body.",
            "What causes encephalitis?",
            "Encephalitis is usually caused by a viral infection, such as herpes simplex virus or West Nile virus.",
            "Is encephalitis contagious?",
            "In general, encephalitis is not contagious, but some viruses that cause encephalitis can be spread from person to person.",
            "Thank you for the information, Medi."
        ],
        "knowledge": "Encephalitis Encephalitis  Herpes simplex encephalitis has an incidence of 2–4 per million of the population per year. Encephalitis with meningitis is known as meningoencephalitis, while encephalitis with involvement of the spinal cord is known as encephalomyelitis. The word is from Ancient Greek ἐγκέφαλος, enképhalos \"brain\", composed of ἐν, en, \"in\" and κεφαλή, kephalé, \"head\", and the medical suffix -itis \"inflammation\".  Encephalitis Encephalitis",
        "response": "No, that's all I wanted to know. Thank you, Medi."
    },
    {
        "dialog": [
            "Hello Medi, I just had a spinal tap done, and I'm feeling a little sore. Do you have any recommendations?",
            "I'm sorry to hear that. Soreness is common after a spinal tap. You can take over-the-counter pain relievers and rest for the first few days.",
            "What about physical activity? Can I continue with my usual exercise routine?",
            "It is usually recommended to avoid strenuous physical activity for a few days after a spinal tap to give your body time to recover.",
            "What about my diet? Should I avoid any particular foods?",
            "There are no specific dietary restrictions after a spinal tap, but it's always a good idea to eat a healthy and balanced diet.",
            "Thank you for the advice, Medi. I'll take it easy for a few days.",
            "You're welcome. If you have any other concerns, don't hesitate to ask.",
            "Actually, I do have one more question. How common are complications from a spinal tap?"
        ],
        "knowledge": "Spinal Tap Spinal Tap  A lumbar puncture (LP), also known as a spinal tap, is a medical procedure performed to obtain a sample of cerebrospinal fluid (CSF) for analysis. It is also used to measure the pressure within the brain and spinal cord. The procedure involves the insertion of a needle between two vertebrae in the lower back, and the removal of a small amount of CSF. Possible complications from a spinal tap include headache, infection, bleeding, and nerve damage. However, these complications are rare.",
        "response": "Complications from a spinal tap are rare, but they can include headache, infection, bleeding, and nerve damage. It's important to monitor your symptoms and contact your doctor if you experience any unusual symptoms."
    },
    {
        "dialog": [
            "Hello Medi, I have a headache and nausea. What should I do?",
            "Hi there, based on your symptoms, you might have inflammation of the brain or encephalitis. ",
            "What can cause encephalitis, Medi?",
            "Encephalitis can be caused by viral infections such as herpes simplex or through bacterial or fungal infections.",
            "What is the treatment for encephalitis?",
            "Treatment depends on the cause of encephalitis, but generally involves antiviral or antibiotic medications.",
            "Should I go to the hospital now?",
            "It is advisable to go to the hospital immediately for a proper diagnosis and treatment.",
            "Thank you, Medi. I will go now."
        ],
        "knowledge": "Encephalitis Encephalitis Herpes simplex encephalitis has an incidence of 2–4 per million of the population per year. Encephalitis with meningitis is known as meningoencephalitis, while encephalitis with involvement of the spinal cord is known as encephalomyelitis. The word is from Ancient Greek ἐγκέφαλος, enképhalos 'brain', composed of ἐν, en, 'in' and κεφαλή, kephalé, 'head', and the medical suffix -itis 'inflammation'. Encephalitis Encephalitis",
        "response": "You're welcome. I hope you get better soon."
    },
    {
        "dialog": [
            "Hi Medi, what is encephalitis?",
            "Hello. Encephalitis is inflammation of the brain caused by viral, bacterial, or fungal infection or an autoimmune reaction.",
            "What are the symptoms of encephalitis?",
            "Encephalitis symptoms include fever, headache, confusion, seizures, and memory loss. More severe cases may cause weakness, paralysis, or coma.",
            "Is encephalitis contagious?",
            "It depends on the cause of encephalitis. Viral encephalitis can be contagious and spread through contact with bodily fluids, while autoimmune encephalitis is not contagious.",
            "How can I prevent encephalitis?",
            "You can reduce your risk of encephalitis by practicing good hygiene, avoiding mosquito bites, getting vaccinated against certain viral infections, and avoiding contact with infected individuals.",
            "That's helpful. Thank you, Medi."
        ],
        "knowledge": "Encephalitis Encephalitis Herpes simplex encephalitis has an incidence of 2–4 per million of the population per year. Encephalitis with meningitis is known as meningoencephalitis, while encephalitis with involvement of the spinal cord is known as encephalomyelitis. The word is from Ancient Greek ἐγκέφαλος, enképhalos 'brain', composed of ἐν, en, 'in' and κεφαλή, kephalé, 'head', and the medical suffix -itis 'inflammation'. Encephalitis Encephalitis",
        "response": "No, that's all for now. Thank you, Medi."
    },
    {
        "dialog": [
            "Hey Medi, I had a lumbar puncture yesterday. Can you give me some advice?",
            "Hi there. After a lumbar puncture, it is important to rest for at least 24 hours and avoid any strenuous activity.",
            "Can I take a shower or bath after a lumbar puncture?",
            "It is best to avoid submerging the puncture site in water for the first 24 hours to prevent infection.",
            "What kind of pain relievers should I take?",
            "Over-the-counter pain relievers such as acetaminophen or ibuprofen can help manage any discomfort at the puncture site.",
            "Should I monitor the puncture site for any signs of infection?",
            "Yes, it is important to monitor the site for any redness, swelling, or drainage, and to contact your healthcare provider if you experience any of these symptoms.",
            "Thank you, Medi. I will follow your advice."
        ],
        "knowledge": "Encephalitis Encephalitis Herpes simplex encephalitis has an incidence of 2–4 per million of the population per year. Encephalitis with meningitis is known as meningoencephalitis, while encephalitis with involvement of the spinal cord is known as encephalomyelitis. The word is from Ancient Greek ἐγκέφαλος, enképhalos 'brain', composed of ἐν, en, 'in' and κεφαλή, kephalé, 'head', and the medical suffix -itis 'inflammation'. Encephalitis Encephalitis",
        "response": "You're welcome. I'm glad I could help."
    },
    {
        "dialog": [
            "Hi Medi, I have a sudden headache and cannot concentrate on anything.",
            "I am here to assist you. Can you tell me more about your symptoms?",
            "I feel pain on one side of my head, and my vision is blurred.",
            "It looks like a migraine. You should avoid triggers like stress or bright lights, and take prescribed medication.",
            "Okay, but what are the triggers for migraines?",
            "Common triggers are stress, hormonal changes, certain foods and drinks, and sleep problems.",
            "I see. Can I take OTC medication?",
            "You can take OTC medication, but it's best to consult your doctor first.",
            "Thanks, Medi. What should I eat to prevent migraines?"
        ],
        "knowledge": "Migraine Migraines  Migraines are a type of headache that cause moderate to severe pain that is often accompanied by nausea and sensitivity to light and sound. Migraines are a common neurological condition that affect more than 1 billion people worldwide. Migraines are caused by genetic and environmental factors and can be triggered by stress, hormonal changes, certain foods and drinks, and sleep problems. Common treatments for migraines include medication, lifestyle changes, and avoiding triggers. Migraine headaches are typically treated with over-the-counter or prescription medication. Migraine Migraines",
        "response": "You should eat a balanced diet rich in fruits, vegetables, whole grains, and lean protein, and avoid processed foods, caffeine, and alcohol."
    },
    {
        "dialog": [
            "Hello Medi, what is encephalitis, and how does it affect the body?",
            "Encephalitis is inflammation of the brain caused by a viral infection or an autoimmune reaction.",
            "What are the symptoms of encephalitis?",
            "Symptoms of encephalitis include fever, headache, confusion, seizures, and fatigue.",
            "How is encephalitis diagnosed and treated?",
            "Encephalitis is diagnosed with a physical exam, blood tests, and imaging studies. Treatment includes antiviral medication, supportive care, and sometimes hospitalization.",
            "Can encephalitis be prevented?",
            "Prevention methods include practicing good hygiene, washing hands regularly, and avoiding mosquito bites.",
            "Thank you, Medi. Which virus causes encephalitis the most?"
        ],
        "knowledge": "Encephalitis Encephalitis  Herpes simplex encephalitis has an incidence of 2–4 per million of the population per year. Encephalitis with meningitis is known as meningoencephalitis, while encephalitis with involvement of the spinal cord is known as encephalomyelitis. The word is from Ancient Greek ἐγκέφαλος, enképhalos 'brain', composed of ἐν, en, 'in' and κεφαλή, kephalé, 'head', and the medical suffix -itis 'inflammation'.  Encephalitis Encephalitis",
        "response": "Herpes simplex virus is the most common cause of encephalitis."
    },
    {
        "dialog": [
            "Hi Medi, I just had a spinal tap procedure, and I am feeling weak and dizzy.",
            "I can help. Can you describe your symptoms in more detail?",
            "I feel pain in the lower back, and my head is spinning. Also, I am feeling nauseous.",
            "These symptoms are common after a spinal tap. You should rest and drink plenty of fluids.",
            "Okay, but what should I eat or not eat?",
            "You should eat a light meal and avoid fatty or fried foods. Also, avoid alcohol and caffeine.",
            "How long will it take for me to recover from the procedure?",
            "It can take a few days to recover from the procedure, but you should contact your doctor if the symptoms persist.",
            "Thanks, Medi. Is there anything else I should do to recover faster?"
        ],
        "knowledge": "Spinal tap Spinal tap  A spinal tap is a procedure where a needle is inserted into the spinal canal to collect cerebrospinal fluid for diagnostic testing. The procedure is usually done to diagnose certain neurological conditions such as meningitis or multiple sclerosis. Side effects of a spinal tap may include headache, nausea, dizziness, or back pain. To prevent complications, it's important to rest and drink plenty of fluids after the procedure. Spinal tap Spinal tap",
        "response": "You should take pain medication as prescribed by your doctor and avoid lifting heavy objects. Also, you should rest and avoid physical activity for a few days."
    }
]