[
    {
        "dialog": [
            "Hi Medi, I have been sneezing a lot lately",
            "Hello there! What other symptoms have you been experiencing?",
            "I have a runny nose and a sore throat",
            "Based on your symptoms, it seems like you might have contracted a common cold",
            "How do I treat it?",
            "You can relieve your symptoms by getting plenty of rest, drinking fluids, and taking over-the-counter medication",
            "What kind of medication should I take?",
            "You can take decongestants and pain relievers to alleviate your symptoms",
            "Thanks for your help, Medi! Can you tell me more about how common cold is transmitted?"
        ],
        "knowledge": "Common cold Common cold Transmission is common in daycare and at school due to the proximity of many children with little immunity and frequently poor hygiene.  These infections are then brought home to other members of the family.  There is no evidence that recirculated air during commercial flight is a method of transmission.  People sitting close to each other appear to be at greater risk of infection. Rhinovirus-caused colds are most infectious during the first three days of symptoms; they are much less infectious afterwards. A common misconception is that one can 'catch a cold' merely through prolonged exposure to cold weather.  Although it is now known that colds are viral infections, the prevalence of many such viruses are indeed seasonal, occurring more frequently during cold weather Common cold Common cold",
        "response": "Common cold is usually transmitted through close contact with infected people, especially in crowded environments like schools and daycare centers"
    },
    {
        "dialog": [
            "Hello Medi, can you explain what a common cold is?",
            "Certainly! A common cold is a viral infection that affects your nose and throat",
            "What are the symptoms of a common cold?",
            "The symptoms of a common cold include runny or stuffy nose, sore throat, cough, congestion, and slight body aches or a mild headache",
            "How can I prevent getting a common cold?",
            "You can prevent getting a common cold by washing your hands frequently, avoiding close contact with infected people, and not touching your face",
            "Is there a cure for common cold?",
            "There is no cure for common cold, but you can relieve your symptoms by taking over-the-counter medication and getting plenty of rest and fluids",
            "Thank you for your explanation, Medi. Can you tell me more about the seasonal prevalence of common cold viruses?"
        ],
        "knowledge": "Common cold Common cold Transmission is common in daycare and at school due to the proximity of many children with little immunity and frequently poor hygiene.  These infections are then brought home to other members of the family.  There is no evidence that recirculated air during commercial flight is a method of transmission.  People sitting close to each other appear to be at greater risk of infection. Rhinovirus-caused colds are most infectious during the first three days of symptoms; they are much less infectious afterwards. A common misconception is that one can 'catch a cold' merely through prolonged exposure to cold weather.  Although it is now known that colds are viral infections, the prevalence of many such viruses are indeed seasonal, occurring more frequently during cold weather Common cold Common cold",
        "response": "Many common cold viruses are seasonal and occur more frequently during cold weather"
    },
    {
        "dialog": [
            "Hi Medi, I just recovered from a cold. What should I do to prevent getting another one?",
            "Hello there! To prevent getting another cold, you should wash your hands frequently, avoid close contact with infected people, and disinfect frequently touched surfaces",
            "What kind of foods should I eat to boost my immune system?",
            "You should eat foods that are high in vitamin C, like citrus fruits and leafy greens, as well as foods that are high in protein and zinc, like lean meats and nuts",
            "Are there any physical activities that can boost my immunity?",
            "Yes, regular physical exercise can help boost your immune system and reduce your risk of getting a cold",
            "What should I do if I start experiencing cold-like symptoms again?",
            "If you start experiencing cold-like symptoms again, you should take over-the-counter medication, get plenty of rest, and stay hydrated",
            "Thank you for your advice, Medi. Can you tell me more about how a common cold spreads?"
        ],
        "knowledge": "Common cold Common cold Transmission is common in daycare and at school due to the proximity of many children with little immunity and frequently poor hygiene.  These infections are then brought home to other members of the family.  There is no evidence that recirculated air during commercial flight is a method of transmission.  People sitting close to each other appear to be at greater risk of infection. Rhinovirus-caused colds are most infectious during the first three days of symptoms; they are much less infectious afterwards. A common misconception is that one can 'catch a cold' merely through prolonged exposure to cold weather.  Although it is now known that colds are viral infections, the prevalence of many such viruses are indeed seasonal, occurring more frequently during cold weather Common cold Common cold",
        "response": "Common cold is usually spread through close contact with infected people, especially in crowded environments like schools and daycare centers"
    },
    {
        "dialog": [
            "Hi Medi, I am feeling sick. I have a runny nose and sore throat.",
            "Hello there. Based on those symptoms, it might be a common cold.",
            "What can I do to ease the symptoms?",
            "You can get enough rest, stay hydrated, and take over-the-counter medications for relief.",
            "How can I avoid spreading the cold to others?",
            "You should wash your hands frequently, avoid close contact with others, and cover your mouth and nose when coughing or sneezing.",
            "Thank you, Medi. Is there anything else I should know?",
            "Yes, avoid touching your face and disinfect frequently touched surfaces to prevent the spread of germs.",
            "Got it. Thank you for your help, Medi."
        ],
        "knowledge": "Common cold Common cold Transmission is common in daycare and at school due to the proximity of many children with little immunity and frequently poor hygiene.  These infections are then brought home to other members of the family.  There is no evidence that recirculated air during commercial flight is a method of transmission.  People sitting close to each other appear to be at greater risk of infection. Rhinovirus-caused colds are most infectious during the first three days of symptoms; they are much less infectious afterwards. A common misconception is that one can \"catch a cold\" merely through prolonged exposure to cold weather.  Although it is now known that colds are viral infections, the prevalence of many such viruses are indeed seasonal, occurring more frequently during cold weather Common cold Common cold",
        "response": "You're welcome! Don't hesitate to seek medical attention if your symptoms worsen or persist."
    },
    {
        "dialog": [
            "Hi Medi, I just recovered from a cold. What can I do to prevent getting sick again?",
            "Good to hear that you're feeling better. One way to prevent getting sick again is to wash your hands frequently.",
            "What else can I do?",
            "You should also avoid close contact with others who are sick and disinfect frequently touched surfaces in your home and workplace.",
            "Are there any foods that can boost my immune system?",
            "Some foods that can help boost your immune system include citrus fruits, leafy greens, and yogurt.",
            "That's helpful. How much sleep should I be getting?",
            "Adults should aim for at least 7-9 hours of sleep per night to keep their immune system strong.",
            "Thank you, Medi. Is there anything else I should know?"
        ],
        "knowledge": "Common cold Common cold Transmission is common in daycare and at school due to the proximity of many children with little immunity and frequently poor hygiene.  These infections are then brought home to other members of the family.  There is no evidence that recirculated air during commercial flight is a method of transmission.  People sitting close to each other appear to be at greater risk of infection. Rhinovirus-caused colds are most infectious during the first three days of symptoms; they are much less infectious afterwards. A common misconception is that one can \"catch a cold\" merely through prolonged exposure to cold weather.  Although it is now known that colds are viral infections, the prevalence of many such viruses are indeed seasonal, occurring more frequently during cold weather Common cold Common cold",
        "response": "You're welcome! Remember to also get vaccinated against the flu to further protect your immune system."
    },
    {
        "dialog": [
            "Hi Medi, I just got over a cold and I'm feeling weak. What can I do to restore my strength?",
            "Hello there. One way to restore your strength is to eat a balanced and nutritious diet.",
            "What kind of foods should I eat?",
            "You should consume plenty of protein, fruits and vegetables, and whole grains.",
            "Are there any specific foods or supplements that can help me?",
            "Foods rich in iron, zinc, and vitamin C can help boost your immune system and restore your strength.",
            "What about physical activity?",
            "Low-intensity exercise, such as walking or yoga, can help you regain your strength and energy.",
            "Thank you, Medi. Is there anything else I should know?"
        ],
        "knowledge": "Common cold Common cold Transmission is common in daycare and at school due to the proximity of many children with little immunity and frequently poor hygiene.  These infections are then brought home to other members of the family.  There is no evidence that recirculated air during commercial flight is a method of transmission.  People sitting close to each other appear to be at greater risk of infection. Rhinovirus-caused colds are most infectious during the first three days of symptoms; they are much less infectious afterwards. A common misconception is that one can \"catch a cold\" merely through prolonged exposure to cold weather.  Although it is now known that colds are viral infections, the prevalence of many such viruses are indeed seasonal, occurring more frequently during cold weather Common cold Common cold",
        "response": "You're welcome! Don't hesitate to consult with a healthcare professional if your symptoms persist or worsen."
    },
    {
        "dialog": [
            "Hello Medi, I feel like I might be getting a cold.",
            "I'm sorry to hear that, what symptoms are you experiencing?",
            "I have a stuffy and runny nose, a cough, and a sore throat.",
            "Based on your symptoms, it's possible that you have a cold.",
            "Is there anything I can do to make it go away faster?",
            "Rest, drink plenty of fluids, and take over-the-counter cold medicine if needed.",
            "What kind of cold medicine do you recommend?",
            "Something with acetaminophen and a decongestant should help relieve your symptoms.",
            "Thank you for the advice. How long does a cold usually last?"
        ],
        "knowledge": "Common cold Common cold Transmission is common in daycare and at school due to the proximity of many children with little immunity and frequently poor hygiene.  These infections are then brought home to other members of the family.  There is no evidence that recirculated air during commercial flight is a method of transmission.  People sitting close to each other appear to be at greater risk of infection. Rhinovirus-caused colds are most infectious during the first three days of symptoms; they are much less infectious afterwards. A common misconception is that one can 'catch a cold' merely through prolonged exposure to cold weather.  Although it is now known that colds are viral infections, the prevalence of many such viruses are indeed seasonal, occurring more frequently during cold weather Common cold Common cold",
        "response": "The duration of a cold can vary, but most people recover within 7-10 days."
    },
    {
        "dialog": [
            "Hi Medi, I have a question about colds.",
            "Sure, what would you like to know?",
            "Can cold weather actually cause a cold?",
            "No, cold weather doesn't cause a cold. It's actually caused by a virus.",
            "But why do people get more colds in the winter then?",
            "There are many viruses that can cause a cold, and they tend to be more prevalent in the winter.",
            "Is there anything I can do to prevent getting a cold?",
            "Washing your hands regularly and avoiding close contact with sick people can help reduce your risk of catching a cold.",
            "Thanks for the advice, Medi. What should I do if I do get a cold?"
        ],
        "knowledge": "Common cold Common cold Transmission is common in daycare and at school due to the proximity of many children with little immunity and frequently poor hygiene.  These infections are then brought home to other members of the family.  There is no evidence that recirculated air during commercial flight is a method of transmission.  People sitting close to each other appear to be at greater risk of infection. Rhinovirus-caused colds are most infectious during the first three days of symptoms; they are much less infectious afterwards. A common misconception is that one can 'catch a cold' merely through prolonged exposure to cold weather.  Although it is now known that colds are viral infections, the prevalence of many such viruses are indeed seasonal, occurring more frequently during cold weather Common cold Common cold",
        "response": "Rest, drink plenty of fluids, and take over-the-counter cold medicine if needed to help relieve your symptoms."
    },
    {
        "dialog": [
            "Hey Medi, I recently had a cold and I'm wondering what I can do to avoid getting sick again.",
            "Good question. One thing you can do is make sure to wash your hands regularly.",
            "What else can I do?",
            "Getting enough sleep, eating a balanced diet, and exercising regularly can all help boost your immune system.",
            "What kinds of foods should I eat?",
            "Foods high in vitamins and antioxidants, like fruits and vegetables, are great for your immune system.",
            "Should I take any supplements?",
            "It's always best to get your vitamins and minerals from whole foods, but taking a multivitamin can be helpful if you're not getting enough from your diet.",
            "Thanks for the advice, Medi. How long does it take for your immune system to recover after a cold?"
        ],
        "knowledge": "Common cold Common cold Transmission is common in daycare and at school due to the proximity of many children with little immunity and frequently poor hygiene.  These infections are then brought home to other members of the family.  There is no evidence that recirculated air during commercial flight is a method of transmission.  People sitting close to each other appear to be at greater risk of infection. Rhinovirus-caused colds are most infectious during the first three days of symptoms; they are much less infectious afterwards. A common misconception is that one can 'catch a cold' merely through prolonged exposure to cold weather.  Although it is now known that colds are viral infections, the prevalence of many such viruses are indeed seasonal, occurring more frequently during cold weather Common cold Common cold",
        "response": "It can take your immune system a few weeks to fully recover after a cold."
    },
    {
        "dialog": [
            "Hello Medi, I think I have a cold.",
            "Okay, can you tell me your symptoms?",
            "I have a runny nose, coughing, and a sore throat.",
            "Based on your symptoms, it is possible that you have a cold.",
            "What can I do to make myself feel better?",
            "You can get plenty of rest, drink fluids, and take over-the-counter medications for symptom relief.",
            "Should I see a doctor?",
            "If your symptoms worsen or do not improve after a few days, you should see a doctor.",
            "Thank you Medi, How can I prevent getting a cold ?"
        ],
        "knowledge": "Common cold Common cold Transmission is common in daycare and at school due to the proximity of many children with little immunity and frequently poor hygiene.  These infections are then brought home to other members of the family.  There is no evidence that recirculated air during commercial flight is a method of transmission.  People sitting close to each other appear to be at greater risk of infection. Rhinovirus-caused colds are most infectious during the first three days of symptoms; they are much less infectious afterwards. A common misconception is that one can 'catch a cold' merely through prolonged exposure to cold weather.  Although it is now known that colds are viral infections, the prevalence of many such viruses are indeed seasonal, occurring more frequently during cold weather Common cold Common cold",
        "response": "You can prevent getting a cold by washing your hands frequently, avoiding touching your face, and avoiding close contact with sick people."
    },
    {
        "dialog": [
            "Hello Medi, I just had a cold and recovered, what should I do now?",
            "It's great to hear that you have recovered. You should continue to take care of yourself.",
            "What should I do to take care of myself?",
            "You should get plenty of rest, eat a healthy diet, and exercise.",
            "Is there anything else I can do to prevent getting another cold?",
            "Yes, you can continue to wash your hands frequently, avoid touching your face, and avoid close contact with sick people.",
            "Should I take any medication to prevent getting another cold?",
            "There is no medication to prevent getting a cold, but you can take immune-boosting supplements if you want.",
            "Thank you Medi, how often can people catch a cold?"
        ],
        "knowledge": "Common cold Common cold Transmission is common in daycare and at school due to the proximity of many children with little immunity and frequently poor hygiene.  These infections are then brought home to other members of the family.  There is no evidence that recirculated air during commercial flight is a method of transmission.  People sitting close to each other appear to be at greater risk of infection. Rhinovirus-caused colds are most infectious during the first three days of symptoms; they are much less infectious afterwards. A common misconception is that one can 'catch a cold' merely through prolonged exposure to cold weather.  Although it is now known that colds are viral infections, the prevalence of many such viruses are indeed seasonal, occurring more frequently during cold weather Common cold Common cold",
        "response": "The frequency of catching a cold depends on many factors such as age, health status, and environment. However, most people catch a cold 2-3 times a year."
    },
    {
        "dialog": [
            "Hello Medi, I want some advice on how to strengthen my immune system.",
            "Great, I can help you with that. What do you currently do to maintain your immune system?",
            "I try to eat a balanced diet and exercise regularly.",
            "That's a great start. You can also get enough sleep and manage your stress levels as they have a significant impact on your immune system.",
            "Are there any foods that can boost my immune system?",
            "Yes, foods high in vitamin C, such as citrus fruits, can boost your immune system. Foods high in zinc, such as nuts and seeds, can also be beneficial.",
            "What about supplements? Should I take any supplements to strengthen my immune system?",
            "There are many supplements that can help boost your immune system, such as vitamin C, vitamin D, and zinc.",
            "Thank you Medi, can you recommend any exercises that can boost my immune system?"
        ],
        "knowledge": "Immune system Immune system  The immune system is a complex network of cells and proteins that defends the body against infection.  It is made up of many different types of cells that work together to recognize and destroy foreign substances.  The immune system is divided into two parts: the innate immune system and the adaptive immune system.  The innate immune system responds rapidly to infection but is not specific to the pathogen.  The adaptive immune system takes longer to respond but is specific to the pathogen.  To maintain a healthy immune system, it is important to eat a balanced diet, exercise regularly, get enough sleep, and manage stress levels Immune system Immune system",
        "response": "Yes, exercises such as brisk walking, jogging, and cycling can boost your immune system by increasing blood flow and reducing stress levels."
    },
    {
        "dialog": [
            "Hi Medi, I have been experiencing a runny nose and sore throat",
            "I am sorry to hear that. How long have you been experiencing these symptoms?",
            "It started yesterday and has been persistent since then",
            "Based on your symptoms, it is likely that you have caught the common cold",
            "Is there anything I can do to alleviate my symptoms?",
            "Yes, you should ensure you rest, keep yourself hydrated and take over the counter cold medication if necessary",
            "Thank you for your help, Medi. Can you provide any more information about the common cold?",
            "The common cold is caused by a virus and is highly contagious. It is usually spread through contact with infected people or surfaces. Most people recover within a week, but in some cases, it can lead to more serious health problems",
            "How can I prevent catching the common cold?"
        ],
        "knowledge": "Common cold Common cold Transmission is common in daycare and at school due to the proximity of many children with little immunity and frequently poor hygiene.  These infections are then brought home to other members of the family.  There is no evidence that recirculated air during commercial flight is a method of transmission.  People sitting close to each other appear to be at greater risk of infection. Rhinovirus-caused colds are most infectious during the first three days of symptoms; they are much less infectious afterwards. A common misconception is that one can \"catch a cold\" merely through prolonged exposure to cold weather.  Although it is now known that colds are viral infections, the prevalence of many such viruses are indeed seasonal, occurring more frequently during cold weather Common cold Common cold",
        "response": "You can prevent catching the common cold by washing your hands regularly, avoiding close contact with infected people, and keeping your immune system healthy through a balanced diet and exercise"
    },
    {
        "dialog": [
            "Hi Medi, I recently had a cold and I'm worried about my symptoms persisting",
            "I'm sorry to hear that. How long have you been experiencing these symptoms?",
            "It's been a week since my cold but I still have a persistent cough",
            "It's normal to experience a cough after a cold, but if it persists for more than a week, it could indicate a more serious problem. You should see a doctor",
            "Thank you. Can you give me any advice on how to prevent getting sick in the future?",
            "Of course! You should maintain good hygiene like washing your hands regularly, getting enough sleep, and eating a balanced diet to keep your immune system healthy",
            "That's helpful, thank you. Is there anything else I should do?",
            "Regular exercise can also help improve your overall health and reduce your risk of getting sick",
            "Thank you for the advice, Medi. I appreciate it. One more question, should I avoid going to public places when I'm sick?"
        ],
        "knowledge": "Common cold Common cold Transmission is common in daycare and at school due to the proximity of many children with little immunity and frequently poor hygiene.  These infections are then brought home to other members of the family.  There is no evidence that recirculated air during commercial flight is a method of transmission.  People sitting close to each other appear to be at greater risk of infection. Rhinovirus-caused colds are most infectious during the first three days of symptoms; they are much less infectious afterwards. A common misconception is that one can \"catch a cold\" merely through prolonged exposure to cold weather.  Although it is now known that colds are viral infections, the prevalence of many such viruses are indeed seasonal, occurring more frequently during cold weather Common cold Common cold",
        "response": "You're welcome. Remember to take care of yourself and seek medical attention if your symptoms persist"
    },
    {
        "dialog": [
            "Hi Medi, I recently recovered from a cold and want to know if there's anything I can do to prevent getting sick again",
            "Of course! Maintaining good hygiene, like washing your hands regularly, is key to preventing the spread of germs and illnesses",
            "Are there any foods that can boost my immune system and help prevent me from getting sick?",
            "Yes, foods like citrus fruits, garlic, and ginger can help boost your immune system",
            "That's interesting. What about exercise?",
            "Regular exercise can also help improve your overall health and reduce your risk of getting sick",
            "Is there anything else I can do to stay healthy?",
            "Getting enough sleep is also crucial to maintaining a healthy immune system. You should aim for 7-8 hours of sleep per night",
            "Thanks for the advice, Medi. One more question, can I still get sick even if I take all these precautions?"
        ],
        "knowledge": "Common cold Common cold Transmission is common in daycare and at school due to the proximity of many children with little immunity and frequently poor hygiene.  These infections are then brought home to other members of the family.  There is no evidence that recirculated air during commercial flight is a method of transmission.  People sitting close to each other appear to be at greater risk of infection. Rhinovirus-caused colds are most infectious during the first three days of symptoms; they are much less infectious afterwards. A common misconception is that one can \"catch a cold\" merely through prolonged exposure to cold weather.  Although it is now known that colds are viral infections, the prevalence of many such viruses are indeed seasonal, occurring more frequently during cold weather Common cold Common cold",
        "response": "You're welcome. Remember to practice good hygiene, eat a balanced diet, and get enough sleep to keep your immune system healthy and reduce your risk of getting sick"
    },
    {
        "dialog": [
            "Hi, Medi. I have a cold, what should I do?",
            "Hello! Let me help you. What are your symptoms?",
            "I have a runny nose and a sore throat.",
            "It sounds like you have a cold. Try drinking plenty of fluids and getting rest.",
            "What else can I do?",
            "You can also try using a humidifier and taking over-the-counter cold medicines.",
            "Can I go to work?",
            "It's best to stay home and rest to avoid spreading the cold to others.",
            "How long will it last?"
        ],
        "knowledge": "Common cold Common cold Transmission is common in daycare and at school due to the proximity of many children with little immunity and frequently poor hygiene.  These infections are then brought home to other members of the family.  There is no evidence that recirculated air during commercial flight is a method of transmission.  People sitting close to each other appear to be at greater risk of infection. Rhinovirus-caused colds are most infectious during the first three days of symptoms; they are much less infectious afterwards. A common misconception is that one can \"catch a cold\" merely through prolonged exposure to cold weather.  Although it is now known that colds are viral infections, the prevalence of many such viruses are indeed seasonal, occurring more frequently during cold weather Common cold Common cold",
        "response": "Most colds last for about a week, but some can linger for up to two weeks."
    },
    {
        "dialog": [
            "Hi, Medi. My family member has a cold. How can I avoid getting sick?",
            "Hello! There are some things you can do to reduce your risk of catching the cold.",
            "What are they?",
            "Wash your hands frequently and avoid touching your face. Try to avoid close contact with the person who is sick.",
            "Is there anything else?",
            "You can also use a humidifier and make sure to clean surfaces that the sick person has touched.",
            "Can I still go to work?",
            "Yes, as long you take precautions, you should be fine.",
            "Okay, thanks for your help!"
        ],
        "knowledge": "Common cold Common cold Transmission is common in daycare and at school due to the proximity of many children with little immunity and frequently poor hygiene.  These infections are then brought home to other members of the family.  There is no evidence that recirculated air during commercial flight is a method of transmission.  People sitting close to each other appear to be at greater risk of infection. Rhinovirus-caused colds are most infectious during the first three days of symptoms; they are much less infectious afterwards. A common misconception is that one can \"catch a cold\" merely through prolonged exposure to cold weather.  Although it is now known that colds are viral infections, the prevalence of many such viruses are indeed seasonal, occurring more frequently during cold weather Common cold Common cold",
        "response": "You're welcome! Stay safe and don't hesitate to reach out if you have any other questions."
    },
    {
        "dialog": [
            "Hi, Medi. I just recovered from a cold. What should I do to stay healthy?",
            "Hello! There are some things you can do to prevent getting sick again.",
            "What are they?",
            "Make sure to get enough sleep and exercise regularly. Wash your hands frequently and avoid touching your face.",
            "Is there anything else?",
            "You can also eat a balanced diet with plenty of fruits and vegetables to boost your immune system.",
            "What about a flu shot?",
            "That's a good idea! Getting a flu shot can help protect you from getting sick.",
            "Okay, thanks for the advice!"
        ],
        "knowledge": "Common cold Common cold Transmission is common in daycare and at school due to the proximity of many children with little immunity and frequently poor hygiene.  These infections are then brought home to other members of the family.  There is no evidence that recirculated air during commercial flight is a method of transmission.  People sitting close to each other appear to be at greater risk of infection. Rhinovirus-caused colds are most infectious during the first three days of symptoms; they are much less infectious afterwards. A common misconception is that one can \"catch a cold\" merely through prolonged exposure to cold weather.  Although it is now known that colds are viral infections, the prevalence of many such viruses are indeed seasonal, occurring more frequently during cold weather Common cold Common cold",
        "response": "You're welcome! Stay healthy and don't hesitate to reach out if you have any other questions."
    },
    {
        "dialog": [
            "Hello Medi, I am feeling sick",
            "Hi there, what are your symptoms?",
            "I have a fever and a runny nose",
            "Based on your symptoms, you may have a cold. Rest and drink fluids",
            "Thanks, do you have any advice for preventing colds?",
            "Wash hands frequently, avoid close contact with sick people, and keep surfaces clean",
            "Got it, thanks Medi",
            "You're welcome. Do you have any other questions?",
            "No, that's all, thank you Medi"
        ],
        "knowledge": "Common cold Common cold Transmission is common in daycare and at school due to the proximity of many children with little immunity and frequently poor hygiene. These infections are then brought home to other members of the family. There is no evidence that recirculated air during commercial flight is a method of transmission. People sitting close to each other appear to be at greater risk of infection. Rhinovirus-caused colds are most infectious during the first three days of symptoms; they are much less infectious afterwards. A common misconception is that one can \"catch a cold\" merely through prolonged exposure to cold weather. Although it is now known that colds are viral infections, the prevalence of many such viruses are indeed seasonal, occurring more frequently during cold weather.",
        "response": "You're welcome. Take care of yourself and stay hydrated."
    },
    {
        "dialog": [
            "Hello Medi, I want to know more about influenza",
            "Hi! What do you want to know about influenza?",
            "What are the symptoms of influenza?",
            "Symptoms of influenza include fever, coughing, sore throat, runny or stuffy nose, body aches, headache, chills, and fatigue.",
            "How is influenza treated?",
            "Treatments for influenza include antiviral medications, rest, and drinking fluids.",
            "Can you give me advice on how to prevent influenza?",
            "The best way to prevent influenza is to get vaccinated every year.",
            "Thanks for the information, Medi."
        ],
        "knowledge": "Influenza Influenza The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion. These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose. Coughing is the most common symptom. Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children. The standard influenza symptoms typically last for 2 - 8 days. A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common",
        "response": "You're welcome. Stay healthy and consider getting vaccinated."
    },
    {
        "dialog": [
            "Hi Medi, I just had surgery and want to know how to take care of myself",
            "Hi! Rest is important after surgery, as well as following your doctor's instructions",
            "What can I do to help with the healing process?",
            "Make sure to get plenty of rest, eat healthy foods, and avoid activities that could disrupt the healing process",
            "Are there any physical activities I can do to help with recovery?",
            "Low-impact exercises like walking or light stretching can help with recovery, but consult with your doctor first",
            "Thanks for the advice, Medi",
            "You're welcome. Do you have any other questions?",
            "No, that's all. Thanks again!"
        ],
        "knowledge": "Post-surgical recovery Post-surgical recovery Rest is important after surgery, as well as following your doctor's instructions. Make sure to get plenty of rest, eat healthy foods, and avoid activities that could disrupt the healing process. Low-impact exercises like walking or light stretching can help with recovery, but consult with your doctor first.",
        "response": "You're welcome. Take care of yourself and don't hesitate to reach out if you have more questions."
    },
    {
        "dialog": [
            "Hello Medi, I have a fever and a runny nose",
            "Hi there, based on your symptoms, it is possible that you have a common cold",
            "What can I do to feel better?",
            "Resting and drinking plenty of fluids are the best things you can do. You should also try taking some OTC medications to alleviate your symptoms.",
            "What can I do to prevent getting a cold again?",
            "Wash your hands frequently and avoid contact with people who have a cold. You should also boost your immune system by eating a healthy diet and getting enough sleep.",
            "Are there any home remedies you would recommend?",
            "Yes, drinking hot tea with honey and lemon can soothe a sore throat, and inhaling steam can help with congestion.",
            "Thank you Medi. How long should I expect to be sick for?"
        ],
        "knowledge": "Common cold Common cold Transmission is common in daycare and at school due to the proximity of many children with little immunity and frequently poor hygiene.  These infections are then brought home to other members of the family.  There is no evidence that recirculated air during commercial flight is a method of transmission.  People sitting close to each other appear to be at greater risk of infection. Rhinovirus-caused colds are most infectious during the first three days of symptoms; they are much less infectious afterwards. A common misconception is that one can 'catch a cold' merely through prolonged exposure to cold weather.  Although it is now known that colds are viral infections, the prevalence of many such viruses are indeed seasonal, occurring more frequently during cold weather Common cold Common cold",
        "response": "Most people recover from a cold within 7-10 days, but it can last up to two weeks."
    },
    {
        "dialog": [
            "Hey Medi, my child has a runny nose and is coughing a lot.",
            "Hello, it is possible that your child has a common cold",
            "Is there anything I can give him to make him feel better?",
            "You can give him some OTC medications specifically for children, but you should consult with a pediatrician first.",
            "What can I do to prevent my other children from getting sick?",
            "Make sure your child with the cold washes their hands frequently, and avoid sharing towels, cups, and utensils. You should also disinfect surfaces regularly.",
            "Can I send my child to school with a cold?",
            "No, it is best to keep your child home until they are feeling better to prevent the spread of the virus to other children.",
            "Thank you Medi. Do I need to take my child to the doctor?"
        ],
        "knowledge": "Common cold Common cold Transmission is common in daycare and at school due to the proximity of many children with little immunity and frequently poor hygiene.  These infections are then brought home to other members of the family.  There is no evidence that recirculated air during commercial flight is a method of transmission.  People sitting close to each other appear to be at greater risk of infection. Rhinovirus-caused colds are most infectious during the first three days of symptoms; they are much less infectious afterwards. A common misconception is that one can 'catch a cold' merely through prolonged exposure to cold weather.  Although it is now known that colds are viral infections, the prevalence of many such viruses are indeed seasonal, occurring more frequently during cold weather Common cold Common cold",
        "response": "If your child's symptoms worsen or do not improve after a few days, you should consult with a pediatrician."
    },
    {
        "dialog": [
            "Hi Medi, I recently recovered from a cold. What should I do to prevent getting another one?",
            "Hello, that's great to hear. To prevent getting another cold, you should wash your hands frequently and avoid contact with people who have a cold.",
            "What else can I do to boost my immune system?",
            "Eating a healthy diet with plenty of fruits and vegetables, getting enough sleep, and exercising regularly can all help boost your immune system.",
            "Can I catch a cold from going outside with wet hair?",
            "No, that is a common myth. The only way to catch a cold is by coming into contact with the virus.",
            "Are there any supplements I can take to prevent getting a cold?",
            "While there is no guarantee that supplements can prevent a cold, some studies suggest that taking vitamin C and Echinacea may help reduce the frequency and severity of colds.",
            "Thank you Medi. Is there anything else I should know?"
        ],
        "knowledge": "Common cold Common cold Transmission is common in daycare and at school due to the proximity of many children with little immunity and frequently poor hygiene.  These infections are then brought home to other members of the family.  There is no evidence that recirculated air during commercial flight is a method of transmission.  People sitting close to each other appear to be at greater risk of infection. Rhinovirus-caused colds are most infectious during the first three days of symptoms; they are much less infectious afterwards. A common misconception is that one can 'catch a cold' merely through prolonged exposure to cold weather.  Although it is now known that colds are viral infections, the prevalence of many such viruses are indeed seasonal, occurring more frequently during cold weather Common cold Common cold",
        "response": "Yes, it is important to avoid close contact with people who have a cold, and to wash your hands frequently to prevent the spread of the virus."
    },
    {
        "dialog": [
            "Hello Medi, I am not feeling well",
            "What are your symptoms?",
            "I have a headache, sore throat and runny nose",
            "It seems like you have a common cold. Rest and drink lots of fluids.",
            "Is there any medicine I can take?",
            "You can take over-the-counter medication for symptom relief",
            "Thank you, Medi. Can you tell me how to prevent a common cold?",
            "Wash your hands frequently and avoid touching your face. Avoid close contact with sick people.",
            "Okay, thank you Medi."
        ],
        "knowledge": "Common cold Common cold Transmission is common in daycare and at school due to the proximity of many children with little immunity and frequently poor hygiene.  These infections are then brought home to other members of the family.  There is no evidence that recirculated air during commercial flight is a method of transmission.  People sitting close to each other appear to be at greater risk of infection. Rhinovirus-caused colds are most infectious during the first three days of symptoms; they are much less infectious afterwards. A common misconception is that one can 'catch a cold' merely through prolonged exposure to cold weather.  Although it is now known that colds are viral infections, the prevalence of many such viruses are indeed seasonal, occurring more frequently during cold weather Common cold Common cold",
        "response": "Rest and drink lots of fluids. Take over-the-counter medication for symptom relief, and wash your hands frequently and avoid close contact with sick people."
    },
    {
        "dialog": [
            "Hello Medi, I just had a medical procedure. Can you give me advice on what to do next?",
            "What procedure did you have?",
            "I had a minor surgery on my leg.",
            "It's important to rest and avoid any strenuous activity for a few days. Keep the incision area clean and dry.",
            "What about my diet?",
            "Make sure to eat a healthy and balanced diet to promote healing. Avoid alcohol and smoking.",
            "Thank you, Medi. Is there anything else I should know?",
            "Follow any instructions given by your doctor and don't hesitate to reach out if you have any concerns or complications.",
            "Thanks, Medi."
        ],
        "knowledge": "After surgery After surgery After surgery, it is important to rest and avoid any strenuous activity for a few days.  Keep the incision area clean and dry.  Eat a healthy and balanced diet to promote healing.  Avoid alcohol and smoking, which can slow down the healing process.  Follow any instructions given by your doctor and don't hesitate to reach out if you have any concerns or complications After surgery After surgery",
        "response": "Rest and avoid any strenuous activity for a few days. Keep the incision area clean and dry. Eat a healthy and balanced diet to promote healing. Avoid alcohol and smoking. Follow any instructions given by your doctor and don't hesitate to reach out if you have any concerns or complications."
    },
    {
        "dialog": [
            "Hello Medi, I have a few questions about the common cold",
            "Sure, what would you like to know?",
            "How is a common cold transmitted?",
            "Transmission is common in daycare and at school due to the proximity of many children with little immunity and frequently poor hygiene. There is no evidence that recirculated air during commercial flight is a method of transmission. People sitting close to each other appear to be at greater risk of infection.",
            "When is a common cold most infectious?",
            "Rhinovirus-caused colds are most infectious during the first three days of symptoms; they are much less infectious afterwards.",
            "Is it true that exposure to cold weather can cause a cold?",
            "A common misconception is that one can 'catch a cold' merely through prolonged exposure to cold weather. Although it is now known that colds are viral infections, the prevalence of many such viruses are indeed seasonal, occurring more frequently during cold weather.",
            "Thank you for your help, Medi."
        ],
        "knowledge": "Common cold Common cold Transmission is common in daycare and at school due to the proximity of many children with little immunity and frequently poor hygiene.  These infections are then brought home to other members of the family.  There is no evidence that recirculated air during commercial flight is a method of transmission.  People sitting close to each other appear to be at greater risk of infection. Rhinovirus-caused colds are most infectious during the first three days of symptoms; they are much less infectious afterwards. A common misconception is that one can 'catch a cold' merely through prolonged exposure to cold weather.  Although it is now known that colds are viral infections, the prevalence of many such viruses are indeed seasonal, occurring more frequently during cold weather Common cold Common cold",
        "response": "Transmission is common in daycare and at school due to the proximity of many children with little immunity and frequently poor hygiene. There is no evidence that recirculated air during commercial flight is a method of transmission. People sitting close to each other appear to be at greater risk of infection. Rhinovirus-caused colds are most infectious during the first three days of symptoms; they are much less infectious afterwards. A common misconception is that one can 'catch a cold' merely through prolonged exposure to cold weather. Although it is now known that colds are viral infections, the prevalence of many such viruses are indeed seasonal, occurring more frequently during cold weather."
    },
    {
        "dialog": [
            "Hello Medi, I have a runny nose and sore throat.",
            "Based on your symptoms, you may have a common cold.",
            "Can you tell me more about it?",
            "It is caused by viruses which can spread easily in areas with lots of people like schools.",
            "How can I prevent it?",
            "Washing your hands often, covering your mouth when you cough or sneeze, and avoiding people who are sick can help.",
            "Is there anything I can do to feel better?",
            "You can take over-the-counter medications for symptom relief and rest.",
            "Can I still go to school or work?"
        ],
        "knowledge": "Common cold Common cold Transmission is common in daycare and at school due to the proximity of many children with little immunity and frequently poor hygiene.  These infections are then brought home to other members of the family.  There is no evidence that recirculated air during commercial flight is a method of transmission.  People sitting close to each other appear to be at greater risk of infection. Rhinovirus-caused colds are most infectious during the first three days of symptoms; they are much less infectious afterwards. A common misconception is that one can \"catch a cold\" merely through prolonged exposure to cold weather.  Although it is now known that colds are viral infections, the prevalence of many such viruses are indeed seasonal, occurring more frequently during cold weather Common cold Common cold",
        "response": "You should stay home for a few days until your symptoms improve and you are no longer contagious."
    },
    {
        "dialog": [
            "Hi Medi, I just had a cold and I'm feeling better now.",
            "That's great to hear! Is there anything I can help you with?",
            "Yes, I'm wondering if there's anything I can do to prevent getting sick again.",
            "Certainly. Keeping your hands clean, avoiding sick people, and getting enough sleep can help boost your immune system.",
            "What about vitamins or supplements?",
            "While some studies suggest that certain vitamins and supplements may help prevent illness, a healthy diet with plenty of fruits and vegetables is the best way to get the nutrients your body needs.",
            "Got it. And what should I do if I start feeling sick again?",
            "Rest and stay hydrated. If necessary, take over-the-counter medications for symptom relief.",
            "Thank you for the advice, Medi!"
        ],
        "knowledge": "Common cold Common cold Transmission is common in daycare and at school due to the proximity of many children with little immunity and frequently poor hygiene.  These infections are then brought home to other members of the family.  There is no evidence that recirculated air during commercial flight is a method of transmission.  People sitting close to each other appear to be at greater risk of infection. Rhinovirus-caused colds are most infectious during the first three days of symptoms; they are much less infectious afterwards. A common misconception is that one can \"catch a cold\" merely through prolonged exposure to cold weather.  Although it is now known that colds are viral infections, the prevalence of many such viruses are indeed seasonal, occurring more frequently during cold weather Common cold Common cold",
        "response": "You're welcome. Remember to take care of yourself and stay healthy!"
    },
    {
        "dialog": [
            "Hello Medi, I just had a cold and I'm wondering if there's anything I can do to help my family avoid getting sick.",
            "That's considerate of you. Washing your hands frequently, covering your mouth and nose when you cough or sneeze, and avoiding close contact with others can help prevent the spread of the virus.",
            "What about cleaning?",
            "Yes, cleaning and disinfecting frequently-touched surfaces like doorknobs, light switches and countertops can also help prevent the spread of the virus.",
            "Anything else?",
            "Staying home if you're sick and keeping your children home if they're sick is important to prevent the spread of the virus.",
            "Thanks for the advice, Medi!",
            "You're welcome. Take care and stay healthy!"
        ],
        "knowledge": "Common cold Common cold Transmission is common in daycare and at school due to the proximity of many children with little immunity and frequently poor hygiene.  These infections are then brought home to other members of the family.  There is no evidence that recirculated air during commercial flight is a method of transmission.  People sitting close to each other appear to be at greater risk of infection. Rhinovirus-caused colds are most infectious during the first three days of symptoms; they are much less infectious afterwards. A common misconception is that one can \"catch a cold\" merely through prolonged exposure to cold weather.  Although it is now known that colds are viral infections, the prevalence of many such viruses are indeed seasonal, occurring more frequently during cold weather Common cold Common cold",
        "response": "You're welcome. Remember to take care of yourself and your family to prevent the spread of the virus."
    }
]