[
    {
        "dialog": [
            "Hey Medi, I think I have a flu.",
            "I can help you with that. What are your symptoms?",
            "I have a headache, body aches and sore throat.",
            "Based on your symptoms, you might have the flu.",
            "What can I do to feel better?",
            "You should take rest, drink fluids and take pain relievers.",
            "Okay, thank you. Do you have any advice for prevention?",
            "Yes, you can prevent the flu by getting vaccinated and washing your hands.",
            "Thank you. How effective is the flu vaccine?"
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "The flu vaccine is generally 40-60% effective, depending on the strains circulating each year."
    },
    {
        "dialog": [
            "Hi Medi, I have some questions about H1N1 and H3N2.",
            "Sure, I can help. What would you like to know?",
            "What are the differences between H1N1 and H3N2?",
            "H1N1 and H3N2 are both strains of the influenza virus, but they have different surface proteins.",
            "What are the symptoms of H1N1 and H3N2?",
            "The symptoms are similar, including fever, cough, sore throat, body aches, and fatigue.",
            "Can these strains be prevented?",
            "Yes, getting vaccinated and practicing good hygiene can help prevent the spread of these strains.",
            "Thank you. What are some hygiene practices?"
        ],
        "knowledge": "Influenza Influenza  Consequently, H1N1, H3N2, and both IBV lineages have been in circulation in seasonal form since the 2009 pandemic. Influenza Influenza",
        "response": "Recovery time for H1N1 and H3N2 can vary, but typically symptoms last for 7-10 days."
    },
    {
        "dialog": [
            "Hi Medi, I just had a medical procedure. Can you give me some advice?",
            "Of course. What kind of procedure did you have?",
            "I had surgery on my knee.",
            "You should rest and elevate your leg to help reduce swelling.",
            "What about physical activity?",
            "It's important to gradually increase your activity level as you heal, following your doctor's instructions.",
            "What kind of diet should I follow?",
            "You should eat a balanced diet with plenty of protein and nutrients to help your body heal.",
            "That makes sense. What about pain management?"
        ],
        "knowledge": "Influenza Influenza  Consequently, H1N1, H3N2, and both IBV lineages have been in circulation in seasonal form since the 2009 pandemic. In 2011, IDV was discovered in pigs in Oklahoma, USA, and cattle were later identified as the primary reservoir of IDV.  In the same year, avian H7N9 was detected in China and began to cause human infections in 2013, starting in Shanghai and Anhui and remaining mostly in China.  HPAI H7N9 emerged sometime in 2016 and has occasionally infected humans incidentally.  Other AIVs have less commonly infected humans since the 1990s, including H5N6, H6N1, H7N2-4, H7N7, and H10N7-8, and HPAI H subtypes such as H5N1-3, H5N5-6, and H5N8 have begun to spread throughout much of the world since the 2010s.  Future flu pandemics, which may be caused by an influenza virus of avian origin, are viewed as almost inevitable, and increased globalization has made it easier for novel viruses to spread, so there are continual efforts to prepare for future pandemics and improve the prevention and treatment of influenza. The word influenza comes from the Italian word influenza, from medieval Latin influentia, originally meaning \"visitation\" or \"influence\" Influenza Influenza",
        "response": "Recovery time can vary depending on the procedure and individual, but it may take several weeks to several months to fully recover."
    },
    {
        "dialog": [
            "Hi Medi, I have a fever and cough.",
            "Hello, sorry to hear that. How long have you had these symptoms?",
            "It's been around two days.",
            "Okay, have you been in contact with someone who has COVID-19?",
            "No, I don't think so.",
            "Based on your symptoms, it could be influenza. You should rest and drink plenty of fluids.",
            "Thank you, Medi. Do you recommend any medicine?",
            "You can take acetaminophen or ibuprofen to relieve your fever and aches.",
            "Okay thank you. How can I prevent getting influenza again?"
        ],
        "knowledge": "Influenza Influenza The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion. These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose. Coughing is the most common symptom. Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children. The standard influenza symptoms typically last for 2 - 8 days. A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "Washing your hands frequently and avoiding close contact with people who are sick can help prevent getting influenza."
    },
    {
        "dialog": [
            "Hi Medi, I have a question about IDV.",
            "Sure, I can help you with that. What would you like to know?",
            "What is IDV and where did it come from?",
            "IDV stands for Influenza D virus and it was discovered in pigs in Oklahoma, USA in 2011. Cattle were later identified as the primary reservoir of IDV.",
            "What are the symptoms of IDV?",
            "IDV can cause respiratory disease in cattle but it has not been reported to cause illness in humans.",
            "Is there a vaccine for IDV?",
            "Currently, there is no vaccine for IDV.",
            "Okay, thank you. Can IDV be transmitted from cattle to humans?"
        ],
        "knowledge": "Influenza Influenza Consequently, H1N1, H3N2, and both IBV lineages have been in circulation in seasonal form since the 2009 pandemic. In 2011, IDV was discovered in pigs in Oklahoma, USA, and cattle were later identified as the primary reservoir of IDV. In the same year, avian H7N9 was detected in China and began to cause human infections in 2013, starting in Shanghai and Anhui and remaining mostly in China. HPAI H7N9 emerged sometime in 2016 and has occasionally infected humans incidentally. Other AIVs have less commonly infected humans since the 1990s, including H5N6, H6N1, H7N2-4, H7N7, and H10N7-8, and HPAI H subtypes such as H5N1-3, H5N5-6, and H5N8 have begun to spread throughout much of the world since the 2010s. Future flu pandemics, which may be caused by an influenza virus of avian origin, are viewed as almost inevitable, and increased globalization has made it easier for novel viruses to spread, so there are continual efforts to prepare for future pandemics and improve the prevention and treatment of influenza. The word influenza comes from the Italian word influenza, from medieval Latin influentia, originally meaning 'visitation' or 'influence' Influenza Influenza",
        "response": "No, IDV has not been reported to cause illness in humans so it cannot be transmitted from cattle to humans."
    },
    {
        "dialog": [
            "Hi Medi, I just had a medical procedure done. What should I do to recover?",
            "Hello, congratulations on completing the procedure. What procedure did you have done?",
            "I had a minor surgery to remove a mole.",
            "After the procedure, you should rest for a few days and avoid any strenuous activity or heavy lifting.",
            "What about my diet?",
            "You should eat a healthy and balanced diet with plenty of fruits and vegetables. Avoid fatty or processed foods.",
            "Thank you, Medi. Can I take a shower?",
            "Yes, but be careful not to get the wound wet. Cover it with a plastic wrap or bandage to keep it dry.",
            "Okay, thank you. How long will it take for the wound to heal?"
        ],
        "knowledge": "Medical Procedure Recovery Medical procedures can vary greatly, so recovery times can vary. After a procedure, it is important to follow your doctor's instructions carefully to ensure proper healing. You may need to rest for a few days and avoid any strenuous activity or heavy lifting. Your doctor may also recommend a specific diet and any medications you should take. It is important to keep the wound clean and dry to prevent infection. Follow-up appointments may be necessary to monitor your recovery and ensure proper healing. Medical Procedure Recovery",
        "response": "The healing time for your wound may vary depending on the location and size of the incision. Your doctor will provide you with more information."
    },
    {
        "dialog": [
            "Hello Medi, I'm feeling really sick.",
            "I'm sorry to hear that. Can you describe your symptoms to me?",
            "I have a fever, cough, and body aches. My throat is sore too.",
            "Based on your symptoms, it sounds like you may have the flu.",
            "What should I do next?",
            "You should rest, drink plenty of fluids, and take over-the-counter medications for fever and cough. If your symptoms persist or worsen, see a doctor.",
            "Thanks for your help. How long does the flu typically last?",
            "The standard flu symptoms typically last for 2 - 8 days. However, some people may experience symptoms for up to 2 weeks.",
            "I see. Is there anything else I should know?"
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "Based on your symptoms, it sounds like you may have the flu."
    },
    {
        "dialog": [
            "Hello Medi, I'm curious about Influenza.",
            "Sure, I'm happy to help. What would you like to know?",
            "What are the most common symptoms of the flu?",
            "The most common symptoms of the flu are fever, cough, body aches, and fatigue. You may also experience a sore throat, runny or stuffy nose, and headaches.",
            "How is the flu spread?",
            "The flu is spread through droplets when someone with the flu coughs, sneezes, or talks. You can also get the flu by touching a surface with the virus on it and then touching your mouth or nose.",
            "Is there a vaccine for the flu?",
            "Yes, there is a flu vaccine that is recommended for everyone over the age of 6 months. It is especially important for people at high risk of complications from the flu, such as young children, pregnant women, and the elderly.",
            "Thanks for the information. How can I prevent getting the flu?"
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "You're welcome. Let me know if you have any other questions."
    },
    {
        "dialog": [
            "Hi Medi, I recently had the flu. What can I do to prevent getting it again?",
            "I'm sorry to hear that you had the flu. To prevent getting it again, make sure you wash your hands frequently, avoid close contact with people who are sick, and consider getting vaccinated.",
            "What else can I do?",
            "You can also make sure that you get enough rest, eat a healthy diet, and exercise regularly to help boost your immune system.",
            "Thanks for the advice. Is there anything else I should know?",
            "It's also important to stay home if you're sick to avoid spreading the flu to others. Cover your mouth and nose when you cough or sneeze, and avoid touching your face.",
            "I see. Thank you, Medi.",
            "You're welcome. Let me know if you have any other questions or concerns."
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "You're welcome. Let me know if you have any other questions or concerns."
    },
    {
        "dialog": [
            "Hi Medi, I don't feel well. I have a headache and a cough",
            "I'm sorry to hear that. How long have you been experiencing these symptoms?",
            "I've had them for a few days now. What could it be?",
            "Based on your symptoms, it may be a common cold or flu. Have you taken your temperature?",
            "Yes, I have. It's 100.4°F. What should I do now?",
            "You should rest and stay hydrated. If your symptoms persist or worsen, please consult a doctor.",
            "Okay, thanks. What are some home remedies I can try?",
            "You can try drinking warm fluids, such as tea with honey, and taking over-the-counter pain relievers for your headache.",
            "Thanks, Medi. What are some warning signs that I should look out for?"
        ],
        "knowledge": "Influenza Influenza The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "You should look out for high fever, shortness of breath, chest pain, and confusion. If you experience any of these, seek medical attention immediately."
    },
    {
        "dialog": [
            "Hello, Medi. I have some questions about the flu.",
            "Sure, I'm happy to help. What would you like to know?",
            "What causes the flu?",
            "The flu is caused by the influenza virus. There are several different types of the virus, including H1N1, H3N2, and influenza B. The virus is contagious and spreads through respiratory droplets when an infected person coughs or sneezes.",
            "How can I prevent getting the flu?",
            "The best way to prevent the flu is to get a flu vaccine each year. You can also practice good hygiene, such as washing your hands frequently and avoiding close contact with people who are sick.",
            "What are the symptoms of the flu?",
            "The symptoms of the flu include fever, cough, sore throat, runny or stuffy nose, body aches, headache, chills, and fatigue.",
            "How long does the flu usually last?"
        ],
        "knowledge": "Influenza Influenza The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "The symptoms usually last for about a week, although it can take up to two weeks to fully recover."
    },
    {
        "dialog": [
            "Hi Medi, I recently had a flu shot. What else can I do to stay healthy?",
            "That's great that you got your flu shot. There are several other things you can do to stay healthy. What's your current lifestyle like?",
            "I try to eat healthy and exercise regularly, but I could use some tips.",
            "Eating a balanced diet with plenty of fruits and vegetables is important. Exercise for at least 30 minutes a day, 5 days a week. Make sure to get enough sleep, manage stress, and avoid smoking and excessive alcohol consumption.",
            "Are there any specific foods that can help boost my immune system?",
            "Yes, foods high in Vitamin C, such as citrus fruits, bell peppers, and broccoli, can help boost your immune system. Foods high in Vitamin D, such as fatty fish and fortified milk products, can also be beneficial.",
            "Thanks, Medi. What are some other ways to stay healthy?",
            "Wash your hands frequently with soap and water, especially before eating or touching your face. Avoid close contact with sick people. Cover your mouth and nose when you cough or sneeze, and stay home if you're feeling ill.",
            "Great, thanks for the advice Medi. How often should I get the flu shot?"
        ],
        "knowledge": "Influenza Influenza The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "You should get the flu shot once a year, usually in the fall before the flu season begins."
    },
    {
        "dialog": [
            "Hello Medi, I have a headache and a runny nose.",
            "Understood, these symptoms may indicate a seasonal flu. Do you have a fever as well?",
            "Yes, I do.",
            "Okay, I suggest you take some rest, drink a lot of fluids, and take some medicine to reduce the fever.",
            "Is there anything I can do to prevent getting the flu again?",
            "Yes, you can get a flu shot every year and wash your hands frequently to avoid germs.",
            "I see, thank you for your advice, Medi.",
            "You're welcome. Don't hesitate to contact me again if you need any further assistance.",
            "Sure. Thank you!"
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "I suggest you take some rest, drink a lot of fluids, and take some medicine to reduce the fever."
    },
    {
        "dialog": [
            "Hi Medi, can you tell me more about H1N1 and H3N2?",
            "Sure, H1N1 and H3N2 are influenza viruses that are responsible for seasonal flu outbreaks.",
            "How do they differ from each other?",
            "H1N1 is more commonly known as swine flu and was responsible for a pandemic in 2009. H3N2, on the other hand, is responsible for severe flu outbreaks in the elderly population.",
            "What are the symptoms of these viruses?",
            "The symptoms are similar to other strains of the flu, including fever, cough, sore throat, runny or stuffy nose, body aches, headache, chills, and fatigue.",
            "How can we prevent getting infected by these viruses?",
            "You can prevent getting infected by getting a flu shot every year, washing your hands frequently, and avoiding close contact with people who are infected.",
            "Thank you, Medi. That's very helpful information."
        ],
        "knowledge": "Influenza Influenza  Consequently, H1N1, H3N2, and both IBV lineages have been in circulation in seasonal form since the 2009 pandemic. In 2011, IDV was discovered in pigs in Oklahoma, USA, and cattle were later identified as the primary reservoir of IDV.  In the same year, avian H7N9 was detected in China and began to cause human infections in 2013, starting in Shanghai and Anhui and remaining mostly in China.  HPAI H7N9 emerged sometime in 2016 and has occasionally infected humans incidentally.  Other AIVs have less commonly infected humans since the 1990s, including H5N6, H6N1, H7N2-4, H7N7, and H10N7-8, and HPAI H subtypes such as H5N1-3, H5N5-6, and H5N8 have begun to spread throughout much of the world since the 2010s.  Future flu pandemics, which may be caused by an influenza virus of avian origin, are viewed as almost inevitable, and increased globalization has made it easier for novel viruses to spread, so there are continual efforts to prepare for future pandemics and improve the prevention and treatment of influenza. The word influenza comes from the Italian word influenza, from medieval Latin influentia, originally meaning \"visitation\" or \"influence\" Influenza Influenza",
        "response": "You're welcome. Don't hesitate to contact me again if you have any further questions."
    },
    {
        "dialog": [
            "Hello Medi, I recently had a medical procedure and I'm not sure what I should do now.",
            "What type of procedure did you have?",
            "I had surgery on my knee.",
            "Okay, you should take some time to rest and avoid putting too much pressure on your knee. You should also follow the physical therapy program prescribed by your doctor.",
            "What kind of diet should I follow?",
            "You should focus on consuming a healthy, balanced diet that includes plenty of fruits and vegetables to help your body heal.",
            "Is there any physical exercise I can do to speed up the recovery process?",
            "Yes, you can perform low impact exercises such as swimming or cycling to help strengthen your knee and improve your overall fitness.",
            "Thank you for your advice, Medi."
        ],
        "knowledge": "Influenza Influenza  Consequently, H1N1, H3N2, and both IBV lineages have been in circulation in seasonal form since the 2009 pandemic. In 2011, IDV was discovered in pigs in Oklahoma, USA, and cattle were later identified as the primary reservoir of IDV.  In the same year, avian H7N9 was detected in China and began to cause human infections in 2013, starting in Shanghai and Anhui and remaining mostly in China.  HPAI H7N9 emerged sometime in 2016 and has occasionally infected humans incidentally.  Other AIVs have less commonly infected humans since the 1990s, including H5N6, H6N1, H7N2-4, H7N7, and H10N7-8, and HPAI H subtypes such as H5N1-3, H5N5-6, and H5N8 have begun to spread throughout much of the world since the 2010s.  Future flu pandemics, which may be caused by an influenza virus of avian origin, are viewed as almost inevitable, and increased globalization has made it easier for novel viruses to spread, so there are continual efforts to prepare for future pandemics and improve the prevention and treatment of influenza. The word influenza comes from the Italian word influenza, from medieval Latin influentia, originally meaning \"visitation\" or \"influence\" Influenza Influenza",
        "response": "You're welcome. Don't hesitate to contact me again if you need any further assistance."
    },
    {
        "dialog": [
            "Hi Medi, I have a fever, can you help me?",
            "Of course, can you tell me more about your symptoms?",
            "I feel hot, my body temperature is 37.8 degrees Celsius",
            "Ok, do you feel tired or have a headache?",
            "Yes, I feel very tired and have a headache",
            "Based on your symptoms, you have a fever, rest and drink plenty of fluids.",
            "What kind of fluids should I drink?",
            "Water, tea, or soup is good.",
            "Ok, thank you for your advice, Medi"
        ],
        "knowledge": "Fever Fever A fever is a temporary increase in body temperature, often due to an illness. Having a fever is a sign that something out of the ordinary is going on in your body. A fever is usually a response by the immune system to an infection, injury, or inflammation. Fevers can be caused by a variety of factors, including bacterial or viral infections, heat exhaustion, medication side effects, autoimmune disorders, and certain types of cancer. The normal body temperature for adults is between 36-37 degrees Celsius. Treatment for a fever usually involves rest and drinking plenty of fluids. In some cases, medication may also be prescribed to help lower the fever. Fever Fever",
        "response": "What kind of fluids should I drink to treat my fever?"
    },
    {
        "dialog": [
            "Hello Medi, I have a question about the flu",
            "Sure, what would you like to know?",
            "What are the symptoms of the flu?",
            "The symptoms include fever, cough, sore throat, runny or stuffy nose, body aches, headache, chills, and fatigue.",
            "Can you give me some advice on how to prevent the flu?",
            "Wash your hands frequently, avoid crowded areas, get vaccinated, and maintain a healthy lifestyle.",
            "Is the flu contagious?",
            "Yes, the flu is contagious and can spread from person to person.",
            "How long does it take to recover from the flu?"
        ],
        "knowledge": "Influenza Influenza The flu is a respiratory illness caused by influenza viruses. Symptoms include fever, cough, sore throat, runny or stuffy nose, body aches, headache, chills, and fatigue. The flu is contagious and can spread from person to person through respiratory droplets when an infected person talks, coughs, or sneezes. Influenza vaccination is the most effective way to prevent the flu. Other prevention strategies include washing your hands frequently, avoiding crowded areas, and maintaining a healthy lifestyle. The flu can be severe and lead to complications such as pneumonia, bronchitis, and ear infections. Recovery from the flu typically takes about 1-2 weeks. Influenza Influenza",
        "response": "How long does it take to recover from the flu?"
    },
    {
        "dialog": [
            "Hi Medi, I just had a medical procedure done, can you give me some advice?",
            "Of course, what kind of procedure did you have?",
            "I had a colonoscopy",
            "After the procedure, it is important to rest and avoid any heavy lifting or strenuous activity for a day or two.",
            "What kind of food should I eat after the procedure?",
            "For the first day or two after the procedure, it is recommended to eat a light diet and avoid foods that are hard to digest. Stick to clear liquids like broth, apple juice, and tea, and gradually add solid foods as you feel better.",
            "How long does it take to recover from a colonoscopy?",
            "Typically, it takes about 24-48 hours to fully recover from a colonoscopy.",
            "What kind of physical activity can I do after the procedure?"
        ],
        "knowledge": "Colonoscopy Colonoscopy A colonoscopy is a medical procedure used to examine the colon and rectum for abnormalities, including signs of cancer. During the procedure, a long, flexible tube with a camera on the end is inserted into the rectum and colon. Colonoscopy is typically performed as part of a routine screening for colorectal cancer, or to investigate symptoms such as rectal bleeding or abdominal pain. After the procedure, it is important to rest and avoid any heavy lifting or strenuous activity for a day or two. For the first day or two after the procedure, it is recommended to eat a light diet and avoid foods that are hard to digest. Typically, it takes about 24-48 hours to fully recover from a colonoscopy. Colonoscopy Colonoscopy",
        "response": "What kind of food should I eat after a colonoscopy?"
    },
    {
        "dialog": [
            "Hi Medi, I've been feeling very sick lately.",
            "I'm sorry to hear that. Can you tell me what symptoms you're experiencing?",
            "I have a fever, a cough, and I'm having trouble breathing.",
            "Okay, based on your symptoms, it's possible that you have contracted COVID-19.",
            "What should I do now?",
            "You should isolate yourself immediately and get tested for COVID-19 as soon as possible.",
            "What happens if I test positive for COVID-19?",
            "If you test positive, you should continue to isolate yourself and follow the instructions provided by your local health authorities.",
            "Thank you, Medi."
        ],
        "knowledge": "COVID-19 COVID-19 COVID-19 (Coronavirus disease 2019) is an infectious disease caused by SARS-CoV-2, a virus closely related to the SARS virus. The disease was first identified in December 2019 in Wuhan, China, and has since spread globally, resulting in the ongoing coronavirus pandemic. Common symptoms include fever, cough, and shortness of breath. Other symptoms may include muscle pain, fatigue, and sore throat. The virus is primarily spread between people during close contact, and via respiratory droplets produced when an infected person coughs or sneezes. Hand hygiene and social distancing measures are recommended to prevent the spread of the virus. COVID-19 COVID-19",
        "response": "You're welcome. I hope you feel better soon."
    },
    {
        "dialog": [
            "Hey Medi, my doctor recently prescribed me some medication. Can you tell me more about it?",
            "Of course, what's the name of the medication?",
            "It's called aspirin.",
            "Aspirin is a medication used to reduce pain, fever, and inflammation. It is also used to prevent blood clots.",
            "Is it safe to take?",
            "Aspirin is generally safe, but there are some side effects you should be aware of. Common side effects include stomach upset and heartburn. More serious side effects, such as bleeding and allergic reactions, are rare but possible.",
            "What should I do if I experience any side effects?",
            "If you experience any side effects, you should contact your doctor immediately.",
            "Thank you for your help, Medi."
        ],
        "knowledge": "Aspirin Aspirin Aspirin, also known as acetylsalicylic acid, is a medication used to reduce pain, fever, and inflammation. It is also used to prevent blood clots. Common side effects include stomach upset and heartburn. More serious side effects, such as bleeding and allergic reactions, are rare but possible. Aspirin should not be given to children under the age of 16 due to the risk of Reye's syndrome. Aspirin should also be used with caution in people who have bleeding disorders or who are taking blood-thinning medications. Aspirin can interact with other medications, so it is important to tell your doctor about all the medications you are taking before starting aspirin. Aspirin Aspirin",
        "response": "You're welcome. Let me know if you have any other questions."
    },
    {
        "dialog": [
            "Hi Medi, I just had surgery on my knee. What should I do to aid in my recovery?",
            "After surgery, it's important to get enough rest and follow your doctor's instructions.",
            "What else can I do to aid in my recovery?",
            "You can try doing some gentle exercises to improve your range of motion and flexibility.",
            "Are there any specific exercises I should do?",
            "Your doctor or a physical therapist can give you specific exercises to do based on your individual needs.",
            "What about my diet?",
            "Eating a healthy and balanced diet can also aid in your recovery. It's important to get enough protein and vitamins to help your body heal.",
            "Thanks for your advice, Medi."
        ],
        "knowledge": "Post-surgery recovery Post-surgery recovery After surgery, it's important to get enough rest and follow your doctor's instructions. You can also try doing some gentle exercises to improve your range of motion and flexibility. Your doctor or a physical therapist can give you specific exercises to do based on your individual needs. Eating a healthy and balanced diet can also aid in your recovery. It's important to get enough protein and vitamins to help your body heal. Post-surgery recovery Post-surgery recovery",
        "response": "You're welcome. I hope your recovery goes well."
    },
    {
        "dialog": [
            "Hi Medi, I feel shortness of breath. Can you help me?",
            "Of course, can you describe the situation in more detail?",
            "I have difficulty breathing and my chest feels tight",
            "Have you been around someone who has COVID-19?",
            "No, I have been practicing social distancing.",
            "Based on your symptoms, it may be asthma. Consult a doctor immediately.",
            "What should I do for now?",
            "Inhale a puff of your asthma inhaler, if you have one, and call a doctor right away.",
            "Thank you, I'll do that."
        ],
        "knowledge": "Asthma Asthma  Asthma is a chronic respiratory disease that causes inflammation of the airways.  It affects approximately 339 million people worldwide and causes an estimated 400,000 deaths annually.  The symptoms of asthma include wheezing, shortness of breath, chest tightness, and coughing.  Asthma symptoms can be triggered by exposure to allergens, irritants, respiratory infections, exercise, cold air, stress, and other factors.  Asthma can be managed with medication and lifestyle changes, but there is no cure.  Inhalers are commonly used to relieve asthma symptoms.  Asthma can range from mild to severe, and it can be life-threatening in some cases.  Asthma attacks can be prevented by avoiding triggers and taking medication as prescribed Asthma Asthma",
        "response": "What kind of medication should I take for asthma?"
    },
    {
        "dialog": [
            "Hi Medi, I have a fever and a headache. What could it be?",
            "It could be a viral fever. Have you been to any crowded places recently?",
            "Yes, I was at a concert last night.",
            "Based on your symptoms, it might be a viral fever. Get some rest and drink plenty of fluids.",
            "Should I take any medication?",
            "You can take acetaminophen or ibuprofen to relieve your fever and headache.",
            "Okay, I'll do that. How long does a viral fever usually last?",
            "Typically, a viral fever lasts for 3-5 days.",
            "Thanks for your advice."
        ],
        "knowledge": "Viral Fever Viral Fever  A viral fever is a type of fever caused by a virus.  The most common symptoms of a viral fever are fever, headache, body aches, chills, and fatigue.  Other symptoms can include a cough, a sore throat, and nasal congestion.  Viral fevers can be caused by a number of different viruses, including the flu virus, the common cold virus, and the coronavirus.  Most viral fevers are self-limiting and go away on their own within a few days.  Treatment for a viral fever usually involves getting plenty of rest and drinking fluids.  Over-the-counter medications like acetaminophen or ibuprofen can be used to reduce fever and relieve other symptoms Viral Fever Viral Fever",
        "response": "Is it safe to take acetaminophen or ibuprofen with a viral fever?"
    },
    {
        "dialog": [
            "Hi Medi, I just had a surgery. What should I do to recover faster?",
            "Congratulations! Resting is the most important thing you can do right now. ",
            "Should I restrict my diet?",
            "You should eat healthy food and avoid fatty, oily and spicy foods",
            "Can I do any physical activity?",
            "You should avoid rigorous exercise for a few weeks, but light movements such as walking are recommended.",
            "Do I need to take medication?",
            "Yes, it is essential to take any medication prescribed by your doctor",
            "Thanks for your advice, Medi."
        ],
        "knowledge": "Post-Operative Care Post-Operative Care  After surgery, it is important to get plenty of rest and take it easy.  You should avoid heavy lifting or strenuous exercise for a few weeks.  It is also important to eat a healthy diet and stay hydrated.  You may experience pain and discomfort after surgery, which can be managed with medication prescribed by your doctor.  You should follow your doctor's instructions carefully and attend any follow-up appointments as scheduled.  If you experience any unusual symptoms or complications, such as fever, bleeding, or infection, you should contact your doctor immediately. Post-Operative Care Post-Operative Care",
        "response": "When can I resume my normal activities after a surgery?"
    },
    {
        "dialog": [
            "Hello Medi, I have a cough and a fever.",
            "Okay, let me understand better. For how long have you been experiencing these symptoms?",
            "It started two days ago and I'm feeling worse every day.",
            "Based on your symptoms, you may have the flu. Have you been in contact with anyone who has been sick recently?",
            "Yes, my co-worker was out sick last week with similar symptoms.",
            "I see. It's best to stay home and rest. Drink plenty of fluids and take over-the-counter medication for your symptoms if necessary.",
            "Should I see a doctor?",
            "If your symptoms worsen or don't improve after a few days, then yes, you should see a doctor.",
            "Thank you, Medi."
        ],
        "knowledge": "Influenza Influenza The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion. These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose. Coughing is the most common symptom. Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children. The standard influenza symptoms typically last for 2 - 8 days. A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common. Influenza Influenza",
        "response": "Based on your symptoms, you may have the flu. Have you been in contact with anyone who has been sick recently?"
    },
    {
        "dialog": [
            "Hi, Medi. Can you explain what avian flu is?",
            "Sure. Avian flu is a subtype of influenza that primarily affects birds.",
            "Is it contagious to humans?",
            "Yes, some types of avian flu can be transmitted from birds to humans.",
            "What are the symptoms of avian flu in humans?",
            "Symptoms include fever, cough, sore throat, muscle aches, and eye infections.",
            "Is there a cure for avian flu?",
            "There is no cure for avian flu, but antiviral medication can be effective in treating and preventing the virus.",
            "How is avian flu prevented?"
        ],
        "knowledge": "Influenza Influenza  Consequently, H1N1, H3N2, and both IBV lineages have been in circulation in seasonal form since the 2009 pandemic. In 2011, IDV was discovered in pigs in Oklahoma, USA, and cattle were later identified as the primary reservoir of IDV. In the same year, avian H7N9 was detected in China and began to cause human infections in 2013, starting in Shanghai and Anhui and remaining mostly in China. HPAI H7N9 emerged sometime in 2016 and has occasionally infected humans incidentally. Other AIVs have less commonly infected humans since the 1990s, including H5N6, H6N1, H7N2-4, H7N7, and H10N7-8, and HPAI H subtypes such as H5N1-3, H5N5-6, and H5N8 have begun to spread throughout much of the world since the 2010s. Future flu pandemics, which may be caused by an influenza virus of avian origin, are viewed as almost inevitable, and increased globalization has made it easier for novel viruses to spread, so there are continual efforts to prepare for future pandemics and improve the prevention and treatment of influenza. The word influenza comes from the Italian word influenza, from medieval Latin influentia, originally meaning 'visitation' or 'influence.' Influenza Influenza",
        "response": "The best way to prevent avian flu is to avoid contact with infected birds, practice good hygiene, and get vaccinated if available."
    },
    {
        "dialog": [
            "Hi, Medi. I recently had a colonoscopy. Can you give me advice on how to recover?",
            "Of course. It's normal to feel a bit tired and bloated after a colonoscopy.",
            "Can I eat normally?",
            "It's best to start with a light diet and gradually reintroduce normal foods. Avoid spicy or fatty foods for a few days.",
            "What about physical activity?",
            "Avoid strenuous physical activity for a few days. Light exercise such as walking is encouraged.",
            "Can I take over-the-counter medication for pain?",
            "Yes, you can take over-the-counter pain medication if needed. Ask your doctor which medications are safe for you to take.",
            "How long should I expect to feel discomfort?"
        ],
        "knowledge": "Colonoscopy Colonoscopy A colonoscopy is a procedure that examines the large intestine for abnormalities or disease. During the procedure, a flexible tube with a camera is inserted through the rectum and into the colon. The procedure takes about 30 minutes to an hour. The colon must be completely clean for the procedure to be effective, so a special diet and laxatives are required before the procedure. After the procedure, you may feel bloated and have some discomfort for a few days. In rare cases, complications such as bleeding or bowel perforation can occur. Colonoscopy Colonoscopy",
        "response": "You may feel some discomfort and bloating for a few days to a week after the procedure."
    }
]