[
    {
        "dialog": [
            "Hi Medi, I think I might have a cold",
            "Hello, what symptoms are you experiencing?",
            "I have a runny nose, cough and sore throat.",
            "Based on your symptoms, it is possible that you have a cold. ",
            "What can I do to feel better?",
            "Getting plenty of rest and staying hydrated can help. You can also try over-the-counter medications such as decongestants or cough suppressants.",
            "Should I take zinc supplements?",
            "There is insufficient scientific evidence to support the use of zinc for the common cold. It is not recommended.",
            "Okay, thank you, Medi. How long should I expect to have these symptoms?"
        ],
        "knowledge": "Common cold Common cold  Some zinc remedies directly applied to the inside of the nose have led to the loss of the sense of smell.  A 2017 review did not recommend the use of zinc for the common cold for various reasons; whereas a 2017 and 2018 review both recommended the use of zinc, but also advocated further research on the topic. While there are many alternative medicines and Chinese herbal medicines supposed to treat the common cold, there is insufficient scientific evidence to support their use.  As of 2015, there is weak evidence to support nasal irrigation with saline.  There is no firm evidence that Echinacea products or garlic provide any meaningful benefit in treating or preventing colds. Vitamin C supplementation does not affect the incidence of the common cold, but may reduce its duration.  There is no conclusive evidence that vitamin D supplementation is efficacious in the prevention or treatment of respiratory tract infections Common cold Common cold",
        "response": "It usually takes 7 to 10 days to recover from a cold, but symptoms can last up to 3 weeks."
    },
    {
        "dialog": [
            "Hi Medi, I recently recovered from COVID-19",
            "Hello! How are you feeling now?",
            "I feel like I'm no longer contagious, but I want to make sure",
            "After a positive COVID-19 test, you should wait at least 10 days since your symptoms first appeared and until you have no fever for at least 24 hours without taking fever-reducing medication before ending isolation.",
            "Can I get COVID-19 again?",
            "It is possible to get reinfected with COVID-19, but it is rare. It is important to continue following safety measures like wearing a mask and social distancing.",
            "What can I do to strengthen my immune system?",
            "Eating a healthy diet, getting enough sleep, and exercising regularly can all help strengthen your immune system.",
            "Thanks, Medi. What is the current status of the COVID-19 pandemic?"
        ],
        "knowledge": "COVID-19 COVID-19  The disease is caused by the SARS-CoV-2 virus, which is related to the virus that caused the SARS outbreak in 2003. It is primarily spread between people via respiratory droplets from infected individuals when they speak, cough, or sneeze.  The time between exposure and symptom onset is typically around five days, but may range from two to fourteen days.  Common symptoms include fever, cough, and shortness of breath.  Complications may include pneumonia and acute respiratory distress syndrome.  The fatality rate varies between 0.2% and 15% depending on age and other health problems.  A vaccine for COVID-19 is available and is being distributed worldwide.",
        "response": "The COVID-19 pandemic is still ongoing, but vaccines have become available and are being distributed worldwide."
    },
    {
        "dialog": [
            "Hi Medi, I just had surgery to remove my appendix",
            "Hi there! How can I assist you today?",
            "I'm looking for advice on what I should eat during my recovery",
            "It's important to eat a balanced diet with plenty of protein and fiber to help your body heal. Avoid high-fat, greasy or fried foods.",
            "Are there any foods that can help speed up the recovery process?",
            "Foods high in vitamin C and zinc can help boost your immune system, which can help speed up the healing process. Examples include citrus fruits, leafy greens, and nuts.",
            "How much physical activity should I do during my recovery?",
            "It's important to start slowly and gradually increase your activity level. Walking short distances is a good place to start.",
            "Thank you, Medi. What else can I do to promote healing?"
        ],
        "knowledge": "Appendicitis Appendicitis  Appendicitis is inflammation of the appendix.  Symptoms commonly include right lower abdominal pain, nausea, vomiting, and decreased appetite.  However, approximately 40% of people do not have these typical symptoms.  Severe complications of a ruptured appendix include widespread, painful inflammation of the inner lining of the abdominal wall and sepsis.  Appendicitis is typically treated with surgery to remove the appendix.  Recovery time varies from person to person, but most people can return to their normal activities within a couple of weeks.",
        "response": "Getting enough sleep and managing stress can also help promote healing after surgery."
    },
    {
        "dialog": [
            "Hello Medi, I have a running nose and sore throat.",
            "It sounds like you might have a common cold. Do you have a fever?",
            "No, I don't have a fever.",
            "That's good. You can try nasal irrigation with saline for relief.",
            "Is there any medicine I can take?",
            "There is weak evidence to support the use of Vitamin C, but other alternative medicines lack scientific support.",
            "I see. Thank you for your advice, Medi.",
            "You're welcome. Do you have any other questions?",
            "No, that's all for now."
        ],
        "knowledge": "Common cold Common cold  Some zinc remedies directly applied to the inside of the nose have led to the loss of the sense of smell.  A 2017 review did not recommend the use of zinc for the common cold for various reasons; whereas a 2017 and 2018 review both recommended the use of zinc, but also advocated further research on the topic. While there are many alternative medicines and Chinese herbal medicines supposed to treat the common cold, there is insufficient scientific evidence to support their use.  As of 2015, there is weak evidence to support nasal irrigation with saline.  There is no firm evidence that Echinacea products or garlic provide any meaningful benefit in treating or preventing colds. Vitamin C supplementation does not affect the incidence of the common cold, but may reduce its duration.  There is no conclusive evidence that vitamin D supplementation is efficacious in the prevention or treatment of respiratory tract infections Common cold Common cold",
        "response": "You're welcome. Take care and get well soon."
    },
    {
        "dialog": [
            "Hello Medi, I recently had a cold and lost my sense of smell.",
            "I'm sorry to hear that. Did you use any zinc remedies directly inside your nose?",
            "Yes, I did.",
            "That's one reason why you may have lost your sense of smell. It's a known side effect of some zinc remedies. ",
            "Oh no, I had no idea. Is there a way to get my sense of smell back?",
            "It should come back on its own after a few weeks, but if it doesn't, you should see a doctor.",
            "Thank you so much for your help.",
            "You're welcome. Do you have any other questions?",
            "No, that's all for now."
        ],
        "knowledge": "Common cold Common cold  Some zinc remedies directly applied to the inside of the nose have led to the loss of the sense of smell.  A 2017 review did not recommend the use of zinc for the common cold for various reasons; whereas a 2017 and 2018 review both recommended the use of zinc, but also advocated further research on the topic. While there are many alternative medicines and Chinese herbal medicines supposed to treat the common cold, there is insufficient scientific evidence to support their use.  As of 2015, there is weak evidence to support nasal irrigation with saline.  There is no firm evidence that Echinacea products or garlic provide any meaningful benefit in treating or preventing colds. Vitamin C supplementation does not affect the incidence of the common cold, but may reduce its duration.  There is no conclusive evidence that vitamin D supplementation is efficacious in the prevention or treatment of respiratory tract infections Common cold Common cold",
        "response": "You're welcome. Take care and don't hesitate to see a doctor if your sense of smell doesn't return."
    },
    {
        "dialog": [
            "Hello Medi, I recently recovered from a cold. What should I do to prevent it from happening again?",
            "You can prevent it by washing your hands often and avoiding close contact with sick people.",
            "Any other advice?",
            "You can try to boost your immune system by eating a healthy diet with plenty of vitamins and getting enough sleep.",
            "Thank you. Do you recommend getting a flu shot?",
            "Yes, it's a good idea to get a flu shot every year to protect yourself from getting sick.",
            "I see. Thanks for your advice.",
            "You're welcome. Do you have any other questions?",
            "No, that's all for now."
        ],
        "knowledge": "Common cold Common cold  Some zinc remedies directly applied to the inside of the nose have led to the loss of the sense of smell.  A 2017 review did not recommend the use of zinc for the common cold for various reasons; whereas a 2017 and 2018 review both recommended the use of zinc, but also advocated further research on the topic. While there are many alternative medicines and Chinese herbal medicines supposed to treat the common cold, there is insufficient scientific evidence to support their use.  As of 2015, there is weak evidence to support nasal irrigation with saline.  There is no firm evidence that Echinacea products or garlic provide any meaningful benefit in treating or preventing colds. Vitamin C supplementation does not affect the incidence of the common cold, but may reduce its duration.  There is no conclusive evidence that vitamin D supplementation is efficacious in the prevention or treatment of respiratory tract infections Common cold Common cold",
        "response": "You're welcome. Stay healthy and don't hesitate to reach out if you need anything else."
    },
    {
        "dialog": [
            "Hi Medi, I have a very bad cold and I don't know what to do",
            "Hello there. I can help you with that. What are your symptoms?",
            "I have a runny nose, sore throat, and a headache",
            "Based on your symptoms, it looks like you have the common cold",
            "How can I treat it?",
            "Rest, drink fluids, and take over-the-counter medication for fever and pain",
            "Okay, thank you. Is there anything else I can do?",
            "Try using a saline nasal spray to relieve congestion",
            "Okay, thank you for your help"
        ],
        "knowledge": "Common cold Common cold  Some zinc remedies directly applied to the inside of the nose have led to the loss of the sense of smell.  A 2017 review did not recommend the use of zinc for the common cold for various reasons; whereas a 2017 and 2018 review both recommended the use of zinc, but also advocated further research on the topic. While there are many alternative medicines and Chinese herbal medicines supposed to treat the common cold, there is insufficient scientific evidence to support their use.  As of 2015, there is weak evidence to support nasal irrigation with saline.  There is no firm evidence that Echinacea products or garlic provide any meaningful benefit in treating or preventing colds. Vitamin C supplementation does not affect the incidence of the common cold, but may reduce its duration.  There is no conclusive evidence that vitamin D supplementation is efficacious in the prevention or treatment of respiratory tract infections Common cold Common cold",
        "response": "You're welcome. Take care and get plenty of rest."
    },
    {
        "dialog": [
            "Hi Medi, I want to know more about the common cold",
            "Of course. What specifically would you like to know?",
            "What causes the common cold?",
            "The common cold is caused by a virus that infects your nose and throat",
            "Is there a cure?",
            "Unfortunately, there is no cure for the common cold. It usually clears up on its own",
            "What can I do to prevent getting a cold?",
            "Wash your hands frequently, avoid close contact with people who have a cold, and avoid touching your face",
            "Okay, thank you for the information"
        ],
        "knowledge": "Common cold Common cold  Some zinc remedies directly applied to the inside of the nose have led to the loss of the sense of smell.  A 2017 review did not recommend the use of zinc for the common cold for various reasons; whereas a 2017 and 2018 review both recommended the use of zinc, but also advocated further research on the topic. While there are many alternative medicines and Chinese herbal medicines supposed to treat the common cold, there is insufficient scientific evidence to support their use.  As of 2015, there is weak evidence to support nasal irrigation with saline.  There is no firm evidence that Echinacea products or garlic provide any meaningful benefit in treating or preventing colds. Vitamin C supplementation does not affect the incidence of the common cold, but may reduce its duration.  There is no conclusive evidence that vitamin D supplementation is efficacious in the prevention or treatment of respiratory tract infections Common cold Common cold",
        "response": "You're welcome. Stay healthy and take care of yourself."
    },
    {
        "dialog": [
            "Hi Medi, I just recovered from a cold. What can I do to prevent getting sick again?",
            "Hello there. One way to prevent getting sick again is to boost your immune system",
            "How can I boost my immune system?",
            "Eat a healthy diet, exercise regularly, get enough sleep, manage stress, and wash your hands frequently",
            "Is there anything specific I should eat?",
            "Include foods that are rich in vitamin C, vitamin E, and zinc in your diet",
            "Okay, thank you for the advice",
            "You're welcome. Is there anything else I can help you with?",
            "No, that's all. Thank you for your help"
        ],
        "knowledge": "Common cold Common cold  Some zinc remedies directly applied to the inside of the nose have led to the loss of the sense of smell.  A 2017 review did not recommend the use of zinc for the common cold for various reasons; whereas a 2017 and 2018 review both recommended the use of zinc, but also advocated further research on the topic. While there are many alternative medicines and Chinese herbal medicines supposed to treat the common cold, there is insufficient scientific evidence to support their use.  As of 2015, there is weak evidence to support nasal irrigation with saline.  There is no firm evidence that Echinacea products or garlic provide any meaningful benefit in treating or preventing colds. Vitamin C supplementation does not affect the incidence of the common cold, but may reduce its duration.  There is no conclusive evidence that vitamin D supplementation is efficacious in the prevention or treatment of respiratory tract infections Common cold Common cold",
        "response": "You're welcome. Take care and continue taking care of your health."
    },
    {
        "dialog": [
            "Hi Medi, I think I have a common cold, what should I do?",
            "Hello, let's find out what symptoms you have and take it from there",
            "I have a runny nose, sore throat and general flu-like symptoms",
            "Sounds like a cold, you can try nasal irrigation with saline and taking Vitamin C to reduce symptoms",
            "What about zinc remedies, are they effective?",
            "There is conflicting information about zinc remedies for the common cold, some studies recommend it but others advise against it",
            "I see, thank you for your help, Medi",
            "You're welcome, take care and get plenty of rest",
            "Is there anything else I should know about the common cold?"
        ],
        "knowledge": "Common cold Common cold  Some zinc remedies directly applied to the inside of the nose have led to the loss of the sense of smell.  A 2017 review did not recommend the use of zinc for the common cold for various reasons; whereas a 2017 and 2018 review both recommended the use of zinc, but also advocated further research on the topic. While there are many alternative medicines and Chinese herbal medicines supposed to treat the common cold, there is insufficient scientific evidence to support their use.  As of 2015, there is weak evidence to support nasal irrigation with saline.  There is no firm evidence that Echinacea products or garlic provide any meaningful benefit in treating or preventing colds. Vitamin C supplementation does not affect the incidence of the common cold, but may reduce its duration.  There is no conclusive evidence that vitamin D supplementation is efficacious in the prevention or treatment of respiratory tract infections Common cold Common cold",
        "response": "Zinc remedies have mixed research and are not definitively effective for treating the common cold"
    },
    {
        "dialog": [
            "Hi Medi, I just got a flu shot and I'm feeling a little sick, is this normal?",
            "Hello, it's normal to experience mild symptoms after getting a flu shot, it means your body is building immunity",
            "But I already had the flu before getting the shot, is it still necessary?",
            "Yes, it's still necessary because the flu shot protects against multiple strains of the flu, not just the one you had",
            "Okay, I understand. Is there anything I can do to alleviate the symptoms?",
            "You can rest and take over-the-counter medication like acetaminophen or ibuprofen for fever and aches",
            "Are there any side effects I should watch out for?",
            "Serious side effects are rare, but you should contact your healthcare provider if you experience any redness or swelling at the injection site or difficulty breathing",
            "Thank you for your help, Medi"
        ],
        "knowledge": "Influenza vaccination Influenza vaccination  Mild side effects such as soreness, redness, or swelling where the shot was given, fever, aches, and headache, are common and usually go away on their own.  If these symptoms persist, contact a healthcare provider.  Serious side effects are rare, but if they occur, contact a healthcare provider immediately.  Symptoms of a severe allergic reaction include difficulty breathing, swelling around the face or throat, fast heartbeat, dizziness, and weakness.  These symptoms can occur within minutes to hours after vaccination, but are very rare. Influenza vaccination Influenza vaccination",
        "response": "Symptoms may last a few days but should gradually improve within a week after getting the flu shot"
    },
    {
        "dialog": [
            "Hi Medi, I just had a surgical procedure and I'm wondering what I can do to aid in my recovery",
            "Hello, it's important to follow your doctor's instructions for post-op care, but general tips include eating a balanced diet and getting enough rest",
            "Are there any foods I should avoid?",
            "Avoid foods that are high in sugar or salt, as well as alcohol and caffeine",
            "What about physical activity?",
            "You should avoid strenuous activity and heavy lifting for a few weeks, but light exercise like walking is encouraged to promote blood flow and prevent blood clots",
            "Thank you, Medi. Any other tips?",
            "Make sure to stay hydrated by drinking plenty of water, and avoid smoking or being around secondhand smoke as it can impede the healing process",
            "Okay, I'll keep that in mind. Thanks again, Medi"
        ],
        "knowledge": "Surgical procedure Surgical procedure  Follow your doctor's instructions for post-op care, which may include keeping the incision area clean and dry, taking medication for pain management, and avoiding certain activities like driving.  You should also eat a balanced diet to promote healing and get enough rest.  Avoid foods high in sugar or salt, as well as alcohol and caffeine.  Light exercise like walking is encouraged to promote blood flow and prevent blood clots, but avoid strenuous activity for a few weeks.  Stay hydrated by drinking plenty of water, and avoid smoking or being around secondhand smoke as it can impede the healing process Surgical procedure Surgical procedure",
        "response": "It depends on the type of procedure and your recovery progress, your doctor can give you a better estimate but it's typically a few days to a few weeks"
    },
    {
        "dialog": [
            "Hello Medi, I have a terrible cold. Can you help me with it?",
            "Hi, sure. What are your symptoms?",
            "I have a sore throat, running nose and cough.",
            "I understand. Have you tried any home remedies?",
            "I tried drinking warm water with honey, but it didn't help.",
            "Ok, let me check our database. Zinc remedies or nasal irrigation with saline can help.",
            "What should I do if I lose my sense of smell from zinc remedies?",
            "Stop using it immediately and try other remedies like saline solution.",
            "Thank you for your advice, Medi."
        ],
        "knowledge": "Common cold Common cold  Some zinc remedies directly applied to the inside of the nose have led to the loss of the sense of smell.  A 2017 review did not recommend the use of zinc for the common cold for various reasons; whereas a 2017 and 2018 review both recommended the use of zinc, but also advocated further research on the topic. While there are many alternative medicines and Chinese herbal medicines supposed to treat the common cold, there is insufficient scientific evidence to support their use.  As of 2015, there is weak evidence to support nasal irrigation with saline.  There is no firm evidence that Echinacea products or garlic provide any meaningful benefit in treating or preventing colds. Vitamin C supplementation does not affect the incidence of the common cold, but may reduce its duration.  There is no conclusive evidence that vitamin D supplementation is efficacious in the prevention or treatment of respiratory tract infections Common cold Common cold",
        "response": "You're welcome. Let me know if you need any other help."
    },
    {
        "dialog": [
            "Hi Medi, what exactly is the common cold?",
            "Hi. The common cold is a viral infection in your nose and throat.",
            "What are the symptoms of the common cold?",
            "Symptoms include a sore throat, runny nose, cough and fever.",
            "How can I prevent getting a cold?",
            "Washing your hands frequently and avoiding close contact with people who are sick is a good start.",
            "Is there a cure for the common cold?",
            "No, there isn't. But there are ways to relieve your symptoms like taking over-the-counter medication.",
            "Thank you, Medi. That was helpful."
        ],
        "knowledge": "Common cold Common cold  Some zinc remedies directly applied to the inside of the nose have led to the loss of the sense of smell.  A 2017 review did not recommend the use of zinc for the common cold for various reasons; whereas a 2017 and 2018 review both recommended the use of zinc, but also advocated further research on the topic. While there are many alternative medicines and Chinese herbal medicines supposed to treat the common cold, there is insufficient scientific evidence to support their use.  As of 2015, there is weak evidence to support nasal irrigation with saline.  There is no firm evidence that Echinacea products or garlic provide any meaningful benefit in treating or preventing colds. Vitamin C supplementation does not affect the incidence of the common cold, but may reduce its duration.  There is no conclusive evidence that vitamin D supplementation is efficacious in the prevention or treatment of respiratory tract infections Common cold Common cold",
        "response": "You're welcome. Let me know if you have any other questions."
    },
    {
        "dialog": [
            "Hello Medi, I just had a cold and I want to know how I can prevent getting another one.",
            "Hi. Basic hygiene is the key. Wash your hands frequently and avoid close contact with people who are sick.",
            "Is there a specific diet I should follow to prevent getting another cold?",
            "Eating a balanced diet with vitamins and vegetables can help boost your immune system.",
            "Are there any home remedies to prevent getting a cold?",
            "There is no cure for the common cold, but you can try taking zinc remedies or using saline solution for nasal irrigation.",
            "Can I take vitamin C supplements to prevent getting a cold?",
            "Vitamin C does not prevent getting a cold, but it may reduce the duration of your symptoms.",
            "Thanks for your help, Medi."
        ],
        "knowledge": "Common cold Common cold  Some zinc remedies directly applied to the inside of the nose have led to the loss of the sense of smell.  A 2017 review did not recommend the use of zinc for the common cold for various reasons; whereas a 2017 and 2018 review both recommended the use of zinc, but also advocated further research on the topic. While there are many alternative medicines and Chinese herbal medicines supposed to treat the common cold, there is insufficient scientific evidence to support their use.  As of 2015, there is weak evidence to support nasal irrigation with saline.  There is no firm evidence that Echinacea products or garlic provide any meaningful benefit in treating or preventing colds. Vitamin C supplementation does not affect the incidence of the common cold, but may reduce its duration.  There is no conclusive evidence that vitamin D supplementation is efficacious in the prevention or treatment of respiratory tract infections Common cold Common cold",
        "response": "You're welcome. Let me know if you have any other questions."
    },
    {
        "dialog": [
            "Hi Medi, I think I have a common cold",
            "Alright, what symptoms do you have?",
            "I have a runny nose, cough, headache, and feel tired",
            "Sorry to hear that. Do you have a fever too?",
            "No, I don't have a fever yet",
            "Okay, it sounds like you have a mild cold. Here is my advice.",
            "What should I do?",
            "Rest well, drink plenty of fluids, take over-the-counter medicine to relieve your symptoms",
            "Okay, thank you. Are there any natural remedies you recommend?"
        ],
        "knowledge": "Common cold Common cold  Some zinc remedies directly applied to the inside of the nose have led to the loss of the sense of smell.  A 2017 review did not recommend the use of zinc for the common cold for various reasons; whereas a 2017 and 2018 review both recommended the use of zinc, but also advocated further research on the topic. While there are many alternative medicines and Chinese herbal medicines supposed to treat the common cold, there is insufficient scientific evidence to support their use.  As of 2015, there is weak evidence to support nasal irrigation with saline.  There is no firm evidence that Echinacea products or garlic provide any meaningful benefit in treating or preventing colds. Vitamin C supplementation does not affect the incidence of the common cold, but may reduce its duration.  There is no conclusive evidence that vitamin D supplementation is efficacious in the prevention or treatment of respiratory tract infections Common cold Common cold",
        "response": "I suggest drinking warm tea with honey and lemon, and getting plenty of rest."
    },
    {
        "dialog": [
            "Hey Medi, I had a cold last week and now I can't smell anything",
            "That's a concerning symptom. Did you use any zinc remedies?",
            "Yes, I tried a zinc nasal spray",
            "Unfortunately, that may have caused your loss of smell. You should stop using it.",
            "Is there anything I can do to regain my sense of smell?",
            "It may take time, but avoiding irritants such as smoke or chemical fumes and waiting for your body to heal is the best course of action.",
            "Okay, thank you for your advice. Can I use anything else to relieve my cold symptoms?",
            "Yes, over-the-counter decongestants and pain relievers may help with your symptoms, but always read the labels carefully and follow the recommended dosages.",
            "Thank you, Medi. I appreciate your help."
        ],
        "knowledge": "Common cold Common cold  Some zinc remedies directly applied to the inside of the nose have led to the loss of the sense of smell.  A 2017 review did not recommend the use of zinc for the common cold for various reasons; whereas a 2017 and 2018 review both recommended the use of zinc, but also advocated further research on the topic. While there are many alternative medicines and Chinese herbal medicines supposed to treat the common cold, there is insufficient scientific evidence to support their use.  As of 2015, there is weak evidence to support nasal irrigation with saline.  There is no firm evidence that Echinacea products or garlic provide any meaningful benefit in treating or preventing colds. Vitamin C supplementation does not affect the incidence of the common cold, but may reduce its duration.  There is no conclusive evidence that vitamin D supplementation is efficacious in the prevention or treatment of respiratory tract infections Common cold Common cold",
        "response": "Be careful with any zinc remedies in the future, and always read the labels of any medication you take."
    },
    {
        "dialog": [
            "Hi Medi, I just recovered from a cold. What can I do to prevent getting another one?",
            "Good to hear that you're feeling better. Here are some tips.",
            "Please tell me more.",
            "Wash your hands regularly, avoid close contact with people who are sick, and keep your immune system strong with a healthy diet and exercise.",
            "Do vitamins help?",
            "While there is no conclusive evidence, vitamin C may help reduce the duration of a cold. It's still important to maintain a balanced diet with all necessary vitamins and minerals.",
            "What about herbal remedies?",
            "While some people believe in the benefits of herbal remedies, there is not enough scientific evidence to support their use for preventing colds.",
            "Thank you for your advice, Medi. I will keep these in mind."
        ],
        "knowledge": "Common cold Common cold  Some zinc remedies directly applied to the inside of the nose have led to the loss of the sense of smell.  A 2017 review did not recommend the use of zinc for the common cold for various reasons; whereas a 2017 and 2018 review both recommended the use of zinc, but also advocated further research on the topic. While there are many alternative medicines and Chinese herbal medicines supposed to treat the common cold, there is insufficient scientific evidence to support their use.  As of 2015, there is weak evidence to support nasal irrigation with saline.  There is no firm evidence that Echinacea products or garlic provide any meaningful benefit in treating or preventing colds. Vitamin C supplementation does not affect the incidence of the common cold, but may reduce its duration.  There is no conclusive evidence that vitamin D supplementation is efficacious in the prevention or treatment of respiratory tract infections Common cold Common cold",
        "response": "You're welcome. Let me know if you have any other questions or concerns about staying healthy."
    },
    {
        "dialog": [
            "Hi Medi, I have a terrible cold and a runny nose.",
            "Hello. Sorry to hear that. I can help you with that.",
            "Is there any remedy that can help me cure the common cold?",
            "There is no conclusive remedy for the common cold, but Vitamin C can help reduce the duration.",
            "What about nasal irrigation with saline, can it help?",
            "There is weak evidence to support nasal irrigation with saline. It may help alleviate symptoms.",
            "Is it safe to use zinc to treat the common cold?",
            "Zinc remedies applied directly to the inside of the nose have led to the loss of the sense of smell. It's not recommended for the common cold.",
            "Okay, thank you. How long will my cold last?"
        ],
        "knowledge": "Common cold Common cold  Some zinc remedies directly applied to the inside of the nose have led to the loss of the sense of smell.  A 2017 review did not recommend the use of zinc for the common cold for various reasons; whereas a 2017 and 2018 review both recommended the use of zinc, but also advocated further research on the topic. While there are many alternative medicines and Chinese herbal medicines supposed to treat the common cold, there is insufficient scientific evidence to support their use.  As of 2015, there is weak evidence to support nasal irrigation with saline.  There is no firm evidence that Echinacea products or garlic provide any meaningful benefit in treating or preventing colds. Vitamin C supplementation does not affect the incidence of the common cold, but may reduce its duration.  There is no conclusive evidence that vitamin D supplementation is efficacious in the prevention or treatment of respiratory tract infections Common cold Common cold",
        "response": "The common cold can last up to 7-10 days. Make sure to get enough rest and stay hydrated."
    },
    {
        "dialog": [
            "Hi Medi, I had a cold a few days ago. What can I do to prevent it from getting worse?",
            "Hello, you should take care of your diet and exercise regularly.",
            "What should I eat and what kind of exercise should I do?",
            "Eat a balanced diet with plenty of fruits and vegetables. Exercise for at least 30 minutes a day.",
            "What else can I do to prevent the spread of the common cold?",
            "Wash your hands regularly and avoid touching your face. Cover your mouth and nose when coughing or sneezing.",
            "Can I go outside when I have a cold?",
            "It's best to stay home and avoid contact with others to prevent the spread of the cold.",
            "Okay, thank you for your advice. Can I take any medication to speed up the recovery process?"
        ],
        "knowledge": "Common cold Common cold  Some zinc remedies directly applied to the inside of the nose have led to the loss of the sense of smell.  A 2017 review did not recommend the use of zinc for the common cold for various reasons; whereas a 2017 and 2018 review both recommended the use of zinc, but also advocated further research on the topic. While there are many alternative medicines and Chinese herbal medicines supposed to treat the common cold, there is insufficient scientific evidence to support their use.  As of 2015, there is weak evidence to support nasal irrigation with saline.  There is no firm evidence that Echinacea products or garlic provide any meaningful benefit in treating or preventing colds. Vitamin C supplementation does not affect the incidence of the common cold, but may reduce its duration.  There is no conclusive evidence that vitamin D supplementation is efficacious in the prevention or treatment of respiratory tract infections Common cold Common cold",
        "response": "There is no medication to cure the common cold, but you can take over-the-counter medication to alleviate the symptoms."
    },
    {
        "dialog": [
            "Hi Medi, I recently had a cold. What can I do to prevent it from reoccurring?",
            "Hello, maintaining a healthy lifestyle can prevent the reoccurrence of the common cold.",
            "What does a healthy lifestyle entail?",
            "A healthy lifestyle includes regular exercise, eating a balanced diet, and getting enough rest.",
            "What can I eat to boost my immune system and prevent the common cold?",
            "Foods that are rich in Vitamin C and zinc can boost the immune system. Examples include citrus fruits and nuts.",
            "Are there any other lifestyle changes I can make?",
            "Avoid smoking and limit alcohol consumption. Manage stress levels and maintain good hygiene.",
            "Thank you for your advice. Can you recommend any supplements to prevent the common cold?"
        ],
        "knowledge": "Common cold Common cold  Some zinc remedies directly applied to the inside of the nose have led to the loss of the sense of smell.  A 2017 review did not recommend the use of zinc for the common cold for various reasons; whereas a 2017 and 2018 review both recommended the use of zinc, but also advocated further research on the topic. While there are many alternative medicines and Chinese herbal medicines supposed to treat the common cold, there is insufficient scientific evidence to support their use.  As of 2015, there is weak evidence to support nasal irrigation with saline.  There is no firm evidence that Echinacea products or garlic provide any meaningful benefit in treating or preventing colds. Vitamin C supplementation does not affect the incidence of the common cold, but may reduce its duration.  There is no conclusive evidence that vitamin D supplementation is efficacious in the prevention or treatment of respiratory tract infections Common cold Common cold",
        "response": "There is no conclusive evidence that supplements can prevent the common cold. Maintaining a healthy lifestyle is the best way to prevent the common cold."
    },
    {
        "dialog": [
            "Hi Medi, I am having a runny nose and headache.",
            "Hello, sorry to hear that. How long have you been feeling like this?",
            "It's been a couple of days now. I also feel tired and have a sore throat.",
            "Based on your symptoms, it seems like you have the common cold. Get plenty of rest and drink lots of fluids.",
            "Are there any remedies that could help?",
            "There is weak evidence to support nasal irrigation with saline. However, there is no conclusive evidence to support alternative medicines.",
            "Got it, thanks. What should I do if it doesn't get better?",
            "If your symptoms persist or worsen, please consult a doctor.",
            "Okay, thank you."
        ],
        "knowledge": "Common cold Common cold Some zinc remedies directly applied to the inside of the nose have led to the loss of the sense of smell. A 2017 review did not recommend the use of zinc for the common cold for various reasons; whereas a 2017 and 2018 review both recommended the use of zinc, but also advocated further research on the topic. While there are many alternative medicines and Chinese herbal medicines supposed to treat the common cold, there is insufficient scientific evidence to support their use. As of 2015, there is weak evidence to support nasal irrigation with saline. There is no firm evidence that Echinacea products or garlic provide any meaningful benefit in treating or preventing colds. Vitamin C supplementation does not affect the incidence of the common cold, but may reduce its duration. There is no conclusive evidence that vitamin D supplementation is efficacious in the prevention or treatment of respiratory tract infections Common cold Common cold",
        "response": "You're welcome. I hope you feel better soon!"
    },
    {
        "dialog": [
            "Hey Medi, I just recovered from a cold. What should I do now?",
            "Great to hear that! It's important to continue to rest and take care of yourself.",
            "I want to make sure I don't get sick again. What can I do to prevent that?",
            "Wash your hands frequently, avoid close contact with people who are sick and try to avoid touching your face. A flu vaccine can also be beneficial.",
            "What about my diet?",
            "Eating a balanced diet with plenty of fruits and vegetables can help maintain your immune system.",
            "Got it. Should I exercise?",
            "Physical activity can help boost your immune system, but it's important not to overdo it when you're recovering from an illness.",
            "That makes sense. Thanks, Medi."
        ],
        "knowledge": "Influenza Influenza The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion. These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose. Coughing is the most common symptom. Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children. The standard influenza symptoms typically last for 2 - 8 days. A 2021 study suggests influenza can cause long-lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "You're welcome. Stay healthy!"
    },
    {
        "dialog": [
            "Hi Medi, I just had surgery and I'm not sure what I should be doing to take care of myself.",
            "I'm here to help. What kind of surgery did you have?",
            "I had my tonsils removed.",
            "You should rest as much as possible and drink plenty of fluids. Avoid solid foods for a few days and eat soft, easy-to-swallow foods like soups and mashed potatoes.",
            "Should I take any medication?",
            "You may be prescribed pain medication or antibiotics. Make sure to take them as directed by your doctor.",
            "Okay, what about physical activity?",
            "Avoid any strenuous activity or exercise for at least two weeks.",
            "Got it, is there anything else I should be aware of?"
        ],
        "knowledge": "Tonsillectomy Tonsillectomy A tonsillectomy is a surgical procedure to remove the tonsils from the back of the throat. The procedure is usually performed to treat recurrent episodes of tonsillitis or for sleep-disordered breathing. After the procedure, the patient may experience a sore throat or earache, and it is important to rest and drink plenty of fluids. Avoid solid foods for a few days and eat soft, easy-to-swallow foods like soups and mashed potatoes. Pain medication may be prescribed, and antibiotics may be necessary in some cases. Avoid any strenuous activity or exercise for at least two weeks. Be aware of any bleeding or fever and call your doctor immediately if you experience either Tonsillectomy Tonsillectomy",
        "response": "You're welcome. Wishing you a speedy recovery!"
    },
    {
        "dialog": [
            "Hi Medi, I have a terrible cold and runny nose",
            "I am here to help. How long have you been experiencing these symptoms?",
            "It started yesterday and it's getting worse",
            "Based on your symptoms, it seems like you have a common cold",
            "What can I do to feel better?",
            "Drink lots of fluids, get plenty of rest and avoid smoking",
            "Are there any over-the-counter medicines I can take?",
            "There are some cold medicines that can relieve your symptoms",
            "Which medicines do you recommend and are there any side effects?"
        ],
        "knowledge": "Common cold Common cold Some zinc remedies directly applied to the inside of the nose have led to the loss of the sense of smell. A 2017 review did not recommend the use of zinc for the common cold for various reasons; whereas a 2017 and 2018 review both recommended the use of zinc, but also advocated further research on the topic. While there are many alternative medicines and Chinese herbal medicines supposed to treat the common cold, there is insufficient scientific evidence to support their use. As of 2015, there is weak evidence to support nasal irrigation with saline. There is no firm evidence that Echinacea products or garlic provide any meaningful benefit in treating or preventing colds. Vitamin C supplementation does not affect the incidence of the common cold, but may reduce its duration. There is no conclusive evidence that vitamin D supplementation is efficacious in the prevention or treatment of respiratory tract infections Common cold Common cold",
        "response": "Some over-the-counter medicines that can relieve your symptoms are pain relievers, decongestants and cough suppressants. However, be aware of their side effects and consult with your doctor."
    },
    {
        "dialog": [
            "Hi Medi, Can you tell me what is Echinacea and how it can help me with my cold?",
            "Echinacea is an herb that is used to boost the immune system and help fight infections",
            "Is there scientific evidence that it works?",
            "The scientific evidence for Echinacea is weak and inconclusive",
            "What about Vitamin C, does it help with colds?",
            "Vitamin C does not prevent colds but it may reduce the duration and severity of colds",
            "Can I take too much Vitamin C?",
            "Taking too much Vitamin C can cause diarrhea and stomach cramps, so be careful about the dosage.",
            "Thank you for your help. One last question, how do I know when it's time to see a doctor?"
        ],
        "knowledge": "Common cold Common cold Some zinc remedies directly applied to the inside of the nose have led to the loss of the sense of smell. A 2017 review did not recommend the use of zinc for the common cold for various reasons; whereas a 2017 and 2018 review both recommended the use of zinc, but also advocated further research on the topic. While there are many alternative medicines and Chinese herbal medicines supposed to treat the common cold, there is insufficient scientific evidence to support their use. As of 2015, there is weak evidence to support nasal irrigation with saline. There is no firm evidence that Echinacea products or garlic provide any meaningful benefit in treating or preventing colds. Vitamin C supplementation does not affect the incidence of the common cold, but may reduce its duration. There is no conclusive evidence that vitamin D supplementation is efficacious in the prevention or treatment of respiratory tract infections Common cold Common cold",
        "response": "If your symptoms last more than 10 days or if you have a fever above 100.4 F, you should seek medical attention."
    },
    {
        "dialog": [
            "Hi Medi, I just had a cold and I am recovering. What can I do to prevent getting another cold?",
            "Good to hear you're recovering. One way is to avoid close contact with sick people",
            "What else can I do to prevent a cold?",
            "Wash your hands frequently, cover your mouth and nose when you cough or sneeze, and avoid touching your face",
            "Can I boost my immune system to prevent getting a cold?",
            "A healthy lifestyle that includes regular exercise, a balanced diet, and adequate sleep can boost your immune system.",
            "Thank you, Medi. Can I take any supplements to prevent colds?",
            "There is no conclusive evidence that supplements can prevent colds. However, some people take Vitamin C and Zinc to boost their immune system.",
            "Got it, Medi. Thank you for your advice."
        ],
        "knowledge": "Common cold Common cold Some zinc remedies directly applied to the inside of the nose have led to the loss of the sense of smell. A 2017 review did not recommend the use of zinc for the common cold for various reasons; whereas a 2017 and 2018 review both recommended the use of zinc, but also advocated further research on the topic. While there are many alternative medicines and Chinese herbal medicines supposed to treat the common cold, there is insufficient scientific evidence to support their use. As of 2015, there is weak evidence to support nasal irrigation with saline. There is no firm evidence that Echinacea products or garlic provide any meaningful benefit in treating or preventing colds. Vitamin C supplementation does not affect the incidence of the common cold, but may reduce its duration. There is no conclusive evidence that vitamin D supplementation is efficacious in the prevention or treatment of respiratory tract infections Common cold Common cold",
        "response": "You're welcome. Stay healthy and take care of yourself."
    }
]