[
    {
        "dialog": [
            "Hello, Medi. I have some symptoms of diabetes.",
            "Sure, I can help. Can you tell me about the symptoms?",
            "I feel thirsty all the time, and I need to pee often.",
            "You may have high blood sugar, and it's a symptom of diabetes.",
            "What should I do next?",
            "You should visit your doctor ASAP for further advice and testing.",
            "What are the treatments for diabetes?",
            "It depends on the type and severity, but lifestyle changes and medication can help.",
            "I see. Thanks for your help, Medi."
        ],
        "knowledge": "Diabetes Diabetes  When insulin is used in type 2 diabetes, a long-acting formulation is usually added initially, while continuing oral medications. Some severe cases of type 2 diabetes may also be treated with insulin, which is increased gradually until glucose targets are reached. Cardiovascular disease is a serious complication associated with diabetes, and many international guidelines recommend blood pressure treatment targets that are lower than 140/90 mmHg for people with diabetes.  However, there is only limited evidence regarding what the lower targets should be.  A 2016 systematic review found potential harm to treating to targets lower than 140 mmHg, and a subsequent systematic review in 2019 found no evidence of additional benefit from blood pressure lowering to between 130 – 140mmHg, although there was an increased risk of adverse events. 2015 American Diabetes Association recommendations are that people with diabetes and albuminuria should receive an inhibitor of the renin-angiotensin system to reduce the risks of progression to end-stage renal disease, cardiovascular events, and death.  There is some evidence that angiotensin converting enzyme inhibitors  are superior to other inhibitors of the renin-angiotensin system such as angiotensin receptor blockers , or aliskiren in preventing cardiovascular disease Diabetes Diabetes",
        "response": "You are welcome. Don't forget to visit your doctor to get diagnosed and treated properly."
    },
    {
        "dialog": [
            "Medi, I have some questions about diabetes.",
            "Sure, what do you want to know?",
            "What are the risk factors for diabetes?",
            "The risk factors include obesity, a sedentary lifestyle, genetics, and some medical conditions.",
            "Can diabetes be prevented?",
            "Yes, it can be prevented by maintaining a healthy lifestyle and weight.",
            "Is type 1 diabetes the same as type 2 diabetes?",
            "No, they are different in terms of causes and treatments.",
            "Thanks, Medi. That's all I wanted to know."
        ],
        "knowledge": "Diabetes Diabetes  When insulin is used in type 2 diabetes, a long-acting formulation is usually added initially, while continuing oral medications. Some severe cases of type 2 diabetes may also be treated with insulin, which is increased gradually until glucose targets are reached. Cardiovascular disease is a serious complication associated with diabetes, and many international guidelines recommend blood pressure treatment targets that are lower than 140/90 mmHg for people with diabetes.  However, there is only limited evidence regarding what the lower targets should be.  A 2016 systematic review found potential harm to treating to targets lower than 140 mmHg, and a subsequent systematic review in 2019 found no evidence of additional benefit from blood pressure lowering to between 130 – 140mmHg, although there was an increased risk of adverse events. 2015 American Diabetes Association recommendations are that people with diabetes and albuminuria should receive an inhibitor of the renin-angiotensin system to reduce the risks of progression to end-stage renal disease, cardiovascular events, and death.  There is some evidence that angiotensin converting enzyme inhibitors  are superior to other inhibitors of the renin-angiotensin system such as angiotensin receptor blockers , or aliskiren in preventing cardiovascular disease Diabetes Diabetes",
        "response": "You are welcome. Happy to help you with your questions about diabetes."
    },
    {
        "dialog": [
            "Medi, I recently had a medical procedure. What should I do now?",
            "First, congratulations on completing the procedure. Can you tell me more about it?",
            "It was a surgery for my obesity.",
            "In that case, you need to make some lifestyle changes and follow the doctor's advice on diet and exercise.",
            "Are there any foods that I should avoid?",
            "You should avoid sugary and high-calorie foods, processed foods, and fast food.",
            "What kind of physical activity should I do?",
            "You should start with low-impact exercises like walking, cycling, or swimming and gradually increase the intensity and duration.",
            "Thanks for your advice, Medi."
        ],
        "knowledge": "Obesity Obesity Obesity is a complex public health and policy problem because of its prevalence, costs, and health effects.  As such, managing it requires changes in the wider societal context and effort by communities, local authorities, and governments.  Public health efforts seek to understand and correct the environmental factors responsible for the increasing prevalence of obesity in the population.  Solutions look at changing the factors that cause excess food energy consumption and inhibit physical activity.  Efforts include federally reimbursed meal programs in schools, limiting direct junk food marketing to children, and decreasing access to sugar-sweetened beverages in schools.  The World Health Organization recommends the taxing of sugary drinks.  When constructing urban environments, efforts have been made to increase access to parks and to develop pedestrian routes Obesity Obesity",
        "response": "You are welcome. I hope my advice will help you recover and lead a healthier life."
    },
    {
        "dialog": [
            "Hello Medi, I have been diagnosed with type 2 diabetes.",
            "I'm here to support you. What questions do you have?",
            "What should I do if my blood sugar is too high?",
            "You should drink plenty of water, exercise, and take your medication as prescribed.",
            "What is the best exercise for diabetes patients?",
            "Walking, cycling or swimming are good options for low-impact exercise.",
            "Is it okay to eat sugary foods sometimes?",
            "It's best to avoid sugary foods as much as possible to keep your blood sugar under control.",
            "Can I still drink alcohol?"
        ],
        "knowledge": "Diabetes Diabetes  When insulin is used in type 2 diabetes, a long-acting formulation is usually added initially, while continuing oral medications. Some severe cases of type 2 diabetes may also be treated with insulin, which is increased gradually until glucose targets are reached. Cardiovascular disease is a serious complication associated with diabetes, and many international guidelines recommend blood pressure treatment targets that are lower than 140/90 mmHg for people with diabetes.  However, there is only limited evidence regarding what the lower targets should be.  A 2016 systematic review found potential harm to treating to targets lower than 140 mmHg, and a subsequent systematic review in 2019 found no evidence of additional benefit from blood pressure lowering to between 130 – 140mmHg, although there was an increased risk of adverse events. 2015 American Diabetes Association recommendations are that people with diabetes and albuminuria should receive an inhibitor of the renin-angiotensin system to reduce the risks of progression to end-stage renal disease, cardiovascular events, and death.  There is some evidence that angiotensin converting enzyme inhibitors  are superior to other inhibitors of the renin-angiotensin system such as angiotensin receptor blockers , or aliskiren in preventing cardiovascular disease Diabetes Diabetes",
        "response": "Alcohol can cause blood sugar spikes and increase your risk of other health problems. It's best to avoid or limit alcohol consumption."
    },
    {
        "dialog": [
            "Hi Medi, I have a few questions about high blood pressure.",
            "Sure. What would you like to know?",
            "What are the causes of high blood pressure?",
            "Some of the causes of high blood pressure include genetics, obesity, and a sedentary lifestyle.",
            "What lifestyle changes can I make to lower my blood pressure?",
            "You should aim to maintain a healthy weight, exercise regularly, and reduce your salt intake.",
            "Are there any medications that can help with high blood pressure?",
            "Yes, there are several medications available, including diuretics, angiotensin-converting enzyme inhibitors, and beta-blockers.",
            "Can high blood pressure be cured?"
        ],
        "knowledge": "High Blood Pressure High Blood Pressure  High blood pressure is a common condition in which the long-term force of the blood against your artery walls is high enough that it may eventually cause health problems, such as heart disease.  Blood pressure is determined by the amount of blood your heart pumps and the amount of resistance to blood flow in your arteries.  The more blood your heart pumps and the narrower your arteries, the higher your blood pressure.  High blood pressure typically develops over many years and affects nearly everyone eventually.  Fortunately, high blood pressure can be easily detected and managed with treatment in order to reduce the risk of heart disease and other complications. High Blood Pressure High Blood Pressure",
        "response": "There is no cure for high blood pressure, but it can be managed with lifestyle changes and medication."
    },
    {
        "dialog": [
            "Hello Medi, I recently had a medical procedure for my knee.",
            "I'm here to help. What advice can I give you?",
            "What type of exercises can I do to help my recovery?",
            "You can do low-impact exercises like walking or swimming and physical therapy exercises prescribed by your doctor.",
            "Can I still do my normal daily activities?",
            "You should avoid putting too much strain on your knee, but otherwise, you can continue with your normal activities.",
            "What should I eat to help with my recovery?",
            "You should eat a well-balanced diet with plenty of protein, vitamins, and minerals to help your body heal.",
            "How long will it take for me to recover fully?"
        ],
        "knowledge": "Knee Surgery Knee Surgery  Knee surgery is a common medical procedure used to treat a variety of knee-related injuries and conditions.  Recovery time varies depending on the type of surgery and the individual patient's healing process.  After surgery, patients may need to use crutches or a knee brace for a period of time and attend physical therapy to regain strength and mobility in the affected knee.  It's important to follow your doctor's instructions for post-surgery care and take any prescribed medications as directed. Knee Surgery Knee Surgery",
        "response": "Recovery time varies depending on the type of surgery and the individual patient's healing process. Your doctor can give you a better idea of how long your recovery will take."
    },
    {
        "dialog": [
            "Hi there, Medi. I have been diagnosed with type 2 diabetes. What should I do?",
            "Hi, I'm here to help. Have you been taking insulin?",
            "No, I haven't yet. What do you suggest?",
            "In severe cases, insulin is used, but it's always good to start with lifestyle changes.",
            "Okay, What about blood pressure? What's the target for someone with diabetes?",
            "The target for blood pressure is usually lower than 140/90 mmHg for diabetics.",
            "Is it safe to go below 140/90 mmHg?",
            "There is limited evidence for lower targets; it's better to consult your doctor first.",
            "Thanks, Medi. What about renin-angiotensin-system inhibitors for people with diabetes and albuminuria?"
        ],
        "knowledge": "Diabetes Diabetes  When insulin is used in type 2 diabetes, a long-acting formulation is usually added initially, while continuing oral medications. Some severe cases of type 2 diabetes may also be treated with insulin, which is increased gradually until glucose targets are reached. Cardiovascular disease is a serious complication associated with diabetes, and many international guidelines recommend blood pressure treatment targets that are lower than 140/90 mmHg for people with diabetes.  However, there is only limited evidence regarding what the lower targets should be.  A 2016 systematic review found potential harm to treating to targets lower than 140 mmHg, and a subsequent systematic review in 2019 found no evidence of additional benefit from blood pressure lowering to between 130 – 140mmHg, although there was an increased risk of adverse events. 2015 American Diabetes Association recommendations are that people with diabetes and albuminuria should receive an inhibitor of the renin-angiotensin system to reduce the risks of progression to end-stage renal disease, cardiovascular events, and death.  There is some evidence that angiotensin converting enzyme inhibitors  are superior to other inhibitors of the renin-angiotensin system such as angiotensin receptor blockers , or aliskiren in preventing cardiovascular disease Diabetes Diabetes",
        "response": "People with diabetes and albuminuria should receive an inhibitor of the renin-angiotensin system according to 2015 American Diabetes Association recommendations."
    },
    {
        "dialog": [
            "Hi, Medi. Can you tell me more about type 2 diabetes?",
            "Of course. Type 2 diabetes is the most common type of diabetes mellitus accounting for 95% of diabetes.",
            "What causes it?",
            "Lifestyle factors and genetics are the main causes of type 2 diabetes.",
            "Can it be cured?",
            "It can't be cured, but it can be managed. Lifestyle changes and medications can help.",
            "What types of medications are there?",
            "There are oral medications and insulin. The type of medication depends on the severity of the condition.",
            "I see. Is there anything else I should know about type 2 diabetes?"
        ],
        "knowledge": "Diabetes Diabetes  The defective responsiveness of body tissues to insulin is believed to involve the insulin receptor.  However, the specific defects are not known.  Diabetes mellitus cases due to a known defect are classified separately.  Type 2 diabetes is the most common type of diabetes mellitus accounting for 95% of diabetes.  Many people with type 2 diabetes have evidence of prediabetes  before meeting the criteria for type 2 diabetes.  The progression of prediabetes to overt type 2 diabetes can be slowed or reversed by lifestyle changes or medications that improve insulin sensitivity or reduce the liver's glucose production. Type 2 diabetes is primarily due to lifestyle factors and genetics Diabetes Diabetes",
        "response": "No, that's all. If you have any more questions, feel free to ask."
    },
    {
        "dialog": [
            "Hi, Medi. I just had a medical procedure. What should I do now?",
            "Hi, I'm here to help. After a procedure, it's important to have a good diet and exercise.",
            "What type of diet should I have?",
            "You should have a balanced diet with more vitamins and vegetables and less sugar.",
            "What type of exercise should I do?",
            "You should do some moderate exercise, such as walking or swimming.",
            "How long should I exercise?",
            "You should aim for at least 30 minutes of exercise per day.",
            "Is there anything else I should know?"
        ],
        "knowledge": "Diabetes Diabetes  When insulin is used in type 2 diabetes, a long-acting formulation is usually added initially, while continuing oral medications. Some severe cases of type 2 diabetes may also be treated with insulin, which is increased gradually until glucose targets are reached. Cardiovascular disease is a serious complication associated with diabetes, and many international guidelines recommend blood pressure treatment targets that are lower than 140/90 mmHg for people with diabetes.  However, there is only limited evidence regarding what the lower targets should be.  A 2016 systematic review found potential harm to treating to targets lower than 140 mmHg, and a subsequent systematic review in 2019 found no evidence of additional benefit from blood pressure lowering to between 130 – 140mmHg, although there was an increased risk of adverse events. 2015 American Diabetes Association recommendations are that people with diabetes and albuminuria should receive an inhibitor of the renin-angiotensin system to reduce the risks of progression to end-stage renal disease, cardiovascular events, and death.  There is some evidence that angiotensin converting enzyme inhibitors  are superior to other inhibitors of the renin-angiotensin system such as angiotensin receptor blockers , or aliskiren in preventing cardiovascular disease Diabetes Diabetes",
        "response": "No, that's all. If you have any more questions, feel free to ask."
    },
    {
        "dialog": [
            "Hello Medi, I'm worried about high blood pressure",
            "Sure, what specifically concerns you about high blood pressure?",
            "I'm not sure what to do about it. Any suggestions?",
            "To manage high blood pressure, it's important to make lifestyle changes such as reducing salt intake and increasing physical activity.",
            "Is there any medication you recommend for high blood pressure?",
            "Yes, there are many types of medication available for high blood pressure. However, you should consult with your doctor first before taking any medication.",
            "Thank you, Medi. Is there anything else I can do to help lower my blood pressure?",
            "Stress management techniques such as yoga and meditation can also help to lower blood pressure.",
            "Great, thank you for your help Medi. Goodbye."
        ],
        "knowledge": "High Blood Pressure- High blood pressure is a common condition that can increase your risk of heart disease, stroke, and other serious health conditions.  Lifestyle changes such as reducing salt intake and increasing physical activity can help manage high blood pressure.  There are many types of medication available for high blood pressure, but you should consult with your doctor before taking any medication.  Stress management techniques such as yoga and meditation can also help to lower blood pressure. High Blood Pressure-",
        "response": "You're welcome. Take care of yourself."
    },
    {
        "dialog": [
            "Hello Medi, I want to know about diabetes symptoms and diagnosis.",
            "Sure, what specifically would you like to know about?",
            "What are the symptoms of diabetes that I should be aware of?",
            "Frequent urination, excessive thirst, and hunger are common symptoms of diabetes. Blurred vision, fatigue, and tingling in the hands or feet are also symptoms.",
            "How is diabetes diagnosed?",
            "A blood test can determine if you have diabetes. Your doctor may also ask you to take a urine test to check for ketones, which are produced when your body burns fat for energy instead of glucose.",
            "Thank you, Medi. Is there anything else I should be aware of?",
            "It's important to monitor your blood sugar levels regularly and make lifestyle changes such as increasing physical activity and maintaining a healthy diet.",
            "Great, thank you for your help. Goodbye."
        ],
        "knowledge": "Diabetes Diabetes  Frequent urination, excessive thirst, and hunger are common symptoms of diabetes. Blurred vision, fatigue, and tingling in the hands or feet are also symptoms.  A blood test can determine if you have diabetes. Your doctor may also ask you to take a urine test to check for ketones, which are produced when your body burns fat for energy instead of glucose.  It's important to monitor your blood sugar levels regularly and make lifestyle changes such as increasing physical activity and maintaining a healthy diet. Diabetes Diabetes",
        "response": "You're welcome. Stay healthy!"
    },
    {
        "dialog": [
            "Hello Medi, I recently got diagnosed with type 2 diabetes. What should I do?",
            "I'm sorry to hear that. Let's talk about how you can manage your diabetes.",
            "What are some lifestyle changes I can make to help manage my diabetes?",
            "Lifestyle changes such as maintaining a healthy diet, getting regular physical activity, and monitoring your blood sugar levels regularly are important for managing type 2 diabetes.",
            "Are there any specific foods I should avoid or eat more of?",
            "You should avoid foods high in sugar and carbohydrates and instead eat more foods that are high in fiber and protein, such as vegetables, fruits, and lean meats.",
            "Thank you, Medi. Is there anything else I can do to help manage my diabetes?",
            "Yes, taking medication as prescribed by your doctor and attending regular check-ups are also important for managing type 2 diabetes.",
            "Okay, thanks for your help Medi. Goodbye."
        ],
        "knowledge": "Type 2 Diabetes- Lifestyle changes such as maintaining a healthy diet, getting regular physical activity, and monitoring your blood sugar levels regularly are important for managing type 2 diabetes. You should avoid foods high in sugar and carbohydrates and instead eat more foods that are high in fiber and protein, such as vegetables, fruits, and lean meats. Taking medication as prescribed by your doctor and attending regular check-ups are also important for managing type 2 diabetes. Type 2 Diabetes-",
        "response": "You're welcome. Take care!"
    },
    {
        "dialog": [
            "Hi Medi, I have type 2 diabetes. What should I do?",
            "Hello, let's talk about what you can do to manage your diabetes.",
            "Can I take insulin as a medication?",
            "Yes, insulin is an effective medication for diabetes, but your doctor will advise you on the best course of action.",
            "What about my blood pressure? Do I need to monitor it?",
            "Yes, high blood pressure is a serious complication of diabetes, and it's essential to keep it under control. The recommended targets are below 140/90 mmHg.",
            "Are there any other things I should do to manage my diabetes?",
            "Yes, you should also make some lifestyle changes such as regular exercise, healthy eating, and weight management.",
            "Thanks, Medi. Can you tell me more about the lifestyle changes?"
        ],
        "knowledge": "Diabetes Diabetes  When insulin is used in type 2 diabetes, a long-acting formulation is usually added initially, while continuing oral medications. Some severe cases of type 2 diabetes may also be treated with insulin, which is increased gradually until glucose targets are reached. Cardiovascular disease is a serious complication associated with diabetes, and many international guidelines recommend blood pressure treatment targets that are lower than 140/90 mmHg for people with diabetes.  However, there is only limited evidence regarding what the lower targets should be.  A 2016 systematic review found potential harm to treating to targets lower than 140 mmHg, and a subsequent systematic review in 2019 found no evidence of additional benefit from blood pressure lowering to between 130 – 140mmHg, although there was an increased risk of adverse events. 2015 American Diabetes Association recommendations are that people with diabetes and albuminuria should receive an inhibitor of the renin-angiotensin system to reduce the risks of progression to end-stage renal disease, cardiovascular events, and death.  There is some evidence that angiotensin converting enzyme inhibitors  are superior to other inhibitors of the renin-angiotensin system such as angiotensin receptor blockers , or aliskiren in preventing cardiovascular disease Diabetes Diabetes",
        "response": "Sure, you can start by exercising regularly, eating healthy meals, and managing your weight."
    },
    {
        "dialog": [
            "Hi Medi, can you help me understand more about diabetes type 2?",
            "Hello, sure. What would you like to know?",
            "What causes diabetes type 2?",
            "There are many factors, but the primary cause is when the body becomes resistant to insulin or doesn't produce enough insulin to regulate blood sugar levels.",
            "Are there any symptoms that I should watch out for?",
            "Yes, some common symptoms include fatigue, increased thirst and hunger, frequent urination, and blurred vision.",
            "Can diabetes type 2 be prevented?",
            "Yes, you can lower your risk of developing diabetes type 2 by maintaining a healthy weight, exercising regularly, and avoiding sugary foods and drinks.",
            "Thanks, Medi. What should I do if I think I might have diabetes type 2?"
        ],
        "knowledge": "Diabetes Diabetes  The defective responsiveness of body tissues to insulin is believed to involve the insulin receptor.  However, the specific defects are not known.  Diabetes mellitus cases due to a known defect are classified separately.  Type 2 diabetes is the most common type of diabetes mellitus accounting for 95% of diabetes.  Many people with type 2 diabetes have evidence of prediabetes  before meeting the criteria for type 2 diabetes.  The progression of prediabetes to overt type 2 diabetes can be slowed or reversed by lifestyle changes or medications that improve insulin sensitivity or reduce the liver's glucose production. Type 2 diabetes is primarily due to lifestyle factors and genetics Diabetes Diabetes",
        "response": "If you are experiencing any symptoms of diabetes type 2, you should talk to your doctor for a proper diagnosis and treatment options."
    },
    {
        "dialog": [
            "Hi Medi, I recently had a medical procedure for my diabetes. What can I do to recover?",
            "Hello, after a medical procedure, it's essential to follow your doctor's instructions carefully.",
            "What kind of lifestyle changes should I make?",
            "You should focus on healthy eating, regular exercise, and proper medication management.",
            "Are there any specific foods that I should eat or avoid?",
            "You should focus on high-fiber, low-fat foods, and avoid processed foods, sugary drinks, and alcohol.",
            "How much exercise should I do?",
            "It's recommended to get at least 150 minutes of moderate exercise per week, but your doctor may advise you on what's best for you.",
            "Thanks, Medi. Are there any other things that I should be aware of?"
        ],
        "knowledge": "Diabetes Diabetes  When insulin is used in type 2 diabetes, a long-acting formulation is usually added initially, while continuing oral medications. Some severe cases of type 2 diabetes may also be treated with insulin, which is increased gradually until glucose targets are reached. Cardiovascular disease is a serious complication associated with diabetes, and many international guidelines recommend blood pressure treatment targets that are lower than 140/90 mmHg for people with diabetes.  However, there is only limited evidence regarding what the lower targets should be.  A 2016 systematic review found potential harm to treating to targets lower than 140 mmHg, and a subsequent systematic review in 2019 found no evidence of additional benefit from blood pressure lowering to between 130 – 140mmHg, although there was an increased risk of adverse events. 2015 American Diabetes Association recommendations are that people with diabetes and albuminuria should receive an inhibitor of the renin-angiotensin system to reduce the risks of progression to end-stage renal disease, cardiovascular events, and death.  There is some evidence that angiotensin converting enzyme inhibitors  are superior to other inhibitors of the renin-angiotensin system such as angiotensin receptor blockers , or aliskiren in preventing cardiovascular disease Diabetes Diabetes",
        "response": "Make sure to keep track of your blood sugar levels, take your medication as prescribed, and follow up with your doctor regularly to monitor your progress."
    },
    {
        "dialog": [
            "Hi, Medi. I have type 2 diabetes. What should I do now?",
            "Hi. Don't worry. You need to control your blood sugar level. I can help you.",
            "How can I control it? Please give me some advice.",
            "You should maintain a healthy diet, regular physical activity, weight management, and take medicine if your doctor prescribes.",
            "Is there anything that I should avoid in my diet?",
            "Yes, you should avoid sugary foods and drinks, saturated fats, and processed foods.",
            "All right. I got it. Can you tell me more about physical exercises?",
            "You should do at least 30 minutes of moderate-intensity aerobic exercise, such as brisk walking, every day.",
            "Thank you for your advice, Medi. What are some of the medicines that I can take?"
        ],
        "knowledge": "Diabetes Diabetes  When insulin is used in type 2 diabetes, a long-acting formulation is usually added initially, while continuing oral medications. Some severe cases of type 2 diabetes may also be treated with insulin, which is increased gradually until glucose targets are reached. Cardiovascular disease is a serious complication associated with diabetes, and many international guidelines recommend blood pressure treatment targets that are lower than 140/90 mmHg for people with diabetes.  However, there is only limited evidence regarding what the lower targets should be.  A 2016 systematic review found potential harm to treating to targets lower than 140 mmHg, and a subsequent systematic review in 2019 found no evidence of additional benefit from blood pressure lowering to between 130 – 140mmHg, although there was an increased risk of adverse events. 2015 American Diabetes Association recommendations are that people with diabetes and albuminuria should receive an inhibitor of the renin-angiotensin system to reduce the risks of progression to end-stage renal disease, cardiovascular events, and death.  There is some evidence that angiotensin converting enzyme inhibitors  are superior to other inhibitors of the renin-angiotensin system such as angiotensin receptor blockers , or aliskiren in preventing cardiovascular disease Diabetes Diabetes",
        "response": "It depends on your condition and doctor's prescription, but some medicines include metformin, sulfonylureas, meglitinides, and DPP-4 inhibitors."
    },
    {
        "dialog": [
            "Hello, Medi. What is cardiovascular disease and how is it associated with diabetes?",
            "Hi, cardiovascular disease is a condition that affects the heart and blood vessels.",
            "Is it common in people with diabetes?",
            "Yes, people with diabetes have a higher risk of developing cardiovascular disease than people without diabetes.",
            "What can I do to reduce my risk of developing cardiovascular disease?",
            "You should control your blood sugar level, blood pressure, and cholesterol level. Also, maintain a healthy lifestyle.",
            "What is the recommended blood pressure level for people with diabetes?",
            "Many international guidelines recommend blood pressure treatment targets that are lower than 140/90 mmHg for people with diabetes.",
            "What else should I know about cardiovascular disease and diabetes?"
        ],
        "knowledge": "Diabetes Diabetes  When insulin is used in type 2 diabetes, a long-acting formulation is usually added initially, while continuing oral medications. Some severe cases of type 2 diabetes may also be treated with insulin, which is increased gradually until glucose targets are reached. Cardiovascular disease is a serious complication associated with diabetes, and many international guidelines recommend blood pressure treatment targets that are lower than 140/90 mmHg for people with diabetes.  However, there is only limited evidence regarding what the lower targets should be.  A 2016 systematic review found potential harm to treating to targets lower than 140 mmHg, and a subsequent systematic review in 2019 found no evidence of additional benefit from blood pressure lowering to between 130 – 140mmHg, although there was an increased risk of adverse events. 2015 American Diabetes Association recommendations are that people with diabetes and albuminuria should receive an inhibitor of the renin-angiotensin system to reduce the risks of progression to end-stage renal disease, cardiovascular events, and death.  There is some evidence that angiotensin converting enzyme inhibitors  are superior to other inhibitors of the renin-angiotensin system such as angiotensin receptor blockers , or aliskiren in preventing cardiovascular disease Diabetes Diabetes",
        "response": "You should also be aware that cardiovascular disease is a serious complication associated with diabetes, and there is some evidence that angiotensin converting enzyme inhibitors are superior to other inhibitors of the renin-angiotensin system such as angiotensin receptor blockers, or aliskiren in preventing cardiovascular disease."
    },
    {
        "dialog": [
            "Hello, Medi. I had a medical procedure recently. What should I do now?",
            "Hi, after a medical procedure, you should follow the advice of your doctor.",
            "What are some things I should keep in mind about my lifestyle?",
            "You should avoid smoking, reduce alcohol intake, maintain a healthy diet, and participate in regular physical activity if your doctor permits.",
            "Are there any specific foods I should eat or avoid?",
            "You should focus on foods that are high in vitamins and minerals, such as fruits and vegetables. You should avoid foods that are high in fat, sugar, and salt.",
            "Can you tell me more about physical activity?",
            "You should start with light physical activity, such as walking, and gradually increase the intensity and duration of the activity as your doctor permits.",
            "What else should I keep in mind after my medical procedure?"
        ],
        "knowledge": "Diabetes Diabetes  When insulin is used in type 2 diabetes, a long-acting formulation is usually added initially, while continuing oral medications. Some severe cases of type 2 diabetes may also be treated with insulin, which is increased gradually until glucose targets are reached. Cardiovascular disease is a serious complication associated with diabetes, and many international guidelines recommend blood pressure treatment targets that are lower than 140/90 mmHg for people with diabetes.  However, there is only limited evidence regarding what the lower targets should be.  A 2016 systematic review found potential harm to treating to targets lower than 140 mmHg, and a subsequent systematic review in 2019 found no evidence of additional benefit from blood pressure lowering to between 130 – 140mmHg, although there was an increased risk of adverse events. 2015 American Diabetes Association recommendations are that people with diabetes and albuminuria should receive an inhibitor of the renin-angiotensin system to reduce the risks of progression to end-stage renal disease, cardiovascular events, and death.  There is some evidence that angiotensin converting enzyme inhibitors  are superior to other inhibitors of the renin-angiotensin system such as angiotensin receptor blockers , or aliskiren in preventing cardiovascular disease Diabetes Diabetes",
        "response": "You should also make sure to follow the instructions given by your doctor and take any prescribed medication regularly."
    },
    {
        "dialog": [
            "Hi Medi, I am experiencing some symptoms related to diabetes.",
            "Sure, I am here to help you. What are the symptoms you're experiencing?",
            "I feel thirsty, urinate frequently, and have blurry vision.",
            "Based on those symptoms, you might have high blood sugar levels.",
            "What should I do now?",
            "You should monitor your blood sugar levels and consult your doctor for further treatment.",
            "Is there any medication that I can take?",
            "Yes, you can take medication to lower your blood sugar levels after consulting your doctor.",
            "Okay, I will do that. Thank you for your help, Medi."
        ],
        "knowledge": "Diabetes Diabetes  When insulin is used in type 2 diabetes, a long-acting formulation is usually added initially, while continuing oral medications. Some severe cases of type 2 diabetes may also be treated with insulin, which is increased gradually until glucose targets are reached. Cardiovascular disease is a serious complication associated with diabetes, and many international guidelines recommend blood pressure treatment targets that are lower than 140/90 mmHg for people with diabetes.  However, there is only limited evidence regarding what the lower targets should be.  A 2016 systematic review found potential harm to treating to targets lower than 140 mmHg, and a subsequent systematic review in 2019 found no evidence of additional benefit from blood pressure lowering to between 130 – 140mmHg, although there was an increased risk of adverse events. 2015 American Diabetes Association recommendations are that people with diabetes and albuminuria should receive an inhibitor of the renin-angiotensin system to reduce the risks of progression to end-stage renal disease, cardiovascular events, and death.  There is some evidence that angiotensin converting enzyme inhibitors  are superior to other inhibitors of the renin-angiotensin system such as angiotensin receptor blockers , or aliskiren in preventing cardiovascular disease Diabetes Diabetes",
        "response": "You're welcome. Remember to monitor your blood sugar levels and consult your doctor for medication."
    },
    {
        "dialog": [
            "Hello Medi, I have some questions about insulin treatment.",
            "Sure, I can help you with that. What would you like to know?",
            "Can type 2 diabetes be treated with insulin?",
            "Yes, it can. Long-acting insulin is usually added initially while continuing oral medications.",
            "Are there any side effects of insulin treatment?",
            "Yes, there can be side effects such as low blood sugar levels, weight gain, and skin reactions.",
            "What should I do if I experience low blood sugar levels?",
            "You should always carry a source of quick sugar with you and notify your doctor if you experience frequent low blood sugar levels.",
            "Thank you for the information, Medi."
        ],
        "knowledge": "Diabetes Diabetes  When insulin is used in type 2 diabetes, a long-acting formulation is usually added initially, while continuing oral medications. Some severe cases of type 2 diabetes may also be treated with insulin, which is increased gradually until glucose targets are reached. Cardiovascular disease is a serious complication associated with diabetes, and many international guidelines recommend blood pressure treatment targets that are lower than 140/90 mmHg for people with diabetes.  However, there is only limited evidence regarding what the lower targets should be.  A 2016 systematic review found potential harm to treating to targets lower than 140 mmHg, and a subsequent systematic review in 2019 found no evidence of additional benefit from blood pressure lowering to between 130 – 140mmHg, although there was an increased risk of adverse events. 2015 American Diabetes Association recommendations are that people with diabetes and albuminuria should receive an inhibitor of the renin-angiotensin system to reduce the risks of progression to end-stage renal disease, cardiovascular events, and death.  There is some evidence that angiotensin converting enzyme inhibitors  are superior to other inhibitors of the renin-angiotensin system such as angiotensin receptor blockers , or aliskiren in preventing cardiovascular disease Diabetes Diabetes",
        "response": "You're welcome. I am always here to help you with any questions."
    },
    {
        "dialog": [
            "Hello Medi, I had a procedure related to diabetes. What should I do next?",
            "Hi, after the procedure, it's important to follow a healthy lifestyle and diet.",
            "What kind of diet should I follow?",
            "You should follow a well-balanced diet with more vegetables and fiber and less sugar and carbohydrates.",
            "What about physical exercise?",
            "Physical exercise is also important. You should aim for 30 minutes of moderate exercise per day.",
            "Are there any other things I should keep in mind?",
            "Yes, you should monitor your blood sugar levels regularly and consult your doctor if you notice any changes.",
            "Thank you, Medi. I will do that."
        ],
        "knowledge": "Diabetes Diabetes  When insulin is used in type 2 diabetes, a long-acting formulation is usually added initially, while continuing oral medications. Some severe cases of type 2 diabetes may also be treated with insulin, which is increased gradually until glucose targets are reached. Cardiovascular disease is a serious complication associated with diabetes, and many international guidelines recommend blood pressure treatment targets that are lower than 140/90 mmHg for people with diabetes.  However, there is only limited evidence regarding what the lower targets should be.  A 2016 systematic review found potential harm to treating to targets lower than 140 mmHg, and a subsequent systematic review in 2019 found no evidence of additional benefit from blood pressure lowering to between 130 – 140mmHg, although there was an increased risk of adverse events. 2015 American Diabetes Association recommendations are that people with diabetes and albuminuria should receive an inhibitor of the renin-angiotensin system to reduce the risks of progression to end-stage renal disease, cardiovascular events, and death.  There is some evidence that angiotensin converting enzyme inhibitors  are superior to other inhibitors of the renin-angiotensin system such as angiotensin receptor blockers , or aliskiren in preventing cardiovascular disease Diabetes Diabetes",
        "response": "You're welcome. Let me know if you have any other questions about diabetes or related procedures."
    },
    {
        "dialog": [
            "Hi Medi, I think I might have diabetes type 2.",
            "Alright, can you tell me about your symptoms?",
            "I feel thirsty, urinate more often than usual, and my vision is blurry.",
            "It's quite possible that you have diabetes. You should check your blood sugar levels.",
            "What can I do to treat it?",
            "You may need to change your diet, exercise regularly, and take medication as prescribed by your doctor.",
            "Do I have to take insulin?",
            "It depends on how well you control your blood sugar levels. Sometimes, lifestyle changes and other medications can help control it.",
            "What happens if I don't get it treated?"
        ],
        "knowledge": "Diabetes Diabetes When insulin is used in type 2 diabetes, a long-acting formulation is usually added initially, while continuing oral medications. Some severe cases of type 2 diabetes may also be treated with insulin, which is increased gradually until glucose targets are reached. Cardiovascular disease is a serious complication associated with diabetes, and many international guidelines recommend blood pressure treatment targets that are lower than 140/90 mmHg for people with diabetes.  However, there is only limited evidence regarding what the lower targets should be.  A 2016 systematic review found potential harm to treating to targets lower than 140 mmHg, and a subsequent systematic review in 2019 found no evidence of additional benefit from blood pressure lowering to between 130 – 140mmHg, although there was an increased risk of adverse events. 2015 American Diabetes Association recommendations are that people with diabetes and albuminuria should receive an inhibitor of the renin-angiotensin system to reduce the risks of progression to end-stage renal disease, cardiovascular events, and death.  There is some evidence that angiotensin converting enzyme inhibitors  are superior to other inhibitors of the renin-angiotensin system such as angiotensin receptor blockers , or aliskiren in preventing cardiovascular disease Diabetes Diabetes",
        "response": "If left untreated, diabetes can cause a lot of complications like cardiovascular disease and damage to your nerves, kidneys, eyes, and blood vessels."
    },
    {
        "dialog": [
            "Hi Medi, what are the symptoms of diabetes?",
            "The symptoms of diabetes include increased thirst, frequent urination, hunger, fatigue, blurred vision, and slow-healing wounds.",
            "What causes diabetes?",
            "There are a lot of risk factors that can contribute to diabetes, like being overweight, having a family history of the disease, and leading a sedentary lifestyle.",
            "Is there anything I can do to prevent it?",
            "Yes, maintaining a healthy weight, eating a balanced diet, and exercising regularly can help prevent diabetes.",
            "Can diabetes be cured?",
            "There is no cure for diabetes, but with proper treatment and management, it can be controlled and the risk of complications can be reduced.",
            "What kind of treatment is available?"
        ],
        "knowledge": "Diabetes Diabetes When insulin is used in type 2 diabetes, a long-acting formulation is usually added initially, while continuing oral medications. Some severe cases of type 2 diabetes may also be treated with insulin, which is increased gradually until glucose targets are reached. Cardiovascular disease is a serious complication associated with diabetes, and many international guidelines recommend blood pressure treatment targets that are lower than 140/90 mmHg for people with diabetes.  However, there is only limited evidence regarding what the lower targets should be.  A 2016 systematic review found potential harm to treating to targets lower than 140 mmHg, and a subsequent systematic review in 2019 found no evidence of additional benefit from blood pressure lowering to between 130 – 140mmHg, although there was an increased risk of adverse events. 2015 American Diabetes Association recommendations are that people with diabetes and albuminuria should receive an inhibitor of the renin-angiotensin system to reduce the risks of progression to end-stage renal disease, cardiovascular events, and death.  There is some evidence that angiotensin converting enzyme inhibitors  are superior to other inhibitors of the renin-angiotensin system such as angiotensin receptor blockers , or aliskiren in preventing cardiovascular disease Diabetes Diabetes",
        "response": "There are a variety of treatments for diabetes, including medication, insulin therapy, lifestyle changes, and monitoring your blood sugar levels regularly."
    },
    {
        "dialog": [
            "Hi Medi, I just had a medical procedure done. What should I do now?",
            "It's important to follow your doctor's instructions for recovery, which may include rest, taking medication as prescribed, and following a specific diet and exercise plan.",
            "What kind of diet should I follow?",
            "Your doctor may recommend a diet that's low in sugar and high in fiber, and they may also suggest limiting your intake of certain types of food like processed foods and saturated fats.",
            "What kind of exercise should I do?",
            "Your doctor may recommend low-impact exercises like walking, swimming, or cycling, and they may also suggest strength training exercises to help build muscle mass.",
            "What else can I do to help with my recovery?",
            "It's important to get plenty of rest, stay hydrated, and avoid smoking or drinking alcohol while you're recovering.",
            "How long will it take to recover?"
        ],
        "knowledge": "Diabetes Diabetes When insulin is used in type 2 diabetes, a long-acting formulation is usually added initially, while continuing oral medications. Some severe cases of type 2 diabetes may also be treated with insulin, which is increased gradually until glucose targets are reached. Cardiovascular disease is a serious complication associated with diabetes, and many international guidelines recommend blood pressure treatment targets that are lower than 140/90 mmHg for people with diabetes.  However, there is only limited evidence regarding what the lower targets should be.  A 2016 systematic review found potential harm to treating to targets lower than 140 mmHg, and a subsequent systematic review in 2019 found no evidence of additional benefit from blood pressure lowering to between 130 – 140mmHg, although there was an increased risk of adverse events. 2015 American Diabetes Association recommendations are that people with diabetes and albuminuria should receive an inhibitor of the renin-angiotensin system to reduce the risks of progression to end-stage renal disease, cardiovascular events, and death.  There is some evidence that angiotensin converting enzyme inhibitors  are superior to other inhibitors of the renin-angiotensin system such as angiotensin receptor blockers , or aliskiren in preventing cardiovascular disease Diabetes Diabetes",
        "response": "The recovery time varies depending on the procedure you had done, so it's best to ask your doctor for an estimate."
    },
    {
        "dialog": [
            "Hi Medi, I think I might have diabetes.",
            "I can give you some information, what symptoms do you have?",
            "I feel thirsty all the time and I have to urinate frequently.",
            "Those are common diabetes symptoms. You should visit a doctor for testing.",
            "Is there any way to prevent diabetes?",
            "Lifestyle changes can help, such as eating a balanced diet and exercising regularly.",
            "Interesting, how is diabetes usually treated?",
            "It depends on the severity, but some people may require insulin injections or oral medications.",
            "Thanks for the information, Medi. Can you recommend some exercises for diabetes?"
        ],
        "knowledge": "Diabetes Diabetes  When insulin is used in type 2 diabetes, a long-acting formulation is usually added initially, while continuing oral medications. Some severe cases of type 2 diabetes may also be treated with insulin, which is increased gradually until glucose targets are reached. Cardiovascular disease is a serious complication associated with diabetes, and many international guidelines recommend blood pressure treatment targets that are lower than 140/90 mmHg for people with diabetes.  However, there is only limited evidence regarding what the lower targets should be.  A 2016 systematic review found potential harm to treating to targets lower than 140 mmHg, and a subsequent systematic review in 2019 found no evidence of additional benefit from blood pressure lowering to between 130 – 140mmHg, although there was an increased risk of adverse events. 2015 American Diabetes Association recommendations are that people with diabetes and albuminuria should receive an inhibitor of the renin-angiotensin system to reduce the risks of progression to end-stage renal disease, cardiovascular events, and death.  There is some evidence that angiotensin converting enzyme inhibitors  are superior to other inhibitors of the renin-angiotensin system such as angiotensin receptor blockers , or aliskiren in preventing cardiovascular disease Diabetes Diabetes",
        "response": "Yes, there are many exercises that can help with diabetes, such as brisk walking, cycling, and swimming."
    },
    {
        "dialog": [
            "Hey Medi, I recently had a medical procedure for Type 2 diabetes.",
            "What kind of procedure did you have?",
            "I received insulin injections and I'm worried about my lifestyle now.",
            "It's important to maintain a healthy lifestyle with a balanced diet and regular exercise.",
            "Are there any specific foods I should avoid?",
            "You should limit your sugar and carbohydrate intake, and focus on whole grains and vegetables.",
            "How often should I exercise?",
            "At least 30 minutes of moderate exercise per day is recommended for those with diabetes.",
            "Thanks for the advice, Medi. Is there anything else I should know?"
        ],
        "knowledge": "Diabetes Diabetes  When insulin is used in type 2 diabetes, a long-acting formulation is usually added initially, while continuing oral medications. Some severe cases of type 2 diabetes may also be treated with insulin, which is increased gradually until glucose targets are reached. Cardiovascular disease is a serious complication associated with diabetes, and many international guidelines recommend blood pressure treatment targets that are lower than 140/90 mmHg for people with diabetes.  However, there is only limited evidence regarding what the lower targets should be.  A 2016 systematic review found potential harm to treating to targets lower than 140 mmHg, and a subsequent systematic review in 2019 found no evidence of additional benefit from blood pressure lowering to between 130 – 140mmHg, although there was an increased risk of adverse events. 2015 American Diabetes Association recommendations are that people with diabetes and albuminuria should receive an inhibitor of the renin-angiotensin system to reduce the risks of progression to end-stage renal disease, cardiovascular events, and death.  There is some evidence that angiotensin converting enzyme inhibitors  are superior to other inhibitors of the renin-angiotensin system such as angiotensin receptor blockers , or aliskiren in preventing cardiovascular disease Diabetes Diabetes",
        "response": "Just remember to check your blood sugar levels regularly and take your medication as prescribed by your doctor."
    },
    {
        "dialog": [
            "Hi Medi, I have a question about diabetes and blood pressure.",
            "Sure, what's your question?",
            "I heard that people with diabetes have to maintain a lower blood pressure. Is that true?",
            "Yes, many international guidelines recommend blood pressure targets lower than 140/90 mmHg for people with diabetes.",
            "Is there any benefit to lowering blood pressure more than that?",
            "A 2016 systematic review found potential harm to treating to targets lower than 140 mmHg.",
            "That's interesting. Is there anything else I should know about blood pressure and diabetes?",
            "2015 American Diabetes Association recommendations suggest that people with diabetes and albuminuria should receive an inhibitor of the renin-angiotensin system to reduce the risks of progression to end-stage renal disease, cardiovascular events, and death.",
            "Thanks, Medi. That's good to know. Is there anything else I should be aware of with diabetes? "
        ],
        "knowledge": "Diabetes Diabetes  When insulin is used in type 2 diabetes, a long-acting formulation is usually added initially, while continuing oral medications. Some severe cases of type 2 diabetes may also be treated with insulin, which is increased gradually until glucose targets are reached. Cardiovascular disease is a serious complication associated with diabetes, and many international guidelines recommend blood pressure treatment targets that are lower than 140/90 mmHg for people with diabetes.  However, there is only limited evidence regarding what the lower targets should be.  A 2016 systematic review found potential harm to treating to targets lower than 140 mmHg, and a subsequent systematic review in 2019 found no evidence of additional benefit from blood pressure lowering to between 130 – 140mmHg, although there was an increased risk of adverse events. 2015 American Diabetes Association recommendations are that people with diabetes and albuminuria should receive an inhibitor of the renin-angiotensin system to reduce the risks of progression to end-stage renal disease, cardiovascular events, and death.  There is some evidence that angiotensin converting enzyme inhibitors  are superior to other inhibitors of the renin-angiotensin system such as angiotensin receptor blockers , or aliskiren in preventing cardiovascular disease Diabetes Diabetes",
        "response": "Just remember to monitor your blood sugar levels regularly and take your medication as prescribed by your doctor. Living a healthy lifestyle will also help manage your diabetes."
    }
]