[
    {
        "dialog": [
            "Hello Medi, I have some symptoms and I don't feel well",
            "Sure, please tell me about your symptoms.",
            "I have a high fever, cough, and cold sweat.",
            "I see, based on your symptoms, you might be suffering from influenza",
            "What should I do next?",
            "You should rest, and get plenty of fluids. If your symptoms persist, you should see a doctor.",
            "Is there any way I can prevent getting the flu?",
            "Yes, the best way to prevent the flu is to get vaccinated every year.",
            "How effective is the flu vaccine? "
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "The flu vaccine is quite effective at preventing the flu, typically around 40-60% effective"
    },
    {
        "dialog": [
            "Hello Medi, I have a question about the history of influenza.",
            "Sure, what do you want to know?",
            "When was the first flu pandemic? ",
            "The first flu pandemic on record dates back to 1580.",
            "How many flu pandemics have there been?",
            "There have been several flu pandemics throughout history, including the second flu pandemic of the 18th century, the pandemic of 1830-1833, and the pandemic of 1889.",
            "How was the flu perceived during the 19th century?",
            "The flu was seen as a common and treatable disease during the 19th century.",
            "What about the mortality rate of these pandemics?"
        ],
        "knowledge": "Influenza Influenza  The second flu pandemic of the 18th century was in 1781–1782, starting in China in autumn.  From this pandemic, influenza became associated with sudden outbreaks of febrile illness.  The next flu pandemic was from 1830 to 1833, beginning in China in winter.  This pandemic had a high attack rate, but the mortality rate was low. A minor influenza pandemic occurred from 1847 to 1851 at the same time as the third cholera pandemic and was the first flu pandemic to occur with vital statistics being recorded, so influenza mortality was clearly recorded for the first time.  Highly pathogenic avian influenza was recognized in 1878 and was soon linked to transmission to humans.  By the time of the 1889 pandemic, which may have been caused by an H2N2 strain, the flu had become an easily recognizable disease Influenza Influenza",
        "response": "The mortality rate varied between pandemics, but the pandemic of 1830-1833 had a low mortality rate."
    },
    {
        "dialog": [
            "Hello Medi, I recently underwent a medical procedure and would like some advice on my recovery.",
            "Of course, what procedure did you undergo?",
            "I had surgery to remove a tumor and I want to ensure I'm doing everything I can to recover quickly.",
            "After surgery, it's important to rest and take it easy for a while. You should also eat a balanced diet and stay hydrated.",
            "What about physical activity?",
            "You should avoid strenuous physical activity for a few weeks after surgery, but light exercise such as walking is good for recovery.",
            "Are there any specific foods I should be eating?",
            "You should eat a balanced diet with plenty of protein and fiber to aid in healing. Fruits and vegetables are also important for their vitamin content.",
            "Are there any foods I should avoid?"
        ],
        "knowledge": "Influenza Influenza  The second flu pandemic of the 18th century was in 1781–1782, starting in China in autumn.  From this pandemic, influenza became associated with sudden outbreaks of febrile illness.  The next flu pandemic was from 1830 to 1833, beginning in China in winter.  This pandemic had a high attack rate, but the mortality rate was low. A minor influenza pandemic occurred from 1847 to 1851 at the same time as the third cholera pandemic and was the first flu pandemic to occur with vital statistics being recorded, so influenza mortality was clearly recorded for the first time.  Highly pathogenic avian influenza was recognized in 1878 and was soon linked to transmission to humans.  By the time of the 1889 pandemic, which may have been caused by an H2N2 strain, the flu had become an easily recognizable disease Influenza Influenza",
        "response": "You should avoid foods that are high in sugar, fat, or salt and processed foods. These can slow down the healing process."
    },
    {
        "dialog": [
            "Hello Medi, I have a fever and cough",
            "Hello, have you experienced any other symptoms?",
            "Yes, I have a runny nose and feel very tired",
            "Based on your symptoms, you may have the flu",
            "Oh no, what should I do?",
            "Make sure to get plenty of rest and drink lots of fluids. You can also take over-the-counter medication for your symptoms",
            "Okay, thank you. Is the flu a serious illness?",
            "For most people, it is not serious and can be treated at home. However, it can lead to complications for some people",
            "Who is at risk for complications from the flu?"
        ],
        "knowledge": "Influenza Influenza The flu can affect anyone, but some people are at higher risk for complications. These include young children, elderly people, pregnant women, and people with certain medical conditions such as asthma, diabetes, and heart disease.",
        "response": "People at higher risk for complications from the flu are young children, elderly people, pregnant women, and people with certain medical conditions such as asthma, diabetes, and heart disease."
    },
    {
        "dialog": [
            "Hi Medi, I just had surgery and I'm not sure what to do next",
            "Hello, what type of surgery did you have?",
            "I had my appendix removed",
            "After surgery, it is important to rest and take it easy for a while. You may also need to take medication for pain",
            "How long will it take for me to recover?",
            "Recovery time can vary, but you should start feeling better in a few days. You may need to avoid certain activities for a while",
            "What should I avoid?",
            "You should avoid heavy lifting and strenuous exercise for a few weeks. You should also follow your doctor's instructions for caring for your incision",
            "Okay, thank you. What should I eat?"
        ],
        "knowledge": "Appendectomy Appendectomy An appendectomy is the surgical removal of the appendix. Recovery time can vary depending on a number of factors, such as the type of surgery performed and the patient's overall health. After surgery, it is important to rest and take it easy for a while. You may need to take medication for pain. You should also follow your doctor's instructions for caring for your incision and avoid heavy lifting and strenuous exercise for a few weeks. It is important to eat a healthy, balanced diet with plenty of fruits, vegetables, and protein.",
        "response": "You should eat a healthy, balanced diet with plenty of fruits, vegetables, and protein. You may also need to avoid certain foods if they cause discomfort."
    },
    {
        "dialog": [
            "Hi Medi, I want to know more about the flu",
            "Of course, what would you like to know?",
            "What are the symptoms of the flu?",
            "The symptoms of the flu include fever, cough, sore throat, runny or stuffy nose, body aches, headache, chills, and fatigue",
            "How is the flu spread?",
            "The flu is spread through respiratory droplets when an infected person talks, coughs, or sneezes. It can also be spread by touching a surface contaminated with the virus and then touching your mouth, nose, or eyes",
            "How can I prevent the flu?",
            "The best way to prevent the flu is to get vaccinated every year. You should also wash your hands frequently, avoid close contact with sick people, and stay home if you are sick",
            "Okay, thank you. Is the flu contagious?"
        ],
        "knowledge": "Influenza Influenza The flu is a contagious respiratory illness caused by the influenza virus. The symptoms of the flu include fever, cough, sore throat, runny or stuffy nose, body aches, headache, chills, and fatigue. The flu is spread through respiratory droplets when an infected person talks, coughs, or sneezes. It can also be spread by touching a surface contaminated with the virus and then touching your mouth, nose, or eyes. The best way to prevent the flu is to get vaccinated every year. You should also wash your hands frequently, avoid close contact with sick people, and stay home if you are sick.",
        "response": "Yes, the flu is highly contagious and can spread easily from person to person."
    },
    {
        "dialog": [
            "Hi Medi, I have a sore throat and a fever.",
            "I'm sorry to hear that. Have you been experiencing any other symptoms?",
            "Yes, I have a runny nose and a cough as well.",
            "Based on those symptoms, it is possible that you have influenza.",
            "What should I do to feel better?",
            "You should get plenty of rest, drink lots of fluids, and take over-the-counter medication for your symptoms.",
            "Thank you for your advice, Medi.",
            "You're welcome. Please let me know if your symptoms worsen.",
            "Will do. Bye."
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "Based on your symptoms, it is possible that you have influenza. Get plenty of rest, drink lots of fluids, and take over-the-counter medication for your symptoms."
    },
    {
        "dialog": [
            "Hi Medi, can you tell me more about the history of the flu?",
            "Sure. What would you like to know?",
            "When was the second flu pandemic?",
            "The second flu pandemic was in 1781-1782, starting in China in autumn. From this pandemic, influenza became associated with sudden outbreaks of febrile illness.",
            "Interesting. What about the next pandemic?",
            "The next flu pandemic was from 1830 to 1833, beginning in China in winter. This pandemic had a high attack rate, but the mortality rate was low.",
            "Thanks for the information, Medi.",
            "You're welcome. Is there anything else you'd like to know?",
            "No, that's all for now. Goodbye, Medi."
        ],
        "knowledge": "Influenza Influenza  The second flu pandemic of the 18th century was in 1781–1782, starting in China in autumn.  From this pandemic, influenza became associated with sudden outbreaks of febrile illness.  The next flu pandemic was from 1830 to 1833, beginning in China in winter.  This pandemic had a high attack rate, but the mortality rate was low. A minor influenza pandemic occurred from 1847 to 1851 at the same time as the third cholera pandemic and was the first flu pandemic to occur with vital statistics being recorded, so influenza mortality was clearly recorded for the first time.  Highly pathogenic avian influenza was recognized in 1878 and was soon linked to transmission to humans.  By the time of the 1889 pandemic, which may have been caused by an H2N2 strain, the flu had become an easily recognizable disease Influenza Influenza",
        "response": "The second flu pandemic was in 1781-1782, starting in China in autumn. From this pandemic, influenza became associated with sudden outbreaks of febrile illness. The next flu pandemic was from 1830 to 1833, beginning in China in winter. This pandemic had a high attack rate, but the mortality rate was low."
    },
    {
        "dialog": [
            "Hi Medi, I just had surgery and I'm not sure what I should do.",
            "I'm here to help. What type of surgery did you have?",
            "I had gallbladder surgery.",
            "Okay, after gallbladder surgery, you should avoid heavy lifting and strenuous activity for at least a week.",
            "What about my diet?",
            "You should stick to a low-fat diet for a few weeks after surgery. Eat small, frequent meals and avoid spicy or greasy foods.",
            "Thanks for your help.",
            "You're welcome. Please follow your doctor's instructions as well.",
            "Will do. Goodbye."
        ],
        "knowledge": "Gallbladder Surgery Gallbladder Surgery After gallbladder surgery, patients should avoid heavy lifting and strenuous activity for at least a week. Patients should stick to a low-fat diet for a few weeks after surgery. Eat small, frequent meals and avoid spicy or greasy foods. Patients should also follow their doctor's instructions for pain management and wound care. Gallbladder Surgery Gallbladder Surgery",
        "response": "After gallbladder surgery, you should avoid heavy lifting and strenuous activity for at least a week. Stick to a low-fat diet for a few weeks after surgery. Eat small, frequent meals and avoid spicy or greasy foods."
    },
    {
        "dialog": [
            "Hello Medi, I have a fever and cough.",
            "All right, any other symptoms?",
            "I feel tired and my throat hurts.",
            "Okay, based on your symptoms, you may have influenza.",
            "What should I do now?",
            "Rest, drink plenty of fluids and take over-the-counter medication for fever. If your symptoms worsen, see a doctor.",
            "Thank you for your advice, Medi.",
            "You're welcome. Take care of yourself.",
            "Can you tell me more about influenza?"
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "Influenza is a contagious respiratory illness caused by influenza viruses. Symptoms include fever, cough, sore throat, muscle aches, fatigue, and headache. It can be serious and lead to complications, especially in young children, older adults, and people with weakened immune systems."
    },
    {
        "dialog": [
            "Hello Medi, I'm curious about the history of influenza.",
            "Sure, I can help with that. What would you like to know?",
            "When was the first recorded influenza pandemic?",
            "The second flu pandemic of the 18th century was in 1781–1782, starting in China in autumn. From this pandemic, influenza became associated with sudden outbreaks of febrile illness.",
            "That's interesting. How about other pandemics?",
            "The next flu pandemic was from 1830 to 1833, beginning in China in winter. This pandemic had a high attack rate, but the mortality rate was low. A minor influenza pandemic occurred from 1847 to 1851 at the same time as the third cholera pandemic and was the first flu pandemic to occur with vital statistics being recorded, so influenza mortality was clearly recorded for the first time. Highly pathogenic avian influenza was recognized in 1878 and was soon linked to transmission to humans. By the time of the 1889 pandemic, which may have been caused by an H2N2 strain, the flu had become an easily recognizable disease.",
            "Wow, there's a lot of history behind influenza. Thank you for the information, Medi.",
            "You're welcome. Is there anything else I can help you with?",
            "No, that's all for now."
        ],
        "knowledge": "Influenza Influenza  The second flu pandemic of the 18th century was in 1781–1782, starting in China in autumn.  From this pandemic, influenza became associated with sudden outbreaks of febrile illness.  The next flu pandemic was from 1830 to 1833, beginning in China in winter.  This pandemic had a high attack rate, but the mortality rate was low. A minor influenza pandemic occurred from 1847 to 1851 at the same time as the third cholera pandemic and was the first flu pandemic to occur with vital statistics being recorded, so influenza mortality was clearly recorded for the first time.  Highly pathogenic avian influenza was recognized in 1878 and was soon linked to transmission to humans.  By the time of the 1889 pandemic, which may have been caused by an H2N2 strain, the flu had become an easily recognizable disease Influenza Influenza",
        "response": "You're welcome. It's always interesting to learn about the history of diseases like influenza."
    },
    {
        "dialog": [
            "Hello Medi, I just recovered from a severe case of influenza. What should I do now?",
            "Glad to hear you're feeling better. You should focus on getting plenty of rest and hydration to help your body recover.",
            "Is there anything I can do to prevent getting the flu again?",
            "Yes, getting an annual flu vaccine is the best way to prevent getting the flu. You should also practice good hygiene by washing your hands frequently, avoiding close contact with sick people, and covering your nose and mouth when you cough or sneeze.",
            "Thank you for the advice, Medi.",
            "You're welcome. Is there anything else I can help you with?",
            "No, that's all for now.",
            "Okay, feel free to come back if you have any more questions.",
            "Sure, I will. Thank you again, Medi."
        ],
        "knowledge": "Influenza Influenza The best way to prevent getting the flu is to get a yearly flu vaccination. Other preventative measures include practicing good hand hygiene, avoiding close contact with sick people, and covering your nose and mouth when you cough or sneeze. Influenza Influenza",
        "response": "You're welcome. Remember to stay healthy by taking preventative measures like getting a flu vaccination and practicing good hygiene."
    },
    {
        "dialog": [
            "Hi Medi, I have some flu-like symptoms",
            "Hello, I can help you. What are your symptoms?",
            "I have been coughing a lot, and have a sore throat",
            "Do you have fever or body aches?",
            "No, I haven't experienced any of those yet",
            "It's likely that you have a mild respiratory infection and should rest.",
            "What can I do to feel better?",
            "You should drink plenty of fluids, take over-the-counter medicines for cough and throat pain and get enough rest",
            "Thanks Medi, how long will this last?"
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion. These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose. Coughing is the most common symptom. Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children. The standard influenza symptoms typically last for 2 - 8 days. A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "Based on your symptoms, it seems like you have a mild respiratory infection. It should last for a few days."
    },
    {
        "dialog": [
            "Hi Medi, I want to know more about the flu pandemic",
            "Sure, I can help you. What do you want to know?",
            "Can you tell me about the outbreak in the 18th century",
            "Yes, the second flu pandemic of the 18th century was in 1781-1782 starting in China in autumn. This pandemic marked the association of influenza with sudden outbreaks of febrile illness",
            "What was the next flu pandemic like?",
            "The next flu pandemic was from 1830 to 1833, beginning in China in winter. This pandemic had a high attack rate, but the mortality rate was low",
            "How was the first flu pandemic that was recorded?",
            "A minor influenza pandemic occurred from 1847 to 1851 at the same time as the third cholera pandemic and was the first flu pandemic to occur with vital statistics being recorded, so influenza mortality was clearly recorded for the first time",
            "What is the most recent flu pandemic known?"
        ],
        "knowledge": "Influenza Influenza  The second flu pandemic of the 18th century was in 1781-1782 starting in China in autumn. From this pandemic, influenza became associated with sudden outbreaks of febrile illness. The next flu pandemic was from 1830 to 1833, beginning in China in winter. This pandemic had a high attack rate, but the mortality rate was low. A minor influenza pandemic occurred from 1847 to 1851 at the same time as the third cholera pandemic and was the first flu pandemic to occur with vital statistics being recorded, so influenza mortality was clearly recorded for the first time. Highly pathogenic avian influenza was recognized in 1878 and was soon linked to transmission to humans. By the time of the 1889 pandemic, which may have been caused by an H2N2 strain, the flu had become an easily recognizable disease Influenza Influenza",
        "response": "The most recent flu pandemic was in 2009 caused by the H1N1 influenza virus"
    },
    {
        "dialog": [
            "Hi Medi, I just had a flu shot. What should I do next?",
            "Hi! That’s great! You should take care of yourself. What are you thinking?",
            "Can I exercise after getting the flu shot?",
            "It's actually recommended to avoid strenuous exercise or activities for at least two hours after getting the flu shot",
            "What should I do if I experience some side effects?",
            "It's possible to feel some mild side effects like fever, headache, or muscle aches after the shot. You can take over-the-counter pain relievers to relieve the symptoms",
            "Are there any other precautions I should take after the shot?",
            "You should continue to practice good hygiene, like washing your hands frequently and covering your mouth when you cough or sneeze",
            "Thanks for the advice. Do you know how often I should get the flu shot?"
        ],
        "knowledge": "Influenza Influenza  Influenza vaccination is recommended for everyone six months and older. The vaccine is especially important for people who are at high risk of serious complications from the flu, including young children, pregnant women, people with chronic health conditions, and older adults. The vaccine is formulated each year to match the strains of the flu virus that are circulating. The vaccine can cause mild side effects, such as soreness, redness, or swelling where the shot was given, fever, headache, and muscle aches. These side effects usually go away on their own in a few days. It is recommended that people get the flu shot every year Influenza Influenza",
        "response": "It's recommended that you get the flu shot every year, as the virus strains can change from year to year."
    },
    {
        "dialog": [
            "Hello Medi, I have a fever and headache",
            "I see. Any other symptoms?",
            "Yes, my throat is sore and I feel weak",
            "Based on your symptoms, it may be influenza. I recommend rest and hydration.",
            "Can I take over-the-counter medication?",
            "Yes, you can take medication for fever and pain. Please follow the instructions on the label.",
            "Okay, thank you for your help. ",
            "You're welcome. Take care and get well soon.",
            "How long does it typically take to recover from influenza?"
        ],
        "knowledge": "Influenza Influenza The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "Typically, symptoms last 2-8 days, but it can take up to two weeks to fully recover. Rest and hydration are key to a speedy recovery."
    },
    {
        "dialog": [
            "Hello Medi, can you tell me more about the flu pandemic in the 18th century?",
            "Certainly. Which pandemic are you referring to?",
            "The second flu pandemic in 1781-1782 that started in China.",
            "That pandemic is significant because it was the first time influenza became associated with sudden outbreaks of febrile illness.",
            "What was the mortality rate of this pandemic?",
            "The mortality rate is not well documented, but it is believed to have been low.",
            "What about the next pandemic in 1830-1833?",
            "That pandemic also began in China and had a high attack rate, but the mortality rate was low.",
            "Thank you for the information. I find it fascinating to learn about the history of the disease."
        ],
        "knowledge": "Influenza Influenza  The second flu pandemic of the 18th century was in 1781–1782, starting in China in autumn.  From this pandemic, influenza became associated with sudden outbreaks of febrile illness.  The next flu pandemic was from 1830 to 1833, beginning in China in winter.  This pandemic had a high attack rate, but the mortality rate was low. A minor influenza pandemic occurred from 1847 to 1851 at the same time as the third cholera pandemic and was the first flu pandemic to occur with vital statistics being recorded, so influenza mortality was clearly recorded for the first time.  Highly pathogenic avian influenza was recognized in 1878 and was soon linked to transmission to humans.  By the time of the 1889 pandemic, which may have been caused by an H2N2 strain, the flu had become an easily recognizable disease Influenza Influenza",
        "response": "You're welcome. Let me know if you have any more questions about the history of influenza."
    },
    {
        "dialog": [
            "Hello Medi, I recently had a flu shot. What other precautions can I take to prevent getting the flu?",
            "Getting the flu shot is a great step toward prevention. Additionally, you can frequently wash your hands and avoid close contact with people who are sick.",
            "Are there any dietary or lifestyle changes that can help prevent the flu?",
            "A well-balanced diet rich in vitamins and nutrients can help boost your immune system. Regular exercise and adequate sleep can also help.",
            "What about supplements or herbal remedies?",
            "Some studies suggest that vitamin C and zinc supplements can help prevent the flu. However, it's best to consult with your doctor before taking any supplements. ",
            "Thank you for the advice. I will take these measures to help prevent getting sick.",
            "You're welcome. Stay healthy!",
            "What are some other common illnesses that have symptoms similar to the flu?"
        ],
        "knowledge": "Influenza Influenza The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "Symptoms of the common cold, allergies, and COVID-19 can be similar to the flu. It's important to consult with a doctor to determine the cause of your symptoms."
    },
    {
        "dialog": [
            "Hello Medi, I have a fever and don't feel well.",
            "I'm sorry to hear that. What other symptoms do you have?",
            "I have a cough and a sore throat. My body also feels very tired.",
            "Based on your symptoms, it could be influenza. You should rest and drink plenty of fluids.",
            "Is there anything else I can do to feel better?",
            "You can take over-the-counter medications for fever and cough. If your symptoms get worse, see a doctor.",
            "Thank you for your advice. How long will it take for me to feel better?",
            "It usually takes a few days to a week to recover from influenza. Make sure to rest and take care of yourself.",
            "Thanks for your help, Medi. I hope I feel better soon."
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "Based on your symptoms such as fever, cough, sore throat, and fatigue, you may have influenza. Rest and drink plenty of fluids, take over-the-counter medication, and see a doctor if your symptoms worsen."
    },
    {
        "dialog": [
            "Hello Medi, I have a question about the history of influenza.",
            "Sure, I'm happy to help. What do you want to know?",
            "I want to know when the first influenza pandemic occurred.",
            "The first recorded influenza pandemic was in 1580, but there were likely pandemics before then that were not recorded.",
            "What were some other major influenza pandemics throughout history?",
            "The second flu pandemic of the 18th century was in 1781–1782, starting in China in autumn. The next flu pandemic was from 1830 to 1833, beginning in China in winter. A minor influenza pandemic occurred from 1847 to 1851 at the same time as the third cholera pandemic and was the first flu pandemic to occur with vital statistics being recorded, so influenza mortality was clearly recorded for the first time. The flu had become an easily recognizable disease by the time of the 1889 pandemic.",
            "What made the flu easily recognizable by the time of the 1889 pandemic?",
            "The 1889 pandemic may have been caused by an H2N2 strain. By that time, influenza had become associated with sudden outbreaks of febrile illness.",
            "That's interesting. Thanks for the information, Medi."
        ],
        "knowledge": "Influenza Influenza  The second flu pandemic of the 18th century was in 1781–1782, starting in China in autumn.  From this pandemic, influenza became associated with sudden outbreaks of febrile illness.  The next flu pandemic was from 1830 to 1833, beginning in China in winter.  This pandemic had a high attack rate, but the mortality rate was low. A minor influenza pandemic occurred from 1847 to 1851 at the same time as the third cholera pandemic and was the first flu pandemic to occur with vital statistics being recorded, so influenza mortality was clearly recorded for the first time.  Highly pathogenic avian influenza was recognized in 1878 and was soon linked to transmission to humans.  By the time of the 1889 pandemic, which may have been caused by an H2N2 strain, the flu had become an easily recognizable disease Influenza Influenza",
        "response": "The first recorded influenza pandemic was in 1580, with other major pandemics occurring in 1781-1782, 1830-1833, 1847-1851, and 1889. By the time of the 1889 pandemic, influenza had become an easily recognizable disease."
    },
    {
        "dialog": [
            "Hello Medi, I recently had a medical procedure and am wondering if there are any lifestyle changes I should make.",
            "Of course, what procedure did you have?",
            "I had surgery to remove my gallbladder.",
            "After gallbladder surgery, it's important to eat a low-fat diet to avoid digestive problems.",
            "What types of foods should I avoid?",
            "You should avoid fried foods, fatty meats, and high-fat dairy products.",
            "What types of foods should I eat?",
            "You should eat lean protein, fruits and vegetables, and whole grains.",
            "Are there any other lifestyle changes I should make?"
        ],
        "knowledge": "Gallbladder Surgery Gallbladder Surgery  After gallbladder surgery, it's important to eat a low-fat diet to avoid digestive problems.  You should avoid fried foods, fatty meats, and high-fat dairy products, and eat lean protein, fruits and vegetables, and whole grains.  You should also avoid alcohol and tobacco, and try to exercise regularly to promote overall health.  Following these lifestyle changes can help you recover from surgery and maintain good health in the long term. Gallbladder Surgery Gallbladder Surgery",
        "response": "After gallbladder surgery, it's important to eat a low-fat diet, avoid fried foods, fatty meats, and high-fat dairy products, and eat lean protein, fruits and vegetables, and whole grains. You should also avoid alcohol and tobacco, and try to exercise regularly."
    },
    {
        "dialog": [
            "Hello Medi, I have a fever and headache",
            "I see. Have you measured your temperature?",
            "Yes, it's 38.5 degrees Celsius",
            "Okay, based on your symptoms, you might have the flu. I suggest you take some rest and drink lots of fluids",
            "Thanks for your suggestion, but how can I prevent getting the flu?",
            "You can get the flu vaccine every year and wash your hands regularly. It also helps to avoid close contact with sick people",
            "I got it. Should I take any medication to relieve my symptoms?",
            "You can take acetaminophen to reduce your fever and headaches. But make sure to follow the recommended dosage and check with your doctor first if you have any medical conditions",
            "Thanks for your advice, Medi. I will follow them. "
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "You're welcome. I hope you feel better soon."
    },
    {
        "dialog": [
            "Hi Medi, can you tell me more about the flu?",
            "Sure, what do you want to know?",
            "I want to know how the flu is different from a cold",
            "The flu and the common cold are both respiratory illnesses caused by different viruses. However, they have different symptoms and severity. The flu tends to have a sudden onset of symptoms like high fever, muscle aches, and fatigue while a cold tends to have milder symptoms like a runny nose and cough",
            "Thanks. How does the flu spread?",
            "The flu can spread through respiratory droplets when an infected person coughs, sneezes, or talks. It can also spread by touching a surface contaminated with the virus and then touching your mouth or nose",
            "Is there any treatment for the flu?",
            "There is no cure for the flu, but antiviral drugs can help reduce the severity and duration of the illness if taken early. It's important to rest and drink plenty of fluids as well",
            "I see. How long does it take to recover from the flu?"
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "You're welcome. Let me know if you have any other questions."
    },
    {
        "dialog": [
            "Hi Medi, I had the flu last year and I don't want to get it again. What should I do?",
            "The best way to prevent the flu is to get vaccinated every year. The vaccine is updated annually to protect against the latest strains of the virus",
            "I see. What if I don't want to get the vaccine?",
            "You can also prevent the flu by washing your hands regularly, avoiding close contact with sick people, and covering your mouth and nose when you cough or sneeze. It's also important to take care of your health by getting enough sleep, eating a balanced diet, and staying active",
            "Thanks for the advice. What are the common complications of the flu?",
            "Complications of the flu can include pneumonia, bronchitis, sinus and ear infections, and worsening of chronic medical conditions like asthma or diabetes. That's why it's important to take the flu seriously and take steps to prevent it",
            "I see. What should I do if I get the flu despite my best efforts to prevent it?",
            "If you think you have the flu, it's important to rest and drink plenty of fluids. You can take acetaminophen to reduce your fever and headaches. If your symptoms are severe or you have underlying medical conditions, you should contact your doctor",
            "Thanks, Medi. I will make sure to take care of myself and get vaccinated this year"
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "You're welcome. Stay healthy and take care!"
    },
    {
        "dialog": [
            "Hi Medi, I have a fever and a headache.",
            "I'm sorry to hear that. Can you tell me more about your symptoms?",
            "I also feel very weak and have a dry cough.",
            "Based on your symptoms, you might have Influenza. You should rest and drink plenty of fluids.",
            "Is it contagious ?",
            "Yes, Influenza is highly contagious. You should avoid contact with other people to prevent spreading the virus.",
            "Okay, I will take your advice. What should I do if my condition worsens?",
            "If your condition worsens or you have difficulty breathing, you should seek medical attention immediately.",
            "Thank you for your help!"
        ],
        "knowledge": "Influenza Influenza The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion. These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose. Coughing is the most common symptom. Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children. The standard influenza symptoms typically last for 2 - 8 days. A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "You're welcome. If you have any more questions, don't hesitate to ask."
    },
    {
        "dialog": [
            "Hello Medi, what causes Influenza?",
            "Influenza is caused by a virus that infects the respiratory system.",
            "How does the virus spread?",
            "The virus is primarily spread through respiratory droplets when a person with the virus sneezes or coughs.",
            "What can I do to prevent getting Influenza?",
            "The best way to prevent getting Influenza is to get vaccinated each year, wash your hands frequently, avoid close contact with sick individuals, and cover your mouth and nose when you cough or sneeze.",
            "Can you tell me more about the vaccine?",
            "The vaccine contains a weakened or dead virus that triggers your immune system to produce antibodies that can protect you from getting infected with the virus.",
            "Is the vaccine safe?"
        ],
        "knowledge": "Influenza Influenza The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion. These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose. Coughing is the most common symptom. Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children. The standard influenza symptoms typically last for 2 - 8 days. A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "You're welcome. Stay safe and healthy!"
    },
    {
        "dialog": [
            "Hello Medi, I recently had Influenza and I am worried about getting it again.",
            "It is possible to get Influenza more than once, but getting vaccinated each year can reduce your risk.",
            "How can I protect my family from getting Influenza?",
            "You can protect your family from getting Influenza by encouraging them to get vaccinated each year, practicing good hygiene by washing their hands frequently, avoiding close contact with sick individuals, and covering their mouth and nose when they cough or sneeze.",
            "Is there anything else I can do to prevent getting Influenza?",
            "Yes, you can boost your immune system by eating a healthy diet, getting plenty of rest, and exercising regularly.",
            "What should I do if someone in my family gets Influenza?",
            "If someone in your family gets Influenza, they should stay home and avoid contact with other people to prevent spreading the virus. They should also rest and drink plenty of fluids.",
            "Thank you for your advice, Medi!"
        ],
        "knowledge": "Influenza Influenza The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion. These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose. Coughing is the most common symptom. Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children. The standard influenza symptoms typically last for 2 - 8 days. A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "No, that's all. Thank you for your help!"
    }
]