[
    {
        "dialog": [
            "Hi Medi, I think I might have swine flu, can you help me?",
            "Sure, what are your symptoms?",
            "I have a fever, a cough, and I feel really tired.",
            "These symptoms are common with swine flu. It's important to get plenty of rest and fluids.",
            "How can I avoid spreading swine flu?",
            "Wash your hands regularly, cover your mouth when you cough or sneeze, and avoid close contact with others.",
            "Is swine flu serious?",
            "It can be, especially for high-risk groups like the elderly, young children, and pregnant women.",
            "What are the high-risk groups?"
        ],
        "knowledge": "Influenza Influenza  Prevention and control measures include inactivated vaccines and culling infected herds.  The influenza viruses usually responsible for swine flu are IAV subtypes H1N1, H1N2, and H3N2. Some IAVs can be transmitted via aerosols from pigs to humans and vice versa.  Furthermore, pigs, along with bats and quails, are recognized as a mixing vessel of influenza viruses because they have both α-2,3 and α-2,6 sialic acid receptors in their respiratory tract.  Because of that, both avian and mammalian influenza viruses can infect pigs.  If co-infection occurs, then reassortment is possible.  A notable example of this was the reassortment of a swine, avian, and human influenza virus in 2009, resulting in a novel H1N1 strain that caused the 2009 flu pandemic Influenza Influenza",
        "response": "High-risk groups include the elderly, young children, and pregnant women."
    },
    {
        "dialog": [
            "Hi Medi, can you tell me more about influenza?",
            "Sure, what would you like to know?",
            "What are the symptoms of the flu?",
            "Common symptoms include a fever, cough, sore throat, runny or stuffy nose, body aches, headache, chills, and fatigue.",
            "How is the flu transmitted?",
            "The flu is highly contagious and can be transmitted through droplets when someone with the virus coughs, sneezes, or talks.",
            "How can I prevent getting the flu?",
            "The best way to prevent the flu is to get vaccinated every year and practice good hygiene like washing your hands regularly.",
            "Is there a cure for the flu?"
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "It's not always necessary to see a doctor if you have the flu, but it's important to monitor your symptoms and seek medical attention if they worsen or you develop complications."
    },
    {
        "dialog": [
            "Hi Medi, I recently got over the flu. Do you have any advice for recovery?",
            "Sure, getting plenty of rest and fluids is key to recovering from the flu.",
            "Are there any foods or beverages I should avoid?",
            "Avoid alcohol and caffeine, which can dehydrate you. Stick to water, tea, or other non-caffeinated beverages.",
            "What kind of physical activity can I do while recovering?",
            "Light exercise like walking or stretching can help speed up recovery, but avoid strenuous activity.",
            "How long does it take to fully recover from the flu?",
            "It can take up to two weeks to fully recover from the flu, depending on the severity of your symptoms.",
            "Can I still spread the flu after I've recovered?"
        ],
        "knowledge": "Influenza Influenza  Prevention and control measures include inactivated vaccines and culling infected herds.  The influenza viruses usually responsible for swine flu are IAV subtypes H1N1, H1N2, and H3N2. Some IAVs can be transmitted via aerosols from pigs to humans and vice versa.  Furthermore, pigs, along with bats and quails, are recognized as a mixing vessel of influenza viruses because they have both α-2,3 and α-2,6 sialic acid receptors in their respiratory tract.  Because of that, both avian and mammalian influenza viruses can infect pigs.  If co-infection occurs, then reassortment is possible.  A notable example of this was the reassortment of a swine, avian, and human influenza virus in 2009, resulting in a novel H1N1 strain that caused the 2009 flu pandemic Influenza Influenza",
        "response": "It's possible to spread the flu for up to seven days after symptoms first appear, so continue practicing good hygiene to avoid spreading the illness."
    },
    {
        "dialog": [
            "Hi Medi, I have a cough and fever these days. What should I do?",
            "Hello, you may have caught the flu, so stay home and rest. Drink plenty of fluids.",
            "Do I need to go to the hospital?",
            "Not necessarily. Take some over the counter flu medicine and if symptoms persist for more than a week, then you should see a doctor.",
            "Okay, thank you for your advice. How can I prevent the flu?",
            "Make sure to get a flu shot every year. Wash your hands frequently and avoid close contact with sick people.",
            "Got it. Thanks, Medi.",
            "You're welcome. Take care of yourself.",
            "Does the flu shot have side effects?"
        ],
        "knowledge": "Influenza Influenza  Prevention and control measures include inactivated vaccines and culling infected herds.  The influenza viruses usually responsible for swine flu are IAV subtypes H1N1, H1N2, and H3N2. Some IAVs can be transmitted via aerosols from pigs to humans and vice versa.  Furthermore, pigs, along with bats and quails, are recognized as a mixing vessel of influenza viruses because they have both α-2,3 and α-2,6 sialic acid receptors in their respiratory tract.  Because of that, both avian and mammalian influenza viruses can infect pigs.  If co-infection occurs, then reassortment is possible.  A notable example of this was the reassortment of a swine, avian, and human influenza virus in 2009, resulting in a novel H1N1 strain that caused the 2009 flu pandemic Influenza Influenza",
        "response": "Some people might experience a low-grade fever or muscle aches after getting the flu shot, but it is usually mild and goes away on its own."
    },
    {
        "dialog": [
            "Hi Medi, can you tell me about the swine flu?",
            "Sure. Swine flu is a respiratory disease caused by influenza viruses that infect the respiratory tract of pigs.",
            "Can humans catch it?",
            "Yes, people who work with pigs or visit pig farms can catch it. It can also spread from person to person.",
            "How can we prevent it?",
            "There is a vaccine for swine flu that can be given to pigs. People can also get a flu shot that protects against swine flu.",
            "Is it dangerous?",
            "Swine flu can be dangerous, especially for people who have weak immune systems or underlying health conditions. It can lead to pneumonia and other complications.",
            "Okay, thanks for the information. Do I need to worry about catching it?"
        ],
        "knowledge": "Influenza Influenza  Prevention and control measures include inactivated vaccines and culling infected herds.  The influenza viruses usually responsible for swine flu are IAV subtypes H1N1, H1N2, and H3N2. Some IAVs can be transmitted via aerosols from pigs to humans and vice versa.  Furthermore, pigs, along with bats and quails, are recognized as a mixing vessel of influenza viruses because they have both α-2,3 and α-2,6 sialic acid receptors in their respiratory tract.  Because of that, both avian and mammalian influenza viruses can infect pigs.  If co-infection occurs, then reassortment is possible.  A notable example of this was the reassortment of a swine, avian, and human influenza virus in 2009, resulting in a novel H1N1 strain that caused the 2009 flu pandemic Influenza Influenza",
        "response": "You're welcome. Let me know if you have any other questions."
    },
    {
        "dialog": [
            "Hi Medi, I recently had surgery. Can you give me advice on my recovery?",
            "Of course. First, make sure to follow your doctor's instructions and take any prescribed medication.",
            "What about physical activity?",
            "You should rest for a few days after surgery, but then start with light exercise, such as walking.",
            "What about my diet?",
            "Make sure to eat a balanced diet with plenty of protein and fiber to help with healing.",
            "Are there any foods I should avoid?",
            "Avoid processed foods, sugary drinks, and excessive alcohol. Also, make sure to stay hydrated.",
            "Thanks for the advice, Medi."
        ],
        "knowledge": "Influenza Influenza  Prevention and control measures include inactivated vaccines and culling infected herds.  The influenza viruses usually responsible for swine flu are IAV subtypes H1N1, H1N2, and H3N2. Some IAVs can be transmitted via aerosols from pigs to humans and vice versa.  Furthermore, pigs, along with bats and quails, are recognized as a mixing vessel of influenza viruses because they have both α-2,3 and α-2,6 sialic acid receptors in their respiratory tract.  Because of that, both avian and mammalian influenza viruses can infect pigs.  If co-infection occurs, then reassortment is possible.  A notable example of this was the reassortment of a swine, avian, and human influenza virus in 2009, resulting in a novel H1N1 strain that caused the 2009 flu pandemic Influenza Influenza",
        "response": "There is always a risk with any surgery, such as bleeding, infection, or complications from anesthesia. However, your doctor will take steps to minimize these risks and ensure a safe recovery."
    },
    {
        "dialog": [
            "Hi Medi, I have a running nose and a sore throat.",
            "Hello, based on your symptoms, you may have caught a cold.",
            "What should I do to get better?",
            "You can try over-the-counter medications to relieve your symptoms or use home remedies like drinking warm liquids and getting plenty of rest.",
            "What if my symptoms persist?",
            "If your symptoms persist for more than a week or get worse, you should consult a doctor.",
            "Okay, thanks. Are there any preventive measures to avoid getting a cold?",
            "Washing your hands regularly, avoiding close contact with people who are sick, and keeping your immune system strong can help prevent catching a cold.",
            "Got it. Thanks, Medi."
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "You're welcome. Stay safe and don't hesitate to come back if your symptoms worsen or persist."
    },
    {
        "dialog": [
            "Medi, what are the symptoms of swine flu?",
            "The symptoms of swine flu are similar to those of the regular flu, including fever, cough, sore throat, body aches, headache, chills, and fatigue.",
            "How is swine flu transmitted?",
            "Swine flu can be transmitted through contact with infected pigs, but it can also be transmitted from person to person through respiratory droplets.",
            "What can I do to prevent getting swine flu?",
            "You can get vaccinated, avoid contact with infected pigs, wash your hands frequently, and avoid close contact with people who are sick.",
            "What should I do if I think I have swine flu?",
            "If you think you have swine flu, you should see a doctor right away. Treatment with antiviral medications can help reduce the severity and duration of symptoms.",
            "Thanks, Medi. Is there anything else I should know about swine flu?"
        ],
        "knowledge": "Influenza Influenza  Prevention and control measures include inactivated vaccines and culling infected herds.  The influenza viruses usually responsible for swine flu are IAV subtypes H1N1, H1N2, and H3N2. Some IAVs can be transmitted via aerosols from pigs to humans and vice versa.  Furthermore, pigs, along with bats and quails, are recognized as a mixing vessel of influenza viruses because they have both α-2,3 and α-2,6 sialic acid receptors in their respiratory tract.  Because of that, both avian and mammalian influenza viruses can infect pigs.  If co-infection occurs, then reassortment is possible.  A notable example of this was the reassortment of a swine, avian, and human influenza virus in 2009, resulting in a novel H1N1 strain that caused the 2009 flu pandemic Influenza Influenza",
        "response": "You're welcome. Stay safe and take necessary preventive measures to avoid getting infected."
    },
    {
        "dialog": [
            "Hi Medi, I just recovered from the flu.",
            "That's great to hear! How are you feeling now?",
            "I feel a bit weak and tired. What can I do to regain my strength?",
            "It's important to get enough rest and eat nutritious food to help your body recover. You can also try gentle exercises like stretching and walking to gradually regain your strength.",
            "What kind of food should I eat to help my body recover?",
            "Foods that are high in protein, vitamins, and minerals can help your body recover faster. Examples include lean meats, fish, eggs, dairy products, fruits, vegetables, and whole grains.",
            "What kind of exercises should I avoid?",
            "You should avoid high-intensity exercises or activities that put a lot of strain on your body, such as weightlifting or running.",
            "Okay, thank you for the advice, Medi."
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "You're welcome. Feel free to contact me if you have any further questions or concerns."
    },
    {
        "dialog": [
            "Hi Medi, I think I might have caught the swine flu",
            "Oh no! What are your symptoms?",
            "I have a fever, headache, cough and sore throat, and I feel very tired",
            "Based on your symptoms, it's possible that you have swine flu. You should see a doctor immediately",
            "Is there anything I can do at home to ease the symptoms?",
            "Yes, you can take over-the-counter pain relievers, drink plenty of fluids and get plenty of rest",
            "Okay, thanks for your advice Medi. I will see a doctor and take care of myself",
            "That's a good idea. Swine flu can be very dangerous if left untreated. Be sure to let the doctor know that you suspect you have swine flu",
            "What should I expect from the treatment?"
        ],
        "knowledge": "Influenza Influenza  Prevention and control measures include inactivated vaccines and culling infected herds.  The influenza viruses usually responsible for swine flu are IAV subtypes H1N1, H1N2, and H3N2. Some IAVs can be transmitted via aerosols from pigs to humans and vice versa.  Furthermore, pigs, along with bats and quails, are recognized as a mixing vessel of influenza viruses because they have both α-2,3 and α-2,6 sialic acid receptors in their respiratory tract.  Because of that, both avian and mammalian influenza viruses can infect pigs.  If co-infection occurs, then reassortment is possible.  A notable example of this was the reassortment of a swine, avian, and human influenza virus in 2009, resulting in a novel H1N1 strain that caused the 2009 flu pandemic Influenza Influenza",
        "response": "The treatment for swine flu usually involves antiviral medications, rest, and plenty of fluids. The antiviral medications can help reduce the severity of the symptoms and shorten the duration of the illness"
    },
    {
        "dialog": [
            "Hi Medi, I have some questions about swine flu",
            "Sure, I'm here to help. What do you want to know?",
            "How is swine flu different from regular flu?",
            "Swine flu is caused by the H1N1 virus, which is a strain of the influenza A virus. It's different from the regular flu because it's transmitted from pigs to humans, and has different symptoms and treatment",
            "Can people die from swine flu?",
            "Yes, people can die from swine flu, especially those who have weakened immune systems or underlying health problems",
            "Is there a vaccine for swine flu?",
            "Yes, there is a vaccine for swine flu. It's recommended for people who are at higher risk of getting the virus",
            "What are the symptoms of swine flu?"
        ],
        "knowledge": "Influenza Influenza  Prevention and control measures include inactivated vaccines and culling infected herds.  The influenza viruses usually responsible for swine flu are IAV subtypes H1N1, H1N2, and H3N2. Some IAVs can be transmitted via aerosols from pigs to humans and vice versa.  Furthermore, pigs, along with bats and quails, are recognized as a mixing vessel of influenza viruses because they have both α-2,3 and α-2,6 sialic acid receptors in their respiratory tract.  Because of that, both avian and mammalian influenza viruses can infect pigs.  If co-infection occurs, then reassortment is possible.  A notable example of this was the reassortment of a swine, avian, and human influenza virus in 2009, resulting in a novel H1N1 strain that caused the 2009 flu pandemic Influenza Influenza",
        "response": "Yes, there are several things you can do to prevent getting swine flu, such as washing your hands frequently, avoiding contact with sick people, covering your nose and mouth when you cough or sneeze, and getting vaccinated if you're in a high-risk group"
    },
    {
        "dialog": [
            "Hi Medi, I just recovered from swine flu. What should I do now?",
            "Congratulations on your recovery! You should take some precautions to avoid getting sick again and help your body recover",
            "What kind of precautions should I take?",
            "You should get plenty of rest, drink plenty of fluids, and eat a healthy diet. You should also avoid contact with sick people and wash your hands frequently",
            "Is there anything else I can do to help my body recover?",
            "Yes, you can do some light exercise and stretching to help improve your circulation and boost your immune system. You should also avoid smoking and limit your alcohol and caffeine intake",
            "Thank you for your advice, Medi. Is there anything else I should be aware of?",
            "Yes, you should be aware that swine flu can have long-term effects on your health, especially if you had severe symptoms. You should see a doctor if you have any ongoing symptoms or concerns",
            "Okay, I will be sure to keep that in mind. Thank you for your help, Medi"
        ],
        "knowledge": "Influenza Influenza  Prevention and control measures include inactivated vaccines and culling infected herds.  The influenza viruses usually responsible for swine flu are IAV subtypes H1N1, H1N2, and H3N2. Some IAVs can be transmitted via aerosols from pigs to humans and vice versa.  Furthermore, pigs, along with bats and quails, are recognized as a mixing vessel of influenza viruses because they have both α-2,3 and α-2,6 sialic acid receptors in their respiratory tract.  Because of that, both avian and mammalian influenza viruses can infect pigs.  If co-infection occurs, then reassortment is possible.  A notable example of this was the reassortment of a swine, avian, and human influenza virus in 2009, resulting in a novel H1N1 strain that caused the 2009 flu pandemic Influenza Influenza",
        "response": "Swine flu can have long-term effects on your health, such as respiratory problems, neurological problems, and fatigue. These effects can last for several months or even years after the initial infection"
    },
    {
        "dialog": [
            "Hi Medi, I've been feeling unwell lately and I suspect it's swine flu.",
            "I'm sorry to hear that. What symptoms are you experiencing?",
            "I have a high fever, cough, sore throat and body aches.",
            "Based on your symptoms, it is possible that you have swine flu.",
            "What should I do now?",
            "You should isolate yourself and rest. Drink plenty of fluids and take over-the-counter medications for fever and pain.",
            "Should I get vaccinated?",
            "Yes, it is recommended that you get vaccinated to prevent future infections.",
            "Thank you, Medi. How long will it take for me to recover?"
        ],
        "knowledge": "Influenza Influenza  Prevention and control measures include inactivated vaccines and culling infected herds.  The influenza viruses usually responsible for swine flu are IAV subtypes H1N1, H1N2, and H3N2. Some IAVs can be transmitted via aerosols from pigs to humans and vice versa.  Furthermore, pigs, along with bats and quails, are recognized as a mixing vessel of influenza viruses because they have both α-2,3 and α-2,6 sialic acid receptors in their respiratory tract.  Because of that, both avian and mammalian influenza viruses can infect pigs.  If co-infection occurs, then reassortment is possible.  A notable example of this was the reassortment of a swine, avian, and human influenza virus in 2009, resulting in a novel H1N1 strain that caused the 2009 flu pandemic Influenza Influenza",
        "response": "The recovery time for swine flu typically ranges from 1 to 2 weeks."
    },
    {
        "dialog": [
            "Hi Medi, can you tell me how swine flu is transmitted?",
            "Swine flu can be transmitted through droplets from coughing and sneezing, touching a surface contaminated with the virus, or direct contact with infected pigs.",
            "Can it spread from pigs to humans?",
            "Yes, it can spread from pigs to humans and vice versa.",
            "What can I do to prevent swine flu?",
            "You can prevent swine flu by washing your hands frequently, avoiding contact with sick people or pigs, and getting vaccinated.",
            "Are there any treatments available for swine flu?",
            "Yes, there are antiviral medications that can be prescribed by a doctor to reduce the severity and duration of the symptoms.",
            "Thank you, Medi. Is it safe to eat pork during a swine flu outbreak?"
        ],
        "knowledge": "Influenza Influenza  Prevention and control measures include inactivated vaccines and culling infected herds.  The influenza viruses usually responsible for swine flu are IAV subtypes H1N1, H1N2, and H3N2. Some IAVs can be transmitted via aerosols from pigs to humans and vice versa.  Furthermore, pigs, along with bats and quails, are recognized as a mixing vessel of influenza viruses because they have both α-2,3 and α-2,6 sialic acid receptors in their respiratory tract.  Because of that, both avian and mammalian influenza viruses can infect pigs.  If co-infection occurs, then reassortment is possible.  A notable example of this was the reassortment of a swine, avian, and human influenza virus in 2009, resulting in a novel H1N1 strain that caused the 2009 flu pandemic Influenza Influenza",
        "response": "Yes, it is safe to eat pork as long as it is properly cooked and handled to prevent contamination with the virus."
    },
    {
        "dialog": [
            "Hi Medi, I just recovered from swine flu. What should I do to prevent future infections?",
            "I'm glad to hear that you're feeling better. You can prevent future infections by maintaining good hygiene habits such as washing your hands frequently, avoiding close contact with sick people or pigs, and getting vaccinated.",
            "Is there anything else I can do to boost my immune system?",
            "Yes, you can improve your immune system by eating a healthy diet, getting enough sleep, managing stress, and exercising regularly.",
            "What kind of exercise should I do?",
            "Any form of physical activity is beneficial for your immune system. You can try walking, running, biking, or swimming.",
            "What about supplements?",
            "Some supplements such as vitamin D, zinc, and probiotics may also boost your immune system, but it's important to consult with your doctor before taking any supplements.",
            "Got it. Thank you, Medi!"
        ],
        "knowledge": "Influenza Influenza  Prevention and control measures include inactivated vaccines and culling infected herds.  The influenza viruses usually responsible for swine flu are IAV subtypes H1N1, H1N2, and H3N2. Some IAVs can be transmitted via aerosols from pigs to humans and vice versa.  Furthermore, pigs, along with bats and quails, are recognized as a mixing vessel of influenza viruses because they have both α-2,3 and α-2,6 sialic acid receptors in their respiratory tract.  Because of that, both avian and mammalian influenza viruses can infect pigs.  If co-infection occurs, then reassortment is possible.  A notable example of this was the reassortment of a swine, avian, and human influenza virus in 2009, resulting in a novel H1N1 strain that caused the 2009 flu pandemic Influenza Influenza",
        "response": "You're welcome. Stay healthy and take care of yourself!"
    },
    {
        "dialog": [
            "Hello Medi, I have a fever and cough.",
            "Hello! Can you please tell me when did you start having these symptoms?",
            "I started feeling unwell yesterday and it got worse today.",
            "Do you have any other symptoms besides cough and fever?",
            "Yes, I also have a runny nose and a headache.",
            "Based on your symptoms, it is possible that you have the flu.",
            "What should I do now, Medi?",
            "I recommend that you rest and drink plenty of fluids. You can also take over-the-counter medications to reduce your symptoms.",
            "Okay, thank you for your help. I hope I'll feel better soon."
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "Based on your symptoms, it is possible that you have the flu."
    },
    {
        "dialog": [
            "Hi Medi, I have some questions about swine flu.",
            "Of course! What would you like to know?",
            "What are the symptoms of swine flu?",
            "The symptoms of swine flu are similar to those of the regular flu, including fever, cough, sore throat, body aches, headache, chills, and fatigue.",
            "How is swine flu spread?",
            "Swine flu is spread from person to person through coughing or sneezing of infected people.",
            "Can I get swine flu from eating pork?",
            "No. Swine flu is not spread by eating pork products.",
            "Okay, that's good to know. Thank you, Medi!"
        ],
        "knowledge": "The influenza viruses usually responsible for swine flu are IAV subtypes H1N1, H1N2, and H3N2. Some IAVs can be transmitted via aerosols from pigs to humans and vice versa.  Furthermore, pigs, along with bats and quails, are recognized as a mixing vessel of influenza viruses because they have both α-2,3 and α-2,6 sialic acid receptors in their respiratory tract.  Because of that, both avian and mammalian influenza viruses can infect pigs.  If co-infection occurs, then reassortment is possible.  A notable example of this was the reassortment of a swine, avian, and human influenza virus in 2009, resulting in a novel H1N1 strain that caused the 2009 flu pandemic Influenza Influenza",
        "response": "You're welcome! And no, swine flu is not spread by eating pork products."
    },
    {
        "dialog": [
            "Hello Medi, I just had my flu shot. What should I do next?",
            "Great! You've taken an important step to protect yourself from the flu. You don't need to do anything else.",
            "Can I still get the flu even though I had the flu shot?",
            "It's possible, but the flu shot is still the best way to protect yourself from the flu. Even if you do get the flu after getting the shot, your symptoms will likely be milder.",
            "What if I have an allergic reaction to the flu shot?",
            "Allergic reactions to the flu shot are rare, but if you experience symptoms such as difficulty breathing, wheezing, hives, or swelling of the face or throat, you should seek medical attention immediately.",
            "Okay, thank you for the information.",
            "You're welcome! Stay healthy!"
        ],
        "knowledge": "Prevention and control measures for influenza include inactivated vaccines and culling infected herds. ",
        "response": "You're welcome! And remember, the flu shot is the best way to protect yourself from the flu."
    },
    {
        "dialog": [
            "Hello, Medi. I'm feeling a bit sick with a headache and muscle pain.",
            "I'm sorry to hear that. Have you taken your temperature?",
            "Yes, I have. It's 38 degrees Celsius.",
            "Based on your symptoms and fever, you may have influenza. I recommend rest and fluids.",
            "Should I take any medication?",
            "You can take acetaminophen or ibuprofen for pain and fever, but it's best to check with your doctor first.",
            "Okay, thank you for your help, Medi.",
            "You're welcome. Don't hesitate to contact me if you have any other concerns."
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "Yes, you should take acetaminophen or ibuprofen for pain and fever, but it's best to check with your doctor first."
    },
    {
        "dialog": [
            "Hi Medi, can you give me some information about influenza?",
            "Of course. Influenza is a viral infection that affects the respiratory system.",
            "What are the symptoms of influenza?",
            "The symptoms include fever, cough, sore throat, runny or stuffy nose, body aches, headache, chills, and fatigue.",
            "How is influenza transmitted?",
            "Influenza can be transmitted through the air by coughing and sneezing, or by touching surfaces contaminated with the virus.",
            "How can I prevent influenza?",
            "The best way to prevent influenza is to get vaccinated every year. You can also avoid close contact with infected individuals and practice good hand hygiene.",
            "Thank you, Medi. You're very informative."
        ],
        "knowledge": "Influenza Influenza  Prevention and control measures include inactivated vaccines and culling infected herds.  The influenza viruses usually responsible for swine flu are IAV subtypes H1N1, H1N2, and H3N2. Some IAVs can be transmitted via aerosols from pigs to humans and vice versa.  Furthermore, pigs, along with bats and quails, are recognized as a mixing vessel of influenza viruses because they have both α-2,3 and α-2,6 sialic acid receptors in their respiratory tract.  Because of that, both avian and mammalian influenza viruses can infect pigs.  If co-infection occurs, then reassortment is possible.  A notable example of this was the reassortment of a swine, avian, and human influenza virus in 2009, resulting in a novel H1N1 strain that caused the 2009 flu pandemic Influenza Influenza",
        "response": "You're welcome. Stay healthy!"
    },
    {
        "dialog": [
            "Hello, Medi. I recently had a medical procedure and I'm wondering about my diet and exercise.",
            "Of course. What procedure did you have?",
            "I had surgery to remove my gallbladder.",
            "After the surgery, it's best to stick to a low-fat diet to avoid discomfort. You can gradually add in more fats over time.",
            "What kind of exercise can I do?",
            "You can start with light exercise like walking and gradually increase the intensity over time. It's best to avoid heavy lifting or strenuous activity for a few weeks.",
            "Are there any foods I should avoid?",
            "You should avoid fatty and greasy foods, as well as spicy and acidic foods that can irritate your digestive system.",
            "Thank you for your advice, Medi."
        ],
        "knowledge": "Gallstone Gallstone  The most common treatment for gallstones is surgical removal of the gallbladder.  After the surgery, it is recommended to stick to a low-fat diet to avoid discomfort and gradually add in more fats over time.  Light exercise like walking is recommended, but heavy lifting should be avoided for a few weeks.  Foods to avoid include fatty and greasy foods, as well as spicy and acidic foods that can irritate the digestive system Gallstone Gallstone",
        "response": "You're welcome. Take care of yourself!"
    },
    {
        "dialog": [
            "Hello Medi, I have a cough and I'm worried.",
            "Hello, I am Medi. Please describe the symptoms you are feeling.",
            "I have a cough that doesn't seem to go away, and my throat is sore.",
            "How long have you had these symptoms?",
            "For about 5 days now.",
            "Do you have any other symptoms like fever, chest pain, or shortness of breath?",
            "No, just the cough and sore throat.",
            "Based on your symptoms, it seems like you have a common cold. Rest and drink plenty of fluids.",
            "What should I do if it doesn't get better?"
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "If it doesn't get better, you should consult your doctor for further evaluation and treatment."
    },
    {
        "dialog": [
            "Hi Medi, I just got vaccinated for the flu, what should I expect?",
            "Hi, I am Medi. After getting the flu vaccine, you may experience mild side effects like soreness or redness at the injection site, low-grade fever, or muscle aches.",
            "How long will these side effects last?",
            "Usually, these side effects will go away on their own within a few days.",
            "Can I still get the flu after getting vaccinated?",
            "Yes, it is still possible to get the flu after getting vaccinated, but the severity and duration of the illness will be much less severe.",
            "How often do I need to get the flu vaccine?",
            "You should get the flu vaccine every year, ideally in the fall before the flu season starts.",
            "Thank you for the information, Medi. Is there anything else I should know?"
        ],
        "knowledge": "Influenza Influenza  Prevention and control measures include inactivated vaccines and culling infected herds.  The influenza viruses usually responsible for swine flu are IAV subtypes H1N1, H1N2, and H3N2. Some IAVs can be transmitted via aerosols from pigs to humans and vice versa.  Furthermore, pigs, along with bats and quails, are recognized as a mixing vessel of influenza viruses because they have both α-2,3 and α-2,6 sialic acid receptors in their respiratory tract.  Because of that, both avian and mammalian influenza viruses can infect pigs.  If co-infection occurs, then reassortment is possible.  A notable example of this was the reassortment of a swine, avian, and human influenza virus in 2009, resulting in a novel H1N1 strain that caused the 2009 flu pandemic Influenza Influenza",
        "response": "You're welcome, stay healthy!"
    },
    {
        "dialog": [
            "Hi Medi, I just had surgery and I'm not sure how to take care of myself.",
            "Hi, I am Medi. What kind of surgery did you have?",
            "I had knee surgery and I'm not sure what exercises I should do.",
            "Did your doctor give you any post-surgery instructions or a physical therapy plan?",
            "Yes, my doctor gave me some exercises to do but I'm not sure if they're the right ones.",
            "It's important to follow your doctor's instructions and physical therapy plan to ensure proper healing and recovery.",
            "What kind of exercises should I be doing?",
            "Your physical therapy plan should include exercises to improve strength, flexibility, and range of motion. You should also avoid any high-impact activities or movements that may cause pain or discomfort.",
            "How long will it take for me to recover?"
        ],
        "knowledge": "Influenza Influenza  Prevention and control measures include inactivated vaccines and culling infected herds.  The influenza viruses usually responsible for swine flu are IAV subtypes H1N1, H1N2, and H3N2. Some IAVs can be transmitted via aerosols from pigs to humans and vice versa.  Furthermore, pigs, along with bats and quails, are recognized as a mixing vessel of influenza viruses because they have both α-2,3 and α-2,6 sialic acid receptors in their respiratory tract.  Because of that, both avian and mammalian influenza viruses can infect pigs.  If co-infection occurs, then reassortment is possible.  A notable example of this was the reassortment of a swine, avian, and human influenza virus in 2009, resulting in a novel H1N1 strain that caused the 2009 flu pandemic Influenza Influenza",
        "response": "You're welcome. Wishing you a speedy and full recovery!"
    },
    {
        "dialog": [
            "Hi Medi, I think I might have swine flu.",
            "Okay, let me help you figure out what might be going on.",
            "I have a fever and a headache.",
            "Have you been around pigs recently or in contact with anyone who has?",
            "No, I haven't.",
            "Well, based on your symptoms, it could be the flu, but not necessarily swine flu.",
            "What should I do now, Medi?",
            "You should rest, drink fluids, and take over-the-counter medication to relieve your symptoms. If they persist, see a doctor.",
            "Okay, thank you. How can I prevent getting swine flu?"
        ],
        "knowledge": "Influenza Influenza Prevention and control measures include inactivated vaccines and culling infected herds. The influenza viruses usually responsible for swine flu are IAV subtypes H1N1, H1N2, and H3N2. Some IAVs can be transmitted via aerosols from pigs to humans and vice versa. Furthermore, pigs, along with bats and quails, are recognized as a mixing vessel of influenza viruses because they have both α-2,3 and α-2,6 sialic acid receptors in their respiratory tract. Because of that, both avian and mammalian influenza viruses can infect pigs. If co-infection occurs, then reassortment is possible. A notable example of this was the reassortment of a swine, avian, and human influenza virus in 2009, resulting in a novel H1N1 strain that caused the 2009 flu pandemic Influenza Influenza",
        "response": "You can prevent getting swine flu by avoiding contact with pigs and people who are sick with the flu, washing your hands frequently, and getting vaccinated."
    },
    {
        "dialog": [
            "Hi Medi, can you tell me more about swine flu?",
            "Sure, what would you like to know?",
            "What makes swine flu different from other types of flu?",
            "Swine flu is caused by influenza viruses that typically affect pigs, but can also be transmitted to humans. The symptoms are similar to those of regular flu, but can be more severe.",
            "How do people get swine flu?",
            "People can get swine flu by being in close contact with infected pigs or by inhaling droplets from an infected person sneezing or coughing.",
            "Is there a vaccine for swine flu?",
            "Yes, there is a vaccine for swine flu. It is recommended for people who are at high risk of getting the flu.",
            "Who is considered high risk?"
        ],
        "knowledge": "Influenza Influenza Prevention and control measures include inactivated vaccines and culling infected herds. The influenza viruses usually responsible for swine flu are IAV subtypes H1N1, H1N2, and H3N2. Some IAVs can be transmitted via aerosols from pigs to humans and vice versa. Furthermore, pigs, along with bats and quails, are recognized as a mixing vessel of influenza viruses because they have both α-2,3 and α-2,6 sialic acid receptors in their respiratory tract. Because of that, both avian and mammalian influenza viruses can infect pigs. If co-infection occurs, then reassortment is possible. A notable example of this was the reassortment of a swine, avian, and human influenza virus in 2009, resulting in a novel H1N1 strain that caused the 2009 flu pandemic Influenza Influenza",
        "response": "People who are at high risk of getting swine flu include children under 5, pregnant women, people over 65, and people with chronic medical conditions."
    },
    {
        "dialog": [
            "Hi Medi, I just recovered from swine flu. What should I do now?",
            "Congratulations on your recovery! It's important to take care of yourself and to prevent the flu from spreading to others.",
            "What kind of care should I take?",
            "Get plenty of rest, drink fluids, and avoid contact with others until you have been fever-free for 24 hours without the use of fever-reducing medication.",
            "Are there any long-term effects of having swine flu?",
            "In most cases, people recover fully from swine flu with no long-term effects. However, in some cases, complications such as pneumonia can occur.",
            "What can I do to prevent getting the flu again?",
            "Wash your hands frequently, cover your mouth when you cough or sneeze, and get vaccinated.",
            "Is it safe to be around other people now?"
        ],
        "knowledge": "Influenza Influenza Prevention and control measures include inactivated vaccines and culling infected herds. The influenza viruses usually responsible for swine flu are IAV subtypes H1N1, H1N2, and H3N2. Some IAVs can be transmitted via aerosols from pigs to humans and vice versa. Furthermore, pigs, along with bats and quails, are recognized as a mixing vessel of influenza viruses because they have both α-2,3 and α-2,6 sialic acid receptors in their respiratory tract. Because of that, both avian and mammalian influenza viruses can infect pigs. If co-infection occurs, then reassortment is possible. A notable example of this was the reassortment of a swine, avian, and human influenza virus in 2009, resulting in a novel H1N1 strain that caused the 2009 flu pandemic Influenza Influenza",
        "response": "It is safe to be around other people now if you have been fever-free for 24 hours without the use of fever-reducing medication and your symptoms have improved. Just remember to continue practicing good hygiene and to cover your mouth when you cough or sneeze."
    }
]