[
    {
        "dialog": [
            "Hi Medi, I've been experiencing some symptoms lately.",
            "Sure, I'm here to help. What symptoms are you experiencing?",
            "I've been feeling really fatigued and have been having a poor appetite.",
            "I see. How long have you had these symptoms?",
            "It's been going on for about a week now.",
            "Have you noticed any other symptoms?",
            "Yes, I've also been having pain in my abdomen and dark urine.",
            "Based on your symptoms, it's possible that you may have hepatitis E.",
            "What can I do if I have hepatitis E?"
        ],
        "knowledge": "Hepatitis E is a viral infection that affects the liver. It can cause symptoms such as fatigue, poor appetite, abdominal pain, dark urine, and jaundice. The infection is usually self-limiting and does not require specific treatment. Resting, staying hydrated, and avoiding alcohol are important. It's best to consult a healthcare professional for a proper diagnosis and guidance.",
        "response": "If you have hepatitis E, it's important to rest, stay hydrated, and avoid alcohol. I recommend consulting a healthcare professional for further guidance."
    },
    {
        "dialog": [
            "Hey Medi, I've been reading about hepatitis E and have some questions.",
            "Of course, I'm here to help. What would you like to know?",
            "I'm curious about how hepatitis E is transmitted.",
            "Hepatitis E is primarily transmitted through the fecal-oral route.",
            "Is there any other way it can be transmitted?",
            "In some cases, it can be transmitted through contaminated water or food.",
            "Is there a vaccine available for hepatitis E?",
            "Yes, there is a vaccine available for hepatitis E, but it is not widely used.",
            "Thank you for answering my questions, Medi. I appreciate it."
        ],
        "knowledge": "Hepatitis E is primarily transmitted through the fecal-oral route, meaning it is spread through contaminated fecal matter entering the mouth. In some cases, it can also be transmitted through contaminated water or food. There is a vaccine available for hepatitis E, but it is not widely used.",
        "response": "You're welcome! If you have any more questions, feel free to ask."
    },
    {
        "dialog": [
            "Hi Medi, I recently had a medical procedure related to hepatitis E. Can you give me some advice?",
            "Sure, I'm here to help. What specific advice are you looking for?",
            "I'm wondering if there are any lifestyle changes or dietary recommendations I should follow.",
            "It's important to maintain a healthy lifestyle and avoid alcohol consumption.",
            "Are there any specific foods I should include or avoid in my diet?",
            "A balanced diet with plenty of fruits and vegetables is recommended. It's best to avoid fatty and fried foods.",
            "What about physical exercise? Is there anything I should be doing?",
            "Regular exercise is beneficial for overall health. Consult your healthcare professional for specific exercise recommendations.",
            "Thank you, Medi. I appreciate your advice."
        ],
        "knowledge": "For individuals with hepatitis E, maintaining a healthy lifestyle is important. This includes avoiding alcohol consumption, following a balanced diet with plenty of fruits and vegetables, and avoiding fatty and fried foods. Regular exercise is also beneficial for overall health. It's best to consult your healthcare professional for specific recommendations tailored to your condition.",
        "response": "You're welcome! If you have any more questions or need further guidance, feel free to ask."
    },
    {
        "dialog": [
            "Hi Medi, I've been experiencing some symptoms lately and I need your help.",
            "Of course, I'm here to assist you. What symptoms are you experiencing?",
            "I've been feeling very fatigued and have had a loss of appetite.",
            "I see. How long have you been experiencing these symptoms?",
            "It's been going on for about a week now.",
            "Have you recently traveled or been in contact with anyone who is sick?",
            "No, I haven't traveled and I haven't been in contact with anyone who is sick.",
            "Based on your symptoms, it's possible that you may have Hepatitis E.",
            "What is Hepatitis E and how is it transmitted?"
        ],
        "knowledge": "Hepatitis E is a viral liver infection caused by the Hepatitis E virus. It is usually spread through contaminated food and water. Poor sanitation and hygiene practices can contribute to the spread of the virus. The symptoms of Hepatitis E include fatigue, loss of appetite, nausea, abdominal pain, and jaundice.",
        "response": "Hepatitis E is a viral liver infection that is usually spread through contaminated food and water. Poor sanitation and hygiene practices can contribute to its transmission."
    },
    {
        "dialog": [
            "Hey Medi, I have a question about Hepatitis E.",
            "Sure, I'm here to provide you with information. What do you want to know?",
            "How common is Hepatitis E?",
            "Hepatitis E is quite common globally, especially in areas with poor sanitation and hygiene.",
            "Is there a vaccine available for Hepatitis E?",
            "Yes, there is a vaccine available for Hepatitis E, but it may not be widely used in all countries.",
            "What are the long-term effects of Hepatitis E?",
            "In most cases, Hepatitis E resolves on its own without causing any long-term effects.",
            "That's good to know. Thank you, Medi."
        ],
        "knowledge": "Hepatitis E is usually a self-limiting infection, meaning it resolves on its own without causing any long-term effects. However, in rare cases, it can lead to chronic hepatitis or other complications.",
        "response": "In most cases, Hepatitis E resolves on its own without causing any long-term effects."
    },
    {
        "dialog": [
            "Hi Medi, I recently had a medical procedure related to Hepatitis E and I need some advice.",
            "Of course, I'm here to help. What advice do you need?",
            "I would like to know if there are any dietary restrictions I should follow.",
            "There are no specific dietary restrictions for Hepatitis E. However, it's important to maintain a healthy diet to support your overall liver health.",
            "Are there any lifestyle changes I should make?",
            "It's important to practice good hygiene and sanitation to prevent the spread of Hepatitis E. Avoid consuming contaminated food and water.",
            "Thank you for the advice, Medi.",
            "You're welcome. If you have any other questions, feel free to ask.",
            "Actually, I have one more question. Can Hepatitis E be cured?"
        ],
        "knowledge": "Hepatitis E is usually a self-limiting infection, meaning it resolves on its own without the need for specific treatment. However, severe cases may require medical intervention.",
        "response": "In most cases, Hepatitis E resolves on its own without the need for specific treatment. However, severe cases may require medical intervention."
    },
    {
        "dialog": [
            "Hello Medi, I have some symptoms that concern me.",
            "I'm here to help. Please tell me about your symptoms.",
            "I have been experiencing fatigue, loss of appetite, and dark urine.",
            "Based on your symptoms, it's possible that you have hepatitis E.",
            "What should I do next to confirm the diagnosis?",
            "I recommend visiting a healthcare professional for further testing and evaluation.",
            "Are there any specific treatments for hepatitis E?",
            "There is no specific treatment for hepatitis E. Rest and staying hydrated are important.",
            "How long does it usually take to recover from hepatitis E?"
        ],
        "knowledge": "Hepatitis E is a viral infection that causes liver inflammation. Symptoms include fatigue, loss of appetite, dark urine, and jaundice. It is spread through contaminated food and water. Most cases of hepatitis E resolve on their own within a few weeks to a couple of months.",
        "response": "Recovery time varies, but most people with hepatitis E recover within a few weeks to a couple of months."
    },
    {
        "dialog": [
            "Hi Medi, I have a question about hepatitis E.",
            "I'm here to provide answers. What would you like to know?",
            "How is hepatitis E transmitted?",
            "Hepatitis E is primarily transmitted through contaminated food and water.",
            "Is there a vaccine available for hepatitis E?",
            "Yes, there is a vaccine available for hepatitis E, but it is not widely used.",
            "What are the symptoms of hepatitis E?",
            "Symptoms of hepatitis E include fatigue, loss of appetite, jaundice, and dark urine.",
            "Can hepatitis E be cured?"
        ],
        "knowledge": "Hepatitis E is a viral infection that causes liver inflammation. It is usually a self-limiting disease, meaning it resolves on its own without treatment. However, in rare cases, it can lead to severe liver disease and be fatal.",
        "response": "Most cases of hepatitis E resolve on their own without treatment. However, in rare cases, it can lead to severe liver disease."
    },
    {
        "dialog": [
            "Hello Medi, I recently had a medical procedure related to hepatitis E.",
            "I'm here to provide guidance. What do you need advice on?",
            "I'm concerned about my diet after the procedure. Are there any specific restrictions?",
            "It's important to follow a healthy diet that supports liver health. Avoid alcohol and fatty foods.",
            "What type of physical exercise can I do after the procedure?",
            "Engaging in light to moderate physical activity, such as walking or gentle yoga, is usually safe.",
            "Are there any lifestyle changes I should consider to prevent hepatitis E from recurring?",
            "Practicing good hygiene, such as washing hands thoroughly and avoiding contaminated food, can help prevent hepatitis E.",
            "How long does it usually take to fully recover from the procedure?"
        ],
        "knowledge": "Recovery time after a medical procedure related to hepatitis E can vary depending on the individual and the specific procedure performed. It's best to follow your healthcare provider's instructions and attend follow-up appointments for a proper recovery.",
        "response": "Recovery time can vary, so it's important to follow your healthcare provider's instructions for a proper recovery."
    },
    {
        "dialog": [
            "Hi Medi, I've been experiencing some symptoms lately.",
            "Sure, I'm here to help. What are the symptoms you're experiencing?",
            "I've been feeling tired all the time and have a loss of appetite.",
            "I see. How long have you been experiencing these symptoms?",
            "It started about a week ago and hasn't improved.",
            "Okay. Based on your symptoms, it's possible that you may have Hepatitis E.",
            "What is Hepatitis E exactly?",
            "Hepatitis E is a viral infection that affects the liver. It can cause fatigue, loss of appetite, and other symptoms.",
            "Is it a serious condition? What should I do next?"
        ],
        "knowledge": "Hepatitis E is a viral infection that affects the liver. It can cause fatigue, loss of appetite, and other symptoms. It's important to see a healthcare professional for proper diagnosis and treatment.",
        "response": "Hepatitis E can be serious, especially in certain populations. I recommend scheduling an appointment with a healthcare professional for further evaluation and guidance."
    },
    {
        "dialog": [
            "Hi Medi, I recently traveled to Namibia and I'm concerned about Hepatitis E.",
            "I understand your concern. Did you experience any symptoms or potential exposure to the virus?",
            "I haven't noticed any symptoms, but I heard there was an outbreak in Namibia.",
            "It's good that you're aware. Hepatitis E is indeed a concern in Namibia, with an outbreak reported. It's important to practice good hygiene and avoid consuming contaminated food or water.",
            "What are the symptoms of Hepatitis E, just in case?",
            "Symptoms of Hepatitis E can include fatigue, jaundice, abdominal pain, nausea, and vomiting. If you experience any of these symptoms, it's important to seek medical attention.",
            "Thank you for the information, Medi. I'll be cautious and monitor my health.",
            "You're welcome. Remember to stay hydrated and practice good hygiene during your travels.",
            "I will. One last question, how is Hepatitis E transmitted?"
        ],
        "knowledge": "Hepatitis E can be transmitted through contaminated food or water, especially in areas with poor sanitation. It can also be transmitted through the consumption of undercooked or raw meat from infected animals.",
        "response": "Hepatitis E is primarily transmitted through consuming contaminated food or water, as well as through the consumption of undercooked or raw meat from infected animals."
    },
    {
        "dialog": [
            "Hi Medi, I recently recovered from Hepatitis E. What should I do to maintain my health?",
            "Congratulations on your recovery. It's important to take care of your health post-recovery. What specific concerns or questions do you have?",
            "I'm worried about the long-term effects and potential recurrence of Hepatitis E.",
            "Most people recover from Hepatitis E without long-term complications. However, it's important to continue practicing good hygiene, maintaining a healthy diet, and avoiding alcohol to support liver health.",
            "That's reassuring. Are there any dietary recommendations or restrictions?",
            "A balanced and healthy diet is recommended, including plenty of fruits, vegetables, whole grains, and lean proteins. It's also important to limit processed foods and saturated fats.",
            "I'll make sure to follow those guidelines. Is there anything else I should be aware of?",
            "Regular check-ups with your healthcare provider are important to monitor your liver health and address any potential concerns. If you have any symptoms or concerns, don't hesitate to seek medical attention.",
            "Thank you for your guidance, Medi. I appreciate your support."
        ],
        "knowledge": "After recovering from Hepatitis E, it's important to maintain a healthy lifestyle, including regular exercise, a balanced diet, and avoiding alcohol. Regular check-ups with a healthcare provider are also recommended to monitor liver health.",
        "response": "You're welcome! Remember to follow a healthy diet, exercise regularly, and attend regular check-ups to ensure your long-term health after recovering from Hepatitis E."
    },
    {
        "dialog": [
            "Hi Medi, I have been feeling really sick lately.",
            "I'm here to help. Can you describe your symptoms?",
            "I've been experiencing nausea, abdominal pain, and fatigue.",
            "Based on your symptoms, it's possible that you have Hepatitis E.",
            "Oh no, how is Hepatitis E transmitted?",
            "Hepatitis E can be transmitted through contaminated food or water.",
            "I see. What can I do to treat Hepatitis E?",
            "Most cases of Hepatitis E resolve on their own. Rest and stay hydrated.",
            "Is there anything else I should know about Hepatitis E?"
        ],
        "knowledge": "Hepatitis E is a viral infection that affects the liver. It can cause symptoms such as nausea, abdominal pain, and fatigue. The virus is primarily transmitted through contaminated food or water. Most cases of Hepatitis E resolve on their own with rest and hydration.",
        "response": "Hepatitis E is a viral infection that affects the liver. It can cause symptoms such as nausea, abdominal pain, and fatigue. The virus is primarily transmitted through contaminated food or water. Most cases of Hepatitis E resolve on their own with rest and hydration."
    },
    {
        "dialog": [
            "Hey Medi, I heard about Hepatitis E. What is it exactly?",
            "Hepatitis E is a viral infection that affects the liver.",
            "How is Hepatitis E transmitted?",
            "Hepatitis E can be transmitted through contaminated food or water.",
            "Are there any specific symptoms of Hepatitis E?",
            "Common symptoms of Hepatitis E include nausea, abdominal pain, and fatigue.",
            "Can Hepatitis E be cured?",
            "Most cases of Hepatitis E resolve on their own with rest and hydration.",
            "Is there anything else I should know about Hepatitis E?"
        ],
        "knowledge": "Hepatitis E is a viral infection that affects the liver. It can be transmitted through contaminated food or water. Common symptoms include nausea, abdominal pain, and fatigue. Most cases resolve on their own with rest and hydration.",
        "response": "Hepatitis E is a viral infection that affects the liver. It can be transmitted through contaminated food or water. Common symptoms include nausea, abdominal pain, and fatigue. Most cases resolve on their own with rest and hydration."
    },
    {
        "dialog": [
            "Hi Medi, I recently had a medical procedure related to Hepatitis E.",
            "I'm here to help. What advice are you looking for?",
            "I want to know what lifestyle changes I should make after the procedure.",
            "After a medical procedure for Hepatitis E, it's important to rest and stay hydrated.",
            "Are there any dietary restrictions I need to follow?",
            "It's recommended to avoid alcohol and eat a balanced diet to support liver health.",
            "Should I engage in physical exercise?",
            "Moderate physical exercise can be beneficial, but consult with your doctor first.",
            "Is there anything else I should keep in mind after the procedure?"
        ],
        "knowledge": "After a medical procedure for Hepatitis E, it's important to rest and stay hydrated. Avoiding alcohol and eating a balanced diet can support liver health. Consult with your doctor before engaging in physical exercise.",
        "response": "After a medical procedure for Hepatitis E, it's important to rest and stay hydrated. Avoiding alcohol and eating a balanced diet can support liver health. Consult with your doctor before engaging in physical exercise."
    },
    {
        "dialog": [
            "Hi Medi, I've been experiencing some symptoms lately.",
            "Sure, I'm here to help. Please let me know what symptoms you're having.",
            "I've been feeling really tired and have been having a loss of appetite.",
            "Okay, fatigue and loss of appetite are common symptoms. Can you tell me how long you've been experiencing them?",
            "It's been going on for about a week now.",
            "I see. Have you noticed any other symptoms along with fatigue and loss of appetite?",
            "Yes, I've also been having some nausea and occasional stomach pain.",
            "I see. Based on your symptoms, it's possible that you may have hepatitis E. I recommend getting a blood test to confirm the diagnosis.",
            "What is hepatitis E exactly? Can you tell me more about it?"
        ],
        "knowledge": "Hepatitis E is a viral liver disease caused by the hepatitis E virus (HEV). It is transmitted through the consumption of contaminated food or water. Symptoms include fatigue, loss of appetite, nausea, stomach pain, and jaundice. It can be diagnosed through a blood test. Hepatitis E is most common in areas with poor sanitation and limited access to clean water.",
        "response": "Hepatitis E is a viral liver disease transmitted through contaminated food or water. It causes fatigue, loss of appetite, nausea, stomach pain, and jaundice."
    },
    {
        "dialog": [
            "Hi Medi, I have a question about hepatitis E.",
            "Sure, go ahead and ask. I'll do my best to answer your question.",
            "How is hepatitis E transmitted from person to person?",
            "Hepatitis E is mainly transmitted through the consumption of contaminated food or water. It can also be transmitted through person-to-person contact, although this is less common. It's important to practice good hygiene and ensure that you have access to clean water and proper sanitation.",
            "Thank you for the explanation, Medi. I have one more question.",
            "Of course, feel free to ask.",
            "Is there a vaccine available for hepatitis E?",
            "Currently, there is no commercially available vaccine for hepatitis E. However, maintaining good hygiene and avoiding consumption of contaminated food and water can greatly reduce the risk of infection.",
            "I see. Thank you for answering my questions, Medi."
        ],
        "knowledge": "Hepatitis E is mainly transmitted through the consumption of contaminated food or water. It can also be transmitted through person-to-person contact, although this is less common. Currently, there is no commercially available vaccine for hepatitis E. Good hygiene practices and avoiding consumption of contaminated food and water are the best preventive measures.",
        "response": "Hepatitis E is mainly transmitted through contaminated food or water. There is currently no vaccine available for it."
    },
    {
        "dialog": [
            "Hey Medi, I recently underwent a medical procedure and need some advice.",
            "Of course, I'm here to help. What kind of advice do you need?",
            "I had a liver transplant surgery. What lifestyle changes should I make?",
            "After a liver transplant, it's important to follow a healthy lifestyle. This includes maintaining a balanced diet, exercising regularly, taking medications as prescribed, avoiding alcohol and smoking, and getting regular check-ups with your transplant team.",
            "What kind of diet should I follow?",
            "A balanced diet is essential after a liver transplant. It should include plenty of fruits, vegetables, whole grains, lean proteins, and healthy fats. It's also important to limit sodium, sugar, and processed foods. Your transplant team can provide you with a more specific diet plan based on your individual needs.",
            "Got it. What about physical exercise?",
            "Physical exercise is important for overall health and well-being. It can help improve strength, endurance, and cardiovascular health. It's best to start with low-impact exercises and gradually increase intensity as advised by your transplant team. They will provide you with specific recommendations based on your condition.",
            "Thank you for the advice, Medi. I appreciate it."
        ],
        "knowledge": "After a liver transplant, it's important to follow a healthy lifestyle. This includes maintaining a balanced diet, exercising regularly, taking medications as prescribed, avoiding alcohol and smoking, and getting regular check-ups with your transplant team. A balanced diet should include fruits, vegetables, whole grains, lean proteins, and healthy fats while limiting sodium, sugar, and processed foods. Physical exercise helps improve strength, endurance, and cardiovascular health.",
        "response": "After a liver transplant, it's important to follow a healthy lifestyle including a balanced diet, regular exercise, and regular check-ups with your transplant team."
    },
    {
        "dialog": [
            "Hey Medi, I've been experiencing some symptoms lately.",
            "Sure, I'm here to help. Please tell me what symptoms you're experiencing.",
            "I've been feeling fatigued, nauseous, and have a loss of appetite.",
            "Based on your symptoms, it's possible that you might have Hepatitis E.",
            "What are the common causes of Hepatitis E?",
            "Hepatitis E is usually caused by consuming contaminated water or food.",
            "Is it a serious condition? What should I do?",
            "Hepatitis E can range from a mild illness to a severe one, but most people recover on their own. It's important to rest, stay hydrated, and avoid alcohol.",
            "Thank you, Medi. I appreciate your help. One last question, how long does it usually take to recover from Hepatitis E?"
        ],
        "knowledge": "Hepatitis E is a liver disease caused by the Hepatitis E virus. It is usually a self-limiting infection that resolves within a few weeks to a few months. The symptoms may include fatigue, nausea, loss of appetite, and jaundice. It is usually transmitted through contaminated water or food. Most people recover completely, but in rare cases, it can lead to acute liver failure, especially in pregnant women.",
        "response": "The recovery time for Hepatitis E varies from person to person, but it usually takes a few weeks to a few months to fully recover."
    },
    {
        "dialog": [
            "Hi Medi, I have some questions about Hepatitis E.",
            "Sure, I'm here to help. What would you like to know?",
            "Is Hepatitis E a contagious disease?",
            "Yes, Hepatitis E is contagious. It can be transmitted through contaminated water or food.",
            "Can Hepatitis E be prevented?",
            "Yes, Hepatitis E can be prevented by practicing good hygiene, such as washing hands thoroughly, avoiding drinking water from unreliable sources, and ensuring the proper cooking of food.",
            "Is there a vaccine available for Hepatitis E?",
            "Yes, there is a vaccine available for Hepatitis E, but it may not be widely accessible in all regions.",
            "Thank you, Medi. That answers all my questions about Hepatitis E."
        ],
        "knowledge": "Hepatitis E is a contagious liver disease caused by the Hepatitis E virus. It is transmitted through contaminated water or food. Good hygiene practices, such as washing hands thoroughly and ensuring the proper cooking of food, can help prevent its transmission. There is a vaccine available for Hepatitis E, but its availability may vary depending on the region.",
        "response": "You're welcome! I'm glad I could help. If you have any more questions, feel free to ask."
    },
    {
        "dialog": [
            "Hello, Medi. I recently had a medical procedure related to Hepatitis E. Are there any dietary restrictions I should follow?",
            "After a medical procedure for Hepatitis E, it's important to follow a healthy diet.",
            "What kind of foods should I include in my diet?",
            "You should include foods that are high in nutrients, such as fruits, vegetables, lean proteins, and whole grains.",
            "Are there any foods I should avoid?",
            "It's best to avoid alcohol, as it can put strain on the liver. You should also avoid foods that are high in fat or sugar.",
            "Should I take any supplements?",
            "It's best to consult with your healthcare provider to determine if you need any specific supplements.",
            "Thank you for the advice, Medi. I'll make sure to follow a healthy diet."
        ],
        "knowledge": "After a medical procedure for Hepatitis E, it's important to follow a healthy diet to support liver health. This includes consuming foods that are high in nutrients and avoiding foods that can put strain on the liver, such as alcohol and foods high in fat or sugar. It's always a good idea to consult with your healthcare provider for personalized dietary recommendations.",
        "response": "You're welcome! Following a healthy diet will help in your recovery. If you have any more questions, feel free to ask."
    },
    {
        "dialog": [
            "Hi Medi, I've been experiencing some symptoms lately.",
            "Sure, I'm here to help. What are the symptoms you're experiencing?",
            "I've been feeling nauseous and fatigued, and I've also noticed a loss of appetite.",
            "I see. How long have you been experiencing these symptoms?",
            "It's been going on for about a week now.",
            "Have you traveled recently or been in contact with anyone who might be sick?",
            "No, I haven't traveled and I haven't been around anyone who's sick.",
            "Based on your symptoms, it's possible that you have hepatitis E. I recommend you see a doctor for further evaluation.",
            "How is hepatitis E transmitted?"
        ],
        "knowledge": "Hepatitis E is a viral infection that is usually spread through contaminated water or food. It can also be transmitted through contact with infected animals, such as rats or pigs.",
        "response": "Hepatitis E is usually transmitted through contaminated water or food, or contact with infected animals."
    },
    {
        "dialog": [
            "Hey Medi, I have a question about hepatitis E.",
            "Sure, I'll do my best to help. What's your question?",
            "How common is hepatitis E?",
            "Hepatitis E is relatively common worldwide, especially in areas with poor sanitation and limited access to clean water.",
            "Is there a vaccine for hepatitis E?",
            "Yes, there is a vaccine available for hepatitis E, but it's not widely used.",
            "What are the symptoms of hepatitis E?",
            "The symptoms of hepatitis E can include fever, fatigue, abdominal pain, nausea, and jaundice.",
            "Can you die from hepatitis E?"
        ],
        "knowledge": "In most cases, hepatitis E is a self-limiting infection and does not cause severe illness. However, in some rare cases, it can lead to acute liver failure, which can be life-threatening.",
        "response": "While most cases of hepatitis E do not cause severe illness, in rare cases, it can lead to acute liver failure, which can be life-threatening."
    },
    {
        "dialog": [
            "Hello Medi, I recently had a procedure done for hepatitis E.",
            "I'm glad to hear that you're taking steps to address your health. What procedure did you have?",
            "I had a liver biopsy to confirm the diagnosis of hepatitis E.",
            "That's an important step in determining the extent of liver damage. Have you been experiencing any symptoms after the procedure?",
            "I've been feeling a bit sore at the biopsy site, but other than that, no major symptoms.",
            "It's normal to feel some discomfort at the biopsy site. Make sure to follow your doctor's instructions for care and rest as needed.",
            "Will I need any lifestyle changes or medication after the procedure?",
            "Your doctor will provide you with specific recommendations based on your individual case, but generally, it's important to maintain a healthy diet, avoid alcohol, and follow any prescribed medications.",
            "Thank you, Medi. I appreciate your guidance."
        ],
        "knowledge": "After a liver biopsy for hepatitis E, it's important to follow your doctor's instructions for care, maintain a healthy diet, avoid alcohol, and take any prescribed medications.",
        "response": "You're welcome! I'm glad I could help. If you have any more questions, feel free to ask."
    }
]