[
    {
        "dialog": [
            "Hi Medi, I'm feeling very sick and have a severe headache.",
            "Hello! Sorry to hear that. Can you tell me more about your symptoms?",
            "My head feels like it's about to explode. I also have a fever and some neck stiffness.",
            "Based on your symptoms, it's possible that you could have meningitis.",
            "Meningitis? What's that?",
            "Meningitis is an inflammation of the protective membranes that surround your brain and spinal cord. It can be caused by a bacterial or viral infection.",
            "Is it serious? What should I do?",
            "Yes, it can be very serious. You should go to the hospital right away to get diagnosed and treated.",
            "Okay, thank you for your advice!"
        ],
        "knowledge": "Meningitis Meningitis In 2019, meningitis was diagnosed in about 7.7 million people worldwide, of whom 236,000 died, down from 433,000 deaths in 1990. With appropriate treatment, the risk of death in bacterial meningitis is less than 15%. Outbreaks of bacterial meningitis occur between December and June each year in an area of sub-Saharan Africa known as the meningitis belt. Smaller outbreaks may also occur in other areas of the world. The word meningitis comes from the Greek μῆνιγξ meninx, 'membrane', and the medical suffix -itis, 'inflammation'. In adults, the most common symptom of meningitis is a severe headache, occurring in almost 90% of cases of bacterial meningitis, followed by neck stiffness Meningitis Meningitis",
        "response": "It's possible that you could have meningitis. You should go to the hospital right away to get diagnosed and treated."
    },
    {
        "dialog": [
            "Hi Medi, I just found out that there was a meningitis outbreak in my area. How can I protect myself?",
            "Hi there! You can protect yourself by practicing good hygiene and avoiding close contact with sick people.",
            "What kind of hygiene practices should I follow?",
            "Wash your hands frequently with soap and water, cover your mouth and nose when coughing or sneezing, and avoid sharing personal items such as towels or utensils.",
            "What about vaccines? Are there any vaccines available for meningitis?",
            "Yes, there are vaccines available for some strains of meningitis. You should talk to your doctor about which vaccine is right for you.",
            "Okay, thank you for your advice!",
            "You're welcome! Stay safe!"
        ],
        "knowledge": "Meningitis Meningitis In 2019, meningitis was diagnosed in about 7.7 million people worldwide, of whom 236,000 died, down from 433,000 deaths in 1990. With appropriate treatment, the risk of death in bacterial meningitis is less than 15%. Outbreaks of bacterial meningitis occur between December and June each year in an area of sub-Saharan Africa known as the meningitis belt. Smaller outbreaks may also occur in other areas of the world. The word meningitis comes from the Greek μῆνιγξ meninx, 'membrane', and the medical suffix -itis, 'inflammation'. In adults, the most common symptom of meningitis is a severe headache, occurring in almost 90% of cases of bacterial meningitis, followed by neck stiffness Meningitis Meningitis",
        "response": "Yes, there are vaccines available for some strains of meningitis. You should talk to your doctor about which vaccine is right for you."
    },
    {
        "dialog": [
            "Hi Medi, I just had a lumbar puncture to test for meningitis. What should I do now?",
            "Hi! After a lumbar puncture, it's important to rest and take it easy for a few days.",
            "Are there any specific activities I should avoid?",
            "Yes, you should avoid any strenuous activities such as heavy lifting or exercise for at least 24 hours after the procedure. You should also avoid bending over or straining.",
            "What about my diet? Are there any specific foods I should eat or avoid?",
            "It's important to stay hydrated and drink plenty of fluids. You should also eat a healthy, balanced diet to support your body's healing process.",
            "Okay, thank you for your advice!",
            "You're welcome! Take care of yourself!"
        ],
        "knowledge": "Meningitis Meningitis In 2019, meningitis was diagnosed in about 7.7 million people worldwide, of whom 236,000 died, down from 433,000 deaths in 1990. With appropriate treatment, the risk of death in bacterial meningitis is less than 15%. Outbreaks of bacterial meningitis occur between December and June each year in an area of sub-Saharan Africa known as the meningitis belt. Smaller outbreaks may also occur in other areas of the world. The word meningitis comes from the Greek μῆνιγξ meninx, 'membrane', and the medical suffix -itis, 'inflammation'. In adults, the most common symptom of meningitis is a severe headache, occurring in almost 90% of cases of bacterial meningitis, followed by neck stiffness Meningitis Meningitis",
        "response": "After a lumbar puncture, it's important to rest and take it easy for a few days. You should avoid any strenuous activities such as heavy lifting or exercise for at least 24 hours after the procedure. You should also avoid bending over or straining."
    },
    {
        "dialog": [
            "Hi Medi, I have a severe headache and neck stiffness.",
            "Based on your symptoms, you may have bacterial meningitis. You should go to the hospital immediately!",
            "Is meningitis a common disease?",
            "In 2019, meningitis was diagnosed in about 7.7 million people worldwide, of whom 236,000 died, down from 433,000 deaths in 1990.",
            "How can I prevent bacterial meningitis?",
            "There is a vaccine available for bacterial meningitis. It's important to get vaccinated if you are in a high-risk group or traveling to an area with a high risk of meningitis outbreaks.",
            "What are the high-risk groups for bacterial meningitis?",
            "People living in crowded conditions, such as dorms or military barracks, and people with weak immune systems are at a higher risk.",
            "Thank you for the information Medi."
        ],
        "knowledge": "Meningitis Meningitis In 2019, meningitis was diagnosed in about 7.7 million people worldwide, of whom 236,000 died, down from 433,000 deaths in 1990.  With appropriate treatment, the risk of death in bacterial meningitis is less than 15%.  Outbreaks of bacterial meningitis occur between December and June each year in an area of sub-Saharan Africa known as the meningitis belt.  Smaller outbreaks may also occur in other areas of the world.  The word meningitis comes from the Greek μῆνιγξ meninx, 'membrane', and the medical suffix -itis, 'inflammation'. In adults, the most common symptom of meningitis is a severe headache, occurring in almost 90% of cases of bacterial meningitis, followed by neck stiffness Meningitis Meningitis",
        "response": "You're welcome. Don't hesitate to go to the hospital immediately. Bacterial meningitis can become deadly within hours."
    },
    {
        "dialog": [
            "Hi Medi, I have a question about meningitis.",
            "Sure, I'm here to help. What do you want to know?",
            "What are the most common symptoms of bacterial meningitis in adults?",
            "In adults, the most common symptom of meningitis is a severe headache, occurring in almost 90% of cases of bacterial meningitis, followed by neck stiffness.",
            "Are there any other symptoms?",
            "Other symptoms include fever, nausea, vomiting, sensitivity to light, confusion, and seizures.",
            "Is meningitis contagious?",
            "Yes, meningitis can be spread through close contact with an infected person's saliva or mucus. It's important to avoid sharing personal items like utensils or water bottles if you know someone has meningitis.",
            "Thank you for your help, Medi."
        ],
        "knowledge": "Meningitis Meningitis In 2019, meningitis was diagnosed in about 7.7 million people worldwide, of whom 236,000 died, down from 433,000 deaths in 1990.  With appropriate treatment, the risk of death in bacterial meningitis is less than 15%.  Outbreaks of bacterial meningitis occur between December and June each year in an area of sub-Saharan Africa known as the meningitis belt.  Smaller outbreaks may also occur in other areas of the world.  The word meningitis comes from the Greek μῆνιγξ meninx, 'membrane', and the medical suffix -itis, 'inflammation'. In adults, the most common symptom of meningitis is a severe headache, occurring in almost 90% of cases of bacterial meningitis, followed by neck stiffness Meningitis Meningitis",
        "response": "You're welcome. Stay safe and take precautions if you know someone has meningitis."
    },
    {
        "dialog": [
            "Hi Medi, I recently recovered from bacterial meningitis.",
            "I'm glad to hear you recovered! Do you have any questions or concerns?",
            "Yes, I'm concerned about the long-term effects of meningitis.",
            "The most common long-term effect of meningitis is hearing loss, but other potential complications include brain damage, seizures, and learning disabilities.",
            "Is there anything I can do to prevent these complications?",
            "It's important to follow your doctor's instructions and attend any follow-up appointments. You can also engage in activities that promote brain health, like exercise and cognitive stimulation.",
            "Are there any lifestyle changes I should make?",
            "It's important to maintain a healthy diet and exercise regularly. You may also want to consider reducing stress and getting enough rest.",
            "Thank you for the advice, Medi."
        ],
        "knowledge": "Meningitis Meningitis In 2019, meningitis was diagnosed in about 7.7 million people worldwide, of whom 236,000 died, down from 433,000 deaths in 1990.  With appropriate treatment, the risk of death in bacterial meningitis is less than 15%.  Outbreaks of bacterial meningitis occur between December and June each year in an area of sub-Saharan Africa known as the meningitis belt.  Smaller outbreaks may also occur in other areas of the world.  The word meningitis comes from the Greek μῆνιγξ meninx, 'membrane', and the medical suffix -itis, 'inflammation'. In adults, the most common symptom of meningitis is a severe headache, occurring in almost 90% of cases of bacterial meningitis, followed by neck stiffness Meningitis Meningitis",
        "response": "You're welcome. It's important to take care of yourself after recovering from meningitis. Don't hesitate to contact your doctor if you have any concerns."
    },
    {
        "dialog": [
            "Hey Medi, I've been experiencing severe headaches lately.",
            "Oh no! How long have you been experiencing these headaches?",
            "It's been a few days now. They're getting worse and I'm feeling dizzy too.",
            "I'd like to ask you a few questions to better understand your symptoms.",
            "Sure, go ahead.",
            "Have you had a fever or neck stiffness recently?",
            "No, I haven't. Just the headaches and dizziness.",
            "Based on your symptoms, I would advise you to see a doctor immediately.",
            "What could be wrong with me?"
        ],
        "knowledge": "Meningitis Meningitis In 2019, meningitis was diagnosed in about 7.7 million people worldwide, of whom 236,000 died, down from 433,000 deaths in 1990. With appropriate treatment, the risk of death in bacterial meningitis is less than 15%. Outbreaks of bacterial meningitis occur between December and June each year in an area of sub-Saharan Africa known as the meningitis belt. Smaller outbreaks may also occur in other areas of the world. The word meningitis comes from the Greek μῆνιγξ meninx, 'membrane', and the medical suffix -itis, 'inflammation'. In adults, the most common symptom of meningitis is a severe headache, occurring in almost 90% of cases of bacterial meningitis, followed by neck stiffness Meningitis Meningitis",
        "response": "Based on your symptoms, I would advise you to see a doctor immediately as it could be a sign of meningitis."
    },
    {
        "dialog": [
            "Hey Medi, I just wanted to learn more about meningitis.",
            "Certainly, what would you like to know?",
            "What are the symptoms of meningitis?",
            "The most common symptoms in adults are a severe headache and neck stiffness. Other symptoms include a high fever, sensitivity to light, confusion, vomiting, and a rash.",
            "How is meningitis treated?",
            "Treatment for meningitis depends on the cause. If it is bacterial meningitis, antibiotics or antiviral medication may be used. For viral meningitis, rest and over-the-counter pain medication may be recommended.",
            "Is meningitis contagious?",
            "Yes, meningitis can be contagious. It can be spread through contact with saliva, mucus, or other bodily fluids of an infected person.",
            "Thanks for your help. How can I prevent meningitis?"
        ],
        "knowledge": "Meningitis Meningitis In 2019, meningitis was diagnosed in about 7.7 million people worldwide, of whom 236,000 died, down from 433,000 deaths in 1990. With appropriate treatment, the risk of death in bacterial meningitis is less than 15%. Outbreaks of bacterial meningitis occur between December and June each year in an area of sub-Saharan Africa known as the meningitis belt. Smaller outbreaks may also occur in other areas of the world. The word meningitis comes from the Greek μῆνιγξ meninx, 'membrane', and the medical suffix -itis, 'inflammation'. In adults, the most common symptom of meningitis is a severe headache, occurring in almost 90% of cases of bacterial meningitis, followed by neck stiffness Meningitis Meningitis",
        "response": "To prevent meningitis, it's important to practice good hygiene such as washing your hands frequently, covering your mouth and nose when coughing or sneezing, and avoiding close contact with people who are sick."
    },
    {
        "dialog": [
            "Hey Medi, I just had a lumbar puncture done. What do I need to know about recovery?",
            "After a lumbar puncture, it is important to lie flat for several hours.",
            "How long should I lie flat for?",
            "You should lie flat for several hours, typically four to six, to reduce the risk of developing a headache or other complications.",
            "What other precautions should I take?",
            "For the first 24 hours, you should avoid any strenuous physical activity, heavy lifting, or driving. You may also experience soreness or bruising at the site of the puncture, so it's important to keep the area clean and dry.",
            "Are there any dietary restrictions I should follow?",
            "There are no specific dietary restrictions after a lumbar puncture, but it's important to drink plenty of fluids to avoid dehydration.",
            "Thank you, Medi. How long until I can resume my normal activities?"
        ],
        "knowledge": "Lumbar Puncture Lumbar Puncture A lumbar puncture is a procedure used to diagnose a variety of conditions, including meningitis and multiple sclerosis. During the procedure, a needle is inserted into the spinal canal in the lower back to collect cerebrospinal fluid for testing. After a lumbar puncture, it is important to lie flat for several hours to reduce the risk of developing a headache or other complications. For the first 24 hours, you should avoid any strenuous physical activity, heavy lifting, or driving. You may also experience soreness or bruising at the site of the puncture, so it's important to keep the area clean and dry. Lumbar Puncture Lumbar Puncture",
        "response": "You should avoid any strenuous physical activity, heavy lifting, or driving for the first 24 hours after the procedure. After several hours of lying flat, you can gradually resume your normal activities."
    },
    {
        "dialog": [
            "Hi Medi, I feel a severe headache and neck stiffness.",
            "Hello! Based on your symptoms, it seems to be a case of bacterial meningitis.",
            "Oh no! What should I do?",
            "You need to go to the hospital immediately for appropriate treatment.",
            "Is there any way to prevent it?",
            "Maintaining good hygiene and avoiding close contact with infected individuals can help prevent meningitis.",
            "What is the usual course of treatment?",
            "Treatment involves antibiotics, anti-inflammatory drugs, and supportive therapies such as intravenous fluids and oxygen therapy.",
            "Thank you, Medi. How can I reduce the risk of getting meningitis?"
        ],
        "knowledge": "Meningitis Meningitis In 2019, meningitis was diagnosed in about 7. 7 million people worldwide, of whom 236,000 died, down from 433,000 deaths in 1990.  With appropriate treatment, the risk of death in bacterial meningitis is less than 15%.  Outbreaks of bacterial meningitis occur between December and June each year in an area of sub-Saharan Africa known as the meningitis belt.  Smaller outbreaks may also occur in other areas of the world.  The word meningitis comes from the Greek μῆνιγξ meninx, 'membrane', and the medical suffix -itis, 'inflammation'. In adults, the most common symptom of meningitis is a severe headache, occurring in almost 90% of cases of bacterial meningitis, followed by neck stiffness  Meningitis Meningitis",
        "response": "Maintaining good hygiene and avoiding close contact with infected individuals can help prevent meningitis."
    },
    {
        "dialog": [
            "Hi Medi, can you tell me more about meningitis?",
            "Sure! Meningitis is an inflammation of the membranes covering the brain and spinal cord.",
            "What causes meningitis?",
            "Meningitis may be caused by a viral, bacterial, or fungal infection. Bacterial meningitis is the most serious type.",
            "What are the common symptoms of meningitis?",
            "Common symptoms include fever, headache, nausea, vomiting, and neck stiffness.",
            "Is it contagious?",
            "Yes, meningitis can be contagious, particularly bacterial meningitis. It can spread through coughing, sneezing, and close contact with an infected person.",
            "Thank you for your explanation, Medi. How long does it usually take to recover from meningitis?"
        ],
        "knowledge": "Meningitis Meningitis In 2019, meningitis was diagnosed in about 7. 7 million people worldwide, of whom 236,000 died, down from 433,000 deaths in 1990.  With appropriate treatment, the risk of death in bacterial meningitis is less than 15%.  Outbreaks of bacterial meningitis occur between December and June each year in an area of sub-Saharan Africa known as the meningitis belt.  Smaller outbreaks may also occur in other areas of the world.  The word meningitis comes from the Greek μῆνιγξ meninx, 'membrane', and the medical suffix -itis, 'inflammation'. In adults, the most common symptom of meningitis is a severe headache, occurring in almost 90% of cases of bacterial meningitis, followed by neck stiffness  Meningitis Meningitis",
        "response": "The recovery period for meningitis can vary depending on the severity of the infection and the individual's overall health. It may take several weeks to several months to fully recover."
    },
    {
        "dialog": [
            "Hi Medi, I have recently been diagnosed with meningitis. What should I do now?",
            "Hello! You need to follow your doctor's treatment plan and take all prescribed medications.",
            "What can I do to help relieve my symptoms?",
            "It is important to get plenty of rest and drink lots of fluids. Pain relievers can also help alleviate headaches and reduce fever.",
            "Is it safe to go to work or school?",
            "No, it is not safe to go to work or school until you have fully recovered and are no longer contagious.",
            "What about my physical activity?",
            "You should avoid physical activity until your doctor gives the approval to resume.",
            "Thank you, Medi. How long will it take for me to fully recover?"
        ],
        "knowledge": "Meningitis Meningitis In 2019, meningitis was diagnosed in about 7. 7 million people worldwide, of whom 236,000 died, down from 433,000 deaths in 1990.  With appropriate treatment, the risk of death in bacterial meningitis is less than 15%.  Outbreaks of bacterial meningitis occur between December and June each year in an area of sub-Saharan Africa known as the meningitis belt.  Smaller outbreaks may also occur in other areas of the world.  The word meningitis comes from the Greek μῆνιγξ meninx, 'membrane', and the medical suffix -itis, 'inflammation'. In adults, the most common symptom of meningitis is a severe headache, occurring in almost 90% of cases of bacterial meningitis, followed by neck stiffness  Meningitis Meningitis",
        "response": "The recovery period can vary depending on the severity of the infection and the individual's overall health. It may take several weeks to several months to fully recover."
    },
    {
        "dialog": [
            "Hello Medi, I'm not feeling well and I have a severe headache.",
            "Hi there, I'm sorry to hear that. Have you taken any medications for your headache?",
            "No, I haven't taken any medication yet. What should I do?",
            "You can take over-the-counter pain relievers such as paracetamol or ibuprofen. But if the headache persists, you should see a doctor.",
            "Should I be worried that this could be meningitis?",
            "Meningitis is a possibility, but it's usually accompanied by other symptoms such as neck stiffness and a high fever. If you don't have those symptoms, it's less likely that you have meningitis.",
            "I don't have a fever, but my neck is a bit stiff. What should I do now?",
            "If your neck is stiff, you should see a doctor immediately. Stiff neck can be a symptom of meningitis, so it's better to be safe than sorry.",
            "Thank you, Medi. I'll go see a doctor right away."
        ],
        "knowledge": "Meningitis Meningitis In 2019, meningitis was diagnosed in about 7.7 million people worldwide, of whom 236,000 died, down from 433,000 deaths in 1990. With appropriate treatment, the risk of death in bacterial meningitis is less than 15%. Outbreaks of bacterial meningitis occur between December and June each year in an area of sub-Saharan Africa known as the meningitis belt. Smaller outbreaks may also occur in other areas of the world. The word meningitis comes from the Greek μῆνιγξ meninx, 'membrane', and the medical suffix -itis, 'inflammation'. In adults, the most common symptom of meningitis is a severe headache, occurring in almost 90% of cases of bacterial meningitis, followed by neck stiffness Meningitis Meningitis",
        "response": "It's good that you're taking your symptoms seriously. It's better to see a doctor, especially with the neck stiffness. Get well soon!"
    },
    {
        "dialog": [
            "Hi Medi, I have a few questions about meningitis.",
            "Sure, I'm happy to help. What would you like to know?",
            "Can you tell me more about the symptoms of meningitis?",
            "The most common symptoms of meningitis are a severe headache, neck stiffness, and a high fever. Other symptoms may include nausea, vomiting, sensitivity to light, confusion, and even seizures.",
            "How is meningitis diagnosed?",
            "Meningitis is usually diagnosed with a combination of physical exam, medical history, and laboratory tests such as blood tests, CT scan, or lumbar puncture.",
            "Can meningitis be prevented?",
            "Yes, there are vaccines available to prevent certain types of meningitis such as meningococcal vaccine and pneumococcal vaccine. Good hygiene such as washing your hands regularly and avoiding close contact with sick people can also help prevent meningitis.",
            "Thank you for your help, Medi. I feel more informed now."
        ],
        "knowledge": "Meningitis Meningitis In 2019, meningitis was diagnosed in about 7.7 million people worldwide, of whom 236,000 died, down from 433,000 deaths in 1990. With appropriate treatment, the risk of death in bacterial meningitis is less than 15%. Outbreaks of bacterial meningitis occur between December and June each year in an area of sub-Saharan Africa known as the meningitis belt. Smaller outbreaks may also occur in other areas of the world. The word meningitis comes from the Greek μῆνιγξ meninx, 'membrane', and the medical suffix -itis, 'inflammation'. In adults, the most common symptom of meningitis is a severe headache, occurring in almost 90% of cases of bacterial meningitis, followed by neck stiffness Meningitis Meningitis",
        "response": "Good to hear that you're feeling informed now. Don't hesitate to reach out again if you have more questions or concerns."
    },
    {
        "dialog": [
            "Hi Medi, I recently had meningitis and I'm curious about what I should do now that I'm recovering.",
            "Hi there, I'm sorry to hear that. What kind of meningitis did you have?",
            "It was bacterial meningitis.",
            "Okay, well first of all, make sure you finish your antibiotics as prescribed by your doctor. This is important to prevent the infection from recurring or becoming more serious.",
            "Are there any lifestyle changes I should make?",
            "Yes, make sure you get enough rest and avoid strenuous physical activity until you're fully recovered. You should also eat a healthy diet and drink plenty of fluids to help your body recover.",
            "Can I go back to work or school?",
            "It depends on the severity of your meningitis and how you're feeling. It's important to consult with your doctor before returning to work or school to make sure it's safe for you.",
            "Thank you, Medi. This is really helpful."
        ],
        "knowledge": "Meningitis Meningitis In 2019, meningitis was diagnosed in about 7.7 million people worldwide, of whom 236,000 died, down from 433,000 deaths in 1990. With appropriate treatment, the risk of death in bacterial meningitis is less than 15%. Outbreaks of bacterial meningitis occur between December and June each year in an area of sub-Saharan Africa known as the meningitis belt. Smaller outbreaks may also occur in other areas of the world. The word meningitis comes from the Greek μῆνιγξ meninx, 'membrane', and the medical suffix -itis, 'inflammation'. In adults, the most common symptom of meningitis is a severe headache, occurring in almost 90% of cases of bacterial meningitis, followed by neck stiffness Meningitis Meningitis",
        "response": "It's important to take care of yourself and consult with your doctor before returning to work or school. Don't hesitate to reach out again if you have any more questions or concerns."
    },
    {
        "dialog": [
            "Hello Medi, I have a headache and neck stiffness.",
            "I think you might have meningitis. It's a serious disease that requires medical attention.",
            "What should I do now?",
            "You should go to the hospital as soon as possible to get a diagnosis and treatment.",
            "Is there any way to prevent meningitis?",
            "Yes, you can get vaccinated for some types of meningitis. Avoiding close contact with people who are sick and washing your hands frequently can also help.",
            "Are there any long-term effects of meningitis?",
            "Yes, meningitis can cause permanent damage to the brain and other organs. It's important to seek treatment as soon as possible to minimize the risk of complications.",
            "Thank you for the information, Medi."
        ],
        "knowledge": "Meningitis Meningitis In 2019, meningitis was diagnosed in about 7. 7 million people worldwide, of whom 236,000 died, down from 433,000 deaths in 1990.  With appropriate treatment, the risk of death in bacterial meningitis is less than 15%.  Outbreaks of bacterial meningitis occur between December and June each year in an area of sub-Saharan Africa known as the meningitis belt.  Smaller outbreaks may also occur in other areas of the world.  The word meningitis comes from the Greek μῆνιγξ meninx, 'membrane', and the medical suffix -itis, 'inflammation'. In adults, the most common symptom of meningitis is a severe headache, occurring in almost 90% of cases of bacterial meningitis, followed by neck stiffness  Meningitis Meningitis",
        "response": "You're welcome. I hope you get better soon."
    },
    {
        "dialog": [
            "Hello Medi, can you explain to me what meningitis is?",
            "Yes, meningitis is an inflammation of the membranes that surround the brain and spinal cord.",
            "What are the symptoms of meningitis?",
            "The symptoms of meningitis can include headache, fever, neck stiffness, and a rash. In some cases, it can lead to seizures or coma.",
            "Is meningitis contagious?",
            "Yes, some forms of meningitis can be contagious. It's important to avoid close contact with people who are sick and to wash your hands frequently.",
            "How is meningitis treated?",
            "Meningitis is typically treated with antibiotics and sometimes antiviral medications. It's important to seek medical attention as soon as possible to minimize the risk of complications.",
            "Thank you for the explanation, Medi."
        ],
        "knowledge": "Meningitis Meningitis In 2019, meningitis was diagnosed in about 7. 7 million people worldwide, of whom 236,000 died, down from 433,000 deaths in 1990.  With appropriate treatment, the risk of death in bacterial meningitis is less than 15%.  Outbreaks of bacterial meningitis occur between December and June each year in an area of sub-Saharan Africa known as the meningitis belt.  Smaller outbreaks may also occur in other areas of the world.  The word meningitis comes from the Greek μῆνιγξ meninx, 'membrane', and the medical suffix -itis, 'inflammation'. In adults, the most common symptom of meningitis is a severe headache, occurring in almost 90% of cases of bacterial meningitis, followed by neck stiffness  Meningitis Meningitis",
        "response": "You're welcome. Let me know if you have any other questions."
    },
    {
        "dialog": [
            "Hello Medi, I just recovered from meningitis. What should I do now?",
            "Congratulations on your recovery! It's important to continue focusing on your health and taking care of yourself.",
            "What lifestyle changes should I make?",
            "It's important to eat a healthy diet, exercise regularly, and get enough sleep. You may also want to avoid smoking and excessive alcohol consumption, as these can weaken your immune system.",
            "Are there any long-term effects of meningitis?",
            "Yes, meningitis can cause permanent damage to the brain and other organs. It's important to continue seeing your doctor and getting regular check-ups to monitor your health.",
            "Can I get meningitis again?",
            "It's possible to get meningitis more than once, but it's not very common. You can reduce your risk by following a healthy lifestyle and avoiding close contact with people who are sick.",
            "Thank you for the advice, Medi."
        ],
        "knowledge": "Meningitis Meningitis In 2019, meningitis was diagnosed in about 7. 7 million people worldwide, of whom 236,000 died, down from 433,000 deaths in 1990.  With appropriate treatment, the risk of death in bacterial meningitis is less than 15%.  Outbreaks of bacterial meningitis occur between December and June each year in an area of sub-Saharan Africa known as the meningitis belt.  Smaller outbreaks may also occur in other areas of the world.  The word meningitis comes from the Greek μῆνιγξ meninx, 'membrane', and the medical suffix -itis, 'inflammation'. In adults, the most common symptom of meningitis is a severe headache, occurring in almost 90% of cases of bacterial meningitis, followed by neck stiffness  Meningitis Meningitis",
        "response": "You're welcome. Take care of yourself and let me know if you have any other questions or concerns."
    },
    {
        "dialog": [
            "Hi Medi, I'm feeling a severe headache",
            "I'm sorry to hear that. Do you have any other symptoms?",
            "I also feel neck stiffness",
            "Based on your symptoms, it seems to be bacterial meningitis. You should see a doctor immediately",
            "What is the meningitis belt?",
            "It's an area of sub-Saharan Africa where outbreaks of bacterial meningitis occur between December and June",
            "Is there any way I can prevent it?",
            "Vaccines are available to prevent some types of meningitis. You should talk to your doctor about vaccination.",
            "Thanks for your advice Medi. I will consult a doctor as soon as possible."
        ],
        "knowledge": "Meningitis Meningitis In 2019, meningitis was diagnosed in about 7.7 million people worldwide, of whom 236,000 died, down from 433,000 deaths in 1990.  With appropriate treatment, the risk of death in bacterial meningitis is less than 15%.  Outbreaks of bacterial meningitis occur between December and June each year in an area of sub-Saharan Africa known as the meningitis belt.  Smaller outbreaks may also occur in other areas of the world.  The word meningitis comes from the Greek μῆνιγξ meninx, 'membrane', and the medical suffix -itis, 'inflammation'. In adults, the most common symptom of meningitis is a severe headache, occurring in almost 90% of cases of bacterial meningitis, followed by neck stiffness  Meningitis Meningitis ",
        "response": "You're welcome. It's better to see a doctor soon to get proper treatment."
    },
    {
        "dialog": [
            "Hi Medi, I want to know more about meningitis",
            "Sure, what do you want to know?",
            "What causes meningitis?",
            "Meningitis is usually caused by viruses or bacteria, but it can also be caused by certain medications, illnesses, or injuries",
            "What are the symptoms of meningitis?",
            "The most common symptoms are fever, headache, and neck stiffness. Other symptoms include sensitivity to light, confusion, vomiting, and seizures",
            "Is meningitis curable?",
            "It depends on the cause and severity of the meningitis, but with appropriate treatment, most people recover fully",
            "Thanks for your explanation Medi"
        ],
        "knowledge": "Meningitis Meningitis In 2019, meningitis was diagnosed in about 7.7 million people worldwide, of whom 236,000 died, down from 433,000 deaths in 1990.  With appropriate treatment, the risk of death in bacterial meningitis is less than 15%.  Outbreaks of bacterial meningitis occur between December and June each year in an area of sub-Saharan Africa known as the meningitis belt.  Smaller outbreaks may also occur in other areas of the world.  The word meningitis comes from the Greek μῆνιγξ meninx, 'membrane', and the medical suffix -itis, 'inflammation'. In adults, the most common symptom of meningitis is a severe headache, occurring in almost 90% of cases of bacterial meningitis, followed by neck stiffness  Meningitis Meningitis ",
        "response": "You're welcome. I hope that helps."
    },
    {
        "dialog": [
            "Hi Medi, I just had a lumbar puncture due to meningitis",
            "I'm sorry to hear that. How are you feeling now?",
            "I feel a little sore and tired",
            "That's normal after a lumbar puncture. You should rest and avoid strenuous activity for a few days",
            "What should I eat after the lumbar puncture?",
            "You should eat a balanced diet with plenty of fluids. Avoid drinking alcohol and caffeine for at least 48 hours",
            "Should I take any medicine?",
            "Your doctor may prescribe pain relievers or antibiotics, depending on the cause of your meningitis and your overall health",
            "Thanks for your advice Medi"
        ],
        "knowledge": "Meningitis Meningitis In 2019, meningitis was diagnosed in about 7.7 million people worldwide, of whom 236,000 died, down from 433,000 deaths in 1990. With appropriate treatment, the risk of death in bacterial meningitis is less than 15%. Outbreaks of bacterial meningitis occur between December and June each year in an area of sub-Saharan Africa known as the meningitis belt. Smaller outbreaks may also occur in other areas of the world. The word meningitis comes from the Greek μῆνιγξ meninx, 'membrane', and the medical suffix -itis, 'inflammation'. In adults, the most common symptom of meningitis is a severe headache, occurring in almost 90% of cases of bacterial meningitis, followed by neck stiffness  Meningitis Meningitis ",
        "response": "You're welcome. I hope it helps you recover soon."
    },
    {
        "dialog": [
            "Hi Medi, I feel neck stiffness and headache.",
            "Hello, based on your symptom, I assume that you might have meningitis.",
            "What is meningitis?",
            "Meningitis is the inflammation of the protective membranes covering the brain and spinal cord. ",
            "What are the symptoms of meningitis?",
            "The most common symptoms of meningitis are neck stiffness, headache, fever, and inability to lower the chin to the chest due to stiffness in the neck. ",
            "What is the best way to prevent meningitis?",
            "Meningitis can be prevented by practicing good hygiene, washing your hands frequently, covering your mouth when coughing or sneezing, and getting vaccinated.",
            "Is meningitis contagious? "
        ],
        "knowledge": "Meningitis Meningitis In 2019, meningitis was diagnosed in about 7. 7 million people worldwide, of whom 236,000 died, down from 433,000 deaths in 1990.  With appropriate treatment, the risk of death in bacterial meningitis is less than 15%.  Outbreaks of bacterial meningitis occur between December and June each year in an area of sub-Saharan Africa known as the meningitis belt.  Smaller outbreaks may also occur in other areas of the world.  The word meningitis comes from the Greek μῆνιγξ meninx, 'membrane', and the medical suffix -itis, 'inflammation'. In adults, the most common symptom of meningitis is a severe headache, occurring in almost 90% of cases of bacterial meningitis, followed by neck stiffness  Meningitis Meningitis",
        "response": "Meningitis can be contagious if the cause of the meningitis is from an infectious agent like bacteria or a virus."
    },
    {
        "dialog": [
            "Hello Medi, I have some questions about meningitis.",
            "Of course, I am happy to help. What is your question?",
            "What are the different types of meningitis?",
            "There are different types of meningitis, but the most common are viral and bacterial meningitis. Fungal and parasitic meningitis are also possible but less common.",
            "What are the causes of meningitis?",
            "Meningitis can be caused by viruses that cause colds and flu, bacteria like Streptococcus pneumoniae and Neisseria meningitidis, or fungus.",
            "What are the treatment options for meningitis?",
            "Treatment depends on the cause of meningitis. Bacterial meningitis is usually treated with antibiotics, viral meningitis requires supportive care such as rest and fluids, and fungal meningitis is treated with antifungal medications.",
            "Can you tell me more about the vaccine for meningitis? "
        ],
        "knowledge": "Meningitis Meningitis In 2019, meningitis was diagnosed in about 7. 7 million people worldwide, of whom 236,000 died, down from 433,000 deaths in 1990.  With appropriate treatment, the risk of death in bacterial meningitis is less than 15%.  Outbreaks of bacterial meningitis occur between December and June each year in an area of sub-Saharan Africa known as the meningitis belt.  Smaller outbreaks may also occur in other areas of the world.  The word meningitis comes from the Greek μῆνιγξ meninx, 'membrane', and the medical suffix -itis, 'inflammation'. In adults, the most common symptom of meningitis is a severe headache, occurring in almost 90% of cases of bacterial meningitis, followed by neck stiffness  Meningitis Meningitis",
        "response": "Yes, there are vaccines available for certain types of meningitis like the meningococcal conjugate vaccine, pneumococcal vaccine, and Hib vaccine. It is best to ask your doctor about which vaccine is appropriate for you."
    },
    {
        "dialog": [
            "Hello Medi, I just got discharged from the hospital after having meningitis.",
            "I'm glad to hear you are feeling better. Do you have any questions?",
            "Yes, what can I do to prevent getting meningitis again in the future?",
            "To prevent meningitis, you should practice good hygiene, wash your hands frequently and avoid close contact with people who are sick. You can also get vaccinated against certain types of meningitis.",
            "Is it safe for me to return to my daily activities like work and exercise?",
            "It is important to rest and recover fully before returning to your normal activities. Your doctor will advise you on when it is safe to return to work and exercise.",
            "What kind of foods should I eat to help my body recover from meningitis?",
            "It is important to eat a healthy and balanced diet with plenty of fruits, vegetables, and protein to aid in recovery. Your doctor can give you more specific advice based on your individual needs.",
            "Thank you, Medi. Do you have any other advice for me?"
        ],
        "knowledge": "Meningitis Meningitis In 2019, meningitis was diagnosed in about 7. 7 million people worldwide, of whom 236,000 died, down from 433,000 deaths in 1990.  With appropriate treatment, the risk of death in bacterial meningitis is less than 15%.  Outbreaks of bacterial meningitis occur between December and June each year in an area of sub-Saharan Africa known as the meningitis belt.  Smaller outbreaks may also occur in other areas of the world.  The word meningitis comes from the Greek μῆνιγξ meninx, 'membrane', and the medical suffix -itis, 'inflammation'. In adults, the most common symptom of meningitis is a severe headache, occurring in almost 90% of cases of bacterial meningitis, followed by neck stiffness  Meningitis Meningitis",
        "response": "I hope these tips help you to have a full recovery from meningitis."
    }
]