[
    {
        "dialog": [
            "Hi Medi, I'm feeling congested and have a runny nose. Can you help me?",
            "Yes, I can. Do you have any other symptoms?",
            "I'm also coughing a lot. What could be wrong with me?",
            "Based on your symptoms, you might have a common cold. Have you tried any remedies?",
            "No, not really. What would you recommend?",
            "You can try using Ipratropium nasal spray to reduce the symptoms of a runny nose. It also helps with coughs in adults.",
            "Okay, I'll try that. Is there anything else I can do to feel better?",
            "You can try chest vapor rub to relieve cough, congestion, and sleep difficulty. And avoid physical exercise if you have fever, widespread muscle aches, or fatigue.",
            "Thanks for the advice, Medi. How long will it take me to get better?"
        ],
        "knowledge": "Common cold Common cold  Ipratropium nasal spray may reduce the symptoms of a runny nose but has little effect on stuffiness. Ipratropium may also help with cough in adults. The safety and effectiveness of nasal decongestant use in children is unclear. Due to lack of studies, it is not known whether increased fluid intake improves symptoms or shortens respiratory illness. As of 2017 heated and humidified air, such as via RhinoTherm, is of unclear benefit. One study has found chest vapor rub to provide some relief of nocturnal cough, congestion, and sleep difficulty. Some advise to avoid physical exercise if there are symptoms such as fever, widespread muscle aches or fatigue Common cold Common cold",
        "response": "The duration of illness varies, but most people recover in 7-10 days."
    },
    {
        "dialog": [
            "Hey Medi, I just had a medical procedure done. Can you give me some advice on post-procedure care?",
            "Sure, what kind of procedure did you have?",
            "I had a colonoscopy. What should I do to take care of myself?",
            "You should avoid driving, operating heavy machinery, or making important decisions for the rest of the day. Drink plenty of fluids, and eat a light meal when you feel ready.",
            "Okay, that sounds easy enough. What about physical activity?",
            "You should avoid any strenuous activity for the next 24 hours. After that, you can resume your normal activities as tolerated.",
            "Alright, thanks for the advice. What kind of foods should I eat?",
            "You should avoid spicy, greasy, or fatty foods. Stick to a light, low-fat diet for the first few days.",
            "Got it. What kind of symptoms should I be aware of?"
        ],
        "knowledge": "Colonoscopy Colonoscopy After a colonoscopy, you should avoid driving, operating heavy machinery, or making important decisions for the rest of the day. Drink plenty of fluids and eat a light meal when you feel ready. Avoid any strenuous activity for the next 24 hours. After that, you can resume your normal activities as tolerated. You should avoid spicy, greasy, or fatty foods and stick to a light, low-fat diet for the first few days. Contact your doctor immediately if you experience severe abdominal pain, fever, chills, or heavy rectal bleeding.",
        "response": "You're welcome. If you have any other questions or concerns, don't hesitate to contact your doctor."
    },
    {
        "dialog": [
            "Hi Medi, I used to smoke and now I have a cough. What could be the problem?",
            "Based on your past history and symptoms, you might have chronic bronchitis. Have you seen a doctor?",
            "No, not yet. What should I do?",
            "You should quit smoking immediately if you haven't already. It's also a good idea to see a doctor for a proper diagnosis and treatment plan.",
            "Okay, I'll do that. What kind of treatment options are available?",
            "There are several options, such as bronchodilators, steroids, and antibiotics. Your doctor will recommend the best treatment for your individual case.",
            "I see. What about lifestyle changes?",
            "You should avoid smoking and secondhand smoke, as well as any other irritants that can aggravate your symptoms. You should also exercise regularly and eat a healthy diet.",
            "Great, thanks for the advice. How long will it take for me to feel better?"
        ],
        "knowledge": "Chronic bronchitis Chronic bronchitis Chronic bronchitis is a type of chronic obstructive pulmonary disease (COPD) that involves a long-term cough with mucous.  The most common cause of chronic bronchitis is smoking, although air pollution, dust, and toxic gases can also contribute.  Treatment options include bronchodilators, steroids, and antibiotics.  Lifestyle changes such as quitting smoking, exercising regularly, and eating a healthy diet can also help.  Most people experience relief of symptoms within a few weeks of quitting smoking and starting treatment. Chronic bronchitis Chronic bronchitis",
        "response": "You're welcome. Remember to see a doctor and quit smoking as soon as possible for the best chance of recovery."
    },
    {
        "dialog": [
            "Hi Medi, I'm experiencing a runny nose recently.",
            "Hello, sorry to hear that. Any other symptoms that you have?",
            "Yes, I also have a cough and feel very tired.",
            "Based on your symptoms, you may have a common cold. Have you taken any medication?",
            "No, I haven't taken any medication yet. What can I take?",
            "You can try using Ipratropium nasal spray to reduce your runny nose. Also, chest vapor rub may provide relief for your cough and congestion.",
            "Are there any natural remedies that I can try?",
            "Drinking lots of fluids may help, but it's not clear whether it shortens the duration of your cold.",
            "Thanks for the advice, Medi. How long should I rest if I have a common cold?"
        ],
        "knowledge": "Common cold Common cold  Ipratropium nasal spray may reduce the symptoms of a runny nose but has little effect on stuffiness.  Ipratropium may also help with cough in adults.  The safety and effectiveness of nasal decongestant use in children is unclear. Due to lack of studies, it is not known whether increased fluid intake improves symptoms or shortens respiratory illness.  As of 2017 heated and humidified air, such as via RhinoTherm, is of unclear benefit.  One study has found chest vapor rub to provide some relief of nocturnal cough, congestion, and sleep difficulty. Some advise to avoid physical exercise if there are symptoms such as fever, widespread muscle aches or fatigue Common cold Common cold",
        "response": "You should rest until the symptoms subside, but it's also important to stay active and do light exercises if possible."
    },
    {
        "dialog": [
            "Hi Medi, I have some questions about nasal decongestants.",
            "Sure, what would you like to know?",
            "Are nasal decongestants safe for children?",
            "It's unclear whether nasal decongestants are safe for children due to a lack of studies.",
            "How effective are nasal decongestants for stuffy nose?",
            "Nasal decongestants can reduce the swelling in the nose and relieve stuffiness, but they are not always effective and may have side effects.",
            "What are the alternatives to nasal decongestants?",
            "You can try using a saline nasal spray or doing a steam inhalation to relieve your stuffy nose.",
            "Thanks for the information, Medi. I appreciate it."
        ],
        "knowledge": "Common cold Common cold  Ipratropium nasal spray may reduce the symptoms of a runny nose but has little effect on stuffiness.  Ipratropium may also help with cough in adults.  The safety and effectiveness of nasal decongestant use in children is unclear. Due to lack of studies, it is not known whether increased fluid intake improves symptoms or shortens respiratory illness.  As of 2017 heated and humidified air, such as via RhinoTherm, is of unclear benefit.  One study has found chest vapor rub to provide some relief of nocturnal cough, congestion, and sleep difficulty. Some advise to avoid physical exercise if there are symptoms such as fever, widespread muscle aches or fatigue Common cold Common cold",
        "response": "No problem, feel free to ask me anything related to nasal decongestants or other health issues."
    },
    {
        "dialog": [
            "Hi Medi, I recently had a cold and I'm feeling better now. What kind of physical exercise can I do?",
            "Hello, glad to hear that you're feeling better. What kind of symptoms did you have?",
            "I had a fever, cough, and fatigue. I didn't exercise during that time.",
            "It's best to avoid physical exercise if you have a fever, widespread muscle aches, or fatigue. Once you feel better, you can start with light exercises such as walking.",
            "What kind of diet should I follow after having a cold?",
            "It's important to eat a balanced diet with lots of fruits and vegetables to boost your immune system. Also, drinking lots of fluids can help with the recovery process.",
            "Thanks for the advice, Medi. How long should I wait before doing intense workouts?",
            "It's best to gradually increase your exercise intensity over a week or two after your symptoms have subsided.",
            "I see, thank you for your time."
        ],
        "knowledge": "Common cold Common cold  Ipratropium nasal spray may reduce the symptoms of a runny nose but has little effect on stuffiness.  Ipratropium may also help with cough in adults.  The safety and effectiveness of nasal decongestant use in children is unclear. Due to lack of studies, it is not known whether increased fluid intake improves symptoms or shortens respiratory illness.  As of 2017 heated and humidified air, such as via RhinoTherm, is of unclear benefit.  One study has found chest vapor rub to provide some relief of nocturnal cough, congestion, and sleep difficulty. Some advise to avoid physical exercise if there are symptoms such as fever, widespread muscle aches or fatigue Common cold Common cold",
        "response": "You're welcome. Let me know if you have any other questions regarding your health."
    },
    {
        "dialog": [
            "Hello Medi, I have a runny nose and a cough, what should I do?",
            "It sounds like you may have a common cold, I suggest drinking plenty of fluids and using nasal spray",
            "What kind of nasal spray should I use?",
            "Ipratropium nasal spray may reduce the symptoms of a runny nose but has little effect on stuffiness.",
            "What about my cough?",
            "Chest vapor rub can provide some relief of nocturnal cough, congestion, and sleep difficulty.",
            "Should I avoid exercise?",
            "You should avoid physical exercise if there are symptoms such as fever, widespread muscle aches or fatigue",
            "Okay, thank you for your advice. Is there anything else I should know?"
        ],
        "knowledge": "Common cold Common cold  Ipratropium nasal spray may reduce the symptoms of a runny nose but has little effect on stuffiness.  Ipratropium may also help with cough in adults.  The safety and effectiveness of nasal decongestant use in children is unclear. Due to lack of studies, it is not known whether increased fluid intake improves symptoms or shortens respiratory illness.  As of 2017 heated and humidified air, such as via RhinoTherm, is of unclear benefit.  One study has found chest vapor rub to provide some relief of nocturnal cough, congestion, and sleep difficulty. Some advise to avoid physical exercise if there are symptoms such as fever, widespread muscle aches or fatigue Common cold Common cold",
        "response": "No, that's all. Just make sure to rest and drink plenty of fluids, and use Ipratropium nasal spray for your runny nose."
    },
    {
        "dialog": [
            "Hello Medi, my child has a runny nose and a cough, what should I do?",
            "It sounds like your child may have a common cold. Make sure they are drinking plenty of fluids and using nasal spray.",
            "What kind of nasal spray should I use?",
            "The safety and effectiveness of nasal decongestant use in children is unclear, so it's best to consult a pediatrician.",
            "What about my child's cough?",
            "Chest vapor rub can provide some relief of nocturnal cough, congestion, and sleep difficulty, but it's best to consult a pediatrician.",
            "Should my child avoid exercise?",
            "Yes, your child should avoid physical exercise if there are symptoms such as fever, widespread muscle aches or fatigue",
            "Okay, thank you for your advice. Is there anything else I should know?"
        ],
        "knowledge": "Common cold Common cold  Ipratropium nasal spray may reduce the symptoms of a runny nose but has little effect on stuffiness.  Ipratropium may also help with cough in adults.  The safety and effectiveness of nasal decongestant use in children is unclear. Due to lack of studies, it is not known whether increased fluid intake improves symptoms or shortens respiratory illness.  As of 2017 heated and humidified air, such as via RhinoTherm, is of unclear benefit.  One study has found chest vapor rub to provide some relief of nocturnal cough, congestion, and sleep difficulty. Some advise to avoid physical exercise if there are symptoms such as fever, widespread muscle aches or fatigue Common cold Common cold",
        "response": "No, that's all. Just make sure to consult a pediatrician for the appropriate nasal spray and treatment for your child's cough, and ensure they get plenty of rest and fluids."
    },
    {
        "dialog": [
            "Hello Medi, I just had a medical procedure, what lifestyle changes should I make?",
            "It depends on what procedure you had, can you tell me more?",
            "I had surgery on my knee",
            "After knee surgery, it's important to rest and elevate your leg. You should also do physical therapy exercises as recommended by your doctor.",
            "What about my diet?",
            "Make sure to eat a balanced diet with plenty of protein and vitamins to aid in healing. Avoid processed foods and sugary drinks.",
            "Are there any exercises I should avoid?",
            "You should avoid high-impact exercises such as running or jumping, as well as any exercises that cause pain or discomfort in your knee.",
            "Okay, thank you for your advice. Is there anything else I should know?"
        ],
        "knowledge": "Medical procedure Medical procedure  Recovery from a medical procedure can vary depending on the type of procedure.  In general, it's important to rest, follow any instructions from your doctor or physical therapist, and eat a balanced diet.  After knee surgery, physical therapy is important to strengthen the muscles around the knee.  It's also important to avoid high-impact exercises that can damage the knee.  A diet with plenty of protein and vitamins can help speed up the healing process. Medical procedure Medical procedure",
        "response": "No, that's all. Just make sure to follow your doctor's instructions and do your physical therapy exercises regularly to aid in your recovery."
    },
    {
        "dialog": [
            "Hello, Medi. I have a cold, can you help me?",
            "Of course, what are your symptoms?",
            "I have a runny nose and cough, but my nose is still stuffy",
            "Ipratropium nasal spray may reduce the symptoms of a runny nose but has little effect on stuffiness.",
            "Is it safe for me to use nasal decongestant?",
            "The safety and effectiveness of nasal decongestant use in children is unclear.",
            "What about increasing my fluid intake?",
            "Due to lack of studies, it is not known whether increased fluid intake improves symptoms or shortens respiratory illness.",
            "What is the benefit of using chest vapor rub?"
        ],
        "knowledge": "Common cold Common cold  Ipratropium nasal spray may reduce the symptoms of a runny nose but has little effect on stuffiness.  Ipratropium may also help with cough in adults.  The safety and effectiveness of nasal decongestant use in children is unclear. Due to lack of studies, it is not known whether increased fluid intake improves symptoms or shortens respiratory illness.  As of 2017 heated and humidified air, such as via RhinoTherm, is of unclear benefit.  One study has found chest vapor rub to provide some relief of nocturnal cough, congestion, and sleep difficulty. Some advise to avoid physical exercise if there are symptoms such as fever, widespread muscle aches or fatigue Common cold Common cold",
        "response": "You are welcome. Hope you get well soon!"
    },
    {
        "dialog": [
            "Hi Medi, can you explain to me what is the best way to take care of my health after surgery?",
            "Sure, what type of surgery did you have?",
            "I've just had my appendix removed, what should I do?",
            "You should avoid physical exercise if there are symptoms such as fever, widespread muscle aches or fatigue.",
            "How about my diet?",
            "You should eat a balanced diet and avoid fatty or fried food, you may want to drink plenty of water.",
            "What should I do with my incision?",
            "You should keep your incision area clean and dry, and monitor it for any signs of infection, such as redness, swelling, or pus drainage. If you have any of these symptoms, contact your doctor.",
            "Thanks for your advice, Medi"
        ],
        "knowledge": "Appendicitis Appendicitis  After surgery, it is important to take care of your health by following your doctor's instructions. If you have pain or discomfort, you should avoid physical exercise. You should eat a balanced diet and avoid fatty or fried food. You may want to drink plenty of water. You should keep your incision area clean and dry, and monitor it for any signs of infection, such as redness, swelling, or pus drainage. If you have any of these symptoms, contact your doctor. Appendectomy is a safe procedure, but like any surgery, it carries risks. In some cases, complications may occur, such as infection, bleeding, or injury to nearby organs. Appendicitis Appendicitis",
        "response": "You're welcome. If you have any other questions, feel free to ask me. "
    },
    {
        "dialog": [
            "Hello, Medi. I recently had my gallbladder removed. What can I do to maintain my health?",
            "After gallbladder surgery, you should take care of your health",
            "What should I do, Medi?",
            "You should eat a low-fat diet, avoid high-fat foods, and eat small, frequent meals. Also, you should drink plenty of fluids and avoid carbonated beverages.",
            "Can I do physical activity?",
            "You should wait until you are fully recovered before you start to do physical activity, and you should consult your doctor first.",
            "What can I do with my incision wound?",
            "You should keep the area clean and dry, and you should monitor it for any signs of infection, such as redness, swelling, or pus drainage. If you have any of these symptoms, contact your doctor.",
            "Thank you, Medi, for your advice."
        ],
        "knowledge": "Gallbladder removal Gallbladder removal  After gallbladder surgery, you should take care of your health by following your doctor's instructions. You should eat a low-fat diet, avoid high-fat foods, and eat small, frequent meals. Also, you should drink plenty of fluids and avoid carbonated beverages. You should wait until you are fully recovered before you start to do physical activity, and you should consult your doctor first. You should keep the area clean and dry, and you should monitor it for any signs of infection, such as redness, swelling, or pus drainage. If you have any of these symptoms, contact your doctor. Gallbladder removal Gallbladder removal",
        "response": "You're welcome. I hope you recover quickly."
    },
    {
        "dialog": [
            "Hello Medi, I have a runny nose and cough. What should I do?",
            "Based on your symptoms, you may have a common cold. You can try Ipratropium nasal spray for runny nose and chest vapor rub for cough relief.",
            "Is it safe for children to use nasal decongestant?",
            "It is unclear due to lack of studies. It is better to consult with a doctor before use.",
            "What can I do to shortens respiratory illness?",
            "It is not known whether increased fluid intake can improve symptoms or shorten respiratory illness.",
            "Can I do physical exercise with these symptoms?",
            "It depends on the severity of your symptoms. If you have fever, widespread muscle aches, or fatigue, it is better to avoid physical exercise.",
            "Thank you for the advice, Medi. What else should I know about common cold?"
        ],
        "knowledge": "Common cold Common cold  Ipratropium nasal spray may reduce the symptoms of a runny nose but has little effect on stuffiness.  Ipratropium may also help with cough in adults.  The safety and effectiveness of nasal decongestant use in children is unclear. Due to lack of studies, it is not known whether increased fluid intake improves symptoms or shortens respiratory illness.  As of 2017 heated and humidified air, such as via RhinoTherm, is of unclear benefit.  One study has found chest vapor rub to provide some relief of nocturnal cough, congestion, and sleep difficulty. Some advise to avoid physical exercise if there are symptoms such as fever, widespread muscle aches or fatigue Common cold Common cold",
        "response": "You're welcome. If you have any further questions or concerns, feel free to ask me."
    },
    {
        "dialog": [
            "Hello Medi, I have a runny nose and cough. What should I do?",
            "Based on your symptoms, you may have a common cold. You can try Ipratropium nasal spray to reduce the runny nose and chest vapor rub for relief of nocturnal cough, congestion, and sleep difficulty.",
            "Can increased fluid intake help me?",
            "There is not enough evidence to suggest that increased fluid intake will help with the symptoms. ",
            "Should I continue my physical exercise routine?",
            "It is advisable to avoid physical exercise if you have symptoms such as fever, widespread muscle aches or fatigue.",
            "Thanks for the advice, Medi. How long is it going to last?",
            "Typically, symptoms of a common cold are resolved within a week or two, but it can last up to several weeks.",
            "Can I take any medications?"
        ],
        "knowledge": "Common cold Common cold  Ipratropium nasal spray may reduce the symptoms of a runny nose but has little effect on stuffiness.  Ipratropium may also help with cough in adults.  The safety and effectiveness of nasal decongestant use in children is unclear. Due to lack of studies, it is not known whether increased fluid intake improves symptoms or shortens respiratory illness.  As of 2017 heated and humidified air, such as via RhinoTherm, is of unclear benefit.  One study has found chest vapor rub to provide some relief of nocturnal cough, congestion, and sleep difficulty. Some advise to avoid physical exercise if there are symptoms such as fever, widespread muscle aches or fatigue Common cold Common cold",
        "response": "You're welcome. If you need further assistance, don't hesitate to ask me."
    },
    {
        "dialog": [
            "Hi Medi, I'm worried that my child has a common cold.",
            "I understand. Can you describe the symptoms?",
            "Yes, my child has a runny nose and a cough.",
            "It is possible that your child may have a common cold. You can try using Ipratropium nasal spray to reduce the runny nose and chest vapor rub for relief of nocturnal cough, congestion, and sleep difficulty.",
            "Is it safe to give my child these medications?",
            "The safety and effectiveness of nasal decongestant use in children is unclear, so it's best to consult your pediatrician first. As for chest vapor rub, it is generally safe for children over 2 years old.",
            "What can I do to make my child feel better?",
            "You can try increasing fluid intake and giving your child plenty of rest. If the symptoms persist, consult your pediatrician.",
            "Thank you, Medi. Is it contagious?"
        ],
        "knowledge": "Common cold Common cold  Ipratropium nasal spray may reduce the symptoms of a runny nose but has little effect on stuffiness.  Ipratropium may also help with cough in adults.  The safety and effectiveness of nasal decongestant use in children is unclear. Due to lack of studies, it is not known whether increased fluid intake improves symptoms or shortens respiratory illness.  As of 2017 heated and humidified air, such as via RhinoTherm, is of unclear benefit.  One study has found chest vapor rub to provide some relief of nocturnal cough, congestion, and sleep difficulty. Some advise to avoid physical exercise if there are symptoms such as fever, widespread muscle aches or fatigue Common cold Common cold",
        "response": "You're welcome. If you need further assistance, don't hesitate to ask me."
    },
    {
        "dialog": [
            "Hi Medi, I just had a common cold. What should I do now?",
            "It's best to rest and avoid strenuous physical activity until you have fully recovered.",
            "Can I exercise if I feel better?",
            "Yes, you can gradually resume your exercise routine once your symptoms have improved. However, it's best to start with light exercise and gradually increase the intensity.",
            "What should I eat?",
            "It's important to eat a well-balanced diet that includes plenty of fruits, vegetables, and lean protein. Avoid sugary and processed foods.",
            "Are there any specific foods that can help with the recovery?",
            "There is no specific food that can cure a common cold, but consuming foods rich in vitamin C and zinc may help boost the immune system.",
            "Thanks for the advice, Medi. Is it possible to get a common cold again?"
        ],
        "knowledge": "Common cold Common cold  Ipratropium nasal spray may reduce the symptoms of a runny nose but has little effect on stuffiness.  Ipratropium may also help with cough in adults.  The safety and effectiveness of nasal decongestant use in children is unclear. Due to lack of studies, it is not known whether increased fluid intake improves symptoms or shortens respiratory illness.  As of 2017 heated and humidified air, such as via RhinoTherm, is of unclear benefit.  One study has found chest vapor rub to provide some relief of nocturnal cough, congestion, and sleep difficulty. Some advise to avoid physical exercise if there are symptoms such as fever, widespread muscle aches or fatigue Common cold Common cold",
        "response": "You're welcome. If you need further assistance, don't hesitate to ask me."
    },
    {
        "dialog": [
            "Hello Medi, I have a runny nose and cough, what should I do?",
            "Based on your symptoms, you might have the common cold. Have you tried any medication?",
            "No, not yet. What is the best medication for a common cold?",
            "Ipratropium nasal spray may reduce the symptoms of a runny nose, while chest vapor rub provides relief of cough and congestion. However, increased fluid intake's effectiveness is unknown.",
            "That's helpful. Should I avoid physical exercise?",
            "If you have fever, widespread muscle aches, or fatigue, it's best to avoid physical exercise.",
            "Okay, I understand. Can you recommend any home remedies?",
            "Heated and humidified air may help, but its benefits are unclear. Rest and plenty of fluids are also recommended.",
            "Thanks, Medi. How long does a common cold usually last?"
        ],
        "knowledge": "Common cold Common cold  Ipratropium nasal spray may reduce the symptoms of a runny nose but has little effect on stuffiness.  Ipratropium may also help with cough in adults.  The safety and effectiveness of nasal decongestant use in children is unclear. Due to lack of studies, it is not known whether increased fluid intake improves symptoms or shortens respiratory illness.  As of 2017 heated and humidified air, such as via RhinoTherm, is of unclear benefit.  One study has found chest vapor rub to provide some relief of nocturnal cough, congestion, and sleep difficulty. Some advise to avoid physical exercise if there are symptoms such as fever, widespread muscle aches or fatigue Common cold Common cold",
        "response": "The common cold usually lasts around 7-10 days. Stay hydrated and rest as much as possible to help your body recover."
    },
    {
        "dialog": [
            "Hello, Medi. I'm just wondering about the safety of nasal decongestants for children.",
            "That's a great question. Currently, there is unclear evidence regarding the safety and effectiveness of nasal decongestants for children.",
            "Oh, I see. So what about cough medicine for children?",
            "Again, the safety and effectiveness of cough medicine for children is unclear. It's always best to consult with a doctor before giving any medication to a child.",
            "Right, thanks for letting me know. Can you give me any advice for preventing a common cold?",
            "Washing your hands frequently, avoiding close contact with sick people and avoiding touching your face are some ways to prevent the common cold.",
            "I'll make sure to keep that in mind. Lastly, how can I tell if my cold has turned into a more serious illness?",
            "If you experience chest pain, difficulty breathing, or a high fever, seek medical attention immediately.",
            "Thank you, Medi. This has been very helpful."
        ],
        "knowledge": "Common cold Common cold  Ipratropium nasal spray may reduce the symptoms of a runny nose but has little effect on stuffiness.  Ipratropium may also help with cough in adults.  The safety and effectiveness of nasal decongestant use in children is unclear. Due to lack of studies, it is not known whether increased fluid intake improves symptoms or shortens respiratory illness.  As of 2017 heated and humidified air, such as via RhinoTherm, is of unclear benefit.  One study has found chest vapor rub to provide some relief of nocturnal cough, congestion, and sleep difficulty. Some advise to avoid physical exercise if there are symptoms such as fever, widespread muscle aches or fatigue Common cold Common cold",
        "response": "You're welcome. Don't hesitate to contact me if you have any more questions."
    },
    {
        "dialog": [
            "Hi, Medi. I recently had a cold and I was wondering what kind of diet I should follow to help my recovery?",
            "Great question. Consuming a balanced diet rich in vitamins and minerals can help boost your immune system and speed up your recovery.",
            "What kind of foods should I eat to boost my immune system?",
            "Foods like citrus fruits, leafy greens, nuts, and whole grains are great sources of vitamins and minerals that can help boost your immune system.",
            "That's helpful. What about physical activity?",
            "Physical activity can help improve your symptoms and boost your immune system, but it's important to listen to your body and not overexert yourself.",
            "Got it. Lastly, is there anything I should avoid eating?",
            "Avoiding foods high in sugar and unhealthy fats can help keep your immune system strong during your recovery.",
            "Thanks, Medi. I'll make sure to follow your advice."
        ],
        "knowledge": "Common cold Common cold  Ipratropium nasal spray may reduce the symptoms of a runny nose but has little effect on stuffiness.  Ipratropium may also help with cough in adults.  The safety and effectiveness of nasal decongestant use in children is unclear. Due to lack of studies, it is not known whether increased fluid intake improves symptoms or shortens respiratory illness.  As of 2017 heated and humidified air, such as via RhinoTherm, is of unclear benefit.  One study has found chest vapor rub to provide some relief of nocturnal cough, congestion, and sleep difficulty. Some advise to avoid physical exercise if there are symptoms such as fever, widespread muscle aches or fatigue Common cold Common cold",
        "response": "You're welcome. I'm always here to help if you have any more questions."
    },
    {
        "dialog": [
            "Hi Medi, I have a runny nose and cough. What should I do?",
            "Hi there, you might have a common cold. Rest and drink plenty of fluids.",
            "What else can I do to relieve my symptoms?",
            "You can try Ipratropium nasal spray for your runny nose and chest vapor rub for your cough.",
            "Is it okay to exercise with these symptoms?",
            "You can exercise if you don't have fever, widespread muscle aches, or fatigue.",
            "Is increased fluid intake helpful?",
            "It's not known whether increased fluid intake improves symptoms or shortens respiratory illness.",
            "What is the safety of nasal decongestant use in children?"
        ],
        "knowledge": "Common cold Common cold  Ipratropium nasal spray may reduce the symptoms of a runny nose but has little effect on stuffiness.  Ipratropium may also help with cough in adults.  The safety and effectiveness of nasal decongestant use in children is unclear. Due to lack of studies, it is not known whether increased fluid intake improves symptoms or shortens respiratory illness.  As of 2017 heated and humidified air, such as via RhinoTherm, is of unclear benefit.  One study has found chest vapor rub to provide some relief of nocturnal cough, congestion, and sleep difficulty. Some advise to avoid physical exercise if there are symptoms such as fever, widespread muscle aches or fatigue Common cold Common cold",
        "response": "The safety and effectiveness of nasal decongestant use in children is unclear due to lack of studies."
    },
    {
        "dialog": [
            "Hey Medi, I just had a medical procedure. What should I do now?",
            "Hi there, take proper rest and avoid heavy lifting for a few days.",
            "What kind of diet should I follow?",
            "Eat small and frequent meals, and avoid spicy and oily food.",
            "Can I exercise after the medical procedure?",
            "You should avoid strenuous physical activity for a few days.",
            "What about other lifestyle changes?",
            "Don't smoke or drink alcohol, and follow your doctor's advice for medication.",
            "When can I resume my normal activities?"
        ],
        "knowledge": "Medical procedure Medical procedure  After a medical procedure, it is important to take proper rest and avoid heavy lifting for a few days.  Eat small and frequent meals, and avoid spicy and oily food.  Avoid strenuous physical activity for a few days.  Don't smoke or drink alcohol, and follow your doctor's advice for medication.  Medical procedures can have different recovery times and requirements depending on the individual, the procedure, and other factors Medical procedure Medical procedure",
        "response": "It depends on the medical procedure you had. You should consult your doctor for the appropriate time to resume your normal activities."
    },
    {
        "dialog": [
            "Hi Medi, can you explain the disease called Influenza?",
            "Sure, Influenza is a viral illness causing fever, cough, and muscle aches.",
            "What are the other symptoms of Influenza?",
            "It can also cause sore throat, runny or stuffy nose, headaches, and fatigue.",
            "How long does Influenza last?",
            "The standard influenza symptoms typically last for 2-8 days.",
            "Is Influenza a serious disease?",
            "Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common.",
            "How can we prevent the spread of Influenza?"
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "Wash your hands frequently, cover your mouth and nose when you cough or sneeze, avoid contact with sick people, and get vaccinated every year."
    },
    {
        "dialog": [
            "Hi Medi, I have a runny nose and cough, can you help me?",
            "Sure, I can help you. Can you describe your symptoms more?",
            "I have a runny nose and cough, and I feel tired.",
            "Based on your symptoms, you may have a common cold.",
            "Is there anything I can do to relieve my symptoms?",
            "You can use an ipratropium nasal spray to reduce your runny nose and chest vapor rub to relieve coughing.",
            "Ok, I will try those. But, is it okay for me to exercise?",
            "It's better to avoid physical exercise if you have a fever, widespread muscle aches or fatigue.",
            "Thanks for your advice, Medi"
        ],
        "knowledge": "Common cold Common cold  Ipratropium nasal spray may reduce the symptoms of a runny nose but has little effect on stuffiness.  Ipratropium may also help with cough in adults.  The safety and effectiveness of nasal decongestant use in children is unclear. Due to lack of studies, it is not known whether increased fluid intake improves symptoms or shortens respiratory illness.  As of 2017 heated and humidified air, such as via RhinoTherm, is of unclear benefit.  One study has found chest vapor rub to provide some relief of nocturnal cough, congestion, and sleep difficulty. Some advise to avoid physical exercise if there are symptoms such as fever, widespread muscle aches or fatigue Common cold Common cold",
        "response": "You're welcome! I hope you feel better soon."
    },
    {
        "dialog": [
            "Hi Medi, do nasal decongestants work for colds?",
            "Yes, they can help relieve symptoms of a runny or stuffy nose.",
            "Are there any side effects?",
            "Nasal decongestants can cause side effects like nasal dryness, irritation, and rebound congestion if used for more than 3 days.",
            "Okay, thanks for letting me know. What about humidifiers?",
            "Humidifiers may help relieve symptoms of a common cold, but their effectiveness is unclear.",
            "I see. Can you suggest any natural remedies for colds?",
            "Drinking plenty of fluids, getting enough rest, and using saline nasal drops can all help relieve symptoms of a common cold.",
            "Thanks for all your help, Medi."
        ],
        "knowledge": "Common cold Common cold  Ipratropium nasal spray may reduce the symptoms of a runny nose but has little effect on stuffiness.  Ipratropium may also help with cough in adults.  The safety and effectiveness of nasal decongestant use in children is unclear. Due to lack of studies, it is not known whether increased fluid intake improves symptoms or shortens respiratory illness.  As of 2017 heated and humidified air, such as via RhinoTherm, is of unclear benefit.  One study has found chest vapor rub to provide some relief of nocturnal cough, congestion, and sleep difficulty. Some advise to avoid physical exercise if there are symptoms such as fever, widespread muscle aches or fatigue Common cold Common cold",
        "response": "You're welcome! Let me know if you have any other questions."
    },
    {
        "dialog": [
            "Hi Medi, I just had nasal surgery. What can I do to help with my recovery?",
            "After nasal surgery, it's important to rest and avoid physical activity for a few days.",
            "What about my diet?",
            "You should avoid spicy or crunchy foods and stick to soft, bland foods for a few days.",
            "Okay, that makes sense. Can I use a humidifier?",
            "Yes, using a humidifier can help keep your nasal passages moist and aid in your recovery.",
            "Thanks for the advice, Medi.",
            "You're welcome! Take care of yourself and follow your doctor's instructions."
        ],
        "knowledge": "Nasal surgery Nasal surgery Nasal surgery is a surgical procedure performed on the nose, usually to correct problems related to breathing or appearance.  After surgery, it's important to rest and avoid physical activity for a few days.  You should avoid spicy or crunchy foods and stick to soft, bland foods for a few days.  Using a humidifier can help keep your nasal passages moist and aid in your recovery. Nasal surgery Nasal surgery",
        "response": "You're welcome! I hope your recovery goes smoothly."
    }
]