[
    {
        "dialog": [
            "Hi Medi, I have a cough and fever. Can you help me?",
            "Sure, I'm here to help. Can you tell me more about your symptoms?",
            "Well, I have a temperature of 101°F and I've been coughing a lot. It's been going on for two days now.",
            "Okay, it sounds like you might have a respiratory infection. I recommend you get some rest and drink plenty of fluids. If your symptoms persist, seek medical attention.",
            "What about medication? Should I take anything?",
            "You can take over-the-counter cough suppressants and fever reducers, but make sure to read the label and follow the recommended dosage. And again, if your symptoms persist, see a doctor."
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "Based on your symptoms, I think you might have a respiratory infection. I recommend rest, fluids and over-the-counter medication. If your symptoms persist, please see a doctor."
    },
    {
        "dialog": [
            "Hi Medi, what is pneumonia and how is it caused?",
            "Pneumonia is an infection in the lungs that can be caused by either a virus or bacteria. Primary pneumonia is caused by the initial viral infection, while secondary pneumonia is caused by a secondary bacterial infection.",
            "What are the symptoms?",
            "Symptoms of primary pneumonia include rapid progression of fever, cough, labored breathing, and low oxygen levels that cause bluish skin. Secondary pneumonia typically has a period of improvement in symptoms for 1-3 weeks followed by recurrent fever, sputum production, and fluid buildup in the lungs, but can also occur just a few days after influenza symptoms appear.",
            "What are the most common bacteria that cause pneumonia?",
            "The most frequent bacteria that cause secondary pneumonia are Streptococcus pneumoniae and Staphylococcus aureus.",
            "Is there a way to prevent pneumonia?",
            "The best way to prevent pneumonia is to maintain good hygiene practices, get vaccinated against viruses that can cause pneumonia, and seek medical attention if you have symptoms of respiratory infection."
        ],
        "knowledge": "Influenza Influenza  Pneumonia may be caused by the primary viral infection or by a secondary bacterial infection.  Primary pneumonia is characterized by rapid progression of fever, cough, labored breathing, and low oxygen levels that cause bluish skin.  It is especially common among those who have an underlying cardiovascular disease such as rheumatic heart disease.  Secondary pneumonia typically has a period of improvement in symptoms for 1–3 weeks followed by recurrent fever, sputum production, and fluid buildup in the lungs, but can also occur just a few days after influenza symptoms appear.  About a third of primary pneumonia cases are followed by secondary pneumonia, which is most frequently caused by the bacteria Streptococcus pneumoniae and Staphylococcus aureus. Influenza viruses comprise four species.  Each of the four species is the sole member of its own genus, and the four influenza genera comprise four of the seven genera in the family Orthomyxoviridae Influenza Influenza",
        "response": "Pneumonia is an infection in the lungs that can be caused by either virus or bacteria. Symptoms include fever, cough, labored breathing and low oxygen levels in primary pneumonia and recurrent fever, sputum production and fluid buildup in the lungs in secondary pneumonia. The most frequent bacteria that cause secondary pneumonia are Streptococcus pneumoniae and Staphylococcus aureus. Good hygiene, vaccination and seeking medical attention are ways to prevent pneumonia."
    },
    {
        "dialog": [
            "Hi Medi, I just had a surgical procedure done and I'm wondering what I should do to recover faster.",
            "Congratulations on finishing the procedure! What kind of procedure did you have done?",
            "I had a minor surgery to remove a mole.",
            "Okay, after the procedure, it's important to take it easy for a few days. Avoid any strenuous physical activity and make sure to get plenty of rest.",
            "What kind of food should I eat?",
            "It's important to eat a healthy, balanced diet that includes plenty of fruits and vegetables. You may also want to incorporate foods that are high in protein to help with healing.",
            "What about medication?",
            "Your doctor may have prescribed some pain medication for you. Make sure to follow the dosage instructions carefully and don't hesitate to contact your doctor if you experience any side effects.",
            "Thank you for the advice, Medi. I feel much better now."
        ],
        "knowledge": "Surgery Surgery  After surgery, it's important to get plenty of rest and avoid any strenuous physical activity.  Eat a healthy, balanced diet that includes plenty of fruits and vegetables.  Incorporate foods that are high in protein to help with healing.  Take any medication prescribed by your doctor as directed and don't hesitate to contact them if you have any questions or concerns. Surgery Surgery",
        "response": "You're welcome! Remember to take it easy for a few days, eat a healthy diet and follow your doctor's instructions for medication. I'm glad you're feeling better."
    },
    {
        "dialog": [
            "Hi, Medi. I am experiencing rapid breathing and low oxygen levels.",
            "Hello! Based on your symptoms, it seems like you could have Primary pneumonia.",
            "What is Primary pneumonia?",
            "It is characterized by rapid progression of fever, cough, labored breathing, and low oxygen levels that cause bluish skin.",
            "What is the cause of Primary pneumonia?",
            "It may be caused by the primary viral infection or by a secondary bacterial infection. It is especially common among those who have an underlying cardiovascular disease such as rheumatic heart disease.",
            "What should I do if I have Primary pneumonia?",
            "You should seek medical help as soon as possible and take proper medication prescribed by your doctor.",
            "What medication do you suggest?"
        ],
        "knowledge": "Influenza Influenza Pneumonia may be caused by the primary viral infection or by a secondary bacterial infection. Primary pneumonia is characterized by rapid progression of fever, cough, labored breathing, and low oxygen levels that cause bluish skin. It is especially common among those who have an underlying cardiovascular disease such as rheumatic heart disease. Secondary pneumonia typically has a period of improvement in symptoms for 1–3 weeks followed by recurrent fever, sputum production, and fluid buildup in the lungs, but can also occur just a few days after influenza symptoms appear. About a third of primary pneumonia cases are followed by secondary pneumonia, which is most frequently caused by the bacteria Streptococcus pneumoniae and Staphylococcus aureus. Influenza viruses comprise four species. Each of the four species is the sole member of its own genus, and the four influenza genera comprise four of the seven genera in the family Orthomyxoviridae Influenza Influenza",
        "response": "That depends on what the doctor prescribes. They will take into account your specific situation and medical history before making any recommendations."
    },
    {
        "dialog": [
            "Hi Medi, I have a question about Influenza.",
            "Sure, I'm here to help. What's your question?",
            "What are the common symptoms of Influenza?",
            "The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion. These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose. Coughing is the most common symptom.",
            "How long do these symptoms usually last?",
            "The standard influenza symptoms typically last for 2 - 8 days.",
            "What about long-term symptoms?",
            "A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID.",
            "Can influenza cause pneumonia?"
        ],
        "knowledge": "Influenza Influenza The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion. These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose. Coughing is the most common symptom. Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children. The standard influenza symptoms typically last for 2 - 8 days. A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "Yes, influenza can cause pneumonia. If you experience symptoms such as labored breathing or low oxygen levels, it's important to seek medical attention as soon as possible."
    },
    {
        "dialog": [
            "Hi Medi, I recently had pneumonia. Do you have any advice for my recovery?",
            "Of course, I'd be happy to help. What kind of advice are you looking for?",
            "I'm wondering if there are any dietary changes I should make.",
            "Yes, it's important to eat a healthy diet with plenty of fruits, vegetables, and whole grains. You should also limit your intake of processed foods and sugary drinks.",
            "What about exercise?",
            "You should start slow and gradually increase your activity level as you feel better. Walking, biking, and swimming are all good options. It's important to listen to your body and not push yourself too hard.",
            "Are there any other lifestyle changes I should make?",
            "Getting enough sleep and managing stress are also important for a healthy recovery. Make sure to stay hydrated as well.",
            "Thank you for the advice. How long should I expect my recovery to take?"
        ],
        "knowledge": "Influenza Influenza Pneumonia may be caused by the primary viral infection or by a secondary bacterial infection. Primary pneumonia is characterized by rapid progression of fever, cough, labored breathing, and low oxygen levels that cause bluish skin. It is especially common among those who have an underlying cardiovascular disease such as rheumatic heart disease. Secondary pneumonia typically has a period of improvement in symptoms for 1–3 weeks followed by recurrent fever, sputum production, and fluid buildup in the lungs, but can also occur just a few days after influenza symptoms appear. About a third of primary pneumonia cases are followed by secondary pneumonia, which is most frequently caused by the bacteria Streptococcus pneumoniae and Staphylococcus aureus. Influenza viruses comprise four species. Each of the four species is the sole member of its own genus, and the four influenza genera comprise four of the seven genera in the family Orthomyxoviridae Influenza Influenza",
        "response": "It's hard to say exactly how long your recovery will take, but make sure to follow your doctor's advice and take care of yourself. With proper care and rest, you should start to feel better soon."
    },
    {
        "dialog": [
            "Hello Medi, I'm feeling very sick. What could be wrong?",
            "I'm here to help. Can you tell me your symptoms?",
            "I have fever, cough, and difficulty breathing.",
            "Based on your symptoms, it's possible that you have pneumonia. You should see a doctor as soon as possible.",
            "What causes pneumonia and how can I prevent it?",
            "Pneumonia can be caused by a viral or bacterial infection. You can prevent it by getting vaccinated and avoiding close contact with people who are sick.",
            "Thanks for the advice, Medi",
            "You're welcome. Please take care of yourself and see a doctor soon if your symptoms worsen.",
            "Will do."
        ],
        "knowledge": "Influenza Influenza  Pneumonia may be caused by the primary viral infection or by a secondary bacterial infection.  Primary pneumonia is characterized by rapid progression of fever, cough, labored breathing, and low oxygen levels that cause bluish skin.  It is especially common among those who have an underlying cardiovascular disease such as rheumatic heart disease.  Secondary pneumonia typically has a period of improvement in symptoms for 1–3 weeks followed by recurrent fever, sputum production, and fluid buildup in the lungs, but can also occur just a few days after influenza symptoms appear.  About a third of primary pneumonia cases are followed by secondary pneumonia, which is most frequently caused by the bacteria Streptococcus pneumoniae and Staphylococcus aureus. Influenza viruses comprise four species.  Each of the four species is the sole member of its own genus, and the four influenza genera comprise four of the seven genera in the family Orthomyxoviridae Influenza Influenza",
        "response": "Please see a doctor as soon as possible based on your symptoms. It's likely you have pneumonia and could have contracted it from a viral or bacterial infection. You can prevent it by getting vaccinated and avoiding close contact with people who are sick."
    },
    {
        "dialog": [
            "Hi Medi, can you tell me more about the flu?",
            "Of course. What would you like to know?",
            "What are the symptoms of the flu?",
            "The symptoms of the flu include fever, cough, sore throat, body aches, and fatigue.",
            "How is the flu spread?",
            "The flu is spread through droplets when someone with the flu coughs, sneezes, or talks. You can also get it by touching a surface with the flu virus on it and then touching your mouth or nose.",
            "How can I prevent getting the flu?",
            "You can prevent getting the flu by getting vaccinated every year, washing your hands frequently, avoiding close contact with people who are sick, and covering your cough or sneeze with a tissue.",
            "Thanks for the information, Medi."
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "You can prevent getting the flu by getting vaccinated every year, washing your hands frequently, avoiding close contact with people who are sick, and covering your cough or sneeze with a tissue."
    },
    {
        "dialog": [
            "Hi Medi, I just had a medical procedure. What should I do next?",
            "Congratulations! What procedure did you have?",
            "I had surgery on my knee.",
            "Ah, I see. You should rest and elevate your knee to reduce swelling. You should also follow any instructions given to you by your doctor.",
            "What about physical activity?",
            "You should avoid any rigorous physical activity for at least a few weeks and gradually increase your activity level as your knee heals.",
            "What about my diet?",
            "You should eat a balanced diet with plenty of protein and vitamins to help your body heal.",
            "Thanks for the advice, Medi."
        ],
        "knowledge": "Influenza Influenza  Pneumonia may be caused by the primary viral infection or by a secondary bacterial infection.  Primary pneumonia is characterized by rapid progression of fever, cough, labored breathing, and low oxygen levels that cause bluish skin.  It is especially common among those who have an underlying cardiovascular disease such as rheumatic heart disease.  Secondary pneumonia typically has a period of improvement in symptoms for 1–3 weeks followed by recurrent fever, sputum production, and fluid buildup in the lungs, but can also occur just a few days after influenza symptoms appear.  About a third of primary pneumonia cases are followed by secondary pneumonia, which is most frequently caused by the bacteria Streptococcus pneumoniae and Staphylococcus aureus. Influenza viruses comprise four species.  Each of the four species is the sole member of its own genus, and the four influenza genera comprise four of the seven genera in the family Orthomyxoviridae Influenza Influenza",
        "response": "Rest and elevate your knee to reduce swelling. Avoid any rigorous physical activity and eat a balanced diet with plenty of protein and vitamins to help your body heal."
    },
    {
        "dialog": [
            "Hi Medi, I have been coughing and feeling feverish for a few days now.",
            "Hello! I'm sorry to hear that. Do you have any other symptoms?",
            "Yes, I also have difficulty breathing and feel very tired.",
            "Based on your symptoms, you may have primary pneumonia. You should see a doctor immediately.",
            "What is primary pneumonia?",
            "Primary pneumonia is characterized by rapid progression of fever, cough, labored breathing, and low oxygen levels that cause bluish skin.",
            "What causes primary pneumonia?",
            "It may be caused by the primary viral infection or by a secondary bacterial infection.",
            "Thank you, Medi."
        ],
        "knowledge": "Influenza Influenza  Pneumonia may be caused by the primary viral infection or by a secondary bacterial infection.  Primary pneumonia is characterized by rapid progression of fever, cough, labored breathing, and low oxygen levels that cause bluish skin.  It is especially common among those who have an underlying cardiovascular disease such as rheumatic heart disease.  Secondary pneumonia typically has a period of improvement in symptoms for 1–3 weeks followed by recurrent fever, sputum production, and fluid buildup in the lungs, but can also occur just a few days after influenza symptoms appear.  About a third of primary pneumonia cases are followed by secondary pneumonia, which is most frequently caused by the bacteria Streptococcus pneumoniae and Staphylococcus aureus. Influenza viruses comprise four species.  Each of the four species is the sole member of its own genus, and the four influenza genera comprise four of the seven genera in the family Orthomyxoviridae Influenza Influenza",
        "response": "You're welcome! Please see a doctor as soon as possible to get a proper diagnosis and treatment."
    },
    {
        "dialog": [
            "Hi Medi, I have some questions about influenza.",
            "Sure, I'm here to help. What would you like to know?",
            "What are the symptoms of influenza?",
            "The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion. These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.",
            "Can influenza cause pneumonia?",
            "Yes, symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common.",
            "How can I prevent getting influenza?",
            "The best way to prevent influenza is by getting vaccinated every year. Washing your hands frequently and avoiding close contact with sick people can also help.",
            "Thank you for the information, Medi."
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "You're welcome! I'm glad to be of help. Let me know if you have any other questions!"
    },
    {
        "dialog": [
            "Hi Medi, I recently had secondary pneumonia. What lifestyle changes should I make to prevent it from happening again?",
            "I'm sorry to hear that. To prevent secondary pneumonia, you should make sure to get a flu vaccine every year and practice good hygiene by washing your hands frequently. Eating a healthy diet, exercising regularly, and avoiding smoking can also help.",
            "What foods should I eat to boost my immune system?",
            "Foods that are rich in antioxidants, such as fruits and vegetables, can help boost your immune system. Vitamin C, found in citrus fruits and leafy greens, can also be beneficial.",
            "Can physical activity help boost my immune system?",
            "Yes, regular physical activity can help boost your immune system and keep you healthy. Just make sure to talk to your doctor before starting a new exercise routine.",
            "Thank you for your advice, Medi.",
            "You're welcome. Please take good care of yourself and let me know if you have any other questions.",
            "Sure, I will. Can you tell me more about secondary pneumonia?"
        ],
        "knowledge": "Influenza Influenza  Pneumonia may be caused by the primary viral infection or by a secondary bacterial infection.  Primary pneumonia is characterized by rapid progression of fever, cough, labored breathing, and low oxygen levels that cause bluish skin.  It is especially common among those who have an underlying cardiovascular disease such as rheumatic heart disease.  Secondary pneumonia typically has a period of improvement in symptoms for 1–3 weeks followed by recurrent fever, sputum production, and fluid buildup in the lungs, but can also occur just a few days after influenza symptoms appear.  About a third of primary pneumonia cases are followed by secondary pneumonia, which is most frequently caused by the bacteria Streptococcus pneumoniae and Staphylococcus aureus. Influenza viruses comprise four species.  Each of the four species is the sole member of its own genus, and the four influenza genera comprise four of the seven genera in the family Orthomyxoviridae Influenza Influenza",
        "response": "You're welcome! Please let me know if you have any other questions."
    },
    {
        "dialog": [
            "Hi Medi, I have been coughing for a week. What is wrong with me?",
            "Hi! I am a chatbot, so I can’t carry out a physical examination. But, your condition might be related to the context. Do you have any other symptoms?",
            "Yes, I feel very weak and get chills sometimes. I also have a mild fever.",
            "Based on your symptoms, you might have contracted pneumonia. It can be caused by a viral or bacterial infection. You should see a doctor immediately.",
            "Oh no, that sounds serious. What are the common treatments for pneumonia?",
            "Depending on the cause of pneumonia, treatment may be antibiotics, antiviral medications, or other medications. Rest, staying hydrated, and taking medication as prescribed by your doctor should be your top priorities.",
            "What can I do to prevent pneumonia from happening?",
            "Maintaining good hygiene, getting vaccinated, and avoiding smoking can help reduce your risk of getting pneumonia.",
            "Thanks for your advice, Medi. You are very helpful."
        ],
        "knowledge": "Influenza Influenza  Pneumonia may be caused by the primary viral infection or by a secondary bacterial infection.  Primary pneumonia is characterized by rapid progression of fever, cough, labored breathing, and low oxygen levels that cause bluish skin.  It is especially common among those who have an underlying cardiovascular disease such as rheumatic heart disease.  Secondary pneumonia typically has a period of improvement in symptoms for 1–3 weeks followed by recurrent fever, sputum production, and fluid buildup in the lungs, but can also occur just a few days after influenza symptoms appear.  About a third of primary pneumonia cases are followed by secondary pneumonia, which is most frequently caused by the bacteria Streptococcus pneumoniae and Staphylococcus aureus. Influenza viruses comprise four species.  Each of the four species is the sole member of its own genus, and the four influenza genera comprise four of the seven genera in the family Orthomyxoviridae Influenza Influenza",
        "response": "You are welcome. Don't hesitate to see a doctor as soon as possible. Pneumonia is a serious matter and requires immediate medical attention."
    },
    {
        "dialog": [
            "Hi Medi, I have been trying to stay healthy. Can you tell me more about the Influenza virus?",
            "Hello! Influenza virus is a common respiratory illness that can be caused by four different viruses. It is highly contagious and can be spread from person to person through coughing and sneezing.",
            "What are the common symptoms of Influenza?",
            "The symptoms of Influenza virus include fever, cough, sore throat, runny or stuffy nose, body aches, headache, chills, and fatigue.",
            "How long do the symptoms last?",
            "The standard symptoms of Influenza virus usually last for 2-8 days, but some people may take longer to recover, and others may develop complications such as pneumonia.",
            "Is there any way to prevent Influenza?",
            "Yes, getting vaccinated, practicing good hygiene, avoiding close contact with sick people, and avoiding touching your eyes, nose, and mouth can help reduce your risk of getting Influenza.",
            "Thank you for your advice, Medi. I will try to stay healthy."
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "You are welcome. Take care of yourself and try to maintain good hygiene to avoid the virus."
    },
    {
        "dialog": [
            "Hi Medi, I just recovered from pneumonia. Do you have any advice on how I can prevent it from returning?",
            "Hi! It's good to hear that you have recovered from pneumonia. The key to preventing pneumonia from returning is to keep your immune system strong.",
            "How can I keep my immune system strong?",
            "Eating a balanced diet, getting enough sleep, exercising regularly, and avoiding smoking and excessive alcohol consumption can help keep your immune system strong.",
            "Are there any specific foods that can help boost my immune system?",
            "Yes, foods that are high in vitamins and minerals such as fruits, vegetables, whole grains, and lean protein can help boost your immune system.",
            "What other preventive measures can I take to avoid pneumonia?",
            "Getting vaccinated, practicing good hygiene, and avoiding close contact with sick people can also help reduce your risk of getting pneumonia.",
            "Thanks, Medi. I will try my best to stay healthy and follow your advice."
        ],
        "knowledge": "Influenza Influenza  Pneumonia may be caused by the primary viral infection or by a secondary bacterial infection.  Primary pneumonia is characterized by rapid progression of fever, cough, labored breathing, and low oxygen levels that cause bluish skin.  It is especially common among those who have an underlying cardiovascular disease such as rheumatic heart disease.  Secondary pneumonia typically has a period of improvement in symptoms for 1–3 weeks followed by recurrent fever, sputum production, and fluid buildup in the lungs, but can also occur just a few days after influenza symptoms appear.  About a third of primary pneumonia cases are followed by secondary pneumonia, which is most frequently caused by the bacteria Streptococcus pneumoniae and Staphylococcus aureus. Influenza viruses comprise four species.  Each of the four species is the sole member of its own genus, and the four influenza genera comprise four of the seven genera in the family Orthomyxoviridae Influenza Influenza",
        "response": "You are welcome. Remember to take good care of yourself and stay healthy. If you have any more questions, feel free to ask me!"
    },
    {
        "dialog": [
            "Hello Medi, I have a fever and cough. What should I do?",
            "Based on your symptoms, it is possible that you have influenza. You should rest and drink plenty of fluids.",
            "Do I need to take any medication?",
            "If your symptoms are mild, over-the-counter medications like acetaminophen or ibuprofen can help relieve fever and body aches. If your symptoms are severe, you may need antiviral medication.",
            "What are the risks associated with influenza?",
            "Complications of influenza include pneumonia, bronchitis, and sinus and ear infections. In rare cases, it can lead to inflammation of the heart, brain or muscle tissue.",
            "How can I prevent getting influenza?",
            "You can prevent getting influenza by getting a flu shot, washing your hands frequently and avoiding contact with people who have the flu.",
            "Thank you for your advice, Medi"
        ],
        "knowledge": "Influenza Influenza The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion. These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose. Coughing is the most common symptom. Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children. The standard influenza symptoms typically last for 2 - 8 days. A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "You're welcome, take care and get well soon!"
    },
    {
        "dialog": [
            "Hello Medi, I just got diagnosed with primary pneumonia. What does that mean?",
            "Primary pneumonia is caused by a virus or bacteria that infects the lungs directly. Symptoms include rapid progression of fever, cough, labored breathing, and low oxygen levels that cause bluish skin.",
            "What causes secondary pneumonia?",
            "Secondary pneumonia can be caused by a bacterial infection that occurs after a person has already been infected with a virus like influenza. About a third of primary pneumonia cases are followed by secondary pneumonia, which is most frequently caused by the bacteria Streptococcus pneumoniae and Staphylococcus aureus.",
            "How can I treat primary pneumonia?",
            "Treatment for primary pneumonia includes bed rest, taking in plenty of fluids, and using over-the-counter medications to relieve fever and aches. If the pneumonia is severe, you may need antibiotics to treat the infection.",
            "Can I prevent getting pneumonia?",
            "You can reduce your risk of getting pneumonia by getting vaccinated, practicing good hygiene, and avoiding contact with people who have respiratory infections.",
            "Thank you for your help, Medi"
        ],
        "knowledge": "Influenza Influenza Pneumonia may be caused by the primary viral infection or by a secondary bacterial infection. Primary pneumonia is characterized by rapid progression of fever, cough, labored breathing, and low oxygen levels that cause bluish skin. It is especially common among those who have an underlying cardiovascular disease such as rheumatic heart disease. Secondary pneumonia typically has a period of improvement in symptoms for 1–3 weeks followed by recurrent fever, sputum production, and fluid buildup in the lungs, but can also occur just a few days after influenza symptoms appear. About a third of primary pneumonia cases are followed by secondary pneumonia, which is most frequently caused by the bacteria Streptococcus pneumoniae and Staphylococcus aureus. Influenza viruses comprise four species. Each of the four species is the sole member of its own genus, and the four influenza genera comprise four of the seven genera in the family Orthomyxoviridae Influenza Influenza",
        "response": "No, that's all for now. Thank you again, Medi."
    },
    {
        "dialog": [
            "Hello Medi, I recently had a medical procedure and I'm not sure what I should be doing in terms of my diet and exercise.",
            "After a medical procedure, it's important to give your body time to heal and to follow your doctor's orders. You should avoid strenuous exercise and stick to light activity like walking until you're fully recovered.",
            "What should I be eating?",
            "You should eat a balanced diet with plenty of protein, whole grains, and fruits and vegetables. Avoid foods that are high in fat, sugar or sodium.",
            "Are there any specific foods that I should avoid?",
            "You should avoid alcohol, caffeine and tobacco, as well as any foods that your doctor tells you to avoid.",
            "How long should I wait before resuming my normal activities?",
            "You should follow your doctor's orders and wait until you're fully recovered before resuming any strenuous activities or high-impact sports.",
            "Thanks for your help, Medi."
        ],
        "knowledge": "Influenza Influenza Pneumonia may be caused by the primary viral infection or by a secondary bacterial infection. Primary pneumonia is characterized by rapid progression of fever, cough, labored breathing, and low oxygen levels that cause bluish skin. It is especially common among those who have an underlying cardiovascular disease such as rheumatic heart disease. Secondary pneumonia typically has a period of improvement in symptoms for 1–3 weeks followed by recurrent fever, sputum production, and fluid buildup in the lungs, but can also occur just a few days after influenza symptoms appear. About a third of primary pneumonia cases are followed by secondary pneumonia, which is most frequently caused by the bacteria Streptococcus pneumoniae and Staphylococcus aureus. Influenza viruses comprise four species. Each of the four species is the sole member of its own genus, and the four influenza genera comprise four of the seven genera in the family Orthomyxoviridae Influenza Influenza",
        "response": "No, that's all for now. Thanks again, Medi."
    },
    {
        "dialog": [
            "Hello Medi, I am feeling quite sick today.",
            "Hello, I'm sorry to hear that. Can you tell me more about your symptoms?",
            "I have high fever, coughing, labored breathing, and my skin has a bluish tint.",
            "Based on your symptoms, it's possible for you to have primary pneumonia. I suggest you see a doctor immediately.",
            "What is primary pneumonia?",
            "It's characterized by rapid progression of fever, cough, labored breathing, and low oxygen levels that cause bluish skin. It's especially common among those who have an underlying cardiovascular disease such as rheumatic heart disease. ",
            "What causes primary pneumonia?",
            "It can be caused by a primary viral infection or by a secondary bacterial infection.",
            "How can I prevent primary pneumonia?"
        ],
        "knowledge": "Influenza Influenza  Pneumonia may be caused by the primary viral infection or by a secondary bacterial infection.  Primary pneumonia is characterized by rapid progression of fever, cough, labored breathing, and low oxygen levels that cause bluish skin.  It is especially common among those who have an underlying cardiovascular disease such as rheumatic heart disease.  Secondary pneumonia typically has a period of improvement in symptoms for 1–3 weeks followed by recurrent fever, sputum production, and fluid buildup in the lungs, but can also occur just a few days after influenza symptoms appear.  About a third of primary pneumonia cases are followed by secondary pneumonia, which is most frequently caused by the bacteria Streptococcus pneumoniae and Staphylococcus aureus. Influenza viruses comprise four species.  Each of the four species is the sole member of its own genus, and the four influenza genera comprise four of the seven genera in the family Orthomyxoviridae Influenza Influenza",
        "response": "You can prevent primary pneumonia by getting vaccinated against the viruses or bacteria that can cause it."
    },
    {
        "dialog": [
            "Hey Medi, can you tell me more about the influenza virus?",
            "Of course, I'd be happy to help. What would you like to know?",
            "What is the influenza virus?",
            "The influenza virus is a type of virus that can cause the flu.",
            "How many species of influenza viruses are there?",
            "There are four species of influenza viruses.",
            "What are the symptoms of the flu?",
            "The symptoms of the flu include fever, cough, sore throat, body aches, fatigue, and sometimes diarrhea and vomiting.",
            "How is the flu treated?"
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "The flu is usually treated with antiviral medications, rest, and plenty of fluids. It's important to see a doctor if your symptoms are severe or if you have other medical conditions that could put you at risk for complications."
    },
    {
        "dialog": [
            "Medi, I just had a medical procedure and want some advice on how to recover well.",
            "Of course, I'm here to help. What procedure did you have?",
            "I had surgery on my knee.",
            "Okay. After surgery, it's important to rest and avoid putting too much pressure on your knee. You should also exercise your knee gently to prevent stiffness and promote healing.",
            "What exercises should I do?",
            "Some exercises you can do include straight leg raises, ankle pumps, and knee bends.",
            "Should I do any particular stretches?",
            "Yes, stretching your quadriceps and hamstrings can help you recover more quickly.",
            "What should I eat to help my knee recover?"
        ],
        "knowledge": "Influenza Influenza  Pneumonia may be caused by the primary viral infection or by a secondary bacterial infection.  Primary pneumonia is characterized by rapid progression of fever, cough, labored breathing, and low oxygen levels that cause bluish skin.  It is especially common among those who have an underlying cardiovascular disease such as rheumatic heart disease.  Secondary pneumonia typically has a period of improvement in symptoms for 1–3 weeks followed by recurrent fever, sputum production, and fluid buildup in the lungs, but can also occur just a few days after influenza symptoms appear.  About a third of primary pneumonia cases are followed by secondary pneumonia, which is most frequently caused by the bacteria Streptococcus pneumoniae and Staphylococcus aureus. Influenza viruses comprise four species.  Each of the four species is the sole member of its own genus, and the four influenza genera comprise four of the seven genera in the family Orthomyxoviridae Influenza Influenza",
        "response": "It's important to eat a balanced and nutritious diet that includes plenty of fruits, vegetables, lean protein, and whole grains. You should also avoid foods that can cause inflammation, such as processed foods and sugary drinks."
    },
    {
        "dialog": [
            "Hi Medi, I feel like I'm coming down with something.",
            "I can help diagnose you. What are your symptoms?",
            "I have a fever, a cough, and I'm having trouble breathing.",
            "Based on your symptoms, it's possible you have pneumonia. You should see a doctor as soon as possible.",
            "What causes pneumonia?",
            "Pneumonia may be caused by a primary viral infection or a secondary bacterial infection.",
            "How is it treated?",
            "Treatment for pneumonia depends on the cause, but generally involves antibiotics and rest.",
            "Thanks for your help, Medi."
        ],
        "knowledge": "Influenza Influenza  Pneumonia may be caused by the primary viral infection or by a secondary bacterial infection.  Primary pneumonia is characterized by rapid progression of fever, cough, labored breathing, and low oxygen levels that cause bluish skin.  It is especially common among those who have an underlying cardiovascular disease such as rheumatic heart disease.  Secondary pneumonia typically has a period of improvement in symptoms for 1–3 weeks followed by recurrent fever, sputum production, and fluid buildup in the lungs, but can also occur just a few days after influenza symptoms appear.  About a third of primary pneumonia cases are followed by secondary pneumonia, which is most frequently caused by the bacteria Streptococcus pneumoniae and Staphylococcus aureus. Influenza viruses comprise four species.  Each of the four species is the sole member of its own genus, and the four influenza genera comprise four of the seven genera in the family Orthomyxoviridae Influenza Influenza",
        "response": "You're welcome. I hope you feel better soon."
    },
    {
        "dialog": [
            "Hi Medi, I have a question about the flu.",
            "Sure, what would you like to know?",
            "What are the symptoms of the flu?",
            "The symptoms of the flu can include fever, cough, sore throat, runny or stuffy nose, body aches, headache, chills, and fatigue.",
            "How long does the flu last?",
            "The flu typically lasts for about a week, but symptoms may persist for longer.",
            "Is there anything I can do to prevent getting the flu?",
            "Yes, the best way to prevent the flu is to get vaccinated each year. You can also wash your hands frequently and avoid close contact with people who are sick.",
            "Thanks, that's very helpful."
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "You're welcome. Let me know if you have any other questions."
    },
    {
        "dialog": [
            "Hi Medi, I recently had pneumonia. What can I do to prevent it from happening again?",
            "I'm sorry to hear that. Making lifestyle changes can help prevent pneumonia from recurring.",
            "What changes should I make?",
            "You should quit smoking if you're a smoker, eat a healthy diet, exercise regularly, get plenty of rest, and practice good hygiene.",
            "What is good hygiene?",
            "Good hygiene includes washing your hands frequently, covering your mouth and nose when you cough or sneeze, and avoiding close contact with people who are sick.",
            "Thanks for the advice, Medi.",
            "You're welcome. Do you have any other questions?"
        ],
        "knowledge": "Influenza Influenza  Pneumonia may be caused by the primary viral infection or by a secondary bacterial infection.  Primary pneumonia is characterized by rapid progression of fever, cough, labored breathing, and low oxygen levels that cause bluish skin.  It is especially common among those who have an underlying cardiovascular disease such as rheumatic heart disease.  Secondary pneumonia typically has a period of improvement in symptoms for 1–3 weeks followed by recurrent fever, sputum production, and fluid buildup in the lungs, but can also occur just a few days after influenza symptoms appear.  About a third of primary pneumonia cases are followed by secondary pneumonia, which is most frequently caused by the bacteria Streptococcus pneumoniae and Staphylococcus aureus. Influenza viruses comprise four species.  Each of the four species is the sole member of its own genus, and the four influenza genera comprise four of the seven genera in the family Orthomyxoviridae Influenza Influenza",
        "response": "You're welcome. Take care of yourself."
    },
    {
        "dialog": [
            "Hi Medi, I'm not feeling well, I think I might have pneumonia.",
            "Hello, I'm sorry to hear that. Can you tell me what symptoms you have?",
            "I have a fever, cough, and labored breathing with low oxygen levels.",
            "I see. It sounds like you might have primary pneumonia. Do you have any underlying cardiovascular diseases?",
            "Yes, I have rheumatic heart disease.",
            "In that case, it is especially common for you to get primary pneumonia. You should see a doctor immediately.",
            "What kind of bacteria usually cause secondary pneumonia?",
            "Streptococcus pneumoniae and Staphylococcus aureus are the most frequent causes of secondary pneumonia.",
            "Thanks for your help Medi."
        ],
        "knowledge": "Influenza Influenza  Pneumonia may be caused by the primary viral infection or by a secondary bacterial infection.  Primary pneumonia is characterized by rapid progression of fever, cough, labored breathing, and low oxygen levels that cause bluish skin.  It is especially common among those who have an underlying cardiovascular disease such as rheumatic heart disease.  Secondary pneumonia typically has a period of improvement in symptoms for 1–3 weeks followed by recurrent fever, sputum production, and fluid buildup in the lungs, but can also occur just a few days after influenza symptoms appear.  About a third of primary pneumonia cases are followed by secondary pneumonia, which is most frequently caused by the bacteria Streptococcus pneumoniae and Staphylococcus aureus. Influenza viruses comprise four species.  Each of the four species is the sole member of its own genus, and the four influenza genera comprise four of the seven genera in the family Orthomyxoviridae Influenza Influenza",
        "response": "You're welcome. I advise you to see a doctor as soon as possible to get proper treatment."
    },
    {
        "dialog": [
            "Hi Medi, I have a question about influenza.",
            "Sure, I'm here to help. What's your question?",
            "I'm curious about the four species of influenza viruses. What are they?",
            "The four species of influenza viruses are each the sole member of their own genus and together they comprise four of the seven genera in the family Orthomyxoviridae.",
            "That's interesting. What are the symptoms of influenza?",
            "The onset of symptoms is sudden and includes fever, chills, headaches, muscle pain, and a feeling of discomfort. Respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose also occur. Gastrointestinal symptoms such as nausea, vomiting, diarrhea, and gastroenteritis are especially common in children.",
            "How long do the symptoms last?",
            "The standard influenza symptoms typically last for 2-8 days. However, a 2021 study suggests that influenza can cause long-lasting symptoms similar to long COVID.",
            "Thank you for the information Medi."
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "You're welcome. Do you have any other questions about influenza?"
    },
    {
        "dialog": [
            "Hi Medi, I had primary pneumonia, can you give me some advice for my diet and physical exercise?",
            "Of course, I'm happy to help. What kind of advice are you looking for specifically?",
            "I want to know what kind of foods I should eat and what kind of exercise I should do to help my recovery.",
            "You should focus on eating a balanced diet that includes plenty of fruits, vegetables, whole grains, and lean protein. Avoid processed foods, sugary drinks, and excess sodium. As for exercise, start with light activities like walking or stretching before gradually increasing in intensity.",
            "How long should I wait before I start exercising?",
            "You should wait until your symptoms have completely gone away and you have been given the go-ahead by your doctor to start exercising.",
            "Thank you for your help Medi.",
            "You're welcome. I'm glad I could be of assistance."
        ],
        "knowledge": "Influenza Influenza  Pneumonia may be caused by the primary viral infection or by a secondary bacterial infection.  Primary pneumonia is characterized by rapid progression of fever, cough, labored breathing, and low oxygen levels that cause bluish skin.  It is especially common among those who have an underlying cardiovascular disease such as rheumatic heart disease.  Secondary pneumonia typically has a period of improvement in symptoms for 1–3 weeks followed by recurrent fever, sputum production, and fluid buildup in the lungs, but can also occur just a few days after influenza symptoms appear.  About a third of primary pneumonia cases are followed by secondary pneumonia, which is most frequently caused by the bacteria Streptococcus pneumoniae and Staphylococcus aureus. Influenza viruses comprise four species.  Each of the four species is the sole member of its own genus, and the four influenza genera comprise four of the seven genera in the family Orthomyxoviridae Influenza Influenza",
        "response": "You're welcome. I hope you feel better soon."
    }
]