[
    {
        "dialog": [
            "Hi Medi, I am worried about my gestational diabetes.",
            "Hello, what are your symptoms?",
            "I am experiencing frequent urination, increased hunger and thirst, and fatigue.",
            "It sounds like you are experiencing typical symptoms of gestational diabetes. Did your doctor diagnose you with it?",
            "Yes, I was diagnosed a week ago. What can I do to manage it?",
            "You should follow a healthy diet, exercise regularly, and monitor your blood sugar levels. Your doctor may also prescribe insulin injections if necessary.",
            "Is there anything else I should know?",
            "It's important to attend all your appointments and follow the advice of your doctor to ensure a healthy pregnancy. Do you have any other questions?",
            "Yes, can gestational diabetes harm my baby?"
        ],
        "knowledge": "Gestational diabetes is a type of diabetes that occurs during pregnancy. It affects approximately 2-10% of pregnancies and can increase the risk of complications for both the mother and baby. The exact cause is unknown, but hormonal changes during pregnancy and genetic predisposition may contribute to its development. Women with gestational diabetes can manage their condition with a healthy diet, regular exercise, and monitoring their blood sugar levels. Insulin injections may be required in some cases. Uncontrolled gestational diabetes can lead to macrosomia, preterm labor, and other complications for both the mother and baby.",
        "response": "Yes, uncontrolled gestational diabetes can lead to macrosomia, preterm labor, and other complications for both the mother and baby."
    },
    {
        "dialog": [
            "Hi Medi, I have type 2 diabetes and I want to know more about it.",
            "Sure, what do you want to know?",
            "What causes type 2 diabetes?",
            "Type 2 diabetes is caused by a combination of lifestyle and genetic factors. Being overweight, inactive, and having a family history of diabetes can increase your risk. ",
            "How can I manage my diabetes?",
            "Following a healthy diet, exercising regularly and monitoring your blood sugar levels are all important for managing diabetes. Your doctor may also prescribe medication or insulin injections if necessary.",
            "What are the complications of type 2 diabetes?",
            "Type 2 diabetes can increase the risk of various complications including heart disease, stroke, kidney damage, nerve damage, and eye damage. It's important to manage your diabetes to prevent these complications. Do you have any other questions?",
            "Yes, can type 2 diabetes be cured?"
        ],
        "knowledge": "Type 2 diabetes is a chronic condition that affects how your body metabolizes sugar (glucose). It's caused by a combination of lifestyle and genetic factors. Being overweight, inactive, and having a family history of diabetes can increase your risk. Type 2 diabetes can be managed with a healthy diet, regular exercise, and monitoring blood sugar levels. Insulin injections or other medications may be required in some cases. There is no cure for type 2 diabetes, but it can be managed to prevent complications.",
        "response": "No, there is no cure for type 2 diabetes, but it can be managed to prevent complications."
    },
    {
        "dialog": [
            "Hi Medi, I just had a caesarean section. What should I do to recover?",
            "Congratulations! It's important to rest and take care of yourself after surgery. Avoid heavy lifting and strenuous activity for several weeks.",
            "What about my diet?",
            "It's important to eat a healthy diet to promote healing. Focus on nutrient-dense foods like fruits, vegetables, whole grains, and lean protein. Avoid sugary and processed foods.",
            "Can I breastfeed?",
            "Yes, you can breastfeed after a caesarean section. It's important to get help from a lactation consultant if you have any difficulties.",
            "Are there any complications I should watch out for?",
            "Some women may experience complications after a caesarean section, such as infection, bleeding, or blood clots. It's important to follow your doctor's instructions and attend all your follow-up appointments to monitor your recovery. Do you have any other questions?",
            "Yes, how long does it take to fully recover?"
        ],
        "knowledge": "A caesarean section is a surgical procedure used to deliver a baby through incisions in the mother's abdomen and uterus. It may be performed if there is marked fetal distress or an increased risk of injury associated with macrosomia, such as shoulder dystocia. It's important to rest and take care of yourself after surgery. Avoid heavy lifting and strenuous activity for several weeks. It's also important to eat a healthy diet and stay hydrated to promote healing. Some women may experience complications after a caesarean section, such as infection, bleeding, or blood clots. It can take several weeks to fully recover after a caesarean section.",
        "response": "It can take several weeks to fully recover after a caesarean section. However, every woman's recovery time is different, so it's important to follow your doctor's advice and attend all your follow-up appointments."
    },
    {
        "dialog": [
            "Hello Medi, I have a question about Diabetes.",
            "Sure, what would you like to know?",
            "What is the difference between Type 1 and Type 2 Diabetes?",
            "Type 1 Diabetes is an autoimmune disease where the body doesn't produce insulin. Type 2 Diabetes is a metabolic disorder where the body doesn't properly use insulin.",
            "I see, is Type 2 Diabetes more common?",
            "Yes, Type 2 Diabetes is more common. It accounts for 95% of Diabetes cases.",
            "What are some risk factors for developing Type 2 Diabetes?",
            "Some risk factors include being overweight or obese, having a family history of Diabetes, and being physically inactive.",
            "Thank you for the information, Medi. How can I reduce my risk of developing Type 2 Diabetes?"
        ],
        "knowledge": "Diabetes Diabetes The defective responsiveness of body tissues to insulin is believed to involve the insulin receptor.  However, the specific defects are not known.  Diabetes mellitus cases due to a known defect are classified separately.  Type 2 diabetes is the most common type of diabetes mellitus accounting for 95% of diabetes.  Many people with type 2 diabetes have evidence of prediabetes  before meeting the criteria for type 2 diabetes.  The progression of prediabetes to overt type 2 diabetes can be slowed or reversed by lifestyle changes or medications that improve insulin sensitivity or reduce the liver's glucose production. Type 2 diabetes is primarily due to lifestyle factors and genetics. Diabetes Diabetes",
        "response": "Some ways to reduce your risk of developing Type 2 Diabetes include maintaining a healthy weight, staying physically active, and eating a balanced diet."
    },
    {
        "dialog": [
            "Hello Medi, I just had a baby and had Labor Induction. What should I do now?",
            "Congratulations on your new baby! After Labor Induction, you should rest and take it easy for the next few days.",
            "Are there any specific care instructions I should follow?",
            "Your care instructions will depend on your specific situation. Your doctor will give you instructions on how to care for yourself and your baby.",
            "What are some common complications after Labor Induction?",
            "Some common complications include heavy bleeding, infection, and problems with anesthesia. However, these complications are rare.",
            "Thank you for the information, Medi. When should I schedule my postpartum checkup?",
            "You should schedule your postpartum checkup 4-6 weeks after giving birth. This is an important checkup to make sure you are healing properly and there are no complications.",
            "Thank you, Medi. That's all I wanted to know."
        ],
        "knowledge": "Diabetes Diabetes  Labor induction may be indicated with decreased placental function.  A caesarean section may be performed if there is marked fetal distress or an increased risk of injury associated with macrosomia, such as shoulder dystocia. Maturity onset diabetes of the young  is a rare autosomal dominant inherited form of diabetes, due to one of several single-gene mutations causing defects in insulin production.  It is significantly less common than the three main types, constituting 1–2% of all cases.  The name of this disease refers to early hypotheses as to its nature.  Being due to a defective gene, this disease varies in age at presentation and in severity according to the specific gene defect; thus, there are at least 13 subtypes of MODY.  People with MODY often can control it without using insulin Diabetes Diabetes",
        "response": "You're welcome! If you have any further questions, don't hesitate to ask."
    },
    {
        "dialog": [
            "Hi Medi, I just had a medical procedure done. What should I do to take care of myself?",
            "It's important to follow your doctor's instructions carefully after a medical procedure. Make sure to rest and avoid strenuous activity for the first few days.",
            "Are there any specific things I should do or avoid?",
            "Your doctor will give you specific instructions on what to do and avoid after your procedure. Some common instructions include avoiding alcohol and smoking, taking medication as prescribed, and getting plenty of rest.",
            "How can I manage any pain or discomfort I may feel?",
            "Your doctor may prescribe pain medication or recommend over-the-counter pain relievers. Make sure to take them as directed.",
            "Thank you for the information, Medi. How long should I expect to take to recover?",
            "Your recovery time will depend on the type of procedure you had and your individual health. Your doctor will give you an estimated recovery time and instructions on what to do during your recovery.",
            "Great, thank you for your help, Medi."
        ],
        "knowledge": "Diabetes Diabetes  Labor induction may be indicated with decreased placental function.  A caesarean section may be performed if there is marked fetal distress or an increased risk of injury associated with macrosomia, such as shoulder dystocia. Maturity onset diabetes of the young  is a rare autosomal dominant inherited form of diabetes, due to one of several single-gene mutations causing defects in insulin production.  It is significantly less common than the three main types, constituting 1–2% of all cases.  The name of this disease refers to early hypotheses as to its nature.  Being due to a defective gene, this disease varies in age at presentation and in severity according to the specific gene defect; thus, there are at least 13 subtypes of MODY.  People with MODY often can control it without using insulin. Diabetes Diabetes",
        "response": "You're welcome! Remember to follow your doctor's instructions carefully and don't hesitate to reach out if you have any questions or concerns during your recovery."
    },
    {
        "dialog": [
            "Hello Medi, can you help me with my diabetes?",
            "Sure, what kind of help do you need?",
            "I am a bit worried about labor induction, when is it indicated?",
            "Labor induction may be indicated with decreased placental function.",
            "Also, I'm concerned about caesarean section, when is it performed?",
            "A caesarean section may be performed if there is marked fetal distress or an increased risk of injury associated with macrosomia, such as shoulder dystocia.",
            "Thanks, Medi. Can you tell me about Maturity onset diabetes of the young?",
            "Maturity onset diabetes of the young is a rare autosomal dominant inherited form of diabetes, due to one of several single-gene mutations causing defects in insulin production.",
            "Got it. And are there any specific types?"
        ],
        "knowledge": "Diabetes Diabetes  Labor induction may be indicated with decreased placental function.  A caesarean section may be performed if there is marked fetal distress or an increased risk of injury associated with macrosomia, such as shoulder dystocia. Maturity onset diabetes of the young  is a rare autosomal dominant inherited form of diabetes, due to one of several single-gene mutations causing defects in insulin production.  It is significantly less common than the three main types, constituting 1–2% of all cases.  The name of this disease refers to early hypotheses as to its nature.  Being due to a defective gene, this disease varies in age at presentation and in severity according to the specific gene defect; thus, there are at least 13 subtypes of MODY.  People with MODY often can control it without using insulin Diabetes Diabetes",
        "response": "No, that's all the information I needed. Thank you for your help, Medi."
    },
    {
        "dialog": [
            "Hey Medi, can you explain more about Maturity onset diabetes of the young?",
            "Sure, what would you like to know?",
            "What exactly causes it?",
            "MODY is caused by a mutation in a single gene. There are several different genes that can cause MODY, and each gene has a specific pattern of inheritance. It is inherited in an autosomal dominant pattern, which means that a person only needs to inherit one copy of the mutated gene from one parent to develop MODY.",
            "And is it common?",
            "It is significantly less common than the three main types, constituting 1–2% of all cases.",
            "Can you elaborate on the three main types?",
            "Sure, the three main types of diabetes are type 1, type 2, and gestational diabetes. Type 1 diabetes is an autoimmune condition where the body attacks and destroys the cells in the pancreas that produce insulin. Type 2 diabetes is when the body doesn't produce enough insulin or becomes resistant to its effects. Gestational diabetes is a type of diabetes that occurs during pregnancy.",
            "Thanks a lot for your help, Medi."
        ],
        "knowledge": "Maturity onset diabetes of the young  is a rare autosomal dominant inherited form of diabetes, due to one of several single-gene mutations causing defects in insulin production.  It is significantly less common than the three main types, constituting 1–2% of all cases.  The name of this disease refers to early hypotheses as to its nature.  Being due to a defective gene, this disease varies in age at presentation and in severity according to the specific gene defect; thus, there are at least 13 subtypes of MODY.  People with MODY often can control it without using insulin Diabetes Diabetes",
        "response": "You're welcome, let me know if you have any other questions."
    },
    {
        "dialog": [
            "Hey Medi, I recently underwent a medical procedure, can you give me advice on lifestyle changes?",
            "Of course, what kind of procedure did you have?",
            "I had a caesarean section. What kind of diet should I follow?",
            "After a caesarean section, it is important to eat a well-balanced diet that includes plenty of protein, fruits and vegetables, whole grains, and healthy fats. You should also stay hydrated and avoid foods that are high in sugar and saturated fat.",
            "Thanks, Medi. What about physical exercise?",
            "It's important to start with light physical activity, such as walking, before gradually increasing the intensity and duration of exercise. Of course, check with your doctor first to ensure that you are cleared for exercise after your procedure.",
            "Got it. How about sleep?",
            "Getting enough sleep is crucial for your body to heal and recover. Aim for at least 7-8 hours of sleep per night, and try to establish a regular sleep routine.",
            "Thank you for your help, Medi."
        ],
        "knowledge": "Diabetes Diabetes  Labor induction may be indicated with decreased placental function.  A caesarean section may be performed if there is marked fetal distress or an increased risk of injury associated with macrosomia, such as shoulder dystocia. Maturity onset diabetes of the young  is a rare autosomal dominant inherited form of diabetes, due to one of several single-gene mutations causing defects in insulin production.  It is significantly less common than the three main types, constituting 1–2% of all cases.  The name of this disease refers to early hypotheses as to its nature.  Being due to a defective gene, this disease varies in age at presentation and in severity according to the specific gene defect; thus, there are at least 13 subtypes of MODY.  People with MODY often can control it without using insulin Diabetes Diabetes",
        "response": "You're welcome, let me know if you have any other questions."
    },
    {
        "dialog": [
            "Hello Medi, I have been diagnosed with diabetes. What should I do now?",
            "I am sorry to hear that. You should first start by monitoring your blood sugar levels.",
            "How can I do that, Medi?",
            "You can do it at home using a glucometer and keeping a record of your readings.",
            "Okay. What diet should I follow?",
            "You should eat a balanced diet with more whole grains, fruits, and vegetables. Try to avoid sugary and fatty foods.",
            "That makes sense. Any other advice?",
            "You should exercise regularly and take your medications as prescribed by your doctor.",
            "Thank you for the advice, Medi. How often should I see my doctor for check-ups?"
        ],
        "knowledge": "Diabetes Diabetes  Diabetes is a chronic condition that affects how your body turns food into energy. There are two main types of diabetes, type 1 and type 2. Type 2 diabetes is more common and is caused by a combination of genetic and lifestyle factors. It can be managed with a combination of medication, diet, and exercise. Regular check-ups with your doctor are important to monitor your blood sugar levels and manage your diabetes.",
        "response": "It is recommended that you see your doctor every three to six months for check-ups."
    },
    {
        "dialog": [
            "Hello Medi, I am pregnant and I have diabetes. What should I do?",
            "Congratulations on your pregnancy. You should consult with your doctor to create a management plan for your diabetes during pregnancy.",
            "What kind of plan, Medi?",
            "Your doctor may recommend monitoring your blood sugar levels more frequently and adjusting your medication dosage as needed. In some cases, you may need insulin injections.",
            "I see. What are the risks for my baby?",
            "Your baby may be at risk for macrosomia, which is when babies are born larger than normal. This can increase the risk of difficulties during delivery. Your doctor may recommend a caesarean section if necessary.",
            "That sounds serious. Is there anything I can do to reduce the risks?",
            "Yes. You should follow a healthy diet and exercise regularly. Your doctor may also recommend regular ultrasounds to monitor your baby's growth.",
            "Thank you, Medi. That's very helpful."
        ],
        "knowledge": "Diabetes Diabetes  Pregnant women with diabetes are at increased risk for complications during pregnancy and delivery. They are more likely to have high blood pressure, pre-eclampsia, and premature delivery. Babies born to mothers with diabetes may be at risk for macrosomia, which is when babies are born larger than normal. This can increase the risk of difficulties during delivery. A caesarean section may be necessary in some cases. A management plan for diabetes during pregnancy should be created in consultation with your doctor.",
        "response": "You're welcome. Don't hesitate to ask your doctor if you have any further questions or concerns."
    },
    {
        "dialog": [
            "Hello Medi, I have just been diagnosed with Maturity Onset Diabetes of the Young. What does that mean?",
            "Maturity Onset Diabetes of the Young is a rare form of diabetes that is caused by a genetic mutation. It is less common than other types of diabetes and is usually diagnosed before the age of 25.",
            "What are the symptoms, Medi?",
            "The symptoms of MODY are similar to other types of diabetes. They include frequent urination, excessive thirst, and fatigue. However, some people with MODY may not have any symptoms.",
            "Is there a cure for MODY?",
            "There is no cure for MODY, but it can be managed with a combination of diet, exercise, and medications. Insulin may be necessary in some cases.",
            "How is MODY different from other types of diabetes?",
            "Unlike other types of diabetes, MODY is caused by a genetic mutation. It can be inherited from one or both parents.",
            "I see. Is there anything else I should know?"
        ],
        "knowledge": "Diabetes Diabetes  Maturity Onset Diabetes of the Young (MODY) is a rare form of diabetes that is caused by a genetic mutation. It is less common than other types of diabetes and is usually diagnosed before the age of 25. The symptoms of MODY are similar to other types of diabetes, but some people with MODY may not have any symptoms. There is no cure for MODY, but it can be managed with a combination of diet, exercise, and medications. Insulin may be necessary in some cases. It's important to work closely with your doctor to manage your diabetes and monitor your blood sugar levels. Regular check-ups are also important to prevent complications.",
        "response": "Remember that managing your diabetes is the key to preventing complications. Don't hesitate to ask your doctor if you have any further questions or concerns."
    },
    {
        "dialog": [
            "Hello Medi, I have symptoms of diabetes.",
            "Sure, What are your symptoms?",
            "I feel thirsty often and need to urinate frequently.",
            "Okay, Have you recently experienced any weight loss or fatigue?",
            "Yes, I have lost weight even though I eat normally and I feel very tired.",
            "Based on your symptoms, it is possible that you have diabetes. ",
            "What should I do now, Medi?",
            "You should consult a doctor as soon as possible to get diagnosed.",
            "Okay, thank you. I will take your advice."
        ],
        "knowledge": "Diabetes Diabetes  The symptoms of diabetes include excessive thirst and hunger, increased urination, weight loss, fatigue, irritability, blurred vision, slow-healing sores or frequent infections, and areas of darkened skin. Diabetes can be diagnosed through a fasting blood sugar test, oral glucose tolerance test, or glycated hemoglobin test. Diabetes Diabetes",
        "response": "Thank you for your advice, Medi. I will consult a doctor soon."
    },
    {
        "dialog": [
            "Hello Medi, I want to know more about Maturity onset diabetes of the young (MODY).",
            "Sure, I can help you. What do you want to know?",
            "What causes MODY?",
            "MODY is caused by a mutation in a single gene that affects insulin production.",
            "How common is MODY?",
            "MODY is a rare form of diabetes, accounting for only 1-2% of all cases of diabetes.",
            "Can MODY be controlled without using insulin?",
            "Yes, many people with MODY can control their blood sugar levels with lifestyle changes and oral medications.",
            "Thank you for your help, Medi."
        ],
        "knowledge": "Maturity onset diabetes of the young (MODY) is a rare autosomal dominant inherited form of diabetes, due to one of several single-gene mutations causing defects in insulin production. It is significantly less common than the three main types, constituting 1-2% of all cases. Being due to a defective gene, this disease varies in age at presentation and in severity according to the specific gene defect, thus there are at least 13 subtypes of MODY. People with MODY often can control their blood sugar levels without using insulin Diabetes Diabetes",
        "response": "Thank you for your help, Medi. It was very informative."
    },
    {
        "dialog": [
            "Hello Medi, I recently had a caesarean section. Can you give me some advice on lifestyle and diet?",
            "Sure. What kind of advice do you need?",
            "I want to know what kind of exercise is safe for me to do after the surgery.",
            "It is important to start with light physical activity such as walking and gradually increase the intensity over time.",
            "What should I eat to promote healing and recovery?",
            "You should eat a balanced diet rich in protein, healthy fats, and vitamins and minerals. Avoid processed foods and sugary drinks.",
            "How long should I wait before I can resume normal activities?",
            "You should consult your doctor first, but typically it takes 6-8 weeks to fully recover from a caesarean section.",
            "Thank you for your help, Medi."
        ],
        "knowledge": "A caesarean section may be performed if there is marked fetal distress or an increased risk of injury associated with macrosomia, such as shoulder dystocia. After a caesarean section, it is important to rest and avoid heavy lifting or strenuous exercise for several weeks to allow your body to heal. Light physical activity such as walking is encouraged to promote circulation and prevent blood clots. A balanced diet rich in protein, healthy fats, and vitamins and minerals is important for healing and recovery.  Caesarean section Caesarean section",
        "response": "Thank you for your help, Medi. I will take your advice and consult my doctor for more information."
    },
    {
        "dialog": [
            "Hello Medi, I have been diagnosed with diabetes recently.",
            "I'm here to support you, what type of diabetes do you have?",
            "I have been diagnosed with MODY, can you tell me more about it?",
            "Maturity onset diabetes of the young is a rare autosomal dominant inherited form of diabetes, due to one of several single-gene mutations causing defects in insulin production. It is significantly less common than the three main types, constituting 1–2% of all cases.",
            "What are the symptoms of MODY?",
            "Symptoms of MODY are similar to other types of diabetes such as increased thirst, frequent urination, and increased hunger. But it usually appears in young people under the age of 25, so if you have these symptoms, it's better to check with a doctor.",
            "How is MODY treated?",
            "Treatment of MODY depends on the subtype of the disease, but it's often managed with lifestyle changes, oral medications, and in some cases, insulin injections. Your doctor will work with you to develop a treatment plan that is right for you.",
            "Thanks for your explanation, Medi."
        ],
        "knowledge": "Diabetes Diabetes Labor induction may be indicated with decreased placental function. A caesarean section may be performed if there is marked fetal distress or an increased risk of injury associated with macrosomia, such as shoulder dystocia. Maturity onset diabetes of the young is a rare autosomal dominant inherited form of diabetes, due to one of several single-gene mutations causing defects in insulin production. It is significantly less common than the three main types, constituting 1–2% of all cases. The name of this disease refers to early hypotheses as to its nature. Being due to a defective gene, this disease varies in age at presentation and in severity according to the specific gene defect; thus, there are at least 13 subtypes of MODY. People with MODY often can control it without using insulin Diabetes Diabetes",
        "response": "You're welcome. Do you have any other questions related to MODY or diabetes in general?"
    },
    {
        "dialog": [
            "Hello Medi, can you help me with some tips for managing my diabetes?",
            "Of course, I'm here to support you in managing your diabetes. What specific questions do you have?",
            "I would like to know some lifestyle changes that can help me manage my diabetes better.",
            "Sure. You can start by eating a balanced diet that is low in sugar and carbohydrates, getting regular exercise, and maintaining a healthy weight. You should also monitor your blood sugar levels regularly and take your medications as prescribed.",
            "Should I avoid certain types of food?",
            "Yes, you should avoid sugary and processed foods, and limit your intake of carbohydrates and saturated fats. Instead, focus on eating whole foods, such as fruits, vegetables, whole grains, and lean proteins.",
            "What type of exercise is good for diabetes?",
            "Any type of physical activity is beneficial for diabetes, but aerobic exercise is especially effective at improving insulin sensitivity and glucose control. This includes activities such as walking, swimming, or cycling.",
            "Thanks Medi, that's very helpful."
        ],
        "knowledge": "Diabetes Diabetes Labor induction may be indicated with decreased placental function. A caesarean section may be performed if there is marked fetal distress or an increased risk of injury associated with macrosomia, such as shoulder dystocia. Maturity onset diabetes of the young is a rare autosomal dominant inherited form of diabetes, due to one of several single-gene mutations causing defects in insulin production. It is significantly less common than the three main types, constituting 1–2% of all cases. The name of this disease refers to early hypotheses as to its nature. Being due to a defective gene, this disease varies in age at presentation and in severity according to the specific gene defect; thus, there are at least 13 subtypes of MODY. People with MODY often can control it without using insulin Diabetes Diabetes",
        "response": "You're welcome. Let me know if you have any more questions or concerns."
    },
    {
        "dialog": [
            "Hello Medi, I just had a caesarean section due to my diabetes, do you have any advice for my recovery?",
            "Sure. After a caesarean section, it's important to get plenty of rest and avoid heavy lifting or strenuous activity for several weeks. You should also monitor your incision site for signs of infection, such as redness, swelling, or discharge.",
            "What about my diet? Are there any foods that I should eat or avoid?",
            "You should focus on eating a healthy, balanced diet that is rich in nutrients to help with your recovery. It's important to stay hydrated and eat plenty of fiber to prevent constipation, which is common after surgery. You should also avoid sugary and processed foods, which can cause inflammation and slow down the healing process.",
            "When can I start exercising again?",
            "You should wait until you are cleared by your doctor to resume exercising after a caesarean section. This usually takes around 6-8 weeks, depending on your individual recovery.",
            "Thank you for your advice, Medi."
        ],
        "knowledge": "Diabetes Diabetes Labor induction may be indicated with decreased placental function. A caesarean section may be performed if there is marked fetal distress or an increased risk of injury associated with macrosomia, such as shoulder dystocia. Maturity onset diabetes of the young is a rare autosomal dominant inherited form of diabetes, due to one of several single-gene mutations causing defects in insulin production. It is significantly less common than the three main types, constituting 1–2% of all cases. The name of this disease refers to early hypotheses as to its nature. Being due to a defective gene, this disease varies in age at presentation and in severity according to the specific gene defect; thus, there are at least 13 subtypes of MODY. People with MODY often can control it without using insulin Diabetes Diabetes",
        "response": "You're welcome. I hope you have a smooth recovery. Let me know if you have any other questions or concerns."
    },
    {
        "dialog": [
            "Hello Medi, I'm feeling numbness in my feet.",
            "Hi, I'm a healthcare chatbot. Can you tell me more about your symptoms?",
            "I feel numbness in both feet, and it seems to worsen when I'm walking.",
            "You might have diabetic neuropathy. Have you been diagnosed with diabetes?",
            "Yes, I have type 2 diabetes.",
            "Managing your diabetes is crucial. You should monitor your blood sugar regularly.",
            "What can I do to relieve the numbness?",
            "Keeping your blood sugar under control is the best way to manage the symptoms. You can also try physical therapy.",
            "Thank you, Medi. What kind of diet should I follow?"
        ],
        "knowledge": "Diabetes Diabetes  Maturity onset diabetes of the young  is a rare autosomal dominant inherited form of diabetes, due to one of several single-gene mutations causing defects in insulin production.  It is significantly less common than the three main types, constituting 1–2% of all cases.  The name of this disease refers to early hypotheses as to its nature.  Being due to a defective gene, this disease varies in age at presentation and in severity according to the specific gene defect; thus, there are at least 13 subtypes of MODY.  People with MODY often can control it without using insulin. Labor induction may be indicated with decreased placental function.  A caesarean section may be performed if there is marked fetal distress or an increased risk of injury associated with macrosomia, such as shoulder dystocia. Diabetes-related foot problems can affect your health and quality of life.  Diabetic neuropathy is a common complication that can cause tingling, pain, and numbness in the feet and legs.  The best way to prevent diabetic foot problems is to manage your diabetes effectively. Diabetes Diabetes",
        "response": "To keep your blood sugar under control follow a balanced diet plan including more vegetables and lean protein and less processed food and sugary drinks"
    },
    {
        "dialog": [
            "Hi Medi, I'm having trouble sleeping.",
            "Hi, I'm a healthcare chatbot. Can you describe your sleep difficulty?",
            "It takes me a long time to fall asleep and I keep waking up during the night.",
            "Have you been feeling stressed or anxious lately?",
            "Yes, I've been really anxious about my work lately.",
            "Stress and anxiety can impact your sleep patterns. Have you tried any relaxation techniques?",
            "No, I haven't. What kind of relaxation techniques can I try?",
            "Deep breathing, muscle relaxation, and meditation are some techniques that can help you relax and sleep better.",
            "Ok, I'll try those out. Can you recommend any over-the-counter sleep aids?"
        ],
        "knowledge": "Insomnia Insomnia  Insomnia is a sleep disorder that is characterized by difficulty falling asleep or staying asleep.  The condition can be acute or chronic.  Acute insomnia is typically caused by stress, anxiety, or a disruptive sleep environment, and usually resolves on its own.  Chronic insomnia is typically caused by an underlying medical condition or a persistent stressor, and can lead to long-term sleep deprivation and negative health outcomes.  Treatment typically involves addressing the underlying cause of the condition and making lifestyle changes, such as improving sleep hygiene, relaxation techniques, and cognitive behavioral therapy.  Over-the-counter sleep aids may be used in conjunction with therapy, but should not be used as a long-term solution. Insomnia Insomnia",
        "response": "It's wise to try relaxation techniques before resorting to over-the-counter sleep aids. If the problem persists, you should consult a doctor for further advice."
    },
    {
        "dialog": [
            "Hello Medi, I recently had a caesarean section and I'm feeling tired all the time.",
            "Hi, I'm a healthcare chatbot. It's normal to feel tired after surgery. Can you tell me more about your symptoms?",
            "I'm feeling depressed and tired all the time, even after getting enough sleep.",
            "You might be experiencing postpartum depression. It's common after childbirth.",
            "What can I do to manage my depression?",
            "You can try exercising and talking to a counselor. You can also try joining a support group.",
            "Ok, I'll try those out. What can I do to speed up my recovery from the surgery?",
            "Make sure to rest and avoid any strenuous activities for the first few weeks. Also, follow your doctor's advice on medications.",
            "Thank you, Medi. Can you recommend any particular diet after the surgery?"
        ],
        "knowledge": "Caesarean section Caesarean section  A caesarean section, also known as a C-section, is a surgical procedure used to deliver a baby through incisions in the abdomen and uterus.  It is typically performed when vaginal delivery is not possible or safe, such as in cases of fetal distress or an increased risk of injury associated with macrosomia, such as shoulder dystocia.  Recovery from a caesarean section typically takes longer than recovery from vaginal delivery, and women may experience fatigue, pain, and discomfort in the days and weeks following surgery. Postpartum depression is a common condition that can affect women after childbirth.  Symptoms include feeling sad, hopeless, and overwhelmed, as well as difficulty sleeping, loss of appetite, and reduced interest in activities.  Exercise, counseling, and support groups can help manage the condition. Caesarean section Caesarean section",
        "response": "A balanced diet with plenty of fruits and vegetables and lean protein is recommended after the surgery. You should also follow your doctor's advice on medications."
    },
    {
        "dialog": [
            "Hi Medi, I have some symptoms related to diabetes.",
            "Sure, please tell me about your symptoms.",
            "I feel thirsty all the time and need to use the bathroom very frequently.",
            "These symptoms could be related to diabetes. You should go to a doctor and get your blood sugar level checked",
            "Is there anything I can do in the meantime to relieve my symptoms?",
            "Drink plenty of water and avoid sugary drinks. Also, try to eat a balanced diet and do some physical exercise.",
            "Do you think I need to take insulin?",
            "It depends on your test results and what your doctor recommends. You should follow their advice.",
            "What kind of physical exercise should I do?"
        ],
        "knowledge": "Diabetes Diabetes  Labor induction may be indicated with decreased placental function.  A caesarean section may be performed if there is marked fetal distress or an increased risk of injury associated with macrosomia, such as shoulder dystocia. Maturity onset diabetes of the young is a rare autosomal dominant inherited form of diabetes, due to one of several single-gene mutations causing defects in insulin production.  It is significantly less common than the three main types, constituting 1–2% of all cases.  The name of this disease refers to early hypotheses as to its nature.  Being due to a defective gene, this disease varies in age at presentation and in severity according to the specific gene defect; thus, there are at least 13 subtypes of MODY.  People with MODY often can control it without using insulin Diabetes Diabetes",
        "response": "Your symptoms could be related to diabetes. You should go to a doctor and get your blood sugar level checked."
    },
    {
        "dialog": [
            "Hello Medi, I'm recovering from a medical procedure related to diabetes complications.",
            "I'm glad to hear that. How can I help you?",
            "I'm wondering about changes to my lifestyle to prevent further complications.",
            "That's a great question. Diet and exercise are very important. Try to eat a balanced diet with plenty of fruits, vegetables, and whole grains. Avoid sugary drinks and limit your intake of processed foods.",
            "What about physical exercise?",
            "Exercise is also very important. Talk to your doctor about starting an exercise program. Walking, jogging, and cycling are all good options.",
            "Are there any other lifestyle changes I should make?",
            "You should also try to quit smoking and limit your alcohol intake. These habits can increase your risk of complications.",
            "Thank you, Medi. That's very helpful."
        ],
        "knowledge": "Diabetes Diabetes  Labor induction may be indicated with decreased placental function.  A caesarean section may be performed if there is marked fetal distress or an increased risk of injury associated with macrosomia, such as shoulder dystocia. Maturity onset diabetes of the young is a rare autosomal dominant inherited form of diabetes, due to one of several single-gene mutations causing defects in insulin production.  It is significantly less common than the three main types, constituting 1–2% of all cases.  The name of this disease refers to early hypotheses as to its nature.  Being due to a defective gene, this disease varies in age at presentation and in severity according to the specific gene defect; thus, there are at least 13 subtypes of MODY.  People with MODY often can control it without using insulin Diabetes Diabetes",
        "response": "Diet and exercise are very important. Try to eat a balanced diet with plenty of fruits, vegetables, and whole grains. Avoid sugary drinks and limit your intake of processed foods. Talk to your doctor about starting an exercise program. Walking, jogging, and cycling are all good options. You should also try to quit smoking and limit your alcohol intake."
    },
    {
        "dialog": [
            "Hi Medi, I have a question about diabetes complications.",
            "Of course, what's your question?",
            "What are some common complications of diabetes?",
            "There are many complications of diabetes. Some of the most common include nerve damage, kidney damage, eye damage, and cardiovascular disease.",
            "What can I do to prevent these complications?",
            "The best way to prevent complications is to keep your blood sugar levels under control. You should also follow a healthy lifestyle, including a balanced diet and regular exercise.",
            "What about medications?",
            "Your doctor may prescribe medications to help control your blood sugar levels and prevent complications. It's important to take these medications as directed.",
            "Thank you, Medi. That's very helpful."
        ],
        "knowledge": "Diabetes Diabetes  Labor induction may be indicated with decreased placental function.  A caesarean section may be performed if there is marked fetal distress or an increased risk of injury associated with macrosomia, such as shoulder dystocia. Maturity onset diabetes of the young is a rare autosomal dominant inherited form of diabetes, due to one of several single-gene mutations causing defects in insulin production.  It is significantly less common than the three main types, constituting 1–2% of all cases.  The name of this disease refers to early hypotheses as to its nature.  Being due to a defective gene, this disease varies in age at presentation and in severity according to the specific gene defect; thus, there are at least 13 subtypes of MODY.  People with MODY often can control it without using insulin Diabetes Diabetes",
        "response": "The best way to prevent complications is to keep your blood sugar levels under control. Follow a healthy lifestyle, including a balanced diet and regular exercise. Your doctor may also prescribe medications to help control your blood sugar levels and prevent complications. It's important to take these medications as directed."
    },
    {
        "dialog": [
            "Hi Medi, I have been recently diagnosed with diabetes mellitus. What should I do?",
            "I can understand your concern. Firstly, you should modify your diet and exercise routine.",
            "What should be my diet plan?",
            "You should eat more fiber-rich foods, whole grains, and healthy fats. You should avoid processed and sugary foods.",
            "What about physical activity?",
            "You should do at least 150 minutes of moderate-intensity exercise per week. You can also try resistance training.",
            "How often should I check my blood sugar?",
            "You should check your blood sugar at least once a day, regularly. You can also consult with your doctor for more information.",
            "What are the symptoms of hypoglycemia?"
        ],
        "knowledge": "Diabetes Diabetes Hypoglycemia symptoms include shakiness, sweating, headache, blurred vision, and difficulty concentrating.  Symptoms can vary in severity.  Prolonged or severe hypoglycemia may lead to seizures, unconsciousness, and permanent brain damage or death.  Hypoglycemia can occur for many reasons, including taking too much insulin, skipping meals, or engaging in strenuous physical activity without adequately compensating with carbohydrate intake.  Hypoglycemia is treated by consuming simple carbohydrates, such as sweet drinks or candy, or by taking glucose tablets or gel Diabetes Diabetes",
        "response": "The symptoms of hypoglycemia include shakiness, sweating, headache, blurred vision, and difficulty concentrating. Symptoms can vary in severity. "
    },
    {
        "dialog": [
            "Hello, Medi. I have gestational diabetes. What should I do?",
            "I understand your concern. You should modify your diet and exercise routine.",
            "What should be my diet plan?",
            "You should eat small, frequent meals throughout the day and avoid sugary and processed foods. You should also increase your intake of fiber-rich foods.",
            "How much physical activity should I do?",
            "You should do at least 30 minutes of moderate-intensity exercise per day. You can also try resistance training.",
            "What are the risks for my baby?",
            "Gestational diabetes can increase the risks of high birth weight, premature birth, and respiratory distress syndrome for your baby.",
            "What about my labor process?"
        ],
        "knowledge": "Diabetes Diabetes Labor induction may be indicated with decreased placental function. A caesarean section may be performed if there is marked fetal distress or an increased risk of injury associated with macrosomia, such as shoulder dystocia. Maturity onset diabetes of the young  is a rare autosomal dominant inherited form of diabetes, due to one of several single-gene mutations causing defects in insulin production.  It is significantly less common than the three main types, constituting 1–2% of all cases.  The name of this disease refers to early hypotheses as to its nature.  Being due to a defective gene, this disease varies in age at presentation and in severity according to the specific gene defect; thus, there are at least 13 subtypes of MODY.  People with MODY often can control it without using insulin Diabetes Diabetes",
        "response": "You're welcome. I hope you find these suggestions helpful."
    },
    {
        "dialog": [
            "Hi Medi, I had a caesarean section recently. What should I do now?",
            "I understand your concern. You should take rest and avoid strenuous activities.",
            "What about my diet?",
            "You should eat a balanced diet including protein, fruits, vegetables, and whole grains. You should avoid processed and sugary foods.",
            "When should I resume physical activity?",
            "You should wait for at least 6-8 weeks before starting any strenuous physical activity. You can start by doing some light exercises like walking.",
            "What are the risks for me?",
            "You may experience bleeding, infection, and blood clots. You should consult with your doctor for more information.",
            "Should I take any supplements?"
        ],
        "knowledge": "Diabetes Diabetes Labor induction may be indicated with decreased placental function. A caesarean section may be performed if there is marked fetal distress or an increased risk of injury associated with macrosomia, such as shoulder dystocia. Maturity onset diabetes of the young  is a rare autosomal dominant inherited form of diabetes, due to one of several single-gene mutations causing defects in insulin production.  It is significantly less common than the three main types, constituting 1–2% of all cases.  The name of this disease refers to early hypotheses as to its nature.  Being due to a defective gene, this disease varies in age at presentation and in severity according to the specific gene defect; thus, there are at least 13 subtypes of MODY.  People with MODY often can control it without using insulin Diabetes Diabetes",
        "response": "You're welcome. Take care of yourself and follow your doctor's advice for a smooth recovery."
    }
]