[
    {
        "dialog": [
            "Hi Medi, I'm not feeling well",
            "Hello, What symptoms are you experiencing?",
            "I have a fever, a sore throat and my nose is congested",
            "Okay, based on your symptoms, it could be a common cold or Influenza",
            "How can I differentiate between the two?",
            "Well, the flu usually has a sudden onset with high fever, severe body aches and fatigue. Whereas, a cold usually develops gradually with milder symptoms.",
            "Oh, I see. What should I do next?",
            "I suggest you rest, drink plenty of fluids and take over-the-counter medication to relieve your symptoms. If you feel worse, please consult your doctor.",
            "Thank you, Medi"
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "You're welcome. Take care."
    },
    {
        "dialog": [
            "Hi Medi, Can you explain what is Influenza?",
            "Sure, Influenza is a viral respiratory illness that causes fever, cough, sore throat, runny or stuffy nose, body aches, headache, chills and fatigue.",
            "How is Influenza transmitted?",
            "It spreads from person to person through the air by coughing, sneezing or talking. Or by touching a surface that has the influenza virus on it and then touching your own mouth, nose or eyes.",
            "How is Influenza treated?",
            "Most people recover from Influenza without medical treatment. However, antiviral drugs can shorten the duration of the illness and prevent complications",
            "Is there any vaccine for Influenza?",
            "Yes, there is a flu vaccine that is recommended every year for anyone 6 months of age or older",
            "Thank you, Medi"
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "You're welcome, take care."
    },
    {
        "dialog": [
            "Hi Medi, I was diagnosed with Influenza. What should I do to recover?",
            "I'm sorry to hear that you have Influenza. Make sure you get plenty of rest, drink fluids and take over-the-counter medications to relieve your symptoms.",
            "Is there any specific foods I should eat?",
            "Yes, it is important to eat a healthy and balanced diet with plenty of fruits and vegetables. Foods that are rich in Vitamin C and Zinc can also help boost your immune system.",
            "What about exercise?",
            "It is important to get plenty of rest, but light exercise such as walking or gentle stretching can also help improve your symptoms and boost your immune system.",
            "Thank you, Medi",
            "You're welcome. If you have any other questions, feel free to ask"
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "You're welcome. Take care."
    },
    {
        "dialog": [
            "Hello Medi, I think I might have the flu.",
            "I am here to help you. Can you tell me your symptoms?",
            "I have a fever, body aches, and a cough.",
            "It sounds like you might have the flu. Rest and drink fluids.",
            "Is there anything else I can do to feel better?",
            "You can take over-the-counter medications for your symptoms.",
            "Which medications should I take?",
            "You can try acetaminophen for fever and pain, and cough suppressants for your cough.",
            "Thank you, Medi. How long will it take to feel better?"
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "It usually takes about a week to feel better, but some symptoms can last longer."
    },
    {
        "dialog": [
            "Hi Medi, I want to learn about the history of the flu.",
            "Of course, I can help you. What do you want to know?",
            "I want to know how long it has been around and how it got its name.",
            "The flu has been around for centuries. It got its name from the Italian word 'influenza'.",
            "What does 'influenza' mean?",
            "It means 'influence of the cold' or 'influence of the stars'.",
            "Why was it called that?",
            "It was called that because people used to think the flu was caused by unfavorable astrological conditions or the cold weather.",
            "Wow, that's interesting. Thank you, Medi."
        ],
        "knowledge": "Influenza Influenza  Terms such as influenza di freddo, meaning 'influence of the cold', and influenza di stelle, meaning 'influence of the stars' are attested from the 14th century.  The latter referred to the disease's cause, which at the time was ascribed by some to unfavorable astrological conditions.  As early as 1504, influenza began to mean a 'visitation' or 'outbreak' of any disease affecting many people in a single place at once.  During an outbreak of influenza in 1743 that started in Italy and spread throughout Europe, the word reached the English language and was anglicized in pronunciation.  Since the mid-1800s, influenza has also been used to refer to severe colds.  The shortened form of the word, 'flu', is first attested in 1839 as flue with the spelling flu confirmed in 1893.  Other names that have been used for influenza include epidemic catarrh, la grippe from French, sweating sickness, and, especially when referring to the 1918 pandemic strain, Spanish fever Influenza Influenza",
        "response": "You're welcome. Do you have any other questions?"
    },
    {
        "dialog": [
            "Hi Medi, I just recovered from the flu. What should I do now?",
            "Congratulations on your recovery! It is important to take care of yourself now.",
            "What can I do to take care of myself?",
            "Get plenty of rest, drink fluids, and eat nutritious foods.",
            "Will I be immune to the flu now that I've had it?",
            "You will have some immunity to the specific strain of the flu you had, but you can still get other strains.",
            "How can I protect myself from getting the flu again?",
            "Wash your hands often, avoid contact with sick people, and get a flu vaccine every year.",
            "Thank you for the advice, Medi. I will do my best to stay healthy."
        ],
        "knowledge": "Influenza Influenza  The flu is a contagious respiratory illness caused by influenza viruses.  It is spread through droplets when infected people cough, sneeze, or talk.  The flu can cause mild to severe illness, and can lead to complications such as pneumonia and death, especially in young children, the elderly, and people with underlying health conditions.  The best way to prevent the flu is by getting a flu vaccine every year.  Other prevention methods include washing your hands often, avoiding close contact with sick people, covering your mouth and nose when you cough or sneeze, and staying home if you are sick Influenza Influenza",
        "response": "You're welcome. Don't forget to get a flu vaccine every year to protect yourself."
    },
    {
        "dialog": [
            "Hi Medi. I have a runny nose and a mild fever.",
            "Hello. You might have a cold. Do you have a sore throat?",
            "Yes, I do. What should I do to feel better?",
            "Make sure you stay hydrated and take some over-the-counter cold medications.",
            "Thank you for the advice, Medi. How long will it take to feel better?",
            "It usually takes about a week to recover from a cold.",
            "Okay, Medi. I will do that. What can I do to prevent getting a cold?",
            "Wash your hands frequently and avoid close contact with people who are sick.",
            "Thanks for all of your help, Medi. You are always so helpful!"
        ],
        "knowledge": "Common cold Common cold The common cold is a viral infectious disease that infects the upper respiratory system.  It is also known as acute viral rhinopharyngitis, acute coryza, or a cold.  Symptoms include coughing, sore throat, runny nose, sneezing, headache, and fever that commonly resolve in seven to ten days, with some symptoms lasting up to three weeks.  In contrast to other contributing factors to illness, such as inadequate sleep and poor nutrition, cold weather is not responsible for the common cold or its symptoms.  There is no vaccine for the common cold.  The best prevention is frequent hand washing and not touching one's face.  Treatment involves symptomatic support. Common cold Common cold",
        "response": "You're welcome. Remember to stay hydrated and take some over-the-counter cold medications to feel better soon."
    },
    {
        "dialog": [
            "Hi Medi, I have been feeling very exhausted recently.",
            "Hello. Have you been sleeping well?",
            "No, I have not been sleeping well lately and I don't feel rested when I wake up either.",
            "I recommend trying to get more sleep each night and creating a relaxing pre-sleep routine.",
            "Thanks, Medi. Do you have any other advice?",
            "You should also try to exercise regularly and eat a balanced diet to improve your overall health.",
            "Okay, I will try that. Do you think I should take any supplements?",
            "It's best to talk to your doctor before taking any supplements to make sure they won't interfere with any medications you're taking or any underlying health conditions you have.",
            "Thank you for your help, Medi. I will try to follow your advice."
        ],
        "knowledge": "Exhaustion Exhaustion Exhaustion is a feeling of being tired, weak, lethargic, or fatigued.  This feeling can be physical, mental, or both.  It can be caused by physical or emotional stress, a lack of sleep, poor nutrition, or an underlying medical condition.  To combat exhaustion, it is important to identify the underlying cause and address it.  This may involve improving sleep habits, eating a balanced diet, increasing physical activity, or seeking medical treatment for an underlying medical condition.  It is also important to manage stress and practice relaxation techniques, such as deep breathing and meditation. Exhaustion Exhaustion",
        "response": "You're welcome. Remember to get more sleep, exercise regularly, eat a balanced diet, and talk to your doctor before taking any supplements to improve your overall health."
    },
    {
        "dialog": [
            "Hi Medi, I just got the flu vaccine. Are there any side effects I should be aware of?",
            "Hello. It's common to experience some mild side effects, such as a sore arm, headache, or low-grade fever.",
            "Okay, that's good to know. Is there anything I can do to prevent these side effects?",
            "Make sure to drink plenty of fluids and take over-the-counter pain relievers like acetaminophen or ibuprofen.",
            "Thank you, Medi. How long will the vaccine protect me from the flu?",
            "The flu vaccine usually provides protection for the entire flu season, which can last from October to May.",
            "That's helpful to know. Is there anything else I should do to prevent getting the flu?",
            "Wash your hands frequently and avoid close contact with people who are sick.",
            "Thanks for all of your help, Medi. You always give such great advice!"
        ],
        "knowledge": "Influenza vaccine Influenza vaccine The influenza vaccine, also known as the flu shot, is a vaccine that protects against influenza.  The vaccine stimulates the immune system to recognize the influenza virus and prepare to fight it.  Side effects from the vaccine are usually mild and may include soreness at the injection site, headache, and low-grade fever.  The vaccine provides protection for the entire flu season, which can last from October to May.  The vaccine is recommended for everyone over the age of six months. In addition to getting the vaccine, it is also important to wash your hands frequently and avoid close contact with people who are sick. Influenza vaccine Influenza vaccine",
        "response": "You're welcome. Remember to drink plenty of fluids and take over-the-counter pain relievers like acetaminophen or ibuprofen to prevent mild side effects. The flu vaccine usually provides protection for the entire flu season, which can last from October to May. Additionally, wash your hands frequently and avoid close contact with people who are sick to prevent getting the flu."
    },
    {
        "dialog": [
            "Hi Medi, I've been having a persistent cough and sore throat lately.",
            "Hello, I'm here to help. How long have you been experiencing these symptoms?",
            "It's been almost a week now. I've been trying home remedies but they don't seem to work.",
            "Based on your symptoms, it's possible that you have a cold or flu. I would suggest you take some over-the-counter medication to relieve your symptoms and rest more.",
            "Is it contagious?",
            "Yes, it is. So, make sure to avoid close contact with others and wash your hands frequently to prevent spreading the virus.",
            "Alright, thanks for the advice Medi.",
            "You're welcome. Take care and stay healthy!",
            "Can I ask you a question about the history of influenza?"
        ],
        "knowledge": "Influenza Influenza Terms such as influenza di freddo, meaning 'influence of the cold', and influenza di stelle, meaning 'influence of the stars' are attested from the 14th century. The latter referred to the disease's cause, which at the time was ascribed by some to unfavorable astrological conditions. As early as 1504, influenza began to mean a 'visitation' or 'outbreak' of any disease affecting many people in a single place at once. During an outbreak of influenza in 1743 that started in Italy and spread throughout Europe, the word reached the English language and was anglicized in pronunciation. Since the mid-1800s, influenza has also been used to refer to severe colds. The shortened form of the word, 'flu', is first attested in 1839 as flue with the spelling flu confirmed in 1893. Other names that have been used for influenza include epidemic catarrh, la grippe from French, sweating sickness, and, especially when referring to the 1918 pandemic strain, Spanish fever Influenza Influenza",
        "response": "Sure, what would you like to know about the history of influenza?"
    },
    {
        "dialog": [
            "Hi Medi, I just had my flu shot yesterday and I'm feeling a bit tired and have a mild fever.",
            "Hello! It's normal to feel a bit tired and feverish after getting a flu shot, as your body is building immunity. Just make sure to rest and drink plenty of fluids.",
            "Is it possible to get the flu from the flu shot?",
            "No, you can't get the flu from the flu shot. It's made from an inactivated virus that can't cause the flu. However, it's possible to get other respiratory infections because the flu shot only protects against certain strains of the flu.",
            "I see. How long does the flu shot protect me?",
            "The flu shot can protect you for up to six months. However, the effectiveness of the vaccine can vary depending on the strains of the flu circulating each year.",
            "Got it. Thanks for the information, Medi.",
            "You're welcome. If you have any other questions, feel free to ask.",
            "Can you give me some advice on how to prevent the flu?"
        ],
        "knowledge": "Influenza Influenza The flu is a contagious respiratory illness caused by influenza viruses that infect the nose, throat, and sometimes the lungs. It can cause mild to severe illness and can be fatal in some cases. The best way to prevent the flu is to get vaccinated every year, practice good hygiene such as washing your hands frequently and avoid close contact with people who are sick. If you do get sick, stay home and avoid contact with others to prevent spreading the virus.",
        "response": "Of course! To prevent the flu, make sure to get vaccinated every year, practice good hygiene such as washing your hands frequently, and avoid close contact with people who are sick. If you do get sick, stay home and avoid contact with others to prevent spreading the virus."
    },
    {
        "dialog": [
            "Hi Medi, I just got back from the hospital after having my appendix removed. Do you have any advice on how to recover quickly?",
            "Hello! After a surgery like that, it's important to rest and follow your doctor's orders. Make sure to take any prescribed medications and attend your follow-up appointments.",
            "Are there any dietary restrictions I should follow?",
            "Your doctor will likely recommend a bland diet for the first few days after surgery, which includes foods that are easy to digest like bananas, rice, applesauce, and toast. After that, you can gradually introduce other foods back into your diet.",
            "I see. What about physical activity?",
            "You should avoid strenuous physical activity or heavy lifting for at least a few weeks after surgery. However, it's important to do some gentle exercises like walking to prevent blood clots and promote healing.",
            "Thanks for the advice, Medi. I'll make sure to take it easy and follow my doctor's orders.",
            "You're welcome! If you have any other questions or concerns, feel free to ask.",
            "Do you have any information on the history of appendicitis?"
        ],
        "knowledge": "Appendicitis Appendicitis is a condition in which the appendix becomes inflamed and filled with pus, causing abdominal pain, nausea, vomiting, and fever. It is one of the most common surgical emergencies and affects around 5% of the population. The cause of appendicitis is not completely understood, but it is thought to be related to the obstruction of the appendix by fecal material, foreign objects, or lymphoid tissue. Appendicitis was first described in detail by Reginald Fitz in 1886, and surgical removal of the appendix, or appendectomy, became the standard treatment in the early 20th century. Before that, appendicitis was often fatal, and many famous figures in history, including King George III and Florence Nightingale, died from the condition.",
        "response": "Sure, what would you like to know about the history of appendicitis?"
    },
    {
        "dialog": [
            "Hello Medi, I think I might have caught something.",
            "What are your symptoms? I'm here to help.",
            "I'm feeling tired and have a headache. My nose is also runny.",
            "Based on your symptoms, it sounds like you may have the flu.",
            "How can I treat it at home?",
            "First, get plenty of rest and stay hydrated. You can also take over-the-counter medication to relieve symptoms.",
            "How long will I be sick?",
            "Most people recover from the flu within a week or two. Stay home and take care of yourself.",
            "Thanks, Medi. What can I do to prevent getting the flu again?"
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "To prevent the flu, make sure to wash your hands regularly, avoid touching your face, and get a flu vaccine every year."
    },
    {
        "dialog": [
            "Hello Medi, I have a sore throat and a cough.",
            "I'm sorry to hear that. How long have you been feeling this way?",
            "It's been a few days now.",
            "It sounds like you may have a cold. Have you been taking anything for it?",
            "I've been taking over-the-counter cough medicine, but it doesn't seem to be helping.",
            "You may want to try honey and lemon tea or gargling with salt water to soothe your throat. Drink plenty of fluids and rest.",
            "Thank you, Medi. What else can I do to help my symptoms?",
            "You can also take over-the-counter pain relievers like acetaminophen or ibuprofen to reduce fever and pain.",
            "I see. How long will it take for me to feel better?"
        ],
        "knowledge": "Common Cold Common Cold  Symptoms include coughing, sore throat, runny nose, and fever which usually resolve in seven to ten days, with some symptoms lasting up to three weeks.  Well over 200 virus strains are implicated in the cause of the common cold; the rhinoviruses are the most common.  A person's immune response to the virus ultimately determines the severity of the cold.  The common cold is the most frequent infectious disease in humans, and the average person gets two to three colds per year. Common Cold Common Cold",
        "response": "It usually takes around a week for your symptoms to fully go away. Make sure to get plenty of rest and take care of yourself."
    },
    {
        "dialog": [
            "Hello Medi, I just recovered from the flu and I'm feeling weak.",
            "I'm glad you're feeling better. Weakness is normal after an illness. Make sure to rest and take it easy.",
            "What foods can I eat to help me regain my strength?",
            "Foods high in protein like eggs and lean meats can help you regain your strength. Make sure to eat plenty of fruits and vegetables for vitamins and minerals.",
            "Any other advice?",
            "You can also do light exercises like walking or yoga to help regain your strength.",
            "Thank you, Medi. I appreciate your help.",
            "You're very welcome. Is there anything else I can do for you?",
            "No, that's all for now. Thank you again, Medi."
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "I'm glad I could help. Take care of yourself and let me know if you need anything else."
    },
    {
        "dialog": [
            "Hello Medi, I think I might have the flu.",
            "Hi, sorry to hear that. What are your symptoms?",
            "I have a fever, cough, runny or stuffy nose, headaches, and fatigue.",
            "Based on those symptoms, it's possible that you have the flu.",
            "What should I do next to feel better?",
            "It's important to rest, stay hydrated, and take over-the-counter pain relievers.",
            "Thank you for your help, Medi.",
            "You're welcome. Don't hesitate to contact me if you have any more questions.",
            "What should I eat in order to fight the flu?"
        ],
        "knowledge": "Influenza Influenza  Eating a healthy diet with plenty of fruits, vegetables, and whole grains can help strengthen your immune system and fight off the flu. Foods high in protein, such as lean meats, poultry, fish, and beans, can also be beneficial. Additionally, certain foods and drinks like ginger tea, chicken soup, and honey can help soothe flu symptoms and relieve congestion. However, it's important to avoid sugary and processed foods as they can weaken your immune system.",
        "response": "Eating a healthy diet with plenty of fruits, vegetables, and whole grains can help strengthen your immune system and fight off the flu. Foods high in protein, such as lean meats, poultry, fish, and beans, can also be beneficial."
    },
    {
        "dialog": [
            "Hello Medi, I have a question about the history of the flu.",
            "Sure, what would you like to know?",
            "I am curious about the origins of the word 'influenza.'",
            "The term 'influenza' has been around since the 14th century and was used to refer to any epidemic disease that affected many people at once. Some people at the time believed that unfavorable astrological conditions caused the disease.",
            "That's interesting. Why is it called the flu?",
            "The shortened form 'flu' first appeared in 1839 as 'flue' and was later confirmed as 'flu' in 1893. The name likely comes from the Italian word 'influenza,' which means 'influence.'",
            "Thank you for your detailed explanation, Medi.",
            "No problem. Feel free to ask me anything else you're curious about!",
            "What are some common complications of the flu?"
        ],
        "knowledge": "Influenza Influenza  Common complications of the flu include pneumonia, bronchitis, sinus and ear infections, and dehydration. Certain groups of people, such as young children, pregnant women, and people with chronic conditions like asthma or diabetes, are at higher risk of developing complications from the flu.",
        "response": "Common complications of the flu include pneumonia, bronchitis, sinus and ear infections, and dehydration."
    },
    {
        "dialog": [
            "Hi Medi, I just had the flu and I want to know how to recover faster.",
            "Hi there! Sorry to hear you've been sick. The best thing you can do is rest and take care of yourself.",
            "What kind of exercise can I do while I'm recovering?",
            "It's important to take it easy while recovering from the flu, but light physical activity like walking or gentle yoga can be beneficial. Just listen to your body and don't push yourself too hard.",
            "What should I eat to help my body recover?",
            "Foods that are high in vitamins and nutrients like fruits, vegetables, and whole grains can help boost your immune system and speed up recovery. It's also important to stay hydrated by drinking plenty of water and fluids like herbal tea and broth.",
            "Thank you for your advice, Medi.",
            "You're welcome. Let me know if you have any more questions.",
            "Are there any supplements or medications I can take to help me recover faster?"
        ],
        "knowledge": "Influenza Influenza  There are several over-the-counter medications like decongestants, cough suppressants, and pain relievers that can help alleviate flu symptoms. It's important to talk to your doctor before taking any new supplements or medications, as they can interact with other medications you may be taking or have side effects.",
        "response": "There are several over-the-counter medications like decongestants, cough suppressants, and pain relievers that can help alleviate flu symptoms. It's important to talk to your doctor before taking any new supplements or medications, as they can interact with other medications you may be taking or have side effects."
    },
    {
        "dialog": [
            "Hi Medi, I'm not feeling well, I have a fever and cough.",
            "Hi there! Sorry to hear that. How long have you had these symptoms?",
            "It started yesterday evening, and I feel worse today.",
            "Okay, based on your symptoms, it's possible that you have influenza. I recommend you rest and drink plenty of fluids. You can also take over-the-counter medications to relieve your symptoms.",
            "Will I need to see a doctor?",
            "Most people with influenza recover on their own without needing to see a doctor. But if your symptoms get worse or you develop difficulty breathing, you should seek medical attention.",
            "Okay, thanks for your advice. I'll try to take care of myself.",
            "You're welcome. Remember to rest and stay hydrated."
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion. These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose. Coughing is the most common symptom. Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children. The standard influenza symptoms typically last for 2 - 8 days. A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common.",
        "response": "What kind of over-the-counter medications do you recommend for relieving my symptoms?"
    },
    {
        "dialog": [
            "Hello Medi, I have some questions about influenza.",
            "Sure, I'm here to help. What do you want to know?",
            "What causes influenza?",
            "Influenza is caused by a virus that infects the respiratory tract. There are many different strains of the virus, which is why people can get the flu more than once. The virus is highly contagious and can spread through the air or by touching contaminated surfaces.",
            "How can I prevent getting the flu?",
            "The best way to prevent the flu is to get vaccinated every year. You should also practice good hygiene by washing your hands frequently, covering your mouth and nose when you cough or sneeze, and avoiding close contact with sick people.",
            "What should I do if I think I have the flu?",
            "If you have flu-like symptoms, you should stay home and rest until you feel better. You can take over-the-counter medications to relieve your symptoms. If your symptoms get worse or you develop difficulty breathing, you should seek medical attention.",
            "Thanks for your help. I'll try to stay healthy and take your advice."
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion. These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose. Coughing is the most common symptom. Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children. The standard influenza symptoms typically last for 2 - 8 days. A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common.",
        "response": "Is the influenza vaccine safe for everyone to get?"
    },
    {
        "dialog": [
            "Hi Medi, I recently recovered from influenza, and I want to make sure I stay healthy.",
            "That's great to hear! What do you want to know?",
            "Are there any lifestyle changes I can make to reduce my risk of getting sick again?",
            "Yes, there are many things you can do to stay healthy. Eating a balanced diet with plenty of fruits and vegetables, exercising regularly, getting enough sleep, and managing your stress can all help boost your immune system and reduce your risk of getting sick.",
            "That sounds like good advice. How much exercise should I aim for?",
            "You should aim for at least 150 minutes of moderate exercise or 75 minutes of vigorous exercise per week. This can include activities like walking, jogging, swimming, or cycling.",
            "Okay, I'll try to incorporate more physical activity into my routine. Are there any specific foods I should focus on?",
            "You should focus on eating a balanced diet that includes plenty of fruits, vegetables, whole grains, and lean proteins. You should also try to limit your intake of processed foods, sugary drinks, and alcohol.",
            "Thanks for your advice, Medi. I'll do my best to stay healthy."
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion. These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose. Coughing is the most common symptom. Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children. The standard influenza symptoms typically last for 2 - 8 days. A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common.",
        "response": "What are some good ways to manage stress and improve my mental health?"
    },
    {
        "dialog": [
            "Hello Medi, I'm feeling very tired and feverish.",
            "I'm sorry to hear that. Can you tell me more about your symptoms?",
            "I've been having chills, body aches, and a headache. My throat is also sore.",
            "How long have you been experiencing these symptoms?",
            "It's been about two days now.",
            "Okay, based on your symptoms, it's possible that you have the flu.",
            "What should I do to feel better?",
            "Drink plenty of fluids, rest, and take acetaminophen for the fever and body aches.",
            "Great, thank you for your help. Is there anything else I should know about the flu?"
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "The flu is a highly contagious respiratory illness caused by influenza viruses. It's important to take precautions to prevent the spread of the virus, such as washing your hands frequently and covering your mouth and nose when you cough or sneeze."
    },
    {
        "dialog": [
            "Hi Medi, I have a question about the history of influenza.",
            "Sure, I'd be happy to help. What would you like to know?",
            "I'm curious about the origin of the term 'influenza.'",
            "Interesting question. The term dates back to the 14th century, when it was used to refer to any disease that affected many people at once.",
            "What caused the disease at that time?",
            "Some people believed it was caused by unfavorable astrological conditions.",
            "How did the term 'influenza' come to be used to describe severe colds?",
            "By the mid-1800s, the term was also being used to refer to severe colds.",
            "Fascinating. Thanks for the information, Medi."
        ],
        "knowledge": "Influenza Influenza  Terms such as influenza di freddo, meaning 'influence of the cold', and influenza di stelle, meaning 'influence of the stars' are attested from the 14th century.  The latter referred to the disease's cause, which at the time was ascribed by some to unfavorable astrological conditions.  As early as 1504, influenza began to mean a 'visitation' or 'outbreak' of any disease affecting many people in a single place at once.  During an outbreak of influenza in 1743 that started in Italy and spread throughout Europe, the word reached the English language and was anglicized in pronunciation.  Since the mid-1800s, influenza has also been used to refer to severe colds.  The shortened form of the word, 'flu', is first attested in 1839 as flue with the spelling flu confirmed in 1893.  Other names that have been used for influenza include epidemic catarrh, la grippe from French, sweating sickness, and, especially when referring to the 1918 pandemic strain, Spanish fever Influenza Influenza",
        "response": "You're welcome! It's always fascinating to learn about the history of different diseases."
    },
    {
        "dialog": [
            "Hi Medi, I recently had the flu and I'm wondering what I can do to prevent getting it again in the future.",
            "I'm glad you're feeling better. There are several things you can do to reduce your risk of getting the flu.",
            "What are some examples?",
            "Washing your hands frequently, avoiding close contact with sick people, and getting an annual flu vaccine are all effective measures.",
            "Does the vaccine protect against all strains of the flu?",
            "No, the vaccine is designed to protect against the strains of the virus that are predicted to be most common in a given season.",
            "I see. Thanks for the information, Medi.",
            "You're welcome. Do you have any other questions?"
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "No problem! It's always a good idea to take steps to protect yourself from getting sick."
    },
    {
        "dialog": [
            "Hello Medi, I'm feeling sick with a headache and fever.",
            "Sorry to hear that, have you been experiencing any other symptoms?",
            "Yes, I've also been feeling tired and have a dry cough.",
            "Based on your symptoms, you may have the flu. It's important to rest and stay hydrated.",
            "Okay, I'll do that. What else can I do to feel better?",
            "You can take over-the-counter medication for the fever and headaches. And make sure to cover your mouth when coughing.",
            "Thank you, Medi. How long does the flu usually last?",
            "Typically, the flu lasts for about a week. But it's important to monitor your symptoms and seek medical attention if they worsen.",
            "Okay, I will. Thank you for your help!"
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "You're welcome. Typically, the flu lasts for about a week. But it's important to monitor your symptoms and seek medical attention if they worsen."
    },
    {
        "dialog": [
            "Hi Medi, I have a question about the flu.",
            "Sure, what would you like to know?",
            "What causes the flu?",
            "The flu is caused by a virus. There are different strains of the virus that can cause the flu.",
            "How is the flu spread?",
            "The flu is spread through respiratory droplets when someone with the flu coughs or sneezes. It can also be spread by touching a surface contaminated with the virus and then touching your face.",
            "Okay, thank you for letting me know.",
            "You're welcome. Do you have any other questions?",
            "No, that's all for now. Thank you, Medi!"
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "You're welcome. Let me know if you have any other questions!"
    },
    {
        "dialog": [
            "Hey Medi, I recently had the flu and I'm feeling better now. What can I do to prevent getting sick again?",
            "Great to hear that you're feeling better. To prevent getting sick again, make sure to wash your hands regularly and avoid close contact with people who are sick.",
            "What about getting the flu shot?",
            "Yes, getting the flu shot is also a good way to prevent getting the flu. It's recommended that everyone gets vaccinated annually.",
            "Okay, thank you for the advice. Is there anything else I should know?",
            "It's also important to maintain a healthy lifestyle by eating a balanced diet, getting enough sleep, and exercising regularly. This can help boost your immune system and prevent getting sick.",
            "Got it. Thank you, Medi!",
            "You're welcome! Let me know if you have any other questions.",
            "No, that's all for now. Thanks again!"
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "You're welcome, happy to help!"
    }
]