[
    {
        "dialog": [
            "Hello Medi, I have a sore throat and feel a bit feverish.",
            "Hi there, have you been exposed to any birds in farms or live poultry markets recently?",
            "No, I haven't. Why do you ask?",
            "Based on your symptoms and information I have, you may have influenza. It's a respiratory illness that can be transmitted from birds to humans.",
            "Oh, I see. What should I do now?",
            "You should rest and drink plenty of fluids. If you have a fever, you can take over-the-counter medication like Tylenol. If your symptoms persist or worsen, you should see a doctor.",
            "Is there any way to prevent getting influenza?",
            "Yes, you can get vaccinated against influenza each year, avoid contact with sick people, and practice good hand hygiene.",
            "Thank you for your advice, Medi. I will take care of myself."
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "You're welcome. Take care of yourself and if your symptoms worsen, please seek medical attention."
    },
    {
        "dialog": [
            "Hello Medi, can you give me more information about avian influenza?",
            "Sure, avian influenza is a virus that primarily infects birds, but it can also spread to humans who have contact with infected birds.",
            "How does it spread from birds to humans?",
            "Most transmission involves domestic poultry, mainly chickens, ducks, and geese but also a variety of other birds such as guinea fowl, partridge, pheasants, and quails. The primary risk factor for infection with AIVs is exposure to birds in farms and live poultry markets.",
            "What are the symptoms of avian influenza in humans?",
            "H5N1 and H7N9 cause severe lower respiratory tract illness, whereas other AIVs such as H9N2 cause a more mild upper respiratory tract illness, commonly with conjunctivitis. Infection with an AIV has an incubation period of 3–5 days but can be up to 9 days.",
            "Is it contagious between humans?",
            "Limited transmission of avian H2, H5-7, H9, and H10 subtypes from one person to another through respiratory droplets, aerosols, and fomites has occurred, but sustained human-to-human transmission of AIVs has not occurred.",
            "Thank you for the information, Medi. Is there anything I can do to prevent getting infected?"
        ],
        "knowledge": "Influenza Influenza  Instead, most transmission involves domestic poultry, mainly chickens, ducks, and geese but also a variety of other birds such as guinea fowl, partridge, pheasants, and quails.  The primary risk factor for infection with AIVs is exposure to birds in farms and live poultry markets.  Typically, infection with an AIV has an incubation period of 3–5 days but can be up to 9 days.  H5N1 and H7N9 cause severe lower respiratory tract illness, whereas other AIVs such as H9N2 cause a more mild upper respiratory tract illness, commonly with conjunctivitis.  Limited transmission of avian H2, H5-7, H9, and H10 subtypes from one person to another through respiratory droplets, aerosols, and fomites has occurred, but sustained human-to-human transmission of AIVs has not occurred.  Before 2013, H5N1 was the most common AIV to infect humans.  Since then, H7N9 has been responsible for most human cases Influenza Influenza",
        "response": "You're welcome. Stay safe and avoid contact with birds in farms and live poultry markets."
    },
    {
        "dialog": [
            "Hello Medi, I recently had a medical procedure. Can you give me some advice for recovery?",
            "Sure, what kind of procedure did you have?",
            "I had surgery to remove my gallbladder.",
            "After surgery, you should rest and avoid strenuous activities for a few weeks. You may experience some pain or discomfort, but your doctor can prescribe pain medication to manage it. You should also eat a low-fat diet to avoid stressing your digestive system.",
            "How long does it take to recover?",
            "It usually takes a few weeks to recover from gallbladder surgery. You may be able to return to work or normal activities after a week or two, but it depends on your individual case and your doctor's advice.",
            "Are there any exercises or physical therapy I can do to help with recovery?",
            "You can do light exercises like walking or gentle stretching, but you should avoid any strenuous activities or heavy lifting until your doctor clears you for it. Your doctor may also recommend physical therapy to help with your recovery.",
            "Thank you for your advice, Medi. I appreciate it."
        ],
        "knowledge": "Gallbladder Surgery Gallbladder Surgery  After surgery, patients should avoid strenuous activities for a few weeks and eat a low-fat diet to avoid stressing the digestive system.  Patients may experience some pain or discomfort after surgery, but their doctor can prescribe pain medication to manage it.  Most people are able to return to work or normal activities after a week or two, but it depends on the individual case and the doctor's advice.  Light exercise like walking or gentle stretching can help with recovery, but patients should avoid heavy lifting or strenuous activities until their doctor clears them for it.  Physical therapy may also be recommended in some cases Gallbladder Surgery Gallbladder Surgery",
        "response": "Thank you for the advice, Medi. I will make sure to follow my doctor's instructions and take it easy during my recovery."
    },
    {
        "dialog": [
            "Hello Medi, I have a bad cold. What should I do?",
            "Hello, to relieve your symptoms, take rest, drink fluids, and use over-the-counter cold remedies.",
            "Can you recommend me some cold remedies, Medi?",
            "Yes. You can take acetaminophen or ibuprofen for pain and fever. Also, use saline nasal sprays, cough syrups, or decongestants.",
            "Thanks. How long will it take to get better?",
            "Usually, a cold will last 7-10 days. However, if you start feeling worse, see a doctor.",
            "Okay. I'll try these remedies.",
            "Great. Keep me updated on how you're feeling.",
            "Sure. Thanks for your help."
        ],
        "knowledge": "Common Cold Common Cold The common cold is a viral infection of the upper respiratory tract caused by different types of viruses. The virus can spread through the air, touching contaminated surfaces, or from person to person. Symptoms include a stuffy or runny nose, sore throat, cough, slight body aches or mild headache, sneezing, low-grade fever, and malaise. Most people recover on their own within a week or two. Over-the-counter medications, fluids, and rest are recommended for symptom relief. In rare cases, complications such as bacterial infections, sinus infections, or pneumonia may occur. Common Cold Common Cold",
        "response": "You're welcome. I hope you feel better soon."
    },
    {
        "dialog": [
            "Hey Medi, I have a question about avian influenza.",
            "Sure. What do you want to know about avian influenza?",
            "How can people catch avian influenza?",
            "Avian influenza usually spreads to people who have contact with infected birds or their droppings. People who work in poultry farms or bird markets are at risk.",
            "What are the symptoms of avian influenza?",
            "Symptoms can range from mild to severe. They include fever, cough, sore throat, muscle aches, eye infections, and respiratory distress.",
            "Can avian influenza be transmitted from person to person?",
            "Limited transmission of avian influenza from one person to another through respiratory droplets, aerosols, and fomites has occurred, but sustained human-to-human transmission of avian influenza has not occurred.",
            "I see. How can I protect myself from avian influenza?"
        ],
        "knowledge": "Influenza Influenza  Instead, most transmission involves domestic poultry, mainly chickens, ducks, and geese but also a variety of other birds such as guinea fowl, partridge, pheasants, and quails.  The primary risk factor for infection with AIVs is exposure to birds in farms and live poultry markets.  Typically, infection with an AIV has an incubation period of 3–5 days but can be up to 9 days.  H5N1 and H7N9 cause severe lower respiratory tract illness, whereas other AIVs such as H9N2 cause a more mild upper respiratory tract illness, commonly with conjunctivitis.  Limited transmission of avian H2, H5-7, H9, and H10 subtypes from one person to another through respiratory droplets, aerosols, and fomites has occurred, but sustained human-to-human transmission of AIVs has not occurred.  Before 2013, H5N1 was the most common AIV to infect humans.  Since then, H7N9 has been responsible for most human cases Influenza Influenza",
        "response": "You're welcome. Let me know if you have any other questions."
    },
    {
        "dialog": [
            "Hi Medi, I just had my flu shot. What should I do now?",
            "Hello. After getting your flu shot, continue to practice good hygiene and avoid close contact with people who are sick.",
            "Can I get the flu from the flu vaccine?",
            "No, you cannot get the flu from the flu vaccine. The vaccine contains inactivated viruses that cannot cause illness.",
            "Do I need to get a flu shot every year?",
            "Yes, it is recommended to get a flu shot every year because the virus can change, and the vaccine may not match the new strains.",
            "What are the side effects of the flu shot?",
            "Common side effects include soreness, redness, or swelling at the injection site, fever, and body aches. These side effects are usually mild and go away on their own within a few days.",
            "Okay. Thank you for the information."
        ],
        "knowledge": "Influenza Influenza  The annual influenza vaccine is the most effective way to prevent influenza.  The vaccine stimulates the immune system to produce antibodies against the virus.  The vaccine strains are selected based on global surveillance data, and updated vaccine formulations are developed annually to provide protection against the currently circulating strains.  The vaccine is usually given by injection, but a nasal spray is also available.  The vaccine is recommended for everyone six months of age and older, especially those at high risk of complications from influenza.  These include pregnant women, young children, older adults, and people with certain medical conditions.  The vaccine is generally safe and well-tolerated. Influenza Influenza",
        "response": "You're welcome. Let me know if you have any other questions."
    },
    {
        "dialog": [
            "Hello Medi, I don't feel well. I have a cough and a fever.",
            "Hi there. I'm here to help. How long have you had these symptoms?",
            "Two days.",
            "Do you feel shortness of breath?",
            "No, I don't.",
            "Do you have any history of exposure to birds in farms and live poultry markets?",
            "Yes, I do. I work in a poultry market.",
            "Based on your symptoms and history, you may have avian influenza. You should immediately contact your healthcare provider.",
            "What should I do to prevent the disease from spreading?"
        ],
        "knowledge": "Influenza Influenza  Instead, most transmission involves domestic poultry, mainly chickens, ducks, and geese but also a variety of other birds such as guinea fowl, partridge, pheasants, and quails.  The primary risk factor for infection with AIVs is exposure to birds in farms and live poultry markets.  Typically, infection with an AIV has an incubation period of 3–5 days but can be up to 9 days.  H5N1 and H7N9 cause severe lower respiratory tract illness, whereas other AIVs such as H9N2 cause a more mild upper respiratory tract illness, commonly with conjunctivitis.  Limited transmission of avian H2, H5-7, H9, and H10 subtypes from one person to another through respiratory droplets, aerosols, and fomites has occurred, but sustained human-to-human transmission of AIVs has not occurred.  Before 2013, H5N1 was the most common AIV to infect humans.  Since then, H7N9 has been responsible for most human cases Influenza Influenza",
        "response": "You should avoid contact with birds and maintain good hygiene practices."
    },
    {
        "dialog": [
            "Hi Medi, What is avian influenza?",
            "Avian influenza is a virus that primarily infects birds, but it can also infect humans.",
            "What are the symptoms?",
            "The symptoms are similar to other types of influenza: fever, cough, sore throat, muscle aches, and fatigue. In more severe cases, it can cause respiratory distress, pneumonia, and even death.",
            "How do people get infected?",
            "The primary risk factor for infection with AIVs is exposure to birds in farms and live poultry markets.",
            "Is it contagious?",
            "Limited transmission of avian H2, H5-7, H9, and H10 subtypes from one person to another through respiratory droplets, aerosols, and fomites has occurred, but sustained human-to-human transmission of AIVs has not occurred.",
            "Thank you for the information."
        ],
        "knowledge": "Influenza Influenza  Instead, most transmission involves domestic poultry, mainly chickens, ducks, and geese but also a variety of other birds such as guinea fowl, partridge, pheasants, and quails.  The primary risk factor for infection with AIVs is exposure to birds in farms and live poultry markets.  Typically, infection with an AIV has an incubation period of 3–5 days but can be up to 9 days.  H5N1 and H7N9 cause severe lower respiratory tract illness, whereas other AIVs such as H9N2 cause a more mild upper respiratory tract illness, commonly with conjunctivitis.  Limited transmission of avian H2, H5-7, H9, and H10 subtypes from one person to another through respiratory droplets, aerosols, and fomites has occurred, but sustained human-to-human transmission of AIVs has not occurred.  Before 2013, H5N1 was the most common AIV to infect humans.  Since then, H7N9 has been responsible for most human cases Influenza Influenza",
        "response": "You're welcome. If you have other questions, feel free to ask me."
    },
    {
        "dialog": [
            "Hi Medi, I just recovered from avian influenza. What should I do to get back to my normal life?",
            "Glad to hear that you've recovered. It's important to take care of yourself before returning to your normal life. How long were you sick?",
            "I was sick for a week.",
            "You should get plenty of rest, stay hydrated, and avoid strenuous physical activity for at least two weeks after your symptoms go away. You should also eat a healthy diet and avoid smoking and alcohol.",
            "Is there anything else I should know?",
            "You should monitor your symptoms and contact your healthcare provider immediately if they worsen or if you have difficulty breathing.",
            "Thanks for the advice.",
            "You're welcome. Take care!"
        ],
        "knowledge": "Influenza Influenza  Instead, most transmission involves domestic poultry, mainly chickens, ducks, and geese but also a variety of other birds such as guinea fowl, partridge, pheasants, and quails.  The primary risk factor for infection with AIVs is exposure to birds in farms and live poultry markets.  Typically, infection with an AIV has an incubation period of 3–5 days but can be up to 9 days.  H5N1 and H7N9 cause severe lower respiratory tract illness, whereas other AIVs such as H9N2 cause a more mild upper respiratory tract illness, commonly with conjunctivitis.  Limited transmission of avian H2, H5-7, H9, and H10 subtypes from one person to another through respiratory droplets, aerosols, and fomites has occurred, but sustained human-to-human transmission of AIVs has not occurred.  Before 2013, H5N1 was the most common AIV to infect humans.  Since then, H7N9 has been responsible for most human cases Influenza Influenza",
        "response": "You're welcome. I hope you have a speedy recovery."
    },
    {
        "dialog": [
            "Hi Medi, I have a cough and I feel very tired.",
            "Hello, Can you tell me more about the cough and other symptoms?",
            "It is a dry cough and I feel very tired and have some muscle aches. I don't have a fever.",
            "Based on your symptoms, it can be a sign of a common cold. You don't have a fever yet, so it's good.",
            "Can I do anything to feel better?",
            "Yes, you should rest and drink plenty of fluids. I suggest you to take some medicine for your cough.",
            "Okay, thanks for your advice.",
            "You're welcome. Don't hesitate to contact me if you have any other concerns.",
            "What kind of medicine do you recommend, Medi?"
        ],
        "knowledge": "Common Cold Common Cold The symptoms of the common cold are a runny nose, congestion, and a cough.  A fever is usually low grade or absent.  The illness is usually self-limited and lasts 5 - 10 days.  Most cases are caused by rhinoviruses, coronaviruses, and respiratory syncytial virus.  The infectious period ranges from shortly before the onset of symptoms to 1 - 2 days after the resolution of fever.  There are no antiviral medications available for the treatment of the common cold.  Symptomatic treatments include rest, hydration, and over-the-counter pain and fever reducers. Common Cold Common Cold",
        "response": "I recommend that you take acetaminophen or ibuprofen for your cough and fever."
    },
    {
        "dialog": [
            "Hi Medi, I just got back from a farm with a lot of birds and I'm feeling sick.",
            "Hello, What are your symptoms? We need to make sure that you are not infected with bird flu.",
            "I have a fever and a cough. Also, my throat is sore.",
            "You might be infected with bird flu, which is caused by avian influenza viruses. You should see a doctor as soon as possible.",
            "Is there anything I can do to feel better?",
            "You should rest and drink plenty of fluids. Also, cover your mouth when you cough or sneeze to prevent the disease from spreading.",
            "Okay, thanks for your advice.",
            "You're welcome. Don't hesitate to contact me if you have any other concerns.",
            "What is bird flu, Medi?"
        ],
        "knowledge": "Influenza Influenza  Instead, most transmission involves domestic poultry, mainly chickens, ducks, and geese but also a variety of other birds such as guinea fowl, partridge, pheasants, and quails.  The primary risk factor for infection with AIVs is exposure to birds in farms and live poultry markets.  Typically, infection with an AIV has an incubation period of 3–5 days but can be up to 9 days.  H5N1 and H7N9 cause severe lower respiratory tract illness, whereas other AIVs such as H9N2 cause a more mild upper respiratory tract illness, commonly with conjunctivitis.  Limited transmission of avian H2, H5-7, H9, and H10 subtypes from one person to another through respiratory droplets, aerosols, and fomites has occurred, but sustained human-to-human transmission of AIVs has not occurred.  Before 2013, H5N1 was the most common AIV to infect humans.  Since then, H7N9 has been responsible for most human cases Influenza Influenza",
        "response": "Bird flu is an infectious disease caused by avian influenza viruses, which can be transmitted to humans through exposure to infected birds in farms and live poultry markets."
    },
    {
        "dialog": [
            "Hi Medi, I just had a vaccine shot and I'm not feeling well.",
            "Hello, What vaccine did you get?",
            "I got a flu vaccine.",
            "Feeling unwell after a flu shot is common. What symptoms are you experiencing?",
            "I have a sore arm and a mild fever.",
            "Those are common side effects of a flu shot. You may also experience a headache and muscle aches.",
            "How long will these symptoms last?",
            "Usually they will go away in a few days. You can take acetaminophen or ibuprofen to reduce the fever and pain.",
            "Okay, thanks for your advice."
        ],
        "knowledge": "Influenza Influenza  Influenza vaccine is a vaccine that protects against infection with influenza viruses.  It is usually given by injection into a muscle.  The vaccine is recommended for all people aged 6 months and older.  The vaccine contains dead or weakened strains of the virus.  The vaccine takes about 2 weeks to provide full protection.  Side effects may include a sore arm, fever, and body aches.  Influenza vaccine is usually given yearly, as the virus changes constantly. Influenza Influenza",
        "response": "Flu vaccine is a vaccine that protects against infection with influenza viruses. It is usually given by injection into a muscle and recommended for all people aged 6 months and older. The vaccine contains dead or weakened strains of the virus."
    },
    {
        "dialog": [
            "Hello Medi, I have a sore throat and difficulty swallowing.",
            "Hi, Let me ask you a few questions to help you.",
            "Sure.",
            "Did you have a cold or flu recently?",
            "No, I didn't.",
            "Have you been exposed to anyone with a sore throat or strep throat?",
            "Not that I'm aware of.",
            "I suspect that your symptoms might be strep throat.",
            "What should I do next, Medi?"
        ],
        "knowledge": "Strep Throat Strep Throat Strep throat is a bacterial infection that causes sore throat, fever, and tonsillitis. Without proper treatment, it can lead to complications like kidney inflammation, rheumatic fever, and even heart damage. It typically spreads through respiratory droplets from infected people, such as when someone coughs or sneezes. To confirm a diagnosis of strep throat, your doctor may perform a throat culture or rapid strep test. Treatment usually involves antibiotics to kill the bacteria and relieve symptoms Strep Throat Strep Throat",
        "response": "How can I confirm this diagnosis, Medi?"
    },
    {
        "dialog": [
            "Hey Medi, I had a flu shot last week. Can I still get sick?",
            "Hello, It's possible to still get the flu even after getting the flu vaccine.",
            "What are the reasons for that?",
            "The flu vaccine is designed to protect against the strains of flu that are predicted to be most common during the upcoming flu season. However, there are many different strains of the flu virus, and the vaccine may not be effective against all of them. Additionally, it takes about two weeks for the vaccine to provide full protection, so you may still get sick during that time period.",
            "I see, what should I do if I feel sick?",
            "If you experience flu-like symptoms such as fever, cough, or body aches, it's important to rest and stay hydrated. Over-the-counter medications like acetaminophen or ibuprofen can help relieve symptoms. If your symptoms are severe or you are at high risk for complications from the flu, you should contact your healthcare provider.",
            "Thank you for the advice, Medi.",
            "You're welcome. Do you have any other questions?"
        ],
        "knowledge": "Flu Vaccine Flu Vaccine The flu vaccine is a vaccine that helps protect against the flu, a viral infection that can cause severe illness and even death. The vaccine works by stimulating the body's immune system to produce antibodies against the flu virus, which can help prevent infection. However, it may not be effective against all strains of the flu virus. The vaccine is typically given once a year, before the start of flu season. It takes about two weeks for the vaccine to provide full protection. The vaccine is recommended for everyone over the age of six months, but it is especially important for people at high risk for complications from the flu, such as young children, pregnant women, and older adults. Flu Vaccine Flu Vaccine",
        "response": "How long does it typically take for the flu vaccine to provide full protection?"
    },
    {
        "dialog": [
            "Hey Medi, I just had a surgery. What can I do to help my recovery?",
            "Hello. After surgery, it's important to follow your doctor's instructions for recovery.",
            "Are there any general things that can help?",
            "Yes, eating a healthy diet, getting enough rest, and avoiding strenuous activity can all help speed up your recovery. Additionally, taking any prescribed medications as directed can help manage pain and prevent infection. It's important to keep your incision clean and dry, and to watch for any signs of infection such as redness, swelling, or drainage.",
            "What kind of diet do you recommend?",
            "A balanced diet that includes plenty of fruits, vegetables, whole grains, and lean protein can help support your body's healing process. Make sure to stay hydrated by drinking plenty of water and avoiding sugary or caffeinated beverages.",
            "Thanks for the advice, Medi.",
            "You're welcome. Don't hesitate to contact your doctor if you have any concerns or questions during your recovery.",
            "Sure, I'll keep that in mind."
        ],
        "knowledge": "Post-Operative Care Post-Operative Care After surgery, it's important to follow your doctor's instructions for recovery. This may include resting, taking any prescribed medications, and avoiding strenuous activity. Eating a healthy diet that includes plenty of fruits, vegetables, whole grains, and lean protein can help support your body's healing process. Staying hydrated by drinking plenty of water and avoiding sugary or caffeinated beverages is also important. It's important to keep your incision clean and dry, and to watch for any signs of infection such as redness, swelling, or drainage. Contact your doctor if you have any concerns or questions during your recovery. Post-Operative Care Post-Operative Care",
        "response": "What precautions should I take to avoid infection at the incision site?"
    },
    {
        "dialog": [
            "Hi Medi, I have some symptoms, can you help me please?",
            "Of course, tell me what's going on?",
            "I have a fever, muscle aches and a dry cough. I also feel tired.",
            "Based on your symptoms, it could be Influenza. Do you have any other symptoms?",
            "No, that's about it.",
            "You should get some rest and drink plenty of fluids. If it gets worse, you should go see a doctor.",
            "What kind of medication would you recommend?",
            "There are antiviral medications that can help reduce the severity of your symptoms. Talk to your doctor about it.",
            "Okay, thank you for your help."
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "Thank you for your advice. What antiviral medication do you recommend for my symptoms?"
    },
    {
        "dialog": [
            "Hey Medi, I'm curious about the transmission of AIVs.",
            "Sure, I can help with that. What do you want to know?",
            "How is AIVs transmitted from birds to humans?",
            "The primary risk factor for infection with AIVs is exposure to birds in farms and live poultry markets. Humans can also contract AIVs by handling infected poultry or through contact with contaminated surfaces or objects. Limited transmission of avian H2, H5-7, H9, and H10 subtypes from one person to another through respiratory droplets, aerosols, and fomites has occurred, but sustained human-to-human transmission of AIVs has not occurred.",
            "What are the symptoms of AIVs in humans?",
            "H5N1 and H7N9 cause severe lower respiratory tract illness, whereas other AIVs such as H9N2 cause a more mild upper respiratory tract illness, commonly with conjunctivitis. Typically, infection with an AIV has an incubation period of 3–5 days but can be up to 9 days.",
            "How can I prevent getting AIVs?",
            "Avoid contact with infected birds or surfaces contaminated with chicken feces, avoid eating raw or undercooked poultry, and wash your hands frequently with soap and water.",
            "Great, thank you for answering my questions."
        ],
        "knowledge": "Influenza Influenza  Instead, most transmission involves domestic poultry, mainly chickens, ducks, and geese but also a variety of other birds such as guinea fowl, partridge, pheasants, and quails.  The primary risk factor for infection with AIVs is exposure to birds in farms and live poultry markets.  Typically, infection with an AIV has an incubation period of 3–5 days but can be up to 9 days.  H5N1 and H7N9 cause severe lower respiratory tract illness, whereas other AIVs such as H9N2 cause a more mild upper respiratory tract illness, commonly with conjunctivitis.  Limited transmission of avian H2, H5-7, H9, and H10 subtypes from one person to another through respiratory droplets, aerosols, and fomites has occurred, but sustained human-to-human transmission of AIVs has not occurred.  Before 2013, H5N1 was the most common AIV to infect humans.  Since then, H7N9 has been responsible for most human cases Influenza Influenza",
        "response": "Thank you for your help. I will make sure to avoid contact with infected birds and surfaces."
    },
    {
        "dialog": [
            "Hey Medi, I just had a flu shot. Can you give me some advice on what to do next?",
            "Sure, after getting a flu shot, you may experience some mild symptoms such as soreness, redness, or swelling at the injection site, or a low-grade fever or headache. These symptoms typically go away on their own within a day or two.",
            "Is there anything I can do to minimize these symptoms?",
            "You can apply a cool, damp cloth to the injection site to reduce soreness and swelling. You can also take an over-the-counter pain reliever like acetaminophen or ibuprofen to relieve any discomfort or fever.",
            "Should I rest after getting a flu shot?",
            "It's a good idea to take it easy and avoid strenuous activity for the rest of the day, but you can resume your normal activities the following day.",
            "Thank you for your help, Medi.",
            "You're welcome. Let me know if you have any other questions."
        ],
        "knowledge": "Influenza Influenza  The most effective way to prevent influenza is to get an annual flu shot.  The flu shot contains inactivated influenza viruses that stimulate the immune system to produce antibodies to fight the virus.  The vaccine is typically given as an injection in the arm, and it takes about 2 weeks for the body to develop immunity to the virus.  After getting the flu shot, you may experience some mild symptoms such as soreness, redness, or swelling at the injection site, or a low-grade fever or headache. These symptoms typically go away on their own within a day or two.  The flu vaccine is generally safe for most people, but you should talk to your doctor if you have any concerns Influenza Influenza",
        "response": "Thank you for your help. I will make sure to take it easy for the rest of the day."
    },
    {
        "dialog": [
            "Hi, Medi. I feel like I have a cold. What should I do?",
            "Hi, sorry to hear that. Can you describe your symptoms?",
            "Yeah, I have a runny nose and a cough.",
            "These symptoms can be caused by various things. Do you feel tired or feverish?",
            "Yeah, I feel a little tired and feverish as well.",
            "It could be the flu. Please rest and drink plenty of fluids.",
            "Do I need any medication?",
            "If your symptoms become unbearable, you can take some over-the-counter medications like acetaminophen or ibuprofen.",
            "Okay, thanks. How can I prevent getting the flu in the future?"
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "The best way to prevent getting the flu is by getting the flu vaccine every year during the flu season and by washing your hands frequently."
    },
    {
        "dialog": [
            "Hi, Medi. I recently visited a farm and I'm worried about catching a disease from the birds.",
            "Hello! What kind of birds were on the farm?",
            "There were chickens, ducks and geese mainly.",
            "In that case, you may have been exposed to avian influenza viruses (AIVs). Do you have any symptoms?",
            "No, not yet. What should I look out for?",
            "Typically, infection with an AIV has an incubation period of 3-5 days but can be up to 9 days. Symptoms can range from mild upper respiratory tract illness to severe lower respiratory tract illness.",
            "What can I do to prevent getting sick?",
            "Avoid contact with birds in farms and live poultry markets as much as possible. If you develop any flu-like symptoms, seek medical attention immediately.",
            "Okay, thank you. What can I do to protect myself in the future?"
        ],
        "knowledge": "Influenza Influenza  Instead, most transmission involves domestic poultry, mainly chickens, ducks, and geese but also a variety of other birds such as guinea fowl, partridge, pheasants, and quails.  The primary risk factor for infection with AIVs is exposure to birds in farms and live poultry markets.  Typically, infection with an AIV has an incubation period of 3–5 days but can be up to 9 days.  H5N1 and H7N9 cause severe lower respiratory tract illness, whereas other AIVs such as H9N2 cause a more mild upper respiratory tract illness, commonly with conjunctivitis.  Limited transmission of avian H2, H5-7, H9, and H10 subtypes from one person to another through respiratory droplets, aerosols, and fomites has occurred, but sustained human-to-human transmission of AIVs has not occurred.  Before 2013, H5N1 was the most common AIV to infect humans.  Since then, H7N9 has been responsible for most human cases Influenza Influenza",
        "response": "You can reduce the risk of exposure by avoiding close contact with birds and farms, and by washing your hands frequently with soap and water."
    },
    {
        "dialog": [
            "Hi, Medi. I just had a minor surgical procedure. What should I do to take care of myself?",
            "Hi! First of all, you should follow any specific instructions provided by your doctor. Do you have any general questions?",
            "Yeah, what should I eat and drink?",
            "It's important to stay hydrated by drinking plenty of water. You can also have clear liquids like broth, apple juice, and sports drinks. Eat soft, bland foods like oatmeal, yogurt, and applesauce.",
            "How about physical activity?",
            "You should avoid strenuous physical activity for a few days after the procedure. Once you feel ready to exercise again, start with light activities like walking and stretching. Avoid lifting heavy objects.",
            "How long will it take to recover?",
            "It depends on the type of procedure you had. In general, it takes a few days to a few weeks to fully recover. Make sure to get enough rest and listen to your body.",
            "Okay, thank you. What should I do if I experience any complications?"
        ],
        "knowledge": "Surgery Surgery  The recovery process is different for everyone and depends on the type of procedure you had. It's important to follow any specific instructions provided by your doctor. In general, you should drink plenty of fluids and eat soft, bland foods. Avoid strenuous physical activity and lifting heavy objects. Make sure to get enough rest. If you experience any complications, contact your doctor immediately Surgery Surgery",
        "response": "If you experience any complications like fever, excessive bleeding, or severe pain, contact your doctor immediately for further guidance and treatment."
    },
    {
        "dialog": [
            "Hi Medi, I'm feeling a bit under the weather lately",
            "Hi there, please tell me your symptoms to determine the cause of your discomfort",
            "I'm experiencing headaches and fatigue with a runny nose. It's been going on for a few days now",
            "Based on your symptoms, it's possible that you are experiencing a common cold",
            "How can I treat it?",
            "You can treat it by drinking plenty of fluids, getting enough rest, and taking over-the-counter cold medications",
            "Thanks for your help, Medi. What should I do if my symptoms persist?",
            "If your symptoms persist for more than a week, you should seek medical attention",
            "Okay, I will. Thanks again for your help"
        ],
        "knowledge": "Common Cold Common Cold The common cold is a viral infection of the upper respiratory tract that primarily affects the nose but can also affect the throat, sinuses, and voice box.  The symptoms include coughing, sore throat, runny or stuffy nose, sneezing, and fatigue.  It is typically a self-limiting disease, which means that it will go away on its own without treatment.  However, treatment can help relieve the symptoms and make you feel more comfortable.  Prevention measures include frequent hand washing, staying away from people who have colds, avoiding touching your face with your hands, and covering your mouth and nose when you cough or sneeze. Common Cold Common Cold",
        "response": "You're welcome. If your symptoms persist for more than a week, you should seek medical attention"
    },
    {
        "dialog": [
            "Hello, Medi. I've been experiencing shortness of breath and coughing recently",
            "Hi there. Those are concerning symptoms. Have you experienced any chest pain or difficulty breathing?",
            "Yes, I have. It's been a little difficult to breathe and I've also had chest pain",
            "Based on your symptoms, I think you should see a doctor as soon as possible as it may be a sign of a respiratory infection",
            "What kind of respiratory infection?",
            "It's difficult to determine without a thorough medical examination, but it could be pneumonia, bronchitis or COVID-19",
            "What should I do until I can see a doctor?",
            "Make sure you rest and drink plenty of fluids. You can also use over-the-counter medications to help relieve your symptoms",
            "Thank you for your help, Medi"
        ],
        "knowledge": "Respiratory Infection Respiratory Infection Respiratory infections are infections that affect the respiratory tract, which includes the nose, throat, sinuses, and lungs. They can be caused by viruses or bacteria and can range from mild to severe. Symptoms include coughing, shortness of breath, chest pain, fever, and fatigue. Treatment depends on the cause of the infection and can include antibiotics, antiviral medications, or rest and fluids. Prevention measures include frequent hand washing, avoiding close contact with people who are sick, and covering your mouth and nose when you cough or sneeze. Respiratory Infection Respiratory Infection",
        "response": "Make sure you rest and drink plenty of fluids. You can also use over-the-counter medications to help relieve your symptoms"
    },
    {
        "dialog": [
            "Hi, Medi. I am planning to adopt a healthier lifestyle",
            "That's great to hear! What specific changes are you planning to make?",
            "I want to improve my diet and start exercising regularly",
            "That's a good start. What kind of changes do you want to make to your diet?",
            "I want to eat more fruits and vegetables, and cut down on processed foods and sugar",
            "Those are great changes. For exercise, what kind of activities do you like?",
            "I enjoy walking and swimming. What do you recommend?",
            "Those are great exercises. I recommend doing them regularly and gradually increasing the intensity or duration",
            "Thanks for your advice, Medi. What else can I do to improve my health?"
        ],
        "knowledge": "Healthy Lifestyle Healthy Lifestyle A healthy lifestyle involves making choices that promote physical, mental, and emotional well-being. This includes eating a balanced diet, getting regular exercise, getting enough sleep, reducing stress, avoiding smoking and excessive alcohol consumption, and staying socially connected. These choices can help prevent chronic diseases and improve overall quality of life. Healthy Lifestyle Healthy Lifestyle",
        "response": "You're welcome. Good luck on your journey to a healthier lifestyle!"
    },
    {
        "dialog": [
            "Hi Medi, I think I might have caught something from birds.",
            "Hi, I'm here to help. Can you tell me your symptoms?",
            "I have a cough and fever, and I feel very tired.",
            "Based on your symptoms, you may have contracted avian influenza.",
            "Is it serious?",
            "It can be. You should see a doctor as soon as possible.",
            "What can I do to prevent contracting it?",
            "Avoiding contact with birds is the best way to prevent it."
        ],
        "knowledge": "Influenza Influenza  Instead, most transmission involves domestic poultry, mainly chickens, ducks, and geese but also a variety of other birds such as guinea fowl, partridge, pheasants, and quails.  The primary risk factor for infection with AIVs is exposure to birds in farms and live poultry markets.  Typically, infection with an AIV has an incubation period of 3–5 days but can be up to 9 days.  H5N1 and H7N9 cause severe lower respiratory tract illness, whereas other AIVs such as H9N2 cause a more mild upper respiratory tract illness, commonly with conjunctivitis.  Limited transmission of avian H2, H5-7, H9, and H10 subtypes from one person to another through respiratory droplets, aerosols, and fomites has occurred, but sustained human-to-human transmission of AIVs has not occurred.  Before 2013, H5N1 was the most common AIV to infect humans.  Since then, H7N9 has been responsible for most human cases Influenza Influenza",
        "response": "Avoiding contact with birds is the best way to prevent contracting AIVs."
    },
    {
        "dialog": [
            "Hi Medi, can you explain to me what avian influenza is?",
            "Of course. Avian influenza is a type of influenza that primarily affects birds.",
            "Can humans get avian influenza?",
            "Yes, humans can contract avian influenza through contact with infected birds.",
            "Is it serious?",
            "It can be. Some strains, such as H5N1 and H7N9, can cause severe respiratory illness in humans.",
            "How is it transmitted?",
            "The primary risk factor for infection with AIVs is exposure to birds in farms and live poultry markets.",
            "Is there a cure?"
        ],
        "knowledge": "Influenza Influenza  Instead, most transmission involves domestic poultry, mainly chickens, ducks, and geese but also a variety of other birds such as guinea fowl, partridge, pheasants, and quails.  The primary risk factor for infection with AIVs is exposure to birds in farms and live poultry markets.  Typically, infection with an AIV has an incubation period of 3–5 days but can be up to 9 days.  H5N1 and H7N9 cause severe lower respiratory tract illness, whereas other AIVs such as H9N2 cause a more mild upper respiratory tract illness, commonly with conjunctivitis.  Limited transmission of avian H2, H5-7, H9, and H10 subtypes from one person to another through respiratory droplets, aerosols, and fomites has occurred, but sustained human-to-human transmission of AIVs has not occurred.  Before 2013, H5N1 was the most common AIV to infect humans.  Since then, H7N9 has been responsible for most human cases Influenza Influenza",
        "response": "Prevention is the best course of action, but treatment typically involves antiviral medication."
    },
    {
        "dialog": [
            "Hi Medi, I recently had a medical procedure done. Can you give me some advice on how to recover?",
            "Sure, what kind of procedure did you have?",
            "I had surgery to remove a cancerous tumor.",
            "I see. It's important to get plenty of rest and follow your doctor's instructions for aftercare.",
            "Is there anything specific I should be doing or avoiding?",
            "You should avoid strenuous activity and heavy lifting for a while, but light exercise can be beneficial.",
            "What about my diet?",
            "You should focus on a healthy, balanced diet with plenty of fruits and vegetables. Talk to your doctor or a dietitian for more specific recommendations.",
            "Thank you for your help, Medi."
        ],
        "knowledge": "Cancer Surgery  Recovery from surgery depends on the type of surgery, the individual's health condition, and the extent of surgery.  After surgery, it is important to follow instructions for aftercare, including rest, wound care, and physical activity.  Pain management is an important part of the postoperative period and may involve the use of medications, relaxation techniques, or other methods.  Light exercise can be beneficial during recovery, but strenuous activity and heavy lifting should be avoided.  A healthy, balanced diet with plenty of fruits and vegetables can also aid in recovery.  Talk to your doctor or a dietitian for more specific recommendations. Cancer Surgery",
        "response": "Thanks for your advice, Medi. I'll be sure to follow my doctor's instructions for aftercare."
    },
    {
        "dialog": [
            "Hi Medi, I'm feeling a bit sick.",
            "Hello. What symptoms are you experiencing?",
            "I have a fever and a cough.",
            "Have you been coughing up mucus?",
            "Yes, I have been coughing up yellow mucus.",
            "Based on your symptoms, it may be a respiratory infection.",
            "What should I do?",
            "Rest and drink plenty of fluids. If it gets worse, see a doctor.",
            "Okay, thank you Medi."
        ],
        "knowledge": "Influenza Influenza The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "You may have a respiratory infection. Rest and drink plenty of fluids. If it gets worse, see a doctor."
    },
    {
        "dialog": [
            "Hi, Medi. Can you explain what is H5N1?",
            "Certainly. H5N1 is a type of avian influenza virus.",
            "How is it spread?",
            "It is primarily spread through contact with infected birds.",
            "What are the symptoms of H5N1?",
            "H5N1 causes severe lower respiratory tract illness.",
            "Is it contagious between humans?",
            "Limited human-to-human transmission has occurred, but sustained transmission has not.",
            "I see. Is there a way to prevent it?"
        ],
        "knowledge": "Influenza Influenza Instead, most transmission involves domestic poultry, mainly chickens, ducks, and geese but also a variety of other birds such as guinea fowl, partridge, pheasants, and quails.  The primary risk factor for infection with AIVs is exposure to birds in farms and live poultry markets.  Typically, infection with an AIV has an incubation period of 3–5 days but can be up to 9 days.  H5N1 and H7N9 cause severe lower respiratory tract illness, whereas other AIVs such as H9N2 cause a more mild upper respiratory tract illness, commonly with conjunctivitis.  Limited transmission of avian H2, H5-7, H9, and H10 subtypes from one person to another through respiratory droplets, aerosols, and fomites has occurred, but sustained human-to-human transmission of AIVs has not occurred.  Before 2013, H5N1 was the most common AIV to infect humans.  Since then, H7N9 has been responsible for most human cases Influenza Influenza",
        "response": "H5N1 is primarily spread through contact with infected birds and causes severe lower respiratory tract illness. Avoid contact with infected birds and practice good hygiene to prevent it."
    },
    {
        "dialog": [
            "Hi Medi, I recently had a medical procedure. What should I do for recovery?",
            "What type of procedure did you have?",
            "I had surgery on my knee.",
            "For the first few days after surgery, rest and elevate your leg.",
            "What about exercise?",
            "Physical therapy is often recommended to help regain strength and mobility.",
            "What should I eat?",
            "A balanced diet with plenty of protein and nutrients can help with recovery.",
            "Thank you for your advice, Medi."
        ],
        "knowledge": "Influenza Influenza Instead, most transmission involves domestic poultry, mainly chickens, ducks, and geese but also a variety of other birds such as guinea fowl, partridge, pheasants, and quails.  The primary risk factor for infection with AIVs is exposure to birds in farms and live poultry markets.  Typically, infection with an AIV has an incubation period of 3–5 days but can be up to 9 days.  H5N1 and H7N9 cause severe lower respiratory tract illness, whereas other AIVs such as H9N2 cause a more mild upper respiratory tract illness, commonly with conjunctivitis.  Limited transmission of avian H2, H5-7, H9, and H10 subtypes from one person to another through respiratory droplets, aerosols, and fomites has occurred, but sustained human-to-human transmission of AIVs has not occurred.  Before 2013, H5N1 was the most common AIV to infect humans.  Since then, H7N9 has been responsible for most human cases Influenza Influenza",
        "response": "After surgery on your knee, rest and elevate your leg for the first few days. Physical therapy and a balanced diet can help with recovery."
    }
]