[
    {
        "dialog": [
            "Hello Medi, I'm feeling very sick and I don't know what to do.",
            "Hi there, I can help you. Can you tell me what symptoms you are experiencing?",
            "I have a fever, coughing, and I feel very tired.",
            "Based on your symptoms, it is possible that you may have the flu. Have you been around anyone with the flu?",
            "Yes, I was in close contact with someone who had the flu.",
            "It's likely that you have contracted the flu virus. My advice is for you to rest and drink plenty of fluids.",
            "What else can I do to help relieve my symptoms?",
            "I recommend taking over-the-counter fever reducers like acetaminophen or ibuprofen and using a humidifier to help with your coughing.",
            "Thank you, Medi. How long will it take for me to feel better?"
        ],
        "knowledge": "Influenza Influenza Influenza in pigs is a respiratory disease similar to influenza in humans and is found worldwide. Asymptomatic infections are common. Symptoms typically appear 1–3 days after infection and include fever, lethargy, anorexia, weight loss, labored breathing, coughing, sneezing, and nasal discharge. In sows, pregnancy may be aborted. Complications include secondary infections and potentially fatal bronchopneumonia. Pigs become contagious within a day of infection and typically spread the virus for 7–10 days, which can spread rapidly within a herd. Pigs usually recover from infection within 3–7 days after symptoms appear Influenza Influenza",
        "response": "It usually takes about a week for symptoms to improve, but it may take longer for some people."
    },
    {
        "dialog": [
            "Hi there, Medi. I have a question about the flu.",
            "Sure, what would you like to know?",
            "How is the flu different from a cold?",
            "The flu and the common cold are both respiratory illnesses caused by different viruses. The flu tends to be more severe and can lead to complications like pneumonia, while colds are usually milder and do not lead to serious health problems.",
            "Thank you for explaining that. Is there a way to prevent getting the flu?",
            "Yes, the best way to prevent getting the flu is to get a flu vaccine every year and to practice good hygiene like washing your hands frequently and avoiding close contact with sick people.",
            "I see. What should I do if I think I have the flu?",
            "If you think you have the flu, it's important to rest and stay hydrated. You can also take over-the-counter fever reducers like acetaminophen or ibuprofen to help with your symptoms. If your symptoms are severe, it's a good idea to see a doctor.",
            "Thank you, Medi. That was very helpful."
        ],
        "knowledge": "Influenza Influenza Influenza in pigs is a respiratory disease similar to influenza in humans and is found worldwide. Asymptomatic infections are common. Symptoms typically appear 1–3 days after infection and include fever, lethargy, anorexia, weight loss, labored breathing, coughing, sneezing, and nasal discharge. In sows, pregnancy may be aborted. Complications include secondary infections and potentially fatal bronchopneumonia. Pigs become contagious within a day of infection and typically spread the virus for 7–10 days, which can spread rapidly within a herd. Pigs usually recover from infection within 3–7 days after symptoms appear Influenza Influenza",
        "response": "No, that's all for now. Thank you for answering my questions."
    },
    {
        "dialog": [
            "Hi, Medi. I just recovered from the flu. What can I do to strengthen my immune system and prevent getting sick again?",
            "Hi there, it's great to hear that you have recovered from the flu. You can strengthen your immune system by eating a balanced diet, exercising regularly, getting enough sleep, and reducing stress.",
            "I see. Can you give me some examples of foods that can boost my immune system?",
            "Sure, some foods that can boost your immune system include citrus fruits, garlic, ginger, yogurt, and green vegetables.",
            "Thank you, Medi. What about vitamins?",
            "Vitamins like vitamin C, vitamin D, and zinc can also help boost your immune system. It's a good idea to talk to your doctor about which supplements might be right for you.",
            "Okay, I will do that. What else can I do to prevent getting sick?",
            "In addition to eating a healthy diet and exercising, it's important to practice good hygiene like washing your hands frequently and avoiding close contact with sick people.",
            "Thank you, Medi. That was very helpful."
        ],
        "knowledge": "Influenza Influenza Influenza in pigs is a respiratory disease similar to influenza in humans and is found worldwide. Asymptomatic infections are common. Symptoms typically appear 1–3 days after infection and include fever, lethargy, anorexia, weight loss, labored breathing, coughing, sneezing, and nasal discharge. In sows, pregnancy may be aborted. Complications include secondary infections and potentially fatal bronchopneumonia. Pigs become contagious within a day of infection and typically spread the virus for 7–10 days, which can spread rapidly within a herd. Pigs usually recover from infection within 3–7 days after symptoms appear Influenza Influenza",
        "response": "No, that's all for now. Thank you for the helpful advice!"
    },
    {
        "dialog": [
            "Hello Medi, I have a sore throat and a runny nose.",
            "Hi, please tell me more about your condition?",
            "I have been feeling like this since yesterday. I also have a mild fever.",
            "Do you have any coughing or breathing difficulty?",
            "No, I only have a sore throat and a runny nose.",
            "Based on your symptoms, it could be a mild flu. You should take rest and drink plenty of fluids.",
            "Should I go to the hospital?",
            "No, but if your condition worsens, you should visit a doctor.",
            "I understand, thank you."
        ],
        "knowledge": "Influenza Influenza in pigs is a respiratory disease similar to influenza in humans and is found worldwide. Asymptomatic infections are common. Symptoms typically appear 1–3 days after infection and include fever, lethargy, anorexia, weight loss, labored breathing, coughing, sneezing, and nasal discharge. In sows, pregnancy may be aborted. Complications include secondary infections and potentially fatal bronchopneumonia. Pigs become contagious within a day of infection and typically spread the virus for 7–10 days, which can spread rapidly within a herd. Pigs usually recover from infection within 3–7 days after symptoms appear.",
        "response": "Based on your symptoms, it could be a mild flu. You should take rest and drink plenty of fluids."
    },
    {
        "dialog": [
            "Hello Medi, I have a question about Influenza in pigs.",
            "Sure, what do you want to know?",
            "How dangerous is Influenza in pigs to humans?",
            "Pigs can transmit the virus to humans, but the risk is low. However, it is important to take precautions around sick pigs.",
            "What are the precautions that I should take?",
            "Avoid contact with sick pigs, wear protective clothing when handling pigs and wash your hands frequently.",
            "Thank you, Medi. Can humans transmit the virus to pigs?",
            "Yes, humans can also transmit the virus to pigs.",
            "I see. Thank you for the information."
        ],
        "knowledge": "Influenza Influenza in pigs is a respiratory disease similar to influenza in humans and is found worldwide. Asymptomatic infections are common. Symptoms typically appear 1–3 days after infection and include fever, lethargy, anorexia, weight loss, labored breathing, coughing, sneezing, and nasal discharge. In sows, pregnancy may be aborted. Complications include secondary infections and potentially fatal bronchopneumonia. Pigs become contagious within a day of infection and typically spread the virus for 7–10 days, which can spread rapidly within a herd. Pigs usually recover from infection within 3–7 days after symptoms appear.",
        "response": "Pigs can transmit the virus to humans, but the risk is low. However, it is important to take precautions around sick pigs. People should avoid contact with sick pigs, wear protective clothing when handling pigs and wash your hands frequently."
    },
    {
        "dialog": [
            "Hello Medi, I just recovered from Influenza in pigs.",
            "That's good to hear. Do you have any questions or concerns?",
            "Yes, what should I eat to help me recover faster?",
            "You should eat foods that are high in protein and antioxidants such as fruits, vegetables, lean meats, and nuts.",
            "What about physical activity?",
            "You should start with light exercise and gradually increase the intensity as you feel better.",
            "How long will it take for me to fully recover?",
            "It usually takes about 7-10 days for pigs to recover from influenza. However, the recovery time for humans can vary depending on their age and overall health.",
            "Thank you, Medi. I will keep that in mind."
        ],
        "knowledge": "Influenza Influenza in pigs is a respiratory disease similar to influenza in humans and is found worldwide. Asymptomatic infections are common. Symptoms typically appear 1–3 days after infection and include fever, lethargy, anorexia, weight loss, labored breathing, coughing, sneezing, and nasal discharge. In sows, pregnancy may be aborted. Complications include secondary infections and potentially fatal bronchopneumonia. Pigs become contagious within a day of infection and typically spread the virus for 7–10 days, which can spread rapidly within a herd. Pigs usually recover from infection within 3–7 days after symptoms appear.",
        "response": "It usually takes about 7-10 days for pigs to recover from influenza. However, the recovery time for humans can vary depending on their age and overall health."
    },
    {
        "dialog": [
            "Hi Medi, I have some symptoms and I'm not feeling well",
            "Hi there, can you tell me about your symptoms?",
            "Yes, I have a fever, coughing, and nasal discharge",
            "Based on your symptoms, it looks like you have influenza.",
            "Is there anything I can do to feel better?",
            "You can get plenty of rest, drink fluids, and take over-the-counter medications for fever and cough.",
            "How long will it take for me to recover?",
            "Most people recover from influenza within 3-7 days after symptoms appear.",
            "Thank you for your help!"
        ],
        "knowledge": "Influenza Influenza in pigs is a respiratory disease similar to influenza in humans and is found worldwide. Asymptomatic infections are common. Symptoms typically appear 1–3 days after infection and include fever, lethargy, anorexia, weight loss, labored breathing, coughing, sneezing, and nasal discharge. In sows, pregnancy may be aborted. Complications include secondary infections and potentially fatal bronchopneumonia. Pigs become contagious within a day of infection and typically spread the virus for 7–10 days, which can spread rapidly within a herd. Pigs usually recover from infection within 3–7 days after symptoms appear Influenza Influenza",
        "response": "You're welcome. I'm glad I could help. Do you have any other questions?"
    },
    {
        "dialog": [
            "Hello Medi, can you tell me more about the symptoms of influenza?",
            "Of course, the symptoms of influenza include fever, coughing, sore throat, nasal discharge, body aches, and fatigue.",
            "Can influenza be fatal?",
            "Yes, influenza can lead to severe complications such as pneumonia and bronchitis which can be fatal, especially in the elderly or people with weakened immune systems.",
            "How can I prevent getting influenza?",
            "You can prevent influenza by getting vaccinated annually, washing your hands regularly, avoiding close contact with sick people, and staying home when you're sick.",
            "Thank you for the information. I'll make sure to take precautions.",
            "You're welcome. Do you have any other questions?",
            "No, that's all for now. Thank you!"
        ],
        "knowledge": "Influenza Influenza in pigs is a respiratory disease similar to influenza in humans and is found worldwide. Asymptomatic infections are common. Symptoms typically appear 1–3 days after infection and include fever, lethargy, anorexia, weight loss, labored breathing, coughing, sneezing, and nasal discharge. In sows, pregnancy may be aborted. Complications include secondary infections and potentially fatal bronchopneumonia. Pigs become contagious within a day of infection and typically spread the virus for 7–10 days, which can spread rapidly within a herd. Pigs usually recover from infection within 3–7 days after symptoms appear Influenza Influenza",
        "response": "You're welcome. Stay safe and healthy!"
    },
    {
        "dialog": [
            "Hi Medi, I just recovered from influenza. What should I do to prevent getting it again?",
            "Congratulations on your recovery! To prevent getting influenza again, you should get vaccinated annually, wash your hands regularly, avoid close contact with sick people, and stay home when you're sick.",
            "Is there anything else I can do?",
            "Yes, you can also boost your immune system by eating a healthy diet, getting regular exercise, and getting enough sleep.",
            "Thank you! Do you have any suggestions for a healthy diet?",
            "A healthy diet should include plenty of fruits, vegetables, whole grains, lean protein, and healthy fats. You should also limit your intake of processed foods, sugary drinks, and saturated fats.",
            "Got it. Thank you for the advice!",
            "You're welcome. Do you have any other questions?",
            "No, that's all for now. Thanks again!"
        ],
        "knowledge": "Influenza Influenza in pigs is a respiratory disease similar to influenza in humans and is found worldwide. Asymptomatic infections are common. Symptoms typically appear 1–3 days after infection and include fever, lethargy, anorexia, weight loss, labored breathing, coughing, sneezing, and nasal discharge. In sows, pregnancy may be aborted. Complications include secondary infections and potentially fatal bronchopneumonia. Pigs become contagious within a day of infection and typically spread the virus for 7–10 days, which can spread rapidly within a herd. Pigs usually recover from infection within 3–7 days after symptoms appear Influenza Influenza",
        "response": "You're welcome. Take care of yourself and stay healthy!"
    },
    {
        "dialog": [
            "Hello Medi, I'm experiencing some respiratory issues.",
            "Sure, can you tell me more about your symptoms?",
            "I have a cough, fever, and shortness of breath.",
            "I see. You may have contracted Influenza in pigs. It is a respiratory disease that commonly affects humans.",
            "What should I do now?",
            "You should see a doctor immediately to confirm the diagnosis and start treatment.",
            "Okay, thank you for your help.",
            "You're welcome. I hope you feel better soon.",
            "What are the common symptoms for Influenza in pigs?"
        ],
        "knowledge": "Influenza Influenza Influenza in pigs is a respiratory disease similar to influenza in humans and is found worldwide.  Asymptomatic infections are common.  Symptoms typically appear 1–3 days after infection and include fever, lethargy, anorexia, weight loss, labored breathing, coughing, sneezing, and nasal discharge.  In sows, pregnancy may be aborted.  Complications include secondary infections and potentially fatal bronchopneumonia.  Pigs become contagious within a day of infection and typically spread the virus for 7–10 days, which can spread rapidly within a herd.  Pigs usually recover from infection within 3–7 days after symptoms appear Influenza Influenza",
        "response": "The common symptoms for Influenza in pigs are fever, lethargy, anorexia, weight loss, labored breathing, coughing, sneezing, and nasal discharge."
    },
    {
        "dialog": [
            "Hi, Medi. I want to know more about Influenza in pigs.",
            "Okay, what do you want to know?",
            "Can Influenza in pigs be transmitted to humans?",
            "Yes, it can. Influenza in pigs is a zoonotic disease that can be transmitted from pigs to humans.",
            "How does it spread?",
            "It spreads through contact with infected pigs, their respiratory secretions, or contaminated objects.",
            "Is it serious for humans?",
            "Yes, it can be serious. Influenza in pigs can cause a range of symptoms, from mild to severe, and can even lead to death in rare cases.",
            "What can we do to prevent it?"
        ],
        "knowledge": "Influenza Influenza Influenza in pigs is a respiratory disease similar to influenza in humans and is found worldwide.  Asymptomatic infections are common.  Symptoms typically appear 1–3 days after infection and include fever, lethargy, anorexia, weight loss, labored breathing, coughing, sneezing, and nasal discharge.  In sows, pregnancy may be aborted.  Complications include secondary infections and potentially fatal bronchopneumonia.  Pigs become contagious within a day of infection and typically spread the virus for 7–10 days, which can spread rapidly within a herd.  Pigs usually recover from infection within 3–7 days after symptoms appear Influenza Influenza",
        "response": "To prevent Influenza in pigs, it is important to practice good hygiene, avoid contact with sick pigs, and get vaccinated if you work with pigs or live in an area where the virus is common."
    },
    {
        "dialog": [
            "Hey Medi, I just recovered from Influenza in pigs. What should I do now?",
            "Congratulations on your recovery. You should still take care of your health.",
            "What do you mean?",
            "You may still be contagious for several days after your symptoms disappear, so you should avoid contact with other people and animals.",
            "What about my diet?",
            "You should eat a healthy and balanced diet to help your body recover from the illness.",
            "Can I exercise?",
            "You can, but start slowly and gradually increase the intensity of your exercise. Listen to your body and stop if you feel any discomfort.",
            "What are the potential complications of Influenza in pigs?"
        ],
        "knowledge": "Influenza Influenza Influenza in pigs is a respiratory disease similar to influenza in humans and is found worldwide.  Asymptomatic infections are common.  Symptoms typically appear 1–3 days after infection and include fever, lethargy, anorexia, weight loss, labored breathing, coughing, sneezing, and nasal discharge.  In sows, pregnancy may be aborted.  Complications include secondary infections and potentially fatal bronchopneumonia.  Pigs become contagious within a day of infection and typically spread the virus for 7–10 days, which can spread rapidly within a herd.  Pigs usually recover from infection within 3–7 days after symptoms appear Influenza Influenza",
        "response": "The potential complications of Influenza in pigs include secondary infections and potentially fatal bronchopneumonia."
    },
    {
        "dialog": [
            "Hi Medi, I'm experiencing some respiratory problems.",
            "Hello! Can you describe your symptoms in detail?",
            "I have fever, cough, and feel fatigue all the time.",
            "Based on your symptoms, it seems like you may have influenza. You should rest and drink plenty of fluids.",
            "Is there any medication that can help treat my symptoms?",
            "Yes, antiviral medication can be effective in treating influenza. You should consult with a doctor for a prescription.",
            "Thank you, Medi. How long does it usually take to recover from influenza?",
            "Symptoms usually last 3-7 days, but it may take up to two weeks to fully recover.",
            "Okay, thank you for your help!"
        ],
        "knowledge": "Influenza Influenza Influenza in pigs is a respiratory disease similar to influenza in humans and is found worldwide.  Asymptomatic infections are common.  Symptoms typically appear 1–3 days after infection and include fever, lethargy, anorexia, weight loss, labored breathing, coughing, sneezing, and nasal discharge.  In sows, pregnancy may be aborted.  Complications include secondary infections and potentially fatal bronchopneumonia.  Pigs become contagious within a day of infection and typically spread the virus for 7–10 days, which can spread rapidly within a herd.  Pigs usually recover from infection within 3–7 days after symptoms appear Influenza Influenza",
        "response": "You're welcome! Take care of yourself and rest well."
    },
    {
        "dialog": [
            "Hi Medi, I have some questions about influenza.",
            "Sure, I'm here to help! What would you like to know?",
            "What is the difference between influenza and a common cold?",
            "Influenza is caused by a different virus than the common cold. It tends to be more severe and has a quicker onset of symptoms.",
            "What are some common symptoms of influenza?",
            "Fever, cough, sore throat, runny or stuffy nose, body aches, headache, chills, and fatigue are all common symptoms of influenza.",
            "Can you get influenza more than once?",
            "Yes, it is possible to get influenza more than once. The virus mutates, which means that your body may not recognize it if you are infected with a different strain.",
            "Thanks Medi! How can I prevent getting influenza?"
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "No problem! Don't hesitate to ask if you have any other questions."
    },
    {
        "dialog": [
            "Hi Medi, I recently recovered from influenza and wanted to know how I can prevent getting it again.",
            "Hi! The best way to prevent getting influenza again is to get vaccinated every year.",
            "What does the vaccine contain?",
            "The vaccine contains pieces of the virus that your body can build immunity against.",
            "Are there any side effects of getting vaccinated?",
            "Some people may experience mild side effects such as soreness, redness, or swelling at the injection site, fever, and body aches.",
            "When is the best time to get vaccinated?",
            "Influenza season typically runs from October to May, so it's best to get vaccinated in September or October before the season begins.",
            "Great, thank you for the information! Are there any other ways to prevent getting influenza?"
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "You're welcome! Stay healthy and take care."
    },
    {
        "dialog": [
            "Hello Medi, I am feeling very unwell",
            "Hi! Can you tell me what symptoms you are experiencing?",
            "I have been feeling feverish, coughing a lot, and have a runny nose",
            "It seems like you might have Influenza",
            "What should I do next?",
            "I recommend you rest and take some over the counter medication to alleviate the symptoms.",
            "Thank you, I will do that",
            "You're welcome. If your condition doesn't improve in the next few days, you should see a doctor",
            "Okay, thank you for your advice"
        ],
        "knowledge": "Influenza Influenza Influenza in pigs is a respiratory disease similar to influenza in humans and is found worldwide. Asymptomatic infections are common. Symptoms typically appear 1–3 days after infection and include fever, lethargy, anorexia, weight loss, labored breathing, coughing, sneezing, and nasal discharge. In sows, pregnancy may be aborted. Complications include secondary infections and potentially fatal bronchopneumonia. Pigs become contagious within a day of infection and typically spread the virus for 7–10 days, which can spread rapidly within a herd. Pigs usually recover from infection within 3–7 days after symptoms appear Influenza Influenza",
        "response": "You're welcome. Stay hydrated and rest. If it doesn't go away in a few days, you'll need to see a doctor."
    },
    {
        "dialog": [
            "Medi, I am curious about Influenza in pigs",
            "What would you like to know?",
            "Can humans get infected with Influenza from pigs?",
            "Yes, humans can get infected by the Influenza virus from pigs. It's called swine flu.",
            "What are the symptoms of swine flu?",
            "The symptoms are similar to the regular flu, such as fever, cough, sore throat, body aches, headache, chills and fatigue",
            "How can I prevent from getting infected?",
            "One of the best ways to prevent getting infected is to get a flu vaccine. Also, if you're around pigs, wash your hands regularly and avoid touching your face.",
            "Thank you for the information"
        ],
        "knowledge": "Influenza Influenza Influenza in pigs is a respiratory disease similar to influenza in humans and is found worldwide. Asymptomatic infections are common. Symptoms typically appear 1–3 days after infection and include fever, lethargy, anorexia, weight loss, labored breathing, coughing, sneezing, and nasal discharge. In sows, pregnancy may be aborted. Complications include secondary infections and potentially fatal bronchopneumonia. Pigs become contagious within a day of infection and typically spread the virus for 7–10 days, which can spread rapidly within a herd. Pigs usually recover from infection within 3–7 days after symptoms appear Influenza Influenza",
        "response": "You're welcome. Stay informed and be aware of the risks to prevent getting infected"
    },
    {
        "dialog": [
            "Hello Medi, I recently had Influenza and I am feeling better now",
            "Glad to hear that! How are you feeling now?",
            "I am feeling better now but I am still weak and tired",
            "It's common to feel weak and tired after having the flu. You should take some rest and eat healthy food to regain your strength",
            "What kind of food should I eat?",
            "You should eat food that contains vitamins and minerals, such as fruits, vegetables, whole grains, lean protein, and low-fat dairy products",
            "Are there any exercises that I can do to regain my energy?",
            "Yes, you can try light exercises like walking, stretching, or yoga to regain your energy. But you should consult with your doctor before starting any physical activity as it may harm you",
            "Thank you for your advice"
        ],
        "knowledge": "Influenza Influenza Influenza in pigs is a respiratory disease similar to influenza in humans and is found worldwide. Asymptomatic infections are common. Symptoms typically appear 1–3 days after infection and include fever, lethargy, anorexia, weight loss, labored breathing, coughing, sneezing, and nasal discharge. In sows, pregnancy may be aborted. Complications include secondary infections and potentially fatal bronchopneumonia. Pigs become contagious within a day of infection and typically spread the virus for 7–10 days, which can spread rapidly within a herd. Pigs usually recover from infection within 3–7 days after symptoms appear Influenza Influenza",
        "response": "You're welcome. Take it easy and give your body time to recover fully"
    },
    {
        "dialog": [
            "Hi Medi, I'm not feeling well and I need your help.",
            "Sure, I'm here to help you. What symptoms are you experiencing?",
            "I'm feeling very weak, have a fever and a cough.",
            "Those symptoms could be due to a respiratory infection, have you been around anyone who is sick?",
            "No, I haven't been around anyone sick. What should I do?",
            "The first step is to rest and stay hydrated. You should also avoid contact with others to prevent the spread of infection.",
            "Okay, thank you for your help. Do you have any other advice?",
            "Yes, if your symptoms do not improve or get worse, seek medical attention immediately.",
            "Alright, I will. Thank you again, Medi."
        ],
        "knowledge": "Influenza Influenza in pigs is a respiratory disease similar to influenza in humans and is found worldwide.  Asymptomatic infections are common.  Symptoms typically appear 1–3 days after infection and include fever, lethargy, anorexia, weight loss, labored breathing, coughing, sneezing, and nasal discharge.  In sows, pregnancy may be aborted.  Complications include secondary infections and potentially fatal bronchopneumonia.  Pigs become contagious within a day of infection and typically spread the virus for 7–10 days, which can spread rapidly within a herd.  Pigs usually recover from infection within 3–7 days after symptoms appear Influenza Influenza",
        "response": "You may have a respiratory infection, it's best to rest and stay hydrated. If symptoms worsen, seek medical attention."
    },
    {
        "dialog": [
            "Hi Medi, I have some questions about the flu. ",
            "Of course, I'm here to help. What would you like to know?",
            "What causes the flu, and how can I prevent it?",
            "The flu is caused by the influenza virus. To prevent it, you should get the flu vaccine each year and practice good hygiene such as washing your hands frequently and avoiding contact with sick individuals.",
            "What are the symptoms of the flu?",
            "Symptoms of the flu include fever, cough, sore throat, runny or stuffy nose, body aches, headache, chills, and fatigue.",
            "What should I do if I think I have the flu?",
            "If you think you have the flu, stay home and rest. You should also drink plenty of fluids and take over-the-counter medications to relieve symptoms.",
            "Thanks for your help, Medi. I appreciate it."
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "The flu is caused by the influenza virus. To prevent it, get the flu vaccine each year and practice good hygiene. Symptoms include fever, cough, sore throat, runny or stuffy nose, body aches, headache, chills, and fatigue. If you think you have the flu, stay home and rest. Drink plenty of fluids and take over-the-counter medications to relieve symptoms."
    },
    {
        "dialog": [
            "Hi Medi, I just recovered from the flu and I'm wondering if there are any lifestyle changes I should make to prevent getting it again.",
            "To reduce your risk of getting the flu again, you should wash your hands frequently, avoid contact with sick individuals, and maintain a healthy lifestyle with a balanced diet, regular exercise, and adequate sleep.",
            "Is there anything else I can do to boost my immune system and prevent getting sick?",
            "Yes, you can also take dietary supplements such as Vitamin C and probiotics which can help boost your immune system.",
            "Thanks for your help, Medi. I'll make sure to follow your advice.",
            "You're welcome. Remember to stay healthy and take care of yourself!",
            "I will, thank you again!"
        ],
        "knowledge": "Influenza Influenza in pigs is a respiratory disease similar to influenza in humans and is found worldwide.  Asymptomatic infections are common.  Symptoms typically appear 1–3 days after infection and include fever, lethargy, anorexia, weight loss, labored breathing, coughing, sneezing, and nasal discharge.  In sows, pregnancy may be aborted.  Complications include secondary infections and potentially fatal bronchopneumonia.  Pigs become contagious within a day of infection and typically spread the virus for 7–10 days, which can spread rapidly within a herd.  Pigs usually recover from infection within 3–7 days after symptoms appear Influenza Influenza",
        "response": "To reduce your risk of getting the flu again, wash your hands frequently, avoid contact with sick individuals, and maintain a healthy lifestyle with a balanced diet, regular exercise, and adequate sleep. You can also take dietary supplements such as Vitamin C and probiotics to boost your immune system."
    },
    {
        "dialog": [
            "Hi Medi, I've been coughing and feeling feverish lately.",
            "Sorry to hear that. Can you describe your symptoms in detail?",
            "I have a cough, fever, and body aches. My throat also feels sore.",
            "Based on the symptoms you've described, it's possible that you have Influenza.",
            "What should I do if I have Influenza?",
            "You should rest, drink plenty of fluids, and take over-the-counter medication to relieve body aches and fever.",
            "Thanks for your advice, Medi. How long does it usually take to recover from Influenza?",
            "Most people recover from Influenza within 3-7 days after symptoms appear.",
            "Okay, thanks for the information."
        ],
        "knowledge": "Influenza Influenza Influenza in pigs is a respiratory disease similar to influenza in humans and is found worldwide.  Asymptomatic infections are common.  Symptoms typically appear 1–3 days after infection and include fever, lethargy, anorexia, weight loss, labored breathing, coughing, sneezing, and nasal discharge.  In sows, pregnancy may be aborted.  Complications include secondary infections and potentially fatal bronchopneumonia.  Pigs become contagious within a day of infection and typically spread the virus for 7–10 days, which can spread rapidly within a herd.  Pigs usually recover from infection within 3–7 days after symptoms appear Influenza Influenza",
        "response": "You're welcome. If you have any other questions, let me know."
    },
    {
        "dialog": [
            "Hello Medi, can you explain what Influenza is?",
            "Sure. Influenza is a respiratory disease that is caused by a virus. It is similar to the common cold, but it can be more severe.",
            "What are the symptoms of Influenza?",
            "The symptoms of Influenza include fever, cough, sore throat, runny or stuffy nose, body aches, headaches, chills, and fatigue.",
            "How is Influenza spread?",
            "Influenza is spread through respiratory droplets when an infected person coughs or sneezes. It can also be spread by touching a surface that has the virus on it and then touching your mouth, nose, or eyes.",
            "How can I prevent getting Influenza?",
            "The best way to prevent Influenza is to get vaccinated every year, wash your hands frequently, avoid close contact with sick people, and cover your mouth and nose when coughing or sneezing.",
            "Thank you, Medi. Can you tell me how long the Influenza vaccine lasts?"
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "You're welcome. If you have any other questions, let me know."
    },
    {
        "dialog": [
            "Hi Medi, I just underwent surgery. Can you give me advice on how to maintain a healthy lifestyle?",
            "Of course. After surgery, it's important to get plenty of rest, eat a healthy and balanced diet, and stay active.",
            "What kind of physical activity can I do after surgery?",
            "You should start with light physical activity, such as walking, and gradually increase the intensity as you recover.",
            "What kind of food should I eat after surgery?",
            "You should eat nutrient-rich foods that are high in protein, such as lean meats, fish, beans, and tofu. You should also eat fruits, vegetables, and whole grains for fiber and other essential nutrients.",
            "Are there any foods I should avoid?",
            "You should avoid processed foods, sugary drinks, and foods that are high in saturated and trans fats. You should also limit your intake of sodium and alcohol.",
            "Thank you for the advice, Medi. How long should I wait before returning to normal activities?"
        ],
        "knowledge": "Influenza Influenza Influenza in pigs is a respiratory disease similar to influenza in humans and is found worldwide.  Asymptomatic infections are common.  Symptoms typically appear 1–3 days after infection and include fever, lethargy, anorexia, weight loss, labored breathing, coughing, sneezing, and nasal discharge.  In sows, pregnancy may be aborted.  Complications include secondary infections and potentially fatal bronchopneumonia.  Pigs become contagious within a day of infection and typically spread the virus for 7–10 days, which can spread rapidly within a herd.  Pigs usually recover from infection within 3–7 days after symptoms appear Influenza Influenza",
        "response": "You're welcome. If you have any other questions, let me know."
    },
    {
        "dialog": [
            "Hi Medi, I think I'm having flu symptoms",
            "Hi, sorry to hear that. Can you please describe your symptoms?",
            "I have fever, cough, and runny nose",
            "Based on your symptoms, you might have influenza. Drink more fluids and take rest. If there is no improvement after 2-3 days, consider seeing a doctor",
            "Thank you, Medi. Can you suggest any home remedies for my flu?",
            "Sure! Try having hot tea and chicken soup to ease your throat and nasal passage. Gargling with salt water and using a humidifier can also help",
            "Okay, I'll try those remedies. What else can I do to prevent spreading it?",
            "Cover your mouth when coughing or sneezing, wash your hands frequently, use tissues and dispose them off properly",
            "That's helpful, thanks Medi!"
        ],
        "knowledge": "Influenza Influenza in pigs is a respiratory disease similar to influenza in humans and is found worldwide.  Asymptomatic infections are common.  Symptoms typically appear 1–3 days after infection and include fever, lethargy, anorexia, weight loss, labored breathing, coughing, sneezing, and nasal discharge.  In sows, pregnancy may be aborted.  Complications include secondary infections and potentially fatal bronchopneumonia.  Pigs become contagious within a day of infection and typically spread the virus for 7–10 days, which can spread rapidly within a herd.  Pigs usually recover from infection within 3–7 days after symptoms appear Influenza Influenza",
        "response": "You're welcome. I hope you feel better soon!"
    },
    {
        "dialog": [
            "Hi Medi, I've been having some breathing problems lately",
            "Hello, I'm sorry to hear that. Can you tell me more about the problem?",
            "I feel shortness of breath and coughing often",
            "Based on your symptoms, you might be suffering from bronchopneumonia. Do you have a history of lung disease or smoking?",
            "No, I don't have any history of lung disease or smoking",
            "Okay, try to avoid smoke and dust, and take enough rest. You may also want to consider seeing a doctor",
            "Is there any exercise I can do to ease my breathing?",
            "Yes, walking and swimming are good exercises for people with breathing problems. Consult with your doctor before starting any exercise routine",
            "Alright, I'll try that. Thanks for your advice, Medi"
        ],
        "knowledge": "Influenza Influenza in pigs is a respiratory disease similar to influenza in humans and is found worldwide.  Asymptomatic infections are common.  Symptoms typically appear 1–3 days after infection and include fever, lethargy, anorexia, weight loss, labored breathing, coughing, sneezing, and nasal discharge.  In sows, pregnancy may be aborted.  Complications include secondary infections and potentially fatal bronchopneumonia.  Pigs become contagious within a day of infection and typically spread the virus for 7–10 days, which can spread rapidly within a herd.  Pigs usually recover from infection within 3–7 days after symptoms appear Influenza Influenza",
        "response": "You're welcome. I hope it helps and you feel better soon!"
    },
    {
        "dialog": [
            "Hi Medi, I recently had a cold and I'm not sure what to eat",
            "Hi! You need to eat healthy foods to regain your strength. What food do you like?",
            "I really love junk food like burgers and pizzas",
            "I'm sorry to say that junk food is not good for you. You should eat more fruits and vegetables, and drink plenty of fluids.",
            "But can't I eat anything unhealthy?",
            "Yes, you can eat small amounts of unhealthy food as a treat, but it shouldn't be a main part of your diet",
            "I see. What are some examples of healthy foods that can help me recover faster?",
            "You can have more soups, whole grains, lean proteins, and natural sweeteners like honey",
            "Okay, thank you for your advice, Medi."
        ],
        "knowledge": "Influenza Influenza in pigs is a respiratory disease similar to influenza in humans and is found worldwide.  Asymptomatic infections are common.  Symptoms typically appear 1–3 days after infection and include fever, lethargy, anorexia, weight loss, labored breathing, coughing, sneezing, and nasal discharge.  In sows, pregnancy may be aborted.  Complications include secondary infections and potentially fatal bronchopneumonia.  Pigs become contagious within a day of infection and typically spread the virus for 7–10 days, which can spread rapidly within a herd.  Pigs usually recover from infection within 3–7 days after symptoms appear Influenza Influenza",
        "response": "You're welcome. Take care and feel better soon!"
    }
]