[
    {
        "dialog": [
            "Hi Medi, I've been experiencing chest pain.",
            "I'm sorry to hear that. Can you describe your pain further?",
            "It's a sharp pain that comes and goes. I also feel shortness of breath.",
            "Based on your symptoms, it's possible that you are experiencing angina. I suggest you see a doctor immediately.",
            "Is angina a serious condition?",
            "Yes, it is a sign of underlying heart disease and can lead to a heart attack if left untreated.",
            "What can I do to prevent heart disease?",
            "You can start by eating a healthy diet, exercising regularly, and avoiding smoking. Regular check-ups with your doctor can also help detect any potential issues early on.",
            "Thank you for your advice, Medi."
        ],
        "knowledge": "Cardiovascular disease Cardiovascular disease  Together CVD resulted in 17. 9 million deaths  in 2015, up from 12. 3 million  in 1990.  Deaths, at a given age, from CVD are more common and have been increasing in much of the developing world, while rates have declined in most of the developed world since the 1970s.  Coronary artery disease and stroke account for 80% of CVD deaths in males and 75% of CVD deaths in females.  Most cardiovascular disease affects older adults.  In the United States 11% of people between 20 and 40 have CVD, while 37% between 40 and 60, 71% of people between 60 and 80, and 85% of people over 80 have CVD Cardiovascular disease Cardiovascular disease",
        "response": "You're welcome. Do you have any other questions about heart disease?"
    },
    {
        "dialog": [
            "Hi Medi, can you explain what cardiovascular disease is?",
            "Of course, cardiovascular disease refers to any disorder that affects the heart or blood vessels. It can range from conditions like high blood pressure to more serious issues like heart attacks.",
            "How common is cardiovascular disease?",
            "It's actually very common, with millions of deaths every year worldwide. In the United States, it affects a large percentage of the population over the age of 40.",
            "What are some common risk factors for cardiovascular disease?",
            "Some common risk factors include high blood pressure, high cholesterol, smoking, obesity, and a sedentary lifestyle. Genetics can also play a role.",
            "Can cardiovascular disease be prevented?",
            "Yes, it can be prevented or managed through a healthy lifestyle, regular exercise, and medication if necessary. It's also important to get regular check-ups with your doctor.",
            "Thank you for explaining, Medi."
        ],
        "knowledge": "Cardiovascular disease Cardiovascular disease  Together CVD resulted in 17. 9 million deaths  in 2015, up from 12. 3 million  in 1990.  Deaths, at a given age, from CVD are more common and have been increasing in much of the developing world, while rates have declined in most of the developed world since the 1970s.  Coronary artery disease and stroke account for 80% of CVD deaths in males and 75% of CVD deaths in females.  Most cardiovascular disease affects older adults.  In the United States 11% of people between 20 and 40 have CVD, while 37% between 40 and 60, 71% of people between 60 and 80, and 85% of people over 80 have CVD Cardiovascular disease Cardiovascular disease",
        "response": "You're welcome. Do you have any other questions about cardiovascular disease?"
    },
    {
        "dialog": [
            "Hi Medi, I just had heart surgery. What should I do now?",
            "Congratulations on completing your surgery. It's important to follow your doctor's instructions carefully, including any medications or lifestyle changes they recommend.",
            "What kind of lifestyle changes should I make?",
            "You should focus on eating a healthy diet, exercising regularly, and avoiding smoking. Your doctor may also recommend certain physical therapy exercises to help with your recovery.",
            "Can I go back to work right away?",
            "It depends on the type of surgery you had and your job requirements. Your doctor will be able to give you a better idea of when it's safe to return to work.",
            "What should I do if I experience any pain or discomfort?",
            "You should contact your doctor immediately if you experience any pain or discomfort, as it could be a sign of a complication.",
            "Thank you for your advice, Medi."
        ],
        "knowledge": "Cardiovascular disease Cardiovascular disease  Together CVD resulted in 17. 9 million deaths  in 2015, up from 12. 3 million  in 1990.  Deaths, at a given age, from CVD are more common and have been increasing in much of the developing world, while rates have declined in most of the developed world since the 1970s.  Coronary artery disease and stroke account for 80% of CVD deaths in males and 75% of CVD deaths in females.  Most cardiovascular disease affects older adults.  In the United States 11% of people between 20 and 40 have CVD, while 37% between 40 and 60, 71% of people between 60 and 80, and 85% of people over 80 have CVD Cardiovascular disease Cardiovascular disease",
        "response": "You're welcome. Do you have any other questions about post-surgery care?"
    },
    {
        "dialog": [
            "Hi Medi, I've been feeling a sharp pain in my chest lately.",
            "I'm sorry to hear that. Tell me more about your symptoms.",
            "It's a sudden and intense pain in the center of my chest that lasts for a few minutes.",
            "Based on what you described, it could be a sign of a heart attack. You should seek medical attention immediately.",
            "Oh no, that sounds serious. What are the causes of heart attacks?",
            "Heart attacks are commonly caused by a buildup of plaque in the arteries, which can lead to a blood clot that blocks blood flow to the heart.",
            "What can I do to prevent it from happening in the future?",
            "You can lower your risk of a heart attack by maintaining a healthy diet, exercising regularly, quitting smoking, and managing stress.",
            "Thank you for the advice. I'll make sure to take better care of myself."
        ],
        "knowledge": "Cardiovascular disease Cardiovascular disease  Together CVD resulted in 17. 9 million deaths  in 2015, up from 12. 3 million  in 1990.  Deaths, at a given age, from CVD are more common and have been increasing in much of the developing world, while rates have declined in most of the developed world since the 1970s.  Coronary artery disease and stroke account for 80% of CVD deaths in males and 75% of CVD deaths in females.  Most cardiovascular disease affects older adults.  In the United States 11% of people between 20 and 40 have CVD, while 37% between 40 and 60, 71% of people between 60 and 80, and 85% of people over 80 have CVD Cardiovascular disease Cardiovascular disease",
        "response": "You're welcome. Take care of your health and seek medical attention immediately if you experience any symptoms of a heart attack."
    },
    {
        "dialog": [
            "Hi Medi, I have a question. What is cardiovascular disease?",
            "Cardiovascular disease, or CVD, is a class of diseases that involve the heart or blood vessels.",
            "What are some examples of CVD?",
            "Examples of CVD include coronary artery disease, heart failure, and stroke.",
            "Who is at risk for CVD?",
            "Most cardiovascular disease affects older adults. In the United States, 11% of people between 20 and 40 have CVD, while 37% between 40 and 60, 71% of people between 60 and 80, and 85% of people over 80 have CVD.",
            "How can CVD be prevented?",
            "You can lower your risk of developing CVD by maintaining a healthy diet, exercising regularly, quitting smoking, managing stress, and controlling your blood pressure and cholesterol levels.",
            "Thanks for explaining. I will try to take better care of my health."
        ],
        "knowledge": "Cardiovascular disease Cardiovascular disease  Together CVD resulted in 17. 9 million deaths  in 2015, up from 12. 3 million  in 1990.  Deaths, at a given age, from CVD are more common and have been increasing in much of the developing world, while rates have declined in most of the developed world since the 1970s.  Coronary artery disease and stroke account for 80% of CVD deaths in males and 75% of CVD deaths in females.  Most cardiovascular disease affects older adults.  In the United States 11% of people between 20 and 40 have CVD, while 37% between 40 and 60, 71% of people between 60 and 80, and 85% of people over 80 have CVD Cardiovascular disease Cardiovascular disease",
        "response": "You're welcome. It's always a good idea to take care of your health and prevent any potential risks of developing CVD."
    },
    {
        "dialog": [
            "Hi Medi, I recently had a heart procedure done and I'm not sure what I should do now.",
            "What kind of procedure did you have?",
            "I had a stent inserted into my artery.",
            "After a stent procedure, it's important to take care of your health. You should maintain a healthy diet, exercise regularly, and take any medications prescribed by your doctor.",
            "Are there any specific exercises I should do?",
            "Low-impact exercises like walking, swimming, and cycling are good choices. It's important to talk to your doctor about what exercises are safe for you.",
            "What about my diet?",
            "You should try to eat a heart-healthy diet that's low in saturated and trans fats, cholesterol, and sodium. Eat more fruits, vegetables, whole grains, lean proteins, and healthy fats like nuts and olive oil.",
            "Thank you for the advice. I'll make sure to follow it."
        ],
        "knowledge": "Cardiovascular disease Cardiovascular disease  Together CVD resulted in 17. 9 million deaths  in 2015, up from 12. 3 million  in 1990.  Deaths, at a given age, from CVD are more common and have been increasing in much of the developing world, while rates have declined in most of the developed world since the 1970s.  Coronary artery disease and stroke account for 80% of CVD deaths in males and 75% of CVD deaths in females.  Most cardiovascular disease affects older adults.  In the United States 11% of people between 20 and 40 have CVD, while 37% between 40 and 60, 71% of people between 60 and 80, and 85% of people over 80 have CVD Cardiovascular disease Cardiovascular disease",
        "response": "You're welcome. It's important to take care of your health after any medical procedure, especially one involving the heart. Always follow your doctor's advice and take any medications as prescribed."
    },
    {
        "dialog": [
            "Hi Medi, I have been feeling chest pain. Can you help me?",
            "Sure, I am here to help you. Can you give more details about the chest pain?",
            "It started 2 hours ago and it feels like a squeezing or tightness. I feel short of breath too.",
            "Based on your symptoms, it could be a heart attack. I advise you to call emergency services and go to the hospital immediately",
            "Oh my God! Really? I am so scared. But I don't want to end up in the hospital. What should I do?",
            "I know it can be scary, but it's better to be safe than sorry. Do not hesitate to call emergency services. They will take good care of you.",
            "Okay, I will call them right away. Thank you so much for your help, Medi.",
            "You are welcome. Take care and stay safe.",
            "I will. Bye!"
        ],
        "knowledge": "Cardiovascular disease Cardiovascular disease Together CVD resulted in 17.9 million deaths in 2015, up from 12.3 million in 1990. Deaths, at a given age, from CVD are more common and have been increasing in much of the developing world, while rates have declined in most of the developed world since the 1970s. Coronary artery disease and stroke account for 80% of CVD deaths in males and 75% of CVD deaths in females. Most cardiovascular disease affects older adults. In the United States 11% of people between 20 and 40 have CVD, while 37% between 40 and 60, 71% of people between 60 and 80, and 85% of people over 80 have CVD Cardiovascular disease Cardiovascular disease",
        "response": "You are welcome, take care of yourself and do not hesitate to call emergency services."
    },
    {
        "dialog": [
            "Hi Medi, I have been hearing a lot about cardiovascular diseases lately. Can you explain what it is?",
            "Of course, Cardiovascular disease is a class of diseases that involve the heart or blood vessels. It is the leading cause of death globally",
            "What are the symptoms of cardiovascular disease?",
            "The common symptoms of cardiovascular disease include chest pain or discomfort, shortness of breath, rapid heartbeat, sweating, nausea, and dizziness",
            "What are some ways to prevent cardiovascular disease?",
            "To prevent cardiovascular disease, you should maintain a healthy lifestyle. This includes eating a healthy diet, exercising regularly, avoiding smoking, and managing stress levels.",
            "How does age affect the risk of cardiovascular disease?",
            "As you age, your risk of developing cardiovascular disease increases. Most cardiovascular disease affects older adults. In the United States, 11% of people between 20 and 40 have CVD, while 37% between 40 and 60, 71% of people between 60 and 80, and 85% of people over 80 have CVD",
            "Thank you for the information, Medi. It was very helpful."
        ],
        "knowledge": "Cardiovascular disease Cardiovascular disease Together CVD resulted in 17.9 million deaths in 2015, up from 12.3 million in 1990. Deaths, at a given age, from CVD are more common and have been increasing in much of the developing world, while rates have declined in most of the developed world since the 1970s. Coronary artery disease and stroke account for 80% of CVD deaths in males and 75% of CVD deaths in females. Most cardiovascular disease affects older adults. In the United States 11% of people between 20 and 40 have CVD, while 37% between 40 and 60, 71% of people between 60 and 80, and 85% of people over 80 have CVD Cardiovascular disease Cardiovascular disease",
        "response": "You are welcome. Take care and stay healthy."
    },
    {
        "dialog": [
            "Hi Medi, I recently had a heart surgery. What should I do to ensure a speedy recovery?",
            "Congratulations on completing the surgery. It's important to follow a healthy lifestyle to ensure a speedy recovery. What are you currently doing?",
            "I am resting most of the time and avoiding any physically strenuous activities. I am also taking my medications regularly.",
            "That's a good start. You should also try to eat a healthy diet, drink plenty of fluids, and avoid smoking and alcohol. Have you considered physical therapy?",
            "No, not really. What is physical therapy?",
            "Physical therapy is a type of rehabilitation that involves exercises and movements to help restore strength, flexibility, and range of motion. It can help you recover faster and improve your overall quality of life.",
            "That sounds interesting. I will definitely look into it. Thanks for the suggestion, Medi.",
            "You are welcome. Take care of yourself and follow your doctor's instructions.",
            "I will. Thanks again. Bye, Medi."
        ],
        "knowledge": "Cardiovascular disease Cardiovascular disease Together CVD resulted in 17.9 million deaths in 2015, up from 12.3 million in 1990. Deaths, at a given age, from CVD are more common and have been increasing in much of the developing world, while rates have declined in most of the developed world since the 1970s. Coronary artery disease and stroke account for 80% of CVD deaths in males and 75% of CVD deaths in females. Most cardiovascular disease affects older adults. In the United States 11% of people between 20 and 40 have CVD, while 37% between 40 and 60, 71% of people between 60 and 80, and 85% of people over 80 have CVD Cardiovascular disease Cardiovascular disease",
        "response": "You are welcome. Take care of yourself and follow your doctor's instructions."
    },
    {
        "dialog": [
            "Hi Medi, I have been experiencing some chest pains recently",
            "Hi there. Can you describe the pain? Is it sharp or dull?",
            "It's a dull but persistent pain that has been bothering me for a few days",
            "Have you experienced shortness of breath or sweating with the pain?",
            "No, I haven't experienced any of those symptoms",
            "It's possible that the pain is related to your cardiovascular health. I recommend seeing a doctor for further evaluation",
            "What kind of tests will the doctor perform?",
            "The doctor may perform an ECG, stress test, or echocardiogram to check your heart function",
            "Alright, thank you Medi"
        ],
        "knowledge": "Cardiovascular disease Cardiovascular disease Together CVD resulted in 17.9 million deaths in 2015, up from 12.3 million in 1990. Deaths, at a given age, from CVD are more common and have been increasing in much of the developing world, while rates have declined in most of the developed world since the 1970s. Coronary artery disease and stroke account for 80% of CVD deaths in males and 75% of CVD deaths in females. Most cardiovascular disease affects older adults. In the United States 11% of people between 20 and 40 have CVD, while 37% between 40 and 60, 71% of people between 60 and 80, and 85% of people over 80 have CVD Cardiovascular disease Cardiovascular disease",
        "response": "You should see a doctor for further evaluation, which may include an ECG, stress test, or echocardiogram to check your heart function"
    },
    {
        "dialog": [
            "Hi Medi, I have been diagnosed with cardiovascular disease. What can I do to improve my health?",
            "Hi there. Making lifestyle changes is one of the most effective ways to manage cardiovascular disease",
            "What kind of lifestyle changes should I make?",
            "You should aim to eat a balanced diet with plenty of fruits, vegetables, and whole grains. Regular exercise is also important, as well as quitting smoking if you are a smoker",
            "Are there any medications I can take to manage my condition?",
            "Yes, your doctor may prescribe medications such as statins to manage your cholesterol levels or blood thinners to reduce the risk of blood clots",
            "Alright, thank you for your advice Medi",
            "You're welcome. Remember to follow your doctor's advice and attend regular check-ups to monitor your condition",
            "I will. Thank you Medi"
        ],
        "knowledge": "Cardiovascular disease Cardiovascular disease Together CVD resulted in 17.9 million deaths in 2015, up from 12.3 million in 1990. Deaths, at a given age, from CVD are more common and have been increasing in much of the developing world, while rates have declined in most of the developed world since the 1970s. Coronary artery disease and stroke account for 80% of CVD deaths in males and 75% of CVD deaths in females. Most cardiovascular disease affects older adults. In the United States 11% of people between 20 and 40 have CVD, while 37% between 40 and 60, 71% of people between 60 and 80, and 85% of people over 80 have CVD Cardiovascular disease Cardiovascular disease",
        "response": "Remember to follow your doctor's advice and attend regular check-ups to monitor your condition"
    },
    {
        "dialog": [
            "Hi Medi, I recently had a heart attack and I'm wondering what kind of lifestyle changes I should make",
            "Hi there. Making lifestyle changes is essential for managing your condition and reducing your risk of future heart attacks",
            "What kind of lifestyle changes should I make?",
            "You should aim to eat a balanced diet with plenty of fruits, vegetables, and whole grains. Regular exercise is also important, as well as quitting smoking if you are a smoker",
            "Are there any medications I can take to reduce my risk of future heart attacks?",
            "Yes, your doctor may prescribe medications such as aspirin or beta blockers to reduce your risk of future heart attacks",
            "Okay, thank you for your advice Medi. I want to make sure I'm doing everything I can to manage my condition",
            "That's great to hear. Remember to follow your doctor's advice and attend regular check-ups to monitor your condition",
            "I will. Thank you Medi"
        ],
        "knowledge": "Cardiovascular disease Cardiovascular disease Together CVD resulted in 17.9 million deaths in 2015, up from 12.3 million in 1990. Deaths, at a given age, from CVD are more common and have been increasing in much of the developing world, while rates have declined in most of the developed world since the 1970s. Coronary artery disease and stroke account for 80% of CVD deaths in males and 75% of CVD deaths in females. Most cardiovascular disease affects older adults. In the United States 11% of people between 20 and 40 have CVD, while 37% between 40 and 60, 71% of people between 60 and 80, and 85% of people over 80 have CVD Cardiovascular disease Cardiovascular disease",
        "response": "Remember to follow your doctor's advice and attend regular check-ups to monitor your condition"
    },
    {
        "dialog": [
            "Hi Medi, I've been experiencing chest pain lately.",
            "Hello, sorry to hear that. Can you tell me more about your pain?",
            "It's like a pressure on my chest and it comes and goes.",
            "Based on your description, it could be a sign of a heart problem. You should see a doctor as soon as possible.",
            "What are the common heart problems?",
            "The most common ones are coronary artery disease and heart failure.",
            "How can I prevent them?",
            "You can reduce the risk of heart problems by quitting smoking, exercising regularly, and following a healthy diet.",
            "What kind of diet is healthy for my heart?"
        ],
        "knowledge": "Cardiovascular disease Cardiovascular disease Together CVD resulted in 17. 9 million deaths in 2015, up from 12. 3 million in 1990. Deaths, at a given age, from CVD are more common and have been increasing in much of the developing world, while rates have declined in most of the developed world since the 1970s. Coronary artery disease and stroke account for 80% of CVD deaths in males and 75% of CVD deaths in females. Most cardiovascular disease affects older adults. In the United States 11% of people between 20 and 40 have CVD, while 37% between 40 and 60, 71% of people between 60 and 80, and 85% of people over 80 have CVD Cardiovascular disease Cardiovascular disease",
        "response": "A healthy heart diet includes fruits, vegetables, whole grains, lean protein, and low-fat dairy products."
    },
    {
        "dialog": [
            "Hi Medi, I just had a heart surgery. What should I do to have a fast recovery?",
            "Hello. First, you should follow your doctor's instructions and take your medication as prescribed.",
            "What about my diet?",
            "You should follow a heart-healthy diet and avoid foods high in sodium and cholesterol.",
            "What kind of physical activity can I do?",
            "It depends on your condition. You should consult your doctor before doing any physical activity.",
            "What about my lifestyle?",
            "You should quit smoking, limit alcohol consumption, and manage your stress level.",
            "Can I return to work soon?"
        ],
        "knowledge": "Cardiovascular disease Cardiovascular disease Together CVD resulted in 17. 9 million deaths in 2015, up from 12. 3 million in 1990. Deaths, at a given age, from CVD are more common and have been increasing in much of the developing world, while rates have declined in most of the developed world since the 1970s. Coronary artery disease and stroke account for 80% of CVD deaths in males and 75% of CVD deaths in females. Most cardiovascular disease affects older adults. In the United States 11% of people between 20 and 40 have CVD, while 37% between 40 and 60, 71% of people between 60 and 80, and 85% of people over 80 have CVD Cardiovascular disease Cardiovascular disease",
        "response": "It depends on the type of work you do and your recovery progress. You should ask your doctor for advice."
    },
    {
        "dialog": [
            "Hi Medi, I'm worried about cardiovascular disease because it runs in my family.",
            "Hello. Do you have any symptoms or have you been diagnosed with any heart problems?",
            "No, but I want to prevent it.",
            "You can reduce the risk of heart problems by maintaining a healthy lifestyle, such as exercising regularly, eating a healthy diet, and managing your stress level.",
            "What kind of exercise is good for my heart?",
            "Aerobic exercise, such as brisk walking, cycling, and swimming, is good for your heart.",
            "What about my diet?",
            "You should follow a heart-healthy diet and avoid foods high in saturated and trans fats, cholesterol, and sodium.",
            "What else can I do?"
        ],
        "knowledge": "Cardiovascular disease Cardiovascular disease Together CVD resulted in 17. 9 million deaths in 2015, up from 12. 3 million in 1990. Deaths, at a given age, from CVD are more common and have been increasing in much of the developing world, while rates have declined in most of the developed world since the 1970s. Coronary artery disease and stroke account for 80% of CVD deaths in males and 75% of CVD deaths in females. Most cardiovascular disease affects older adults. In the United States 11% of people between 20 and 40 have CVD, while 37% between 40 and 60, 71% of people between 60 and 80, and 85% of people over 80 have CVD Cardiovascular disease Cardiovascular disease",
        "response": "You should also have regular check-ups with your doctor to monitor your heart health."
    },
    {
        "dialog": [
            "Hi Medi, I feel chest pain and shortness of breath. Can you help me?",
            "I am here to help. How long have you been experiencing these symptoms?",
            "It's been 30 minutes",
            "You should seek medical attention immediately as these symptoms may indicate a heart attack.",
            "What are the symptoms of a heart attack?",
            "Other symptoms of a heart attack may include sweating, nausea, and pain in the left arm or jaw.",
            "What should I do while waiting for medical attention?",
            "You should rest and try to remain calm. Don't exert yourself and take deep breaths to ease the shortness of breath.",
            "Thank you, Medi. I will seek medical attention right away."
        ],
        "knowledge": "Cardiovascular disease Cardiovascular disease  Together CVD resulted in 17. 9 million deaths  in 2015, up from 12. 3 million  in 1990.  Deaths, at a given age, from CVD are more common and have been increasing in much of the developing world, while rates have declined in most of the developed world since the 1970s.  Coronary artery disease and stroke account for 80% of CVD deaths in males and 75% of CVD deaths in females.  Most cardiovascular disease affects older adults.  In the United States 11% of people between 20 and 40 have CVD, while 37% between 40 and 60, 71% of people between 60 and 80, and 85% of people over 80 have CVD Cardiovascular disease Cardiovascular disease",
        "response": "You're welcome. It's important to seek medical attention immediately when experiencing these symptoms because they may indicate a heart attack."
    },
    {
        "dialog": [
            "Hi Medi, can you explain to me what is Cardiovascular disease?",
            "Yes, Cardiovascular disease is a group of disorders of the heart and blood vessels.",
            "What are the symptoms of Cardiovascular disease?",
            "Symptoms may include chest pain, shortness of breath, dizziness, and fatigue.",
            "What are the causes of Cardiovascular disease?",
            "The causes of Cardiovascular disease are multifactorial, including lifestyle factors such as smoking, poor diet, and lack of exercise, as well as genetics and other medical conditions.",
            "How can I prevent Cardiovascular disease?",
            "You can prevent Cardiovascular disease by maintaining a healthy lifestyle, including regular exercise, a balanced diet, and avoiding smoking and excessive alcohol consumption.",
            "Thank you, Medi. I will take your advice seriously."
        ],
        "knowledge": "Cardiovascular disease Cardiovascular disease  Together CVD resulted in 17. 9 million deaths  in 2015, up from 12. 3 million  in 1990.  Deaths, at a given age, from CVD are more common and have been increasing in much of the developing world, while rates have declined in most of the developed world since the 1970s.  Coronary artery disease and stroke account for 80% of CVD deaths in males and 75% of CVD deaths in females.  Most cardiovascular disease affects older adults.  In the United States 11% of people between 20 and 40 have CVD, while 37% between 40 and 60, 71% of people between 60 and 80, and 85% of people over 80 have CVD Cardiovascular disease Cardiovascular disease",
        "response": "You're welcome. Maintaining a healthy lifestyle is very important in preventing Cardiovascular disease."
    },
    {
        "dialog": [
            "Hi Medi, I just had a stent inserted. What lifestyle changes should I make?",
            "After having a stent inserted, it's important to make certain lifestyle changes to prevent further complications.",
            "What kind of lifestyle changes should I make?",
            "You should quit smoking if you smoke, maintain a healthy weight, eat a balanced diet that's low in cholesterol and saturated fats, and exercise regularly.",
            "What kind of exercise is recommended?",
            "Low-impact exercise such as walking, cycling, and swimming is recommended.",
            "What kind of diet should I follow?",
            "You should follow a diet that's low in cholesterol and saturated fats and high in fruits, vegetables, whole grains, and lean proteins.",
            "Thank you, Medi. I will make these lifestyle changes to improve my health."
        ],
        "knowledge": "Cardiovascular disease Cardiovascular disease  Together CVD resulted in 17. 9 million deaths  in 2015, up from 12. 3 million  in 1990.  Deaths, at a given age, from CVD are more common and have been increasing in much of the developing world, while rates have declined in most of the developed world since the 1970s.  Coronary artery disease and stroke account for 80% of CVD deaths in males and 75% of CVD deaths in females.  Most cardiovascular disease affects older adults.  In the United States 11% of people between 20 and 40 have CVD, while 37% between 40 and 60, 71% of people between 60 and 80, and 85% of people over 80 have CVD Cardiovascular disease Cardiovascular disease",
        "response": "You're welcome. Making these lifestyle changes is very important to improve your health after having a stent inserted."
    },
    {
        "dialog": [
            "Hello Medi, I am worried about my heart.",
            "I'm here for you! What seems to be the issue?",
            "I have been experiencing chest pain and shortness of breath lately.",
            "I'm sorry to hear that. Based on your symptoms, you might be at risk of heart disease.",
            "What can I do to prevent it?",
            "You can start by maintaining a healthy lifestyle, such as eating a balanced diet and exercising regularly.",
            "What about medical treatment?",
            "It depends on the severity of your condition. You may need medications or surgery. It's best to consult with a doctor.",
            "Thanks for your advice!"
        ],
        "knowledge": "Cardiovascular disease Cardiovascular disease  Together CVD resulted in 17. 9 million deaths  in 2015, up from 12. 3 million  in 1990.  Deaths, at a given age, from CVD are more common and have been increasing in much of the developing world, while rates have declined in most of the developed world since the 1970s.  Coronary artery disease and stroke account for 80% of CVD deaths in males and 75% of CVD deaths in females.  Most cardiovascular disease affects older adults.  In the United States 11% of people between 20 and 40 have CVD, while 37% between 40 and 60, 71% of people between 60 and 80, and 85% of people over 80 have CVD Cardiovascular disease Cardiovascular disease",
        "response": "You're welcome! Is there anything else I can help you with?"
    },
    {
        "dialog": [
            "Hey Medi, I have a question about cardiovascular disease.",
            "Sure, feel free to ask me anything!",
            "What are some common risk factors of heart disease?",
            "There are many, but some common ones are high blood pressure, high cholesterol, smoking, diabetes, obesity, and lack of physical activity.",
            "How can I reduce my risk?",
            "You can reduce your risk by making lifestyle changes such as eating a healthy diet, exercising regularly, quitting smoking, and managing your stress levels.",
            "Are there any warning signs I should look out for?",
            "Yes, some common symptoms of heart disease are chest pain, shortness of breath, and fatigue.",
            "Thanks for the information!"
        ],
        "knowledge": "Cardiovascular disease Cardiovascular disease  Together CVD resulted in 17. 9 million deaths  in 2015, up from 12. 3 million  in 1990.  Deaths, at a given age, from CVD are more common and have been increasing in much of the developing world, while rates have declined in most of the developed world since the 1970s.  Coronary artery disease and stroke account for 80% of CVD deaths in males and 75% of CVD deaths in females.  Most cardiovascular disease affects older adults.  In the United States 11% of people between 20 and 40 have CVD, while 37% between 40 and 60, 71% of people between 60 and 80, and 85% of people over 80 have CVD Cardiovascular disease Cardiovascular disease",
        "response": "You're welcome! Let me know if you have any other questions."
    },
    {
        "dialog": [
            "Hi Medi, I recently had a heart attack and want to know how to improve my recovery.",
            "I'm here to help! Have you talked to your doctor about a recovery plan?",
            "Yes, but I want to know how I can improve my lifestyle to aid in my recovery.",
            "That's a great question. Maintaining a healthy lifestyle is crucial for recovery. You should eat a balanced diet, exercise regularly, and quit smoking if you haven't already.",
            "What kind of exercises are best?",
            "It's best to start with light exercises such as walking and gradually increasing the intensity. You should also consult with your doctor for a customized exercise plan.",
            "What about stress management?",
            "Stress management is important for recovery as well. You can try relaxation techniques such as deep breathing, meditation, and yoga.",
            "Thanks for your advice, Medi!"
        ],
        "knowledge": "Cardiovascular disease Cardiovascular disease  Together CVD resulted in 17. 9 million deaths  in 2015, up from 12. 3 million  in 1990.  Deaths, at a given age, from CVD are more common and have been increasing in much of the developing world, while rates have declined in most of the developed world since the 1970s.  Coronary artery disease and stroke account for 80% of CVD deaths in males and 75% of CVD deaths in females.  Most cardiovascular disease affects older adults.  In the United States 11% of people between 20 and 40 have CVD, while 37% between 40 and 60, 71% of people between 60 and 80, and 85% of people over 80 have CVD Cardiovascular disease Cardiovascular disease",
        "response": "You're welcome! Let me know if you have any other questions about your recovery."
    },
    {
        "dialog": [
            "Hello Medi, I am having chest pain and discomfort",
            "Hello, sorry to hear that. For how long have you been feeling this pain ?",
            "It has been a few hours now",
            "Okay, does the pain radiate to your left arm, jaw or neck ?",
            "No, it doesn't",
            "That's good. Does the pain increase with physical activity or stress ?",
            "Yes, it does actually",
            "Based on your symptoms, it could be angina. You should see a doctor as soon as possible",
            "What should I do in the meantime ?"
        ],
        "knowledge": "Cardiovascular disease Cardiovascular disease  Together CVD resulted in 17. 9 million deaths  in 2015, up from 12. 3 million  in 1990.  Deaths, at a given age, from CVD are more common and have been increasing in much of the developing world, while rates have declined in most of the developed world since the 1970s.  Coronary artery disease and stroke account for 80% of CVD deaths in males and 75% of CVD deaths in females.  Most cardiovascular disease affects older adults.  In the United States 11% of people between 20 and 40 have CVD, while 37% between 40 and 60, 71% of people between 60 and 80, and 85% of people over 80 have CVD Cardiovascular disease Cardiovascular disease",
        "response": "You should avoid physical activity and any kind of stress. Please see a doctor as soon as possible as it could be angina."
    },
    {
        "dialog": [
            "Hello Medi, I have a few questions about cardiovascular disease",
            "Sure, ask me anything",
            "Can you briefly explain what is cardiovascular disease?",
            "Cardiovascular disease refers to a class of diseases that involve the heart or blood vessels. It could be coronary artery disease, heart valve disease, heart failure, arrhythmia, etc.",
            "How can we prevent cardiovascular disease?",
            "You can prevent cardiovascular disease by adopting a healthy lifestyle such as regular exercising, balanced diet, avoiding smoking, and limiting alcohol intake",
            "Who is at risk of cardiovascular disease?",
            "Most cardiovascular diseases affect older adults, but it can happen to anyone. People with a family history of cardiovascular disease, high blood pressure, and high cholesterol are at higher risk.",
            "Okay, thank you. Is there anything else I should know?"
        ],
        "knowledge": "Cardiovascular disease Cardiovascular disease  Together CVD resulted in 17. 9 million deaths  in 2015, up from 12. 3 million  in 1990.  Deaths, at a given age, from CVD are more common and have been increasing in much of the developing world, while rates have declined in most of the developed world since the 1970s.  Coronary artery disease and stroke account for 80% of CVD deaths in males and 75% of CVD deaths in females.  Most cardiovascular disease affects older adults.  In the United States 11% of people between 20 and 40 have CVD, while 37% between 40 and 60, 71% of people between 60 and 80, and 85% of people over 80 have CVD Cardiovascular disease Cardiovascular disease",
        "response": "Yes, you should be aware of the symptoms of cardiovascular disease such as chest pain, shortness of breath, and dizziness. If you experience any symptoms, please see a doctor as soon as possible."
    },
    {
        "dialog": [
            "Hello Medi, I have recently had a heart bypass surgery",
            "Hello, how are you feeling after the surgery ?",
            "I am feeling okay, but I am not sure what to do regarding my diet and physical activity",
            "You should follow a heart-healthy diet that includes fruits, vegetables, whole grains, lean protein, and low-fat dairy. Avoid saturated and trans fats, salt, and added sugars. For physical activity, you should start with light exercises such as walking and gradually increase the intensity",
            "What about medications ?",
            "Your doctor will prescribe you medications to reduce the risk of blood clots, lower your blood pressure and cholesterol levels, and manage your symptoms. Please make sure to follow your doctor's instructions.",
            "Thank you, Medi. Can I resume my normal activities ?",
            "You should avoid any heavy lifting or strenuous activity for at least six weeks after the surgery. Please check with your doctor before resuming any activity",
            "Okay, thank you for your help."
        ],
        "knowledge": "Cardiovascular disease Cardiovascular disease  Together CVD resulted in 17. 9 million deaths  in 2015, up from 12. 3 million  in 1990.  Deaths, at a given age, from CVD are more common and have been increasing in much of the developing world, while rates have declined in most of the developed world since the 1970s.  Coronary artery disease and stroke account for 80% of CVD deaths in males and 75% of CVD deaths in females.  Most cardiovascular disease affects older adults.  In the United States 11% of people between 20 and 40 have CVD, while 37% between 40 and 60, 71% of people between 60 and 80, and 85% of people over 80 have CVD Cardiovascular disease Cardiovascular disease",
        "response": "You're welcome. Please make sure to follow your doctor's instructions and attend all follow-up appointments to ensure a successful recovery."
    },
    {
        "dialog": [
            "Hello Medi, I have chest pain and feel dizzy.",
            "It could be a sign of a heart attack. You should call an ambulance immediately.",
            "What should I do in the meantime?",
            "You should lie down and rest while waiting for the ambulance to arrive.",
            "I'm scared. What if it's not a heart attack?",
            "It's better to be safe than sorry. Time is of the essence in these situations.",
            "What if it is a heart attack? What will happen to me?",
            "You will receive medical treatment to restore blood flow to your heart. It's important to act fast.",
            "How can I prevent future heart attacks?"
        ],
        "knowledge": "Cardiovascular disease Cardiovascular disease  Together CVD resulted in 17.9 million deaths in 2015, up from 12.3 million in 1990. Deaths, at a given age, from CVD are more common and have been increasing in much of the developing world, while rates have declined in most of the developed world since the 1970s. Coronary artery disease and stroke account for 80% of CVD deaths in males and 75% of CVD deaths in females. Most cardiovascular disease affects older adults. In the United States 11% of people between 20 and 40 have CVD, while 37% between 40 and 60, 71% of people between 60 and 80, and 85% of people over 80 have CVD Cardiovascular disease Cardiovascular disease",
        "response": "There are several ways to prevent future heart attacks such as quitting smoking, maintaining a healthy weight, exercising regularly, managing stress, and controlling high blood pressure and cholesterol levels."
    },
    {
        "dialog": [
            "Hello Medi, can you explain what is cardiovascular disease?",
            "Cardiovascular disease refers to a group of conditions that affect the heart and blood vessels.",
            "What are the symptoms of cardiovascular disease?",
            "The symptoms depend on the specific condition, but some common symptoms include chest pain, shortness of breath, dizziness, and fatigue.",
            "Who is at risk for cardiovascular disease?",
            "Most cardiovascular diseases affect older adults, but there are several risk factors that can increase the risk of developing the disease such as smoking, high blood pressure, high cholesterol, obesity, and diabetes.",
            "Can cardiovascular disease be prevented?",
            "Yes, there are several ways to prevent cardiovascular disease such as quitting smoking, maintaining a healthy weight, exercising regularly, managing stress, and controlling high blood pressure and cholesterol levels.",
            "Is there a cure for cardiovascular disease?"
        ],
        "knowledge": "Cardiovascular disease Cardiovascular disease  Together CVD resulted in 17.9 million deaths in 2015, up from 12.3 million in 1990. Deaths, at a given age, from CVD are more common and have been increasing in much of the developing world, while rates have declined in most of the developed world since the 1970s. Coronary artery disease and stroke account for 80% of CVD deaths in males and 75% of CVD deaths in females. Most cardiovascular disease affects older adults. In the United States 11% of people between 20 and 40 have CVD, while 37% between 40 and 60, 71% of people between 60 and 80, and 85% of people over 80 have CVD Cardiovascular disease Cardiovascular disease",
        "response": "There is no cure for cardiovascular disease, but it can be managed through lifestyle changes and medical treatment to reduce the risk of complications."
    },
    {
        "dialog": [
            "Hello Medi, I recently had a heart procedure. What should I do now?",
            "It's important to take it easy for a few days after the procedure and follow your doctor's instructions for recovery.",
            "What lifestyle changes should I make to prevent future heart issues?",
            "You should quit smoking, maintain a healthy weight, exercise regularly, manage stress, and control high blood pressure and cholesterol levels.",
            "What foods should I eat?",
            "You should eat a healthy, balanced diet with plenty of fruits and vegetables, whole grains, lean protein, and healthy fats.",
            "Are there any foods I should avoid?",
            "You should limit your intake of saturated and trans fats, processed foods, sugary drinks, and sodium.",
            "Can I still drink alcohol?"
        ],
        "knowledge": "Cardiovascular disease Cardiovascular disease  Together CVD resulted in 17.9 million deaths in 2015, up from 12.3 million in 1990. Deaths, at a given age, from CVD are more common and have been increasing in much of the developing world, while rates have declined in most of the developed world since the 1970s. Coronary artery disease and stroke account for 80% of CVD deaths in males and 75% of CVD deaths in females. Most cardiovascular disease affects older adults. In the United States 11% of people between 20 and 40 have CVD, while 37% between 40 and 60, 71% of people between 60 and 80, and 85% of people over 80 have CVD Cardiovascular disease Cardiovascular disease",
        "response": "You should limit your alcohol intake to no more than one drink per day for women and two drinks per day for men."
    },
    {
        "dialog": [
            "Hi Medi, I feel chest pain and shortness of breath. What's happening to me?",
            "Based on your symptoms, it's possible that you are experiencing a cardiovascular disease.",
            "What should I do next, Medi?",
            "You should immediately seek medical attention from a doctor or go to the emergency room.",
            "What are the causes of cardiovascular disease?",
            "There are many factors that can contribute to the development of cardiovascular disease, such as high blood pressure, high cholesterol, smoking, diabetes, and genetics.",
            "How can I prevent cardiovascular disease?",
            "You can lower your risk of developing cardiovascular disease by maintaining a healthy diet, exercising regularly, not smoking, and managing any existing health conditions such as high blood pressure or diabetes.",
            "Thanks, Medi. I will make sure to see a doctor."
        ],
        "knowledge": "Cardiovascular disease Cardiovascular disease  Together CVD resulted in 17.9 million deaths in 2015, up from 12.3 million in 1990. Deaths, at a given age, from CVD are more common and have been increasing in much of the developing world, while rates have declined in most of the developed world since the 1970s. Coronary artery disease and stroke account for 80% of CVD deaths in males and 75% of CVD deaths in females. Most cardiovascular disease affects older adults. In the United States 11% of people between 20 and 40 have CVD, while 37% between 40 and 60, 71% of people between 60 and 80, and 85% of people over 80 have CVD Cardiovascular disease Cardiovascular disease",
        "response": "You're welcome. Don't hesitate to go to the doctor since it's the best course of action to address your symptoms."
    },
    {
        "dialog": [
            "Hi Medi, can you explain what is cardiovascular disease?",
            "Cardiovascular disease is a group of conditions that affect the heart and blood vessels.",
            "What are some of the conditions under cardiovascular disease?",
            "Conditions that fall under cardiovascular disease include coronary artery disease, heart failure, heart valve disease, and arrhythmia.",
            "Are there any symptoms that may indicate the presence of cardiovascular disease?",
            "Some symptoms include chest pain, shortness of breath, fatigue, dizziness, and heart palpitations.",
            "Are there any risk factors that increase the likelihood of developing cardiovascular disease?",
            "Risk factors include high blood pressure, high cholesterol, smoking, diabetes, obesity, and a family history of cardiovascular disease.",
            "Thanks, Medi. That was helpful."
        ],
        "knowledge": "Cardiovascular disease Cardiovascular disease  Together CVD resulted in 17.9 million deaths in 2015, up from 12.3 million in 1990. Deaths, at a given age, from CVD are more common and have been increasing in much of the developing world, while rates have declined in most of the developed world since the 1970s. Coronary artery disease and stroke account for 80% of CVD deaths in males and 75% of CVD deaths in females. Most cardiovascular disease affects older adults. In the United States 11% of people between 20 and 40 have CVD, while 37% between 40 and 60, 71% of people between 60 and 80, and 85% of people over 80 have CVD Cardiovascular disease Cardiovascular disease",
        "response": "You're welcome. If you have any further questions, don't hesitate to ask."
    },
    {
        "dialog": [
            "Hi Medi, I just had a heart procedure. What should I do now?",
            "After a heart procedure, it's important to follow the doctor's instructions carefully.",
            "What lifestyle changes should I make?",
            "You should eat a healthy diet, exercise regularly, and avoid smoking or being around secondhand smoke.",
            "Are there any physical activities that I should avoid?",
            "You should avoid strenuous physical activity and lifting heavy objects for a certain period of time after the procedure.",
            "What should I do if I experience any symptoms?",
            "You should contact your doctor immediately if you experience any symptoms such as chest pain, shortness of breath, or dizziness.",
            "Thanks, Medi. I will make sure to follow my doctor's instructions."
        ],
        "knowledge": "Cardiovascular disease Cardiovascular disease  Together CVD resulted in 17.9 million deaths in 2015, up from 12.3 million in 1990. Deaths, at a given age, from CVD are more common and have been increasing in much of the developing world, while rates have declined in most of the developed world since the 1970s. Coronary artery disease and stroke account for 80% of CVD deaths in males and 75% of CVD deaths in females. Most cardiovascular disease affects older adults. In the United States 11% of people between 20 and 40 have CVD, while 37% between 40 and 60, 71% of people between 60 and 80, and 85% of people over 80 have CVD Cardiovascular disease Cardiovascular disease",
        "response": "You're welcome. It's important to follow the doctor's instructions to ensure a successful recovery."
    }
]