[
    {
        "dialog": [
            "Hi Medi, I've been experiencing frequent migraines lately.",
            "I'm here to help. Could you describe the symptoms of your migraines?",
            "I usually have a throbbing pain on one side of my head, along with nausea and sensitivity to light and sound.",
            "Based on your symptoms, it seems like you may be experiencing migraines. They can be debilitating.",
            "Yes, they are affecting my daily life. Is there anything I can do to prevent them?",
            "There is some preliminary evidence that a ketogenic diet may help prevent migraines. It's worth considering.",
            "I'll definitely look into that. Thank you, Medi.",
            "You're welcome. If you have any more questions, feel free to ask.",
            "Does gender play a role in migraine prevalence?"
        ],
        "knowledge": "Migraine Migraine In the United States, direct costs have been estimated at $17 billion, while indirect costs – such as missed or decreased ability to work – is estimated at $15 billion. Nearly a tenth of the direct cost is due to the cost of triptans. In those who do attend work during a migraine attack, effectiveness is decreased by around a third. Negative impacts also frequently occur for a person's family. Transcranial magnetic stimulation shows promise, as does transcutaneous supraorbital nerve stimulation. There is preliminary evidence that a ketogenic diet may help prevent episodic and long-term migraine. While no definitive proof has been found linking migraine to gender, statistical data indicates that women may be more prone to having migraines, showing migraine incidence three times higher among women than men Migraine Migraine",
        "response": "Statistical data indicates that women may be more prone to having migraines, showing migraine incidence three times higher among women than men."
    },
    {
        "dialog": [
            "Hello, Medi. I recently had a medical procedure and need some advice for my recovery.",
            "Of course. What kind of procedure did you have?",
            "I underwent transcranial magnetic stimulation. It went well, but I'm not sure how to take care of myself afterward.",
            "After the procedure, it's important to take it easy and avoid strenuous activities for a few days. Rest is crucial for recovery.",
            "Should I follow any specific diet or exercise routine?",
            "Maintaining a balanced diet with plenty of nutrients can support your recovery. Light physical exercise, like walking, is recommended.",
            "That's helpful. Thank you, Medi.",
            "You're welcome. If you have any more questions, feel free to ask.",
            "Is there any evidence that transcutaneous supraorbital nerve stimulation can help with migraines?"
        ],
        "knowledge": "Migraine Migraine In the United States, direct costs have been estimated at $17 billion, while indirect costs – such as missed or decreased ability to work – is estimated at $15 billion. Nearly a tenth of the direct cost is due to the cost of triptans. In those who do attend work during a migraine attack, effectiveness is decreased by around a third. Negative impacts also frequently occur for a person's family. Transcranial magnetic stimulation shows promise, as does transcutaneous supraorbital nerve stimulation. There is preliminary evidence that a ketogenic diet may help prevent episodic and long-term migraine. While no definitive proof has been found linking migraine to gender, statistical data indicates that women may be more prone to having migraines, showing migraine incidence three times higher among women than men Migraine Migraine",
        "response": "Yes, there is preliminary evidence that transcutaneous supraorbital nerve stimulation can help with migraines."
    },
    {
        "dialog": [
            "Hi, Medi. I've been dealing with migraines for a while now and it's affecting my productivity.",
            "I understand how challenging migraines can be. What treatments have you tried so far?",
            "I've tried medication, but I'm looking for alternative approaches to manage my migraines.",
            "Have you considered transcutaneous supraorbital nerve stimulation? It has shown promise as a non-medication option.",
            "I haven't heard of that. How does it work?",
            "It involves applying gentle electrical stimulation to the nerves in the forehead. It can help alleviate migraine symptoms.",
            "That's intriguing. I'll definitely look into it. Thanks, Medi.",
            "You're welcome. If you have any more questions, feel free to ask.",
            "Are there any lifestyle changes I can make to reduce the impact of migraines?"
        ],
        "knowledge": "Migraine Migraine In the United States, direct costs have been estimated at $17 billion, while indirect costs – such as missed or decreased ability to work – is estimated at $15 billion. Nearly a tenth of the direct cost is due to the cost of triptans. In those who do attend work during a migraine attack, effectiveness is decreased by around a third. Negative impacts also frequently occur for a person's family. Transcranial magnetic stimulation shows promise, as does transcutaneous supraorbital nerve stimulation. There is preliminary evidence that a ketogenic diet may help prevent episodic and long-term migraine. While no definitive proof has been found linking migraine to gender, statistical data indicates that women may be more prone to having migraines, showing migraine incidence three times higher among women than men Migraine Migraine",
        "response": "Making lifestyle changes like managing stress, maintaining a regular sleep schedule, and avoiding triggers can help reduce the impact of migraines."
    },
    {
        "dialog": [
            "Hi Medi, I've been experiencing frequent migraines lately.",
            "I'm here to help. Can you describe your migraines? How often do they occur?",
            "They happen at least twice a week, and the pain is intense.",
            "I see. Migraines can be debilitating. Have you tried any treatments or remedies?",
            "I've tried over-the-counter painkillers, but they don't provide much relief.",
            "I understand. There are other options you can explore. Have you heard of transcutaneous supraorbital nerve stimulation?",
            "No, I haven't. What is it, and can it help with migraines?",
            "Transcutaneous supraorbital nerve stimulation is a non-invasive technique that involves applying mild electrical stimulation to the nerves associated with migraines. It has shown promising results in reducing migraine frequency and intensity.",
            "That sounds interesting. Is it a widely available treatment?"
        ],
        "knowledge": "Migraine Migraine  In the United States, direct costs have been estimated at $17 billion, while indirect costs – such as missed or decreased ability to work – is estimated at $15 billion.  Nearly a tenth of the direct cost is due to the cost of triptans.  In those who do attend work during a migraine attack, effectiveness is decreased by around a third.  Negative impacts also frequently occur for a person's family. Transcranial magnetic stimulation shows promise, as does transcutaneous supraorbital nerve stimulation.  There is preliminary evidence that a ketogenic diet may help prevent episodic and long-term migraine. While no definitive proof has been found linking migraine to gender, statistical data indicates that women may be more prone to having migraine, showing migraine incidence three times higher among women than men Migraine Migraine",
        "response": "Transcutaneous supraorbital nerve stimulation is gaining recognition as a treatment for migraines, but its availability may vary. I recommend consulting with a headache specialist to explore this option further."
    },
    {
        "dialog": [
            "Hello Medi, I have a question about migraines. Are there any dietary changes that can help prevent migraines?",
            "Certainly! Making certain adjustments to your diet may be beneficial. What specifically would you like to know?",
            "I'm interested in the ketogenic diet. Can it help with preventing migraines?",
            "There is some preliminary evidence suggesting that a ketogenic diet may help prevent both episodic and long-term migraines.",
            "That's intriguing. How does the ketogenic diet work in preventing migraines?",
            "The exact mechanism is not fully understood, but it is believed that the ketogenic diet alters brain metabolism and reduces inflammation, which are factors associated with migraines.",
            "I see. Are there any specific guidelines or restrictions for following a ketogenic diet?",
            "Yes, a ketogenic diet typically involves consuming high amounts of healthy fats, moderate protein, and very low carbohydrates. It's important to consult with a healthcare professional or nutritionist to ensure you're following it correctly.",
            "Thank you for the information, Medi. I appreciate your help."
        ],
        "knowledge": "Migraine Migraine  In the United States, direct costs have been estimated at $17 billion, while indirect costs – such as missed or decreased ability to work – is estimated at $15 billion.  Nearly a tenth of the direct cost is due to the cost of triptans.  In those who do attend work during a migraine attack, effectiveness is decreased by around a third.  Negative impacts also frequently occur for a person's family. Transcranial magnetic stimulation shows promise, as does transcutaneous supraorbital nerve stimulation.  There is preliminary evidence that a ketogenic diet may help prevent episodic and long-term migraine. While no definitive proof has been found linking migraine to gender, statistical data indicates that women may be more prone to having migraine, showing migraine incidence three times higher among women than men Migraine Migraine",
        "response": "You're welcome! If you decide to try the ketogenic diet for preventing migraines, it's advisable to seek guidance from a healthcare professional or nutritionist to ensure it is tailored to your needs and preferences."
    },
    {
        "dialog": [
            "Hi Medi, I recently underwent a medical procedure to treat my migraines. What lifestyle changes should I make?",
            "Congratulations on taking steps to manage your migraines. Lifestyle changes can be beneficial. What specific areas would you like advice on?",
            "I'd like advice on my diet. Are there any foods I should avoid or include to support my migraine treatment?",
            "In general, it's advisable to avoid trigger foods that can potentially induce migraines, such as processed foods, aged cheese, caffeine, and alcohol. Including foods rich in magnesium, like leafy greens and nuts, may be helpful for some individuals.",
            "Got it. How about physical exercise? Is there a particular type of exercise that's beneficial for migraine sufferers?",
            "Engaging in regular aerobic exercise, such as brisk walking, swimming, or cycling, can have positive effects on migraines. However, it's important to listen to your body and avoid excessive strain.",
            "That makes sense. Are there any other lifestyle factors I should consider?",
            "Adequate sleep, stress management techniques, and maintaining a consistent daily routine can also contribute to migraine management.",
            "Thank you, Medi. Your advice is much appreciated!"
        ],
        "knowledge": "Migraine Migraine  In the United States, direct costs have been estimated at $17 billion, while indirect costs – such as missed or decreased ability to work – is estimated at $15 billion.  Nearly a tenth of the direct cost is due to the cost of triptans.  In those who do attend work during a migraine attack, effectiveness is decreased by around a third.  Negative impacts also frequently occur for a person's family. Transcranial magnetic stimulation shows promise, as does transcutaneous supraorbital nerve stimulation.  There is preliminary evidence that a ketogenic diet may help prevent episodic and long-term migraine. While no definitive proof has been found linking migraine to gender, statistical data indicates that women may be more prone to having migraine, showing migraine incidence three times higher among women than men Migraine Migraine",
        "response": "You're welcome! Making changes in your diet, incorporating regular aerobic exercise, prioritizing sleep, managing stress, and maintaining a consistent routine can all contribute to managing your migraines effectively."
    },
    {
        "dialog": [
            "Hi Medi, I've been experiencing frequent migraines lately.",
            "I'm here to help. Could you describe your migraines in more detail?",
            "The pain is usually on one side of my head, and I feel nauseous and sensitive to light.",
            "Based on your symptoms, it appears to be a classic migraine. Have you tried any treatments?",
            "I've taken over-the-counter painkillers, but they only provide temporary relief.",
            "I recommend considering transcutaneous supraorbital nerve stimulation for long-term relief.",
            "Is that a safe and effective option? Are there any side effects?",
            "It's generally safe and well-tolerated, but you should consult with a healthcare professional.",
            "Thank you, Medi. Do you have any advice on how to prevent migraines?"
        ],
        "knowledge": "Migraine Migraine In the United States, direct costs have been estimated at $17 billion, while indirect costs – such as missed or decreased ability to work – is estimated at $15 billion. Nearly a tenth of the direct cost is due to the cost of triptans. In those who do attend work during a migraine attack, effectiveness is decreased by around a third. Negative impacts also frequently occur for a person's family. Transcranial magnetic stimulation shows promise, as does transcutaneous supraorbital nerve stimulation. There is preliminary evidence that a ketogenic diet may help prevent episodic and long-term migraine. While no definitive proof has been found linking migraine to gender, statistical data indicates that women may be more prone to having migraine, showing migraine incidence three times higher among women than men Migraine Migraine",
        "response": "To prevent migraines, it's important to identify triggers, manage stress, and consider a ketogenic diet."
    },
    {
        "dialog": [
            "Hey Medi, I have a question about migraines. Are they more common in women?",
            "Yes, statistical data indicates that women are more prone to migraines than men.",
            "Is there any particular reason why women experience migraines more often?",
            "While no definitive proof has been found, there is a higher incidence of migraines among women.",
            "That's interesting. Are there any effective non-medication treatments for migraines?",
            "Transcranial magnetic stimulation and transcutaneous supraorbital nerve stimulation show promise.",
            "Are these treatments widely available? Can I access them easily?",
            "They are not as widely available as medications. You may need to consult with a specialist.",
            "Thank you, Medi. I appreciate your help and answers."
        ],
        "knowledge": "Migraine Migraine In the United States, direct costs have been estimated at $17 billion, while indirect costs – such as missed or decreased ability to work – is estimated at $15 billion. Nearly a tenth of the direct cost is due to the cost of triptans. In those who do attend work during a migraine attack, effectiveness is decreased by around a third. Negative impacts also frequently occur for a person's family. Transcranial magnetic stimulation shows promise, as does transcutaneous supraorbital nerve stimulation. There is preliminary evidence that a ketogenic diet may help prevent episodic and long-term migraine. While no definitive proof has been found linking migraine to gender, statistical data indicates that women may be more prone to having migraine, showing migraine incidence three times higher among women than men Migraine Migraine",
        "response": "You're welcome! If you have any more questions, feel free to ask."
    },
    {
        "dialog": [
            "Hi Medi, I recently had a migraine and I'm looking for lifestyle changes to prevent future episodes.",
            "I can provide you with lifestyle advice to help prevent migraines. What's your current routine like?",
            "I work long hours and often skip meals. My sleep schedule is irregular as well.",
            "Maintaining a regular sleep schedule, eating balanced meals, and managing stress can help reduce migraines.",
            "Are there any specific dietary recommendations to prevent migraines?",
            "There is preliminary evidence that a ketogenic diet may help prevent episodic and long-term migraines.",
            "What does a ketogenic diet involve? Is it difficult to follow?",
            "A ketogenic diet is low in carbohydrates and high in healthy fats. It may require some adjustment but can be effective.",
            "Thank you for the information, Medi. I'll consider these lifestyle changes."
        ],
        "knowledge": "Migraine Migraine In the United States, direct costs have been estimated at $17 billion, while indirect costs – such as missed or decreased ability to work – is estimated at $15 billion. Nearly a tenth of the direct cost is due to the cost of triptans. In those who do attend work during a migraine attack, effectiveness is decreased by around a third. Negative impacts also frequently occur for a person's family. Transcranial magnetic stimulation shows promise, as does transcutaneous supraorbital nerve stimulation. There is preliminary evidence that a ketogenic diet may help prevent episodic and long-term migraine. While no definitive proof has been found linking migraine to gender, statistical data indicates that women may be more prone to having migraine, showing migraine incidence three times higher among women than men Migraine Migraine",
        "response": "You're welcome! I hope these lifestyle changes help reduce your migraines. If you have any more questions, feel free to ask."
    },
    {
        "dialog": [
            "Hi Medi, I've been experiencing frequent migraines lately.",
            "I'm here to help. Can you describe your migraine symptoms?",
            "The pain is usually on one side of my head, and it's accompanied by nausea and sensitivity to light.",
            "Based on your symptoms, it seems like you're experiencing migraines. Have you tried any remedies?",
            "I've tried taking over-the-counter painkillers, but they don't seem to provide much relief.",
            "In addition to painkillers, you can try relaxation techniques, such as deep breathing and meditation.",
            "I'll give that a try. By the way, are there any dietary changes that can help with migraines?",
            "There is preliminary evidence that a ketogenic diet may help prevent migraines in the long term.",
            "That's interesting. How does a ketogenic diet help prevent migraines?"
        ],
        "knowledge": "Migraine Migraine In the United States, direct costs have been estimated at $17 billion, while indirect costs – such as missed or decreased ability to work – are estimated at $15 billion. Nearly a tenth of the direct cost is due to the cost of triptans. In those who do attend work during a migraine attack, effectiveness is decreased by around a third. Negative impacts also frequently occur for a person's family. Transcranial magnetic stimulation shows promise, as does transcutaneous supraorbital nerve stimulation. There is preliminary evidence that a ketogenic diet may help prevent episodic and long-term migraine. While no definitive proof has been found linking migraine to gender, statistical data indicates that women may be more prone to having migraines, showing migraine incidence three times higher among women than men Migraine Migraine",
        "response": "A ketogenic diet helps prevent migraines by altering the metabolism of the brain and reducing inflammation."
    },
    {
        "dialog": [
            "Hey Medi, I have a question about migraines.",
            "Sure, feel free to ask your question about migraines.",
            "What are some common triggers for migraines?",
            "Common triggers for migraines include stress, certain foods, strong smells, hormonal changes, and changes in sleep patterns.",
            "I see. How can I manage or avoid these triggers?",
            "Managing triggers involves identifying them and making lifestyle changes. For example, you can practice stress management techniques and avoid known trigger foods.",
            "That makes sense. Are there any medications that can help with migraines?",
            "Yes, there are medications available for migraines. It's best to consult with a healthcare professional for personalized advice.",
            "Got it. Thanks for the information!"
        ],
        "knowledge": "Migraine Migraine In the United States, direct costs have been estimated at $17 billion, while indirect costs – such as missed or decreased ability to work – are estimated at $15 billion. Nearly a tenth of the direct cost is due to the cost of triptans. In those who do attend work during a migraine attack, effectiveness is decreased by around a third. Negative impacts also frequently occur for a person's family. Transcranial magnetic stimulation shows promise, as does transcutaneous supraorbital nerve stimulation. There is preliminary evidence that a ketogenic diet may help prevent episodic and long-term migraine. While no definitive proof has been found linking migraine to gender, statistical data indicates that women may be more prone to having migraines, showing migraine incidence three times higher among women than men Migraine Migraine",
        "response": "You're welcome! If you have any more questions, feel free to ask."
    },
    {
        "dialog": [
            "Hi Medi, I recently had a migraine and wanted some advice on lifestyle changes.",
            "Of course! I'm here to provide guidance. What lifestyle changes are you interested in?",
            "I'm wondering if there are any dietary recommendations for managing migraines.",
            "A ketogenic diet has shown promise in preventing migraines. It involves reducing carbohydrate intake and increasing healthy fats.",
            "That's interesting. Are there any specific exercises that can help with migraines?",
            "Engaging in regular aerobic exercises, such as brisk walking or swimming, can help reduce the frequency and severity of migraines.",
            "I'll try incorporating those changes into my routine. Are there any other tips you can provide?",
            "It's also important to maintain a consistent sleep schedule, manage stress levels, and stay hydrated.",
            "Thanks for the advice, Medi! I appreciate your help."
        ],
        "knowledge": "Migraine Migraine In the United States, direct costs have been estimated at $17 billion, while indirect costs – such as missed or decreased ability to work – are estimated at $15 billion. Nearly a tenth of the direct cost is due to the cost of triptans. In those who do attend work during a migraine attack, effectiveness is decreased by around a third. Negative impacts also frequently occur for a person's family. Transcranial magnetic stimulation shows promise, as does transcutaneous supraorbital nerve stimulation. There is preliminary evidence that a ketogenic diet may help prevent episodic and long-term migraine. While no definitive proof has been found linking migraine to gender, statistical data indicates that women may be more prone to having migraines, showing migraine incidence three times higher among women than men Migraine Migraine",
        "response": "You're welcome! If you have any more questions or need further assistance, feel free to ask."
    },
    {
        "dialog": [
            "Hi Medi, I've been experiencing severe headaches lately.",
            "I'm here to help. Can you tell me more about your headaches?",
            "The pain is throbbing, and it's usually on one side of my head.",
            "Based on your symptoms, it's possible that you're experiencing migraines.",
            "What can I do to alleviate the pain and prevent migraines?",
            "There are different approaches you can try, such as medications and lifestyle changes.",
            "Are there any natural remedies I can try?",
            "Yes, some people find relief with techniques like relaxation exercises and acupuncture.",
            "How effective are those natural remedies?"
        ],
        "knowledge": "Migraine Migraine In the United States, direct costs have been estimated at $17 billion, while indirect costs – such as missed or decreased ability to work – is estimated at $15 billion. Nearly a tenth of the direct cost is due to the cost of triptans. In those who do attend work during a migraine attack, effectiveness is decreased by around a third. Negative impacts also frequently occur for a person's family. Transcranial magnetic stimulation shows promise, as does transcutaneous supraorbital nerve stimulation. There is preliminary evidence that a ketogenic diet may help prevent episodic and long-term migraine. While no definitive proof has been found linking migraine to gender, statistical data indicates that women may be more prone to having migraines, showing migraine incidence three times higher among women than men Migraine Migraine",
        "response": "Natural remedies can vary in effectiveness for each individual, but they may offer relief."
    },
    {
        "dialog": [
            "Hello, Medi. I have a question about migraines.",
            "Sure, feel free to ask. I'm here to provide information and support.",
            "Are migraines more common in women than men?",
            "Yes, statistical data suggests that women are more prone to experiencing migraines.",
            "Is there a specific reason for this gender difference?",
            "There is no definitive proof linking migraines to gender, but it appears to be more common in women.",
            "I see. Thank you for clarifying.",
            "You're welcome. If you have any more questions, feel free to ask.",
            "How can I identify a migraine attack?"
        ],
        "knowledge": "Migraine Migraine In the United States, direct costs have been estimated at $17 billion, while indirect costs – such as missed or decreased ability to work – is estimated at $15 billion. Nearly a tenth of the direct cost is due to the cost of triptans. In those who do attend work during a migraine attack, effectiveness is decreased by around a third. Negative impacts also frequently occur for a person's family. Transcranial magnetic stimulation shows promise, as does transcutaneous supraorbital nerve stimulation. There is preliminary evidence that a ketogenic diet may help prevent episodic and long-term migraine. While no definitive proof has been found linking migraine to gender, statistical data indicates that women may be more prone to having migraines, showing migraine incidence three times higher among women than men Migraine Migraine",
        "response": "Migraine attacks are often characterized by severe headaches, throbbing pain, and sensitivity to light and sound."
    },
    {
        "dialog": [
            "Hey Medi, I recently had a medical procedure related to migraines.",
            "I'm here to provide support and guidance. How can I assist you?",
            "I was wondering if there are any lifestyle changes I should make post-procedure.",
            "It's important to maintain a healthy lifestyle, including regular exercise and a balanced diet.",
            "Are there any specific exercises that can help with migraines?",
            "Exercises like yoga and aerobic activities have shown potential benefits for migraine prevention.",
            "That's good to know. How about my diet?",
            "Some evidence suggests that a ketogenic diet may help prevent episodic and long-term migraines.",
            "How can I follow a ketogenic diet?"
        ],
        "knowledge": "Migraine Migraine In the United States, direct costs have been estimated at $17 billion, while indirect costs – such as missed or decreased ability to work – is estimated at $15 billion. Nearly a tenth of the direct cost is due to the cost of triptans. In those who do attend work during a migraine attack, effectiveness is decreased by around a third. Negative impacts also frequently occur for a person's family. Transcranial magnetic stimulation shows promise, as does transcutaneous supraorbital nerve stimulation. There is preliminary evidence that a ketogenic diet may help prevent episodic and long-term migraine. While no definitive proof has been found linking migraine to gender, statistical data indicates that women may be more prone to having migraines, showing migraine incidence three times higher among women than men Migraine Migraine",
        "response": "To follow a ketogenic diet, you should focus on consuming low-carb, high-fat foods and limit your carbohydrate intake."
    },
    {
        "dialog": [
            "Hi, Medi. I've been experiencing migraines lately. Can you help me?",
            "Of course, I'm here to assist you. Please describe your symptoms.",
            "I have throbbing headaches, sensitivity to light, and nausea during the attacks.",
            "Based on your symptoms, it seems like you're experiencing migraines.",
            "Are there any treatments or remedies I can try?",
            "There are various treatment options available, including medications and lifestyle changes. Would you like more information about them?",
            "Yes, please. Tell me about lifestyle changes that can help with migraines.",
            "Maintaining a regular sleep schedule, managing stress, and avoiding triggers like certain foods can be beneficial.",
            "What are some common triggers that I should avoid?"
        ],
        "knowledge": "Migraine Migraine In the United States, direct costs have been estimated at $17 billion, while indirect costs – such as missed or decreased ability to work – is estimated at $15 billion. Nearly a tenth of the direct cost is due to the cost of triptans. In those who do attend work during a migraine attack, effectiveness is decreased by around a third. Negative impacts also frequently occur for a person's family. Transcranial magnetic stimulation shows promise, as does transcutaneous supraorbital nerve stimulation. There is preliminary evidence that a ketogenic diet may help prevent episodic and long-term migraine. While no definitive proof has been found linking migraine to gender, statistical data indicates that women may be more prone to having migraine, showing migraine incidence three times higher among women than men Migraine Migraine",
        "response": "Common triggers include certain foods (e.g., chocolate, aged cheeses), alcohol, stress, lack of sleep, and hormonal changes."
    },
    {
        "dialog": [
            "Hey, Medi. I've recently started a ketogenic diet to prevent migraines. Any advice?",
            "That's great! A ketogenic diet can be beneficial for managing migraines.",
            "What foods should I focus on in my diet?",
            "You should consume foods that are low in carbohydrates and high in healthy fats, such as avocados, nuts, and olive oil.",
            "Are there any specific foods I should avoid?",
            "Yes, you should avoid foods that are high in carbohydrates, such as bread, pasta, and sugary snacks.",
            "Can you recommend any other lifestyle changes to complement the diet?",
            "Regular exercise, stress management techniques, and adequate sleep can further support your efforts in preventing migraines.",
            "How long does it typically take to see results from the diet?"
        ],
        "knowledge": "Migraine Migraine In the United States, direct costs have been estimated at $17 billion, while indirect costs – such as missed or decreased ability to work – is estimated at $15 billion. Nearly a tenth of the direct cost is due to the cost of triptans. In those who do attend work during a migraine attack, effectiveness is decreased by around a third. Negative impacts also frequently occur for a person's family. Transcranial magnetic stimulation shows promise, as does transcutaneous supraorbital nerve stimulation. There is preliminary evidence that a ketogenic diet may help prevent episodic and long-term migraine. While no definitive proof has been found linking migraine to gender, statistical data indicates that women may be more prone to having migraine, showing migraine incidence three times higher among women than men Migraine Migraine",
        "response": "Results may vary, but some individuals report a reduction in migraine frequency within a few weeks of following a ketogenic diet."
    },
    {
        "dialog": [
            "Hi, Medi. I just had transcranial magnetic stimulation for my migraines. Any recommendations?",
            "Transcranial magnetic stimulation can be beneficial for managing migraines. How are you feeling after the procedure?",
            "I'm feeling a bit tired and have a mild headache. Is that normal?",
            "Yes, it's common to experience temporary side effects like fatigue and mild headaches after the procedure.",
            "Should I rest or continue with my daily activities?",
            "It's important to listen to your body and rest if you feel the need to. Gradually resume your activities as you start feeling better.",
            "Are there any precautions I should take after the procedure?",
            "Avoid exposing yourself to strong magnetic fields or undergoing other magnetic stimulation procedures for a certain period of time.",
            "How long until I can expect to see improvements in my migraines?"
        ],
        "knowledge": "Migraine Migraine In the United States, direct costs have been estimated at $17 billion, while indirect costs – such as missed or decreased ability to work – is estimated at $15 billion. Nearly a tenth of the direct cost is due to the cost of triptans. In those who do attend work during a migraine attack, effectiveness is decreased by around a third. Negative impacts also frequently occur for a person's family. Transcranial magnetic stimulation shows promise, as does transcutaneous supraorbital nerve stimulation. There is preliminary evidence that a ketogenic diet may help prevent episodic and long-term migraine. While no definitive proof has been found linking migraine to gender, statistical data indicates that women may be more prone to having migraine, showing migraine incidence three times higher among women than men Migraine Migraine",
        "response": "Improvements vary among individuals, but many report a reduction in migraine frequency within a few weeks to months of undergoing transcranial magnetic stimulation."
    },
    {
        "dialog": [
            "Hello Medi, I've been experiencing frequent migraines lately.",
            "I'm here to help. Can you tell me more about your symptoms?",
            "The migraines usually start with a throbbing pain on one side of my head.",
            "How long do these migraines typically last?",
            "They can last anywhere from a few hours to a couple of days.",
            "Do you notice any triggers that might be causing your migraines?",
            "I've noticed that lack of sleep and stress tend to trigger my migraines.",
            "Those are common triggers. I can provide some lifestyle recommendations to help manage your migraines.",
            "That would be great, Medi. What can I do to prevent migraines?"
        ],
        "knowledge": "Migraine Migraine  In the United States, direct costs have been estimated at $17 billion, while indirect costs – such as missed or decreased ability to work – is estimated at $15 billion. Nearly a tenth of the direct cost is due to the cost of triptans. In those who do attend work during a migraine attack, effectiveness is decreased by around a third. Negative impacts also frequently occur for a person's family. Transcranial magnetic stimulation shows promise, as does transcutaneous supraorbital nerve stimulation. There is preliminary evidence that a ketogenic diet may help prevent episodic and long-term migraine. While no definitive proof has been found linking migraine to gender, statistical data indicates that women may be more prone to having migraines, showing migraine incidence three times higher among women than men Migraine Migraine",
        "response": "Some lifestyle changes that may help prevent migraines include maintaining a regular sleep schedule, managing stress levels, and identifying and avoiding triggers. Additionally, a ketogenic diet has shown promise in preventing migraines."
    },
    {
        "dialog": [
            "Hi Medi, I have a question about migraines.",
            "Of course, I'm here to provide information and answer your questions.",
            "Can migraines be hereditary?",
            "While no definitive proof has been found, statistical data suggests that women may be more prone to migraines.",
            "I see. Are there any treatments or therapies available for migraines?",
            "Yes, there are several options. Transcranial magnetic stimulation and transcutaneous supraorbital nerve stimulation have shown promise as non-invasive treatments for migraines.",
            "That's interesting. Are there any lifestyle changes that can help manage migraines?",
            "Certainly. Maintaining a regular sleep schedule, managing stress levels, and identifying triggers can all contribute to managing migraines.",
            "Thanks for the information, Medi. It's been really helpful."
        ],
        "knowledge": "Migraine Migraine  In the United States, direct costs have been estimated at $17 billion, while indirect costs – such as missed or decreased ability to work – is estimated at $15 billion. Nearly a tenth of the direct cost is due to the cost of triptans. In those who do attend work during a migraine attack, effectiveness is decreased by around a third. Negative impacts also frequently occur for a person's family. Transcranial magnetic stimulation shows promise, as does transcutaneous supraorbital nerve stimulation. There is preliminary evidence that a ketogenic diet may help prevent episodic and long-term migraine. While no definitive proof has been found linking migraine to gender, statistical data indicates that women may be more prone to having migraines, showing migraine incidence three times higher among women than men Migraine Migraine",
        "response": "You're welcome! I'm glad I could help. If you have any more questions, feel free to ask."
    },
    {
        "dialog": [
            "Hey Medi, I recently had a medical procedure and need some advice.",
            "I'm here to assist you. What kind of procedure did you have?",
            "I had a surgical procedure to remove my gallbladder.",
            "After gallbladder removal, it's important to maintain a healthy diet.",
            "Are there any specific dietary restrictions I need to follow?",
            "It's generally recommended to avoid high-fat and greasy foods after gallbladder removal.",
            "Got it. Are there any exercises I should avoid or focus on?",
            "In the initial recovery period, it's best to avoid strenuous activities. Gentle walking is a good exercise to start with.",
            "Thanks for the advice, Medi. I appreciate your help."
        ],
        "knowledge": "Gallbladder Removal Gallbladder Removal  After gallbladder removal, it's important to maintain a healthy diet to aid digestion. It's generally recommended to avoid high-fat and greasy foods. Regular exercise, such as walking, is beneficial for overall health, but strenuous activities should be avoided during the initial recovery period Gallbladder Removal Gallbladder Removal",
        "response": "You're welcome! I'm glad I could provide assistance. If you have any more questions, feel free to ask."
    },
    {
        "dialog": [
            "Hi Medi, I've been having frequent migraines lately.",
            "I'm here to help. Can you describe your migraine symptoms?",
            "The pain is usually on one side of my head, accompanied by nausea and sensitivity to light.",
            "Based on your symptoms, it seems like you're experiencing typical migraines.",
            "Is there anything I can do to prevent migraines from occurring?",
            "There are lifestyle changes you can try, such as maintaining a regular sleep schedule and managing stress.",
            "I'll give those a try. By the way, is there any known cause for migraines?",
            "While there's no definitive proof, statistical data suggests women are more prone to migraines than men.",
            "Why is that the case?"
        ],
        "knowledge": "Migraine Migraine In the United States, direct costs have been estimated at $17 billion, while indirect costs – such as missed or decreased ability to work – are estimated at $15 billion. Nearly a tenth of the direct cost is due to the cost of triptans. In those who do attend work during a migraine attack, effectiveness is decreased by around a third. Negative impacts also frequently occur for a person's family. Transcranial magnetic stimulation shows promise, as does transcutaneous supraorbital nerve stimulation. There is preliminary evidence that a ketogenic diet may help prevent episodic and long-term migraine. While no definitive proof has been found linking migraine to gender, statistical data indicates that women may be more prone to having migraines, showing migraine incidence three times higher among women than men Migraine Migraine",
        "response": "The reasons behind the higher incidence of migraines in women are still not definitively known."
    },
    {
        "dialog": [
            "Hey Medi, I just had a transcranial magnetic stimulation session for my migraines.",
            "That's great! How are you feeling after the session?",
            "I'm experiencing some mild discomfort, but I'm hopeful it will provide relief in the long run.",
            "It's normal to experience mild discomfort. Remember to follow any post-treatment instructions given to you.",
            "Will there be any lifestyle changes I should consider after this treatment?",
            "It's always beneficial to maintain a healthy lifestyle by managing stress, getting enough sleep, and staying hydrated.",
            "I'll keep that in mind. Are there any specific dietary recommendations for migraines?",
            "There is preliminary evidence that a ketogenic diet may help prevent episodic and long-term migraines.",
            "How does a ketogenic diet help in preventing migraines?"
        ],
        "knowledge": "Migraine Migraine In the United States, direct costs have been estimated at $17 billion, while indirect costs – such as missed or decreased ability to work – are estimated at $15 billion. Nearly a tenth of the direct cost is due to the cost of triptans. In those who do attend work during a migraine attack, effectiveness is decreased by around a third. Negative impacts also frequently occur for a person's family. Transcranial magnetic stimulation shows promise, as does transcutaneous supraorbital nerve stimulation. There is preliminary evidence that a ketogenic diet may help prevent episodic and long-term migraines. While no definitive proof has been found linking migraine to gender, statistical data indicates that women may be more prone to having migraines, showing migraine incidence three times higher among women than men Migraine Migraine",
        "response": "The exact mechanism behind how a ketogenic diet helps prevent migraines is still being studied."
    },
    {
        "dialog": [
            "Hi Medi, I recently underwent a medical procedure for my migraines.",
            "I hope the procedure went well. How are you feeling post-procedure?",
            "I'm feeling a bit tired and weak, but the doctor said it's normal during the recovery period.",
            "Resting and allowing your body to heal is important after a medical procedure. Take it easy.",
            "Are there any specific lifestyle changes I should make to support my recovery?",
            "It's advisable to get regular exercise, maintain a balanced diet, and manage stress for overall well-being.",
            "Thank you for the advice. How about my diet? Are there any restrictions?",
            "Avoiding triggers like caffeine, alcohol, and certain food additives may help prevent migraines.",
            "Are there any other precautions I should take post-procedure?"
        ],
        "knowledge": "Migraine Migraine In the United States, direct costs have been estimated at $17 billion, while indirect costs – such as missed or decreased ability to work – are estimated at $15 billion. Nearly a tenth of the direct cost is due to the cost of triptans. In those who do attend work during a migraine attack, effectiveness is decreased by around a third. Negative impacts also frequently occur for a person's family. Transcranial magnetic stimulation shows promise, as does transcutaneous supraorbital nerve stimulation. There is preliminary evidence that a ketogenic diet may help prevent episodic and long-term migraines. While no definitive proof has been found linking migraine to gender, statistical data indicates that women may be more prone to having migraines, showing migraine incidence three times higher among women than men Migraine Migraine",
        "response": "Be sure to follow any post-procedure instructions given by your doctor for a smooth recovery."
    },
    {
        "dialog": [
            "Hi Medi, I've been experiencing frequent migraines lately. Can you help me?",
            "Of course! I'll do my best to assist you. Can you describe your migraines in more detail?",
            "The migraines usually start with a throbbing pain on one side of my head, accompanied by nausea and sensitivity to light and sound.",
            "I see. How long do these migraines usually last?",
            "They typically last for several hours, sometimes even a whole day.",
            "I understand how debilitating that can be. Have you tried any treatments or remedies?",
            "I've taken over-the-counter pain relievers, but they don't seem to provide much relief.",
            "I recommend you consult a healthcare professional for a proper diagnosis and personalized treatment plan.",
            "What are some possible treatment options for migraines?"
        ],
        "knowledge": "Migraine Migraine In the United States, direct costs have been estimated at $17 billion, while indirect costs – such as missed or decreased ability to work – is estimated at $15 billion. Nearly a tenth of the direct cost is due to the cost of triptans. In those who do attend work during a migraine attack, effectiveness is decreased by around a third. Negative impacts also frequently occur for a person's family. Transcranial magnetic stimulation shows promise, as does transcutaneous supraorbital nerve stimulation. There is preliminary evidence that a ketogenic diet may help prevent episodic and long-term migraine. While no definitive proof has been found linking migraine to gender, statistical data indicates that women may be more prone to having migraines, showing migraine incidence three times higher among women than men Migraine Migraine",
        "response": "Treatment options for migraines may include medications such as triptans, nonsteroidal anti-inflammatory drugs (NSAIDs), or preventive medications. Non-medical approaches like stress management, relaxation techniques, and avoiding triggers can also be helpful."
    },
    {
        "dialog": [
            "Hello Medi, I've been experiencing migraines frequently. Are there any lifestyle changes that can help prevent them?",
            "Certainly! Making certain lifestyle changes can potentially help reduce the frequency of migraines. Can you tell me about your current lifestyle?",
            "I work long hours in front of a computer and don't get much physical activity. My sleep schedule is also irregular.",
            "I see. It's important to prioritize self-care. Consider taking regular breaks from screen time, engaging in physical exercise, and establishing a consistent sleep routine.",
            "That sounds doable. Are there any dietary recommendations for preventing migraines?",
            "Some people have found that following a ketogenic diet, which is low in carbohydrates and high in healthy fats, can help prevent migraines. It's worth discussing with a healthcare professional.",
            "I'll look into that. Thank you for your advice, Medi!",
            "You're welcome! I hope these lifestyle changes bring you some relief. If you have any more questions, feel free to ask.",
            "Is there any evidence linking migraines to gender?"
        ],
        "knowledge": "Migraine Migraine In the United States, direct costs have been estimated at $17 billion, while indirect costs – such as missed or decreased ability to work – is estimated at $15 billion. Nearly a tenth of the direct cost is due to the cost of triptans. In those who do attend work during a migraine attack, effectiveness is decreased by around a third. Negative impacts also frequently occur for a person's family. Transcranial magnetic stimulation shows promise, as does transcutaneous supraorbital nerve stimulation. There is preliminary evidence that a ketogenic diet may help prevent episodic and long-term migraine. While no definitive proof has been found linking migraine to gender, statistical data indicates that women may be more prone to having migraines, showing migraine incidence three times higher among women than men Migraine Migraine",
        "response": "While no definitive proof has been found linking migraines to gender, statistical data suggests that women may be more prone to having migraines, with migraine incidence three times higher among women than men."
    },
    {
        "dialog": [
            "Hi Medi, I recently underwent a procedure to treat my migraines. Do you have any advice for my post-procedure recovery?",
            "Certainly! I'm here to assist you. Can you provide more details about the procedure you underwent?",
            "I had transcutaneous supraorbital nerve stimulation. It's a non-invasive procedure that uses electrical impulses to alleviate migraine pain.",
            "That's great! After the procedure, it's important to take it easy and allow your body to recover. Avoid strenuous physical activities for a few days.",
            "Will there be any dietary restrictions after the procedure?",
            "In most cases, there are no specific dietary restrictions after transcutaneous supraorbital nerve stimulation. However, it's always a good idea to follow a balanced diet for overall health.",
            "I'll make sure to take care of myself. Thank you, Medi!",
            "You're welcome! If you have any concerns during your recovery, don't hesitate to reach out. Take care!",
            "Is transcranial magnetic stimulation also an effective treatment for migraines?"
        ],
        "knowledge": "Migraine Migraine In the United States, direct costs have been estimated at $17 billion, while indirect costs – such as missed or decreased ability to work – is estimated at $15 billion. Nearly a tenth of the direct cost is due to the cost of triptans. In those who do attend work during a migraine attack, effectiveness is decreased by around a third. Negative impacts also frequently occur for a person's family. Transcranial magnetic stimulation shows promise, as does transcutaneous supraorbital nerve stimulation. There is preliminary evidence that a ketogenic diet may help prevent episodic and long-term migraine. While no definitive proof has been found linking migraine to gender, statistical data indicates that women may be more prone to having migraines, showing migraine incidence three times higher among women than men Migraine Migraine",
        "response": "Yes, transcranial magnetic stimulation has shown promise as a treatment for migraines. It uses magnetic fields to stimulate specific areas of the brain associated with migraines."
    },
    {
        "dialog": [
            "Hi Medi, I've been experiencing frequent migraines lately.",
            "I'm here to help. Can you describe your migraine symptoms?",
            "I usually have throbbing pain on one side of my head, along with nausea.",
            "Based on your symptoms, it seems like you're experiencing migraines. Have you tried any treatments?",
            "I've tried over-the-counter pain relievers, but they don't provide much relief.",
            "If over-the-counter medications aren't effective, I recommend considering prescription triptans for migraines.",
            "Are there any potential side effects of triptans?",
            "Common side effects of triptans include dizziness, drowsiness, and nausea. It's best to consult with your doctor.",
            "Is there anything I can do to prevent migraines from occurring?"
        ],
        "knowledge": "Migraine Migraine In the United States, direct costs have been estimated at $17 billion, while indirect costs – such as missed or decreased ability to work – are estimated at $15 billion. Nearly a tenth of the direct cost is due to the cost of triptans. In those who do attend work during a migraine attack, effectiveness is decreased by around a third. Negative impacts also frequently occur for a person's family. Transcranial magnetic stimulation shows promise, as does transcutaneous supraorbital nerve stimulation. There is preliminary evidence that a ketogenic diet may help prevent episodic and long-term migraine. While no definitive proof has been found linking migraine to gender, statistical data indicates that women may be more prone to having migraines, showing migraine incidence three times higher among women than men Migraine Migraine",
        "response": "Lifestyle changes can help prevent migraines. Avoiding triggers like stress, certain foods, and irregular sleep patterns may be beneficial."
    },
    {
        "dialog": [
            "Hello Medi, I have a question about migraines. Are they more common in women?",
            "Yes, statistical data suggests that migraines are more prevalent among women compared to men.",
            "Is there a specific reason why women are more prone to migraines?",
            "There's no definitive proof, but hormonal factors and genetic predisposition may contribute to the higher incidence in women.",
            "I see. Thank you for the explanation, Medi. Can migraines be hereditary?",
            "Yes, there is a genetic component to migraines. If a family member has migraines, you may have an increased risk.",
            "That's good to know. Is there any non-medication-based treatment for migraines?",
            "Yes, alternative treatments like transcranial magnetic stimulation and transcutaneous supraorbital nerve stimulation have shown promise.",
            "Do these alternative treatments have any side effects?"
        ],
        "knowledge": "Migraine Migraine In the United States, direct costs have been estimated at $17 billion, while indirect costs – such as missed or decreased ability to work – are estimated at $15 billion. Nearly a tenth of the direct cost is due to the cost of triptans. In those who do attend work during a migraine attack, effectiveness is decreased by around a third. Negative impacts also frequently occur for a person's family. Transcranial magnetic stimulation shows promise, as does transcutaneous supraorbital nerve stimulation. There is preliminary evidence that a ketogenic diet may help prevent episodic and long-term migraine. While no definitive proof has been found linking migraine to gender, statistical data indicates that women may be more prone to having migraines, showing migraine incidence three times higher among women than men Migraine Migraine",
        "response": "Alternative treatments for migraines generally have minimal side effects, but it's best to consult with a healthcare professional for personalized advice."
    },
    {
        "dialog": [
            "Hi Medi, I recently had a migraine and it affected my work productivity. Any suggestions?",
            "During a migraine attack, it's common for work effectiveness to decrease. Taking breaks and managing stress can help.",
            "That makes sense. Is there anything I can do to prevent migraines in the long term?",
            "Maintaining a healthy lifestyle is crucial. Regular exercise, a balanced diet, and adequate sleep can help prevent migraines.",
            "I've heard about the ketogenic diet. Can it be beneficial for preventing migraines?",
            "Yes, there is preliminary evidence that a ketogenic diet may help prevent both episodic and long-term migraines.",
            "Are there any specific foods I should include or avoid in a ketogenic diet for migraines?",
            "A ketogenic diet typically involves high fat, low carbohydrate foods. It's best to consult with a nutritionist for personalized guidance.",
            "Thank you, Medi. One last question: Can migraines have a significant impact on a person's family?"
        ],
        "knowledge": "Migraine Migraine In the United States, direct costs have been estimated at $17 billion, while indirect costs – such as missed or decreased ability to work – are estimated at $15 billion. Nearly a tenth of the direct cost is due to the cost of triptans. In those who do attend work during a migraine attack, effectiveness is decreased by around a third. Negative impacts also frequently occur for a person's family. Transcranial magnetic stimulation shows promise, as does transcutaneous supraorbital nerve stimulation. There is preliminary evidence that a ketogenic diet may help prevent episodic and long-term migraine. While no definitive proof has been found linking migraine to gender, statistical data indicates that women may be more prone to having migraines, showing migraine incidence three times higher among women than men Migraine Migraine",
        "response": "Yes, migraines can have negative impacts on a person's family, as the condition often requires understanding and support from loved ones."
    },
    {
        "dialog": [
            "Hello Medi, I have been experiencing frequent migraines lately.",
            "I'm here to help. Can you tell me more about your symptoms?",
            "I get throbbing headaches on one side of my head, along with nausea and sensitivity to light.",
            "Based on your symptoms, it's likely you're experiencing migraines. They can be quite debilitating.",
            "Is there anything I can do to prevent migraines or reduce their frequency?",
            "There are some lifestyle changes that may help, such as maintaining a regular sleep schedule and managing stress levels.",
            "I'll try incorporating those changes. By the way, can migraines be hereditary?",
            "While there's no definitive proof, statistical data suggests that women are more prone to migraines than men.",
            "Is there any specific treatment I should consider?"
        ],
        "knowledge": "Migraine Migraine In the United States, direct costs have been estimated at $17 billion, while indirect costs – such as missed or decreased ability to work – is estimated at $15 billion. Nearly a tenth of the direct cost is due to the cost of triptans. In those who do attend work during a migraine attack, effectiveness is decreased by around a third. Negative impacts also frequently occur for a person's family. Transcranial magnetic stimulation shows promise, as does transcutaneous supraorbital nerve stimulation. There is preliminary evidence that a ketogenic diet may help prevent episodic and long-term migraine. While no definitive proof has been found linking migraine to gender, statistical data indicates that women may be more prone to having migraine, showing migraine incidence three times higher among women than men Migraine Migraine",
        "response": "Treatment options for migraines include over-the-counter pain relievers and prescription medications. It's best to consult with a healthcare professional for personalized advice."
    },
    {
        "dialog": [
            "Hi Medi, I've been following a ketogenic diet to help manage my migraines.",
            "That's interesting. How has the diet been working for you?",
            "I've noticed a reduction in the frequency and intensity of my migraines since starting the diet.",
            "That's great to hear. The ketogenic diet has shown promise in preventing migraines.",
            "Are there any other lifestyle changes I can make to complement the diet?",
            "Regular exercise, stress management techniques, and getting enough sleep can all contribute to migraine prevention.",
            "I'll make sure to incorporate those changes into my routine. Thank you, Medi.",
            "You're welcome! I'm glad I could help. If you have any more questions, feel free to ask.",
            "Is there any particular type of exercise that's more beneficial for migraine prevention?"
        ],
        "knowledge": "Migraine Migraine In the United States, direct costs have been estimated at $17 billion, while indirect costs – such as missed or decreased ability to work – is estimated at $15 billion. Nearly a tenth of the direct cost is due to the cost of triptans. In those who do attend work during a migraine attack, effectiveness is decreased by around a third. Negative impacts also frequently occur for a person's family. Transcranial magnetic stimulation shows promise, as does transcutaneous supraorbital nerve stimulation. There is preliminary evidence that a ketogenic diet may help prevent episodic and long-term migraine. While no definitive proof has been found linking migraine to gender, statistical data indicates that women may be more prone to having migraine, showing migraine incidence three times higher among women than men Migraine Migraine",
        "response": "Any form of aerobic exercise, such as brisk walking, swimming, or cycling, can be beneficial for migraine prevention."
    },
    {
        "dialog": [
            "Hello Medi, I recently underwent transcranial magnetic stimulation for my migraines.",
            "That's an interesting treatment option. How has it been working for you?",
            "I've noticed a significant reduction in the frequency and severity of my migraines since starting the treatment.",
            "That's great to hear. Transcranial magnetic stimulation has shown promise in managing migraines.",
            "Are there any specific lifestyle changes I should consider after the procedure?",
            "Maintaining a healthy lifestyle with regular exercise, adequate sleep, and stress management can complement the treatment.",
            "I'll be sure to follow those recommendations. Thank you for your guidance, Medi.",
            "You're welcome! If you have any more questions or need further assistance, feel free to ask.",
            "Is transcranial magnetic stimulation suitable for all migraine sufferers?"
        ],
        "knowledge": "Migraine Migraine In the United States, direct costs have been estimated at $17 billion, while indirect costs – such as missed or decreased ability to work – is estimated at $15 billion. Nearly a tenth of the direct cost is due to the cost of triptans. In those who do attend work during a migraine attack, effectiveness is decreased by around a third. Negative impacts also frequently occur for a person's family. Transcranial magnetic stimulation shows promise, as does transcutaneous supraorbital nerve stimulation. There is preliminary evidence that a ketogenic diet may help prevent episodic and long-term migraine. While no definitive proof has been found linking migraine to gender, statistical data indicates that women may be more prone to having migraine, showing migraine incidence three times higher among women than men Migraine Migraine",
        "response": "Transcranial magnetic stimulation can be a suitable option for many migraine sufferers, but it's best to consult with a healthcare professional to determine if it's appropriate for your specific condition."
    }
]