[
    {
        "dialog": [
            "Hello Medi, I'm experiencing a terrible headache",
            "I'm sorry to hear that, can you give me more details about your headache?",
            "It's a throbbing pain and I feel like my head is about to explode",
            "Do you have any other symptoms?",
            "Yes, I also have a fever and a stiff neck",
            "Based on your symptoms, it's possible that you have encephalitis",
            "What is encephalitis?",
            "Encephalitis is an inflammation of the brain usually caused by a viral infection",
            "What should I do next, Medi?"
        ],
        "knowledge": "Encephalitis Encephalitis  Other causes of acute viral encephalitis are rabies virus, poliovirus, and measles virus. Additional possible viral causes are arboviral flavivirus , bunyavirus , arenavirus , reovirus , and henipavirus infections.  The Powassan virus is a rare cause of encephalitis. It can be caused by a bacterial infection, such as bacterial meningitis, or may be a complication of a current infectious disease syphilis . Certain parasitic or protozoal infestations, such as toxoplasmosis, malaria, or primary amoebic meningoencephalitis, can also cause encephalitis in people with compromised immune systems.  Lyme disease or Bartonella henselae may also cause encephalitis. Other bacterial pathogens, like Mycoplasma and those causing rickettsial disease, cause inflammation of the meninges and consequently encephalitis Encephalitis Encephalitis",
        "response": "You should go see a doctor as soon as possible. They will do tests to confirm the diagnosis and provide treatment."
    },
    {
        "dialog": [
            "Hi Medi, I'd like to know more about encephalitis",
            "Sure, what would you like to know?",
            "What are the symptoms of encephalitis?",
            "The symptoms of encephalitis can vary, but common symptoms include fever, headache, confusion, and seizures",
            "What are the causes of encephalitis?",
            "Encephalitis is usually caused by a viral infection, but it can also be caused by bacterial or fungal infections",
            "Is encephalitis contagious?",
            "It depends on the cause of the encephalitis. Some viral causes, such as herpes simplex virus, can be contagious.",
            "Is there a vaccine for encephalitis?"
        ],
        "knowledge": "Encephalitis Encephalitis  Other causes of acute viral encephalitis are rabies virus, poliovirus, and measles virus. Additional possible viral causes are arboviral flavivirus , bunyavirus , arenavirus , reovirus , and henipavirus infections.  The Powassan virus is a rare cause of encephalitis. It can be caused by a bacterial infection, such as bacterial meningitis, or may be a complication of a current infectious disease syphilis . Certain parasitic or protozoal infestations, such as toxoplasmosis, malaria, or primary amoebic meningoencephalitis, can also cause encephalitis in people with compromised immune systems.  Lyme disease or Bartonella henselae may also cause encephalitis. Other bacterial pathogens, like Mycoplasma and those causing rickettsial disease, cause inflammation of the meninges and consequently encephalitis Encephalitis Encephalitis",
        "response": "There are vaccines for some viral causes of encephalitis, such as Japanese encephalitis and tick-borne encephalitis. However, there is no vaccine for all causes of encephalitis."
    },
    {
        "dialog": [
            "Hi Medi, I just had a lumbar puncture done",
            "How are you feeling?",
            "Not great, I have a headache and my back hurts",
            "It's common to have a headache after a lumbar puncture. You should drink plenty of fluids and rest.",
            "What should I eat after a lumbar puncture?",
            "It's best to stick to light meals and avoid fatty or spicy foods. You should also avoid caffeine and alcohol.",
            "Can I exercise after a lumbar puncture?",
            "You should avoid strenuous exercise for a few days after a lumbar puncture, but light exercise such as walking is fine.",
            "When can I take a shower after a lumbar puncture?"
        ],
        "knowledge": "Lumbar Puncture Lumbar Puncture  A lumbar puncture is a medical procedure where a needle is inserted into the lower back to collect cerebrospinal fluid.  It is used to diagnose and treat conditions such as meningitis and multiple sclerosis.  Complications can include headaches, infection, bleeding, and nerve damage.  To prevent headaches, it is recommended to drink plenty of fluids and rest.  Patients should also avoid strenuous exercise for a few days after the procedure.  Light exercise such as walking is fine.  Patients should stick to light meals and avoid fatty or spicy foods.  They should also avoid caffeine and alcohol.  Patients can usually shower after 24 hours Lumbar Puncture Lumbar Puncture",
        "response": "You can usually shower after 24 hours. However, you should avoid hot water and scrubbing the site where the needle was inserted. It's best to use mild soap and pat the area dry."
    },
    {
        "dialog": [
            "Hi Medi, I think I might have encephalitis. What should I do?",
            "Hello, can you please tell me your symptoms?",
            "I have severe headaches, fever, and confusion.",
            "Based on your symptoms, it is important that you seek medical attention immediately.",
            "What are the possible causes of encephalitis?",
            "Viral infections such as rabies virus, poliovirus, and measles virus can cause encephalitis, as well as bacterial infections like bacterial meningitis.",
            "How is encephalitis treated?",
            "Treatment depends on the underlying cause of the encephalitis and may include antiviral or antibiotic medication, hospitalization, and supportive care.",
            "Thank you for your help, Medi."
        ],
        "knowledge": "Encephalitis Encephalitis  Other causes of acute viral encephalitis are rabies virus, poliovirus, and measles virus. Additional possible viral causes are arboviral flavivirus , bunyavirus , arenavirus , reovirus , and henipavirus infections.  The Powassan virus is a rare cause of encephalitis. It can be caused by a bacterial infection, such as bacterial meningitis, or may be a complication of a current infectious disease syphilis . Certain parasitic or protozoal infestations, such as toxoplasmosis, malaria, or primary amoebic meningoencephalitis, can also cause encephalitis in people with compromised immune systems.  Lyme disease or Bartonella henselae may also cause encephalitis. Other bacterial pathogens, like Mycoplasma and those causing rickettsial disease, cause inflammation of the meninges and consequently encephalitis Encephalitis Encephalitis",
        "response": "You're welcome. I recommend that you seek medical attention immediately if you suspect encephalitis."
    },
    {
        "dialog": [
            "Hello Medi, I have some questions about encephalitis.",
            "Of course, what would you like to know?",
            "What are the early signs and symptoms of encephalitis?",
            "The early signs and symptoms of encephalitis include fever, headache, vomiting, stiff neck, and sensitivity to light.",
            "Is there any way to prevent encephalitis?",
            "Prevention methods include avoiding exposure to mosquitoes and ticks, practicing good hygiene, and keeping up to date with vaccines.",
            "Are there any long-term effects of encephalitis?",
            "Some people may experience long-term effects such as memory loss, personality changes, and seizures.",
            "Thank you for your help, Medi."
        ],
        "knowledge": "Encephalitis Encephalitis  Other causes of acute viral encephalitis are rabies virus, poliovirus, and measles virus. Additional possible viral causes are arboviral flavivirus , bunyavirus , arenavirus , reovirus , and henipavirus infections.  The Powassan virus is a rare cause of encephalitis. It can be caused by a bacterial infection, such as bacterial meningitis, or may be a complication of a current infectious disease syphilis . Certain parasitic or protozoal infestations, such as toxoplasmosis, malaria, or primary amoebic meningoencephalitis, can also cause encephalitis in people with compromised immune systems.  Lyme disease or Bartonella henselae may also cause encephalitis. Other bacterial pathogens, like Mycoplasma and those causing rickettsial disease, cause inflammation of the meninges and consequently encephalitis Encephalitis Encephalitis",
        "response": "You're welcome. If you have any more questions, feel free to ask."
    },
    {
        "dialog": [
            "Hi Medi, I just had a medical procedure. What should I do now?",
            "Hello, it's important that you follow your doctor's recommendations for aftercare.",
            "Are there any lifestyle changes I should make?",
            "It depends on the procedure you had. In general, it's important to rest, stay hydrated, and eat a healthy diet.",
            "What about physical activity?",
            "Again, it depends on the procedure you had. Your doctor will let you know when it's safe to resume physical activity.",
            "What about my diet?",
            "A healthy diet is always important, but it's especially important after a medical procedure. Be sure to eat plenty of fruits and vegetables, lean proteins, and whole grains.",
            "Thank you for your help, Medi."
        ],
        "knowledge": "Encephalitis Encephalitis  Other causes of acute viral encephalitis are rabies virus, poliovirus, and measles virus. Additional possible viral causes are arboviral flavivirus , bunyavirus , arenavirus , reovirus , and henipavirus infections.  The Powassan virus is a rare cause of encephalitis. It can be caused by a bacterial infection, such as bacterial meningitis, or may be a complication of a current infectious disease syphilis . Certain parasitic or protozoal infestations, such as toxoplasmosis, malaria, or primary amoebic meningoencephalitis, can also cause encephalitis in people with compromised immune systems.  Lyme disease or Bartonella henselae may also cause encephalitis. Other bacterial pathogens, like Mycoplasma and those causing rickettsial disease, cause inflammation of the meninges and consequently encephalitis Encephalitis Encephalitis",
        "response": "You're welcome. Be sure to follow your doctor's recommendations for aftercare to ensure a full and speedy recovery."
    },
    {
        "dialog": [
            "Hi Medi, I have a headache and I don't know what to do.",
            "Hello there! Can you tell me how long you've had this headache?",
            "I've had it for the whole day and it's getting worse.",
            "Okay, have you taken any painkillers yet?",
            "Yes, I took some paracetamol but it didn't help.",
            "I see. It's possible that it could be a migraine. Do you have any other symptoms?",
            "Yes, I feel nauseous and my vision is blurred.",
            "Based on your symptoms, it's likely that you have a migraine. I recommend resting in a quiet, dark room and avoiding bright lights and loud noises.",
            "Thank you, Medi. What should I do if it doesn't go away?"
        ],
        "knowledge": "Migraine Migraine A migraine is a type of headache that can cause severe pain, throbbing, and sensitivity to light and sound.  It can also cause nausea and vomiting.  Migraines can last for hours, days, or even weeks.  Some people may experience an aura before the migraine starts.  This can include visual disturbances like flashing lights or zigzag lines.  Certain foods, stress, and hormonal changes can trigger migraines.  Treatment options include over-the-counter pain medications, prescription medications, and lifestyle changes like stress reduction and dietary changes.  If migraines are frequent or severe, it's important to see a doctor.  They may recommend preventive medications or other treatments to manage the condition. Migraine Migraine",
        "response": "If the migraine persists, I suggest seeing a doctor for further evaluation and treatment options."
    },
    {
        "dialog": [
            "Hi Medi, can you tell me more about encephalitis?",
            "Of course! Encephalitis is an inflammation of the brain caused by a viral or bacterial infection.",
            "What are some of the symptoms of encephalitis?",
            "Symptoms can include fever, headache, confusion, seizures, and loss of consciousness.",
            "What are some of the causes of encephalitis?",
            "Some possible viral causes include the rabies virus, poliovirus, and measles virus. Bacterial infections like bacterial meningitis can also cause encephalitis. Certain parasitic or protozoal infections can also cause encephalitis in people with compromised immune systems.",
            "Is there anything I can do to prevent encephalitis?",
            "Prevention methods include practicing good hygiene, getting vaccinated for certain viral infections, and avoiding contact with infected individuals or animals.",
            "Thank you for the information, Medi. What should I do if I suspect that I have encephalitis?"
        ],
        "knowledge": "Encephalitis Encephalitis  Other causes of acute viral encephalitis are rabies virus, poliovirus, and measles virus. Additional possible viral causes are arboviral flavivirus , bunyavirus , arenavirus , reovirus , and henipavirus infections.  The Powassan virus is a rare cause of encephalitis. It can be caused by a bacterial infection, such as bacterial meningitis, or may be a complication of a current infectious disease syphilis . Certain parasitic or protozoal infestations, such as toxoplasmosis, malaria, or primary amoebic meningoencephalitis, can also cause encephalitis in people with compromised immune systems.  Lyme disease or Bartonella henselae may also cause encephalitis. Other bacterial pathogens, like Mycoplasma and those causing rickettsial disease, cause inflammation of the meninges and consequently encephalitis Encephalitis Encephalitis",
        "response": "If you suspect you have encephalitis, seek medical attention immediately. Treatment for encephalitis depends on the cause and severity of the infection and may include antiviral or antibacterial medications."
    },
    {
        "dialog": [
            "Hi Medi, I just had a medical procedure and I'm not sure what I can and can't do now.",
            "Hello! Can you tell me what procedure you had?",
            "I had surgery on my knee and I'm not sure what I should be doing now.",
            "After knee surgery, it's important to rest and avoid putting weight on the affected knee for a few days.",
            "How long do I have to avoid putting weight on my knee?",
            "It depends on the type of surgery you had, but typically it's recommended to keep weight off the knee for at least a few days to a week.",
            "Are there any exercises or physical therapy I can do to help with my recovery?",
            "Yes, once your doctor approves it, you can start doing exercises to strengthen the muscles around your knee and improve range of motion.",
            "Thank you, Medi. What else should I be doing to aid in my recovery?"
        ],
        "knowledge": "Knee Surgery Knee Surgery After knee surgery, it's important to rest and avoid putting weight on the affected knee for a few days.  Physical therapy is usually recommended to help strengthen the muscles around the knee and improve range of motion.  It's important to follow your doctor's instructions for recovery and to avoid doing anything that could reinjure the knee.  This may include avoiding certain activities or movements and wearing a brace or using crutches for support.  Pain medication may also be prescribed to manage pain during the recovery period.",
        "response": "In addition to physical therapy, it's important to follow your doctor's instructions for recovery and avoid activities that could reinjure the knee. Pain medication may also be prescribed to manage pain during the recovery period."
    },
    {
        "dialog": [
            "Hello Medi, I am experiencing a severe headache",
            "Hello, Please describe the symptoms and how long you have been experiencing them",
            "I have been experiencing a headache for several days now, and it's been getting worse.",
            "Based on your symptoms, you might be suffering from encephalitis",
            "What is encephalitis?",
            "It is an inflammation of the brain caused by viruses or bacteria",
            "How can I treat it?",
            "It depends on the cause of encephalitis, but most cases are treated with antiviral medication or antibiotics",
            "Thank you, Medi. What are the possible causes of encephalitis?"
        ],
        "knowledge": "Encephalitis Encephalitis  Other causes of acute viral encephalitis are rabies virus, poliovirus, and measles virus. Additional possible viral causes are arboviral flavivirus , bunyavirus , arenavirus , reovirus , and henipavirus infections.  The Powassan virus is a rare cause of encephalitis. It can be caused by a bacterial infection, such as bacterial meningitis, or may be a complication of a current infectious disease syphilis . Certain parasitic or protozoal infestations, such as toxoplasmosis, malaria, or primary amoebic meningoencephalitis, can also cause encephalitis in people with compromised immune systems.  Lyme disease or Bartonella henselae may also cause encephalitis. Other bacterial pathogens, like Mycoplasma and those causing rickettsial disease, cause inflammation of the meninges and consequently encephalitis Encephalitis Encephalitis",
        "response": "Encephalitis can be caused by viruses or bacteria, including the rabies virus, poliovirus, and measles virus. It can also be caused by bacterial infections such as bacterial meningitis, Lyme disease or Bartonella henselae, and certain parasitic or protozoal infestations."
    },
    {
        "dialog": [
            "Hi, Medi. What is encephalitis?",
            "Encephalitis is an inflammation of the brain caused by viruses or bacteria",
            "What are the symptoms of encephalitis?",
            "The symptoms of encephalitis can include fever, headache, confusion, seizures, and paralysis",
            "How is encephalitis diagnosed?",
            "Encephalitis is diagnosed using imaging tests, such as CT and MRI scans, as well as laboratory tests to identify the virus or bacteria causing the inflammation",
            "Thanks, Medi. Can you tell me more about the treatment for encephalitis?",
            "The treatment for encephalitis depends on the cause of the inflammation. Most cases are treated with antiviral medication or antibiotics",
            "What are the long-term effects of encephalitis?"
        ],
        "knowledge": "Encephalitis Encephalitis  Other causes of acute viral encephalitis are rabies virus, poliovirus, and measles virus. Additional possible viral causes are arboviral flavivirus , bunyavirus , arenavirus , reovirus , and henipavirus infections.  The Powassan virus is a rare cause of encephalitis. It can be caused by a bacterial infection, such as bacterial meningitis, or may be a complication of a current infectious disease syphilis . Certain parasitic or protozoal infestations, such as toxoplasmosis, malaria, or primary amoebic meningoencephalitis, can also cause encephalitis in people with compromised immune systems.  Lyme disease or Bartonella henselae may also cause encephalitis. Other bacterial pathogens, like Mycoplasma and those causing rickettsial disease, cause inflammation of the meninges and consequently encephalitis Encephalitis Encephalitis",
        "response": "The long-term effects of encephalitis depend on the severity of the inflammation and the parts of the brain affected. Some people may experience long-term neurological problems, such as seizures, memory problems, or personality changes."
    },
    {
        "dialog": [
            "Hi Medi, I am recovering from encephalitis. What lifestyle changes should I make?",
            "Hello, it's good to hear that you're recovering. You should eat a healthy diet and get regular exercise",
            "Can you be more specific?",
            "A healthy diet can include foods that are high in antioxidants and nutrients, such as fruits, vegetables, whole grains, and lean protein. You should also avoid processed foods and sugary drinks. Regular exercise can include activities such as walking, biking, or swimming",
            "How long should I wait before I can exercise?",
            "You should wait until your doctor clears you for physical activity. Once you have been cleared, you can start with low-impact exercises and gradually increase the intensity",
            "What are the possible complications of encephalitis?",
            "The complications of encephalitis can include seizures, memory problems, personality changes, and long-term neurological problems",
            "Thanks, Medi. What can I do to prevent encephalitis?"
        ],
        "knowledge": "Encephalitis Encephalitis  Other causes of acute viral encephalitis are rabies virus, poliovirus, and measles virus. Additional possible viral causes are arboviral flavivirus , bunyavirus , arenavirus , reovirus , and henipavirus infections.  The Powassan virus is a rare cause of encephalitis. It can be caused by a bacterial infection, such as bacterial meningitis, or may be a complication of a current infectious disease syphilis . Certain parasitic or protozoal infestations, such as toxoplasmosis, malaria, or primary amoebic meningoencephalitis, can also cause encephalitis in people with compromised immune systems.  Lyme disease or Bartonella henselae may also cause encephalitis. Other bacterial pathogens, like Mycoplasma and those causing rickettsial disease, cause inflammation of the meninges and consequently encephalitis Encephalitis Encephalitis",
        "response": "You can prevent encephalitis by practicing good hygiene, such as washing your hands regularly, and avoiding contact with people who have viral or bacterial infections. You can also get vaccinated against some of the viruses that can cause encephalitis, such as the measles virus and herpes simplex virus."
    },
    {
        "dialog": [
            "Hello, Medi. I feel extremely fatigued and have a high temperature.",
            "Hi there. Can you tell me more about the symptoms?",
            "I have a headache, joint pain, and muscle ache.",
            "Based on your symptoms, you might have viral encephalitis.",
            "What is viral encephalitis?",
            "It's an inflammation of the brain caused by a viral infection.",
            "What are the common causes of viral encephalitis?",
            "Common causes are rabies, poliovirus, measles virus, and arboviral flavivirus.",
            "What should I do now?"
        ],
        "knowledge": "Encephalitis Encephalitis  Other causes of acute viral encephalitis are rabies virus, poliovirus, and measles virus. Additional possible viral causes are arboviral flavivirus, bunyavirus, arenavirus, reovirus, and henipavirus infections. The Powassan virus is a rare cause of encephalitis. It can be caused by a bacterial infection, such as bacterial meningitis, or may be a complication of a current infectious disease syphilis. Certain parasitic or protozoal infestations, such as toxoplasmosis, malaria, or primary amoebic meningoencephalitis, can also cause encephalitis in people with compromised immune systems. Lyme disease or Bartonella henselae may also cause encephalitis. Other bacterial pathogens, like Mycoplasma and those causing rickettsial disease, cause inflammation of the meninges and consequently encephalitis Encephalitis Encephalitis",
        "response": "You should immediately see a doctor and get tested for viral encephalitis."
    },
    {
        "dialog": [
            "Hello, Medi. I was diagnosed with encephalitis. Can you give me some advice?",
            "I am sorry to hear that. What kind of encephalitis?",
            "The doctor said it's caused by a viral infection.",
            "What are your symptoms?",
            "I have a high fever, headache, and stiff neck.",
            "You should get plenty of rest and avoid stress.",
            "What should I eat?",
            "Consume a balanced diet with lots of fresh fruits and vegetables.",
            "What about physical exercise?"
        ],
        "knowledge": "Encephalitis Encephalitis  Other causes of acute viral encephalitis are rabies virus, poliovirus, and measles virus. Additional possible viral causes are arboviral flavivirus , bunyavirus , arenavirus , reovirus , and henipavirus infections.  The Powassan virus is a rare cause of encephalitis. It can be caused by a bacterial infection, such as bacterial meningitis, or may be a complication of a current infectious disease syphilis . Certain parasitic or protozoal infestations, such as toxoplasmosis, malaria, or primary amoebic meningoencephalitis, can also cause encephalitis in people with compromised immune systems.  Lyme disease or Bartonella henselae may also cause encephalitis. Other bacterial pathogens, like Mycoplasma and those causing rickettsial disease, cause inflammation of the meninges and consequently encephalitis Encephalitis Encephalitis",
        "response": "You should get plenty of rest and avoid stress. Consume a balanced diet with lots of fresh fruits and vegetables. Avoid strenuous physical activity and get plenty of rest."
    },
    {
        "dialog": [
            "Hello, Medi. I recently underwent surgery for encephalitis. What should I do now?",
            "Hi there. How are you feeling after the surgery?",
            "I am feeling much better. But I have some questions regarding my recovery.",
            "Of course. What are your questions?",
            "What kind of diet should I follow during my recovery?",
            "Consume a balanced diet with lots of fresh fruits and vegetables.",
            "Can I return to my normal physical activity?",
            "Not yet. Avoid strenuous physical activity and get plenty of rest.",
            "What else should I do?"
        ],
        "knowledge": "Encephalitis Encephalitis  Other causes of acute viral encephalitis are rabies virus, poliovirus, and measles virus. Additional possible viral causes are arboviral flavivirus , bunyavirus , arenavirus , reovirus , and henipavirus infections.  The Powassan virus is a rare cause of encephalitis. It can be caused by a bacterial infection, such as bacterial meningitis, or may be a complication of a current infectious disease syphilis . Certain parasitic or protozoal infestations, such as toxoplasmosis, malaria, or primary amoebic meningoencephalitis, can also cause encephalitis in people with compromised immune systems.  Lyme disease or Bartonella henselae may also cause encephalitis. Other bacterial pathogens, like Mycoplasma and those causing rickettsial disease, cause inflammation of the meninges and consequently encephalitis Encephalitis Encephalitis",
        "response": "Take your medication as prescribed by your doctor and attend all follow-up appointments. Consume a balanced diet with lots of fresh fruits and vegetables. Avoid strenuous physical activity and get plenty of rest."
    },
    {
        "dialog": [
            "Hi Medi, I think I might be suffering from encephalitis.",
            "Let me ask you some questions to help diagnose your symptoms.",
            "Okay, I feel very fatigued and have headaches frequently.",
            "Are you experiencing any confusion or disorientation?",
            "Yes, sometimes I feel like my mind is foggy.",
            "Based on your symptoms, it's possible that you have encephalitis. You should see a doctor immediately.",
            "What kind of test should I take to confirm if I have encephalitis?",
            "A lumbar puncture is commonly used to test for encephalitis.",
            "Thank you for your help, Medi."
        ],
        "knowledge": "Encephalitis Encephalitis  Other causes of acute viral encephalitis are rabies virus, poliovirus, and measles virus. Additional possible viral causes are arboviral flavivirus , bunyavirus , arenavirus , reovirus , and henipavirus infections.  The Powassan virus is a rare cause of encephalitis. It can be caused by a bacterial infection, such as bacterial meningitis, or may be a complication of a current infectious disease syphilis . Certain parasitic or protozoal infestations, such as toxoplasmosis, malaria, or primary amoebic meningoencephalitis, can also cause encephalitis in people with compromised immune systems.  Lyme disease or Bartonella henselae may also cause encephalitis. Other bacterial pathogens, like Mycoplasma and those causing rickettsial disease, cause inflammation of the meninges and consequently encephalitis Encephalitis Encephalitis",
        "response": "You should get tested for encephalitis through a lumbar puncture."
    },
    {
        "dialog": [
            "Hello Medi, I have a question about encephalitis.",
            "Sure, what can I help you with?",
            "Can encephalitis be treated?",
            "Yes, encephalitis can be treated. The specific treatment depends on the cause.",
            "Are there any ways to prevent encephalitis?",
            "Yes, the best way to prevent encephalitis is by avoiding mosquito and tick bites.",
            "Is there a vaccine for encephalitis?",
            "Yes, there are vaccines available for certain causes of encephalitis.",
            "Thank you for your help, Medi."
        ],
        "knowledge": "Encephalitis Encephalitis  Other causes of acute viral encephalitis are rabies virus, poliovirus, and measles virus. Additional possible viral causes are arboviral flavivirus , bunyavirus , arenavirus , reovirus , and henipavirus infections.  The Powassan virus is a rare cause of encephalitis. It can be caused by a bacterial infection, such as bacterial meningitis, or may be a complication of a current infectious disease syphilis . Certain parasitic or protozoal infestations, such as toxoplasmosis, malaria, or primary amoebic meningoencephalitis, can also cause encephalitis in people with compromised immune systems.  Lyme disease or Bartonella henselae may also cause encephalitis. Other bacterial pathogens, like Mycoplasma and those causing rickettsial disease, cause inflammation of the meninges and consequently encephalitis Encephalitis Encephalitis",
        "response": "Yes, encephalitis can be treated and the best way to prevent it is by avoiding mosquito and tick bites. There are also vaccines available for certain causes of encephalitis."
    },
    {
        "dialog": [
            "Hi Medi, I just had a lumbar puncture to test for encephalitis.",
            "How did it go?",
            "It went well, but now I'm wondering what I should do next.",
            "You should wait for the test results to come back. In the meantime, get plenty of rest and avoid stress.",
            "Are there any lifestyle changes I can make to avoid encephalitis in the future?",
            "Yes, the best way to prevent encephalitis is by avoiding mosquito and tick bites.",
            "Thank you for your help, Medi.",
            "You're welcome, take care of yourself."
        ],
        "knowledge": "Encephalitis Encephalitis  Other causes of acute viral encephalitis are rabies virus, poliovirus, and measles virus. Additional possible viral causes are arboviral flavivirus , bunyavirus , arenavirus , reovirus , and henipavirus infections.  The Powassan virus is a rare cause of encephalitis. It can be caused by a bacterial infection, such as bacterial meningitis, or may be a complication of a current infectious disease syphilis . Certain parasitic or protozoal infestations, such as toxoplasmosis, malaria, or primary amoebic meningoencephalitis, can also cause encephalitis in people with compromised immune systems.  Lyme disease or Bartonella henselae may also cause encephalitis. Other bacterial pathogens, like Mycoplasma and those causing rickettsial disease, cause inflammation of the meninges and consequently encephalitis Encephalitis Encephalitis",
        "response": "You should wait for your test results to come back, and in the meantime, focus on getting plenty of rest and avoiding stress. The best way to prevent encephalitis is by avoiding mosquito and tick bites."
    },
    {
        "dialog": [
            "Hi Medi, I have been feeling sick since yesterday.",
            "Hello, I'm here to help you. Can you please tell me about your symptoms?",
            "I have a high fever, headache, and my neck is stiff.",
            "You may have viral encephalitis. You should see a doctor immediately.",
            "Oh, that sounds serious. What causes it?",
            "It can be caused by viral, bacterial, or parasitic infections.",
            "How is it treated?",
            "Treatment depends on the cause. Antiviral, antibiotics, and supportive measures may be used.",
            "Okay, thank you for your advice, Medi."
        ],
        "knowledge": "Encephalitis Encephalitis  Other causes of acute viral encephalitis are rabies virus, poliovirus, and measles virus. Additional possible viral causes are arboviral flavivirus , bunyavirus , arenavirus , reovirus , and henipavirus infections.  The Powassan virus is a rare cause of encephalitis. It can be caused by a bacterial infection, such as bacterial meningitis, or may be a complication of a current infectious disease syphilis . Certain parasitic or protozoal infestations, such as toxoplasmosis, malaria, or primary amoebic meningoencephalitis, can also cause encephalitis in people with compromised immune systems.  Lyme disease or Bartonella henselae may also cause encephalitis. Other bacterial pathogens, like Mycoplasma and those causing rickettsial disease, cause inflammation of the meninges and consequently encephalitis Encephalitis Encephalitis",
        "response": "I advise you to see a doctor immediately as you may have viral encephalitis."
    },
    {
        "dialog": [
            "Hi Medi, I have a question about encephalitis.",
            "Hi, I'm here to help. What do you want to know?",
            "What is encephalitis and what are its symptoms?",
            "Encephalitis is an inflammation of the brain. Symptoms include fever, headache, confusion, seizures, and stiff neck.",
            "Can it be caused by a virus?",
            "Yes, viral infections are one of the main causes of encephalitis.",
            "Is it contagious?",
            "It depends on the cause. Some viruses that cause encephalitis, such as herpes simplex virus, can be transmitted through direct contact with infected individuals.",
            "Thanks for your help, Medi."
        ],
        "knowledge": "Encephalitis Encephalitis  Other causes of acute viral encephalitis are rabies virus, poliovirus, and measles virus. Additional possible viral causes are arboviral flavivirus , bunyavirus , arenavirus , reovirus , and henipavirus infections.  The Powassan virus is a rare cause of encephalitis. It can be caused by a bacterial infection, such as bacterial meningitis, or may be a complication of a current infectious disease syphilis . Certain parasitic or protozoal infestations, such as toxoplasmosis, malaria, or primary amoebic meningoencephalitis, can also cause encephalitis in people with compromised immune systems.  Lyme disease or Bartonella henselae may also cause encephalitis. Other bacterial pathogens, like Mycoplasma and those causing rickettsial disease, cause inflammation of the meninges and consequently encephalitis Encephalitis Encephalitis",
        "response": "Encephalitis is an inflammation of the brain and viral infections are one of the main causes."
    },
    {
        "dialog": [
            "Hi Medi, I just had a lumbar puncture for suspected encephalitis.",
            "Hello, I'm here to help. How are you feeling?",
            "I have a headache and my back hurts where they did the puncture.",
            "That's normal. You may need to rest for a few days and take pain medication.",
            "Anything I can do to speed up the recovery process?",
            "You can take care of yourself by getting plenty of rest, eating a healthy diet, and staying hydrated.",
            "Are there any physical activities I should avoid?",
            "You should avoid strenuous activities for at least a few days and get plenty of rest.",
            "Thanks for the advice, Medi."
        ],
        "knowledge": "Encephalitis Encephalitis  Other causes of acute viral encephalitis are rabies virus, poliovirus, and measles virus. Additional possible viral causes are arboviral flavivirus , bunyavirus , arenavirus , reovirus , and henipavirus infections.  The Powassan virus is a rare cause of encephalitis. It can be caused by a bacterial infection, such as bacterial meningitis, or may be a complication of a current infectious disease syphilis . Certain parasitic or protozoal infestations, such as toxoplasmosis, malaria, or primary amoebic meningoencephalitis, can also cause encephalitis in people with compromised immune systems.  Lyme disease or Bartonella henselae may also cause encephalitis. Other bacterial pathogens, like Mycoplasma and those causing rickettsial disease, cause inflammation of the meninges and consequently encephalitis Encephalitis Encephalitis",
        "response": "You should get plenty of rest, eat a healthy diet, and stay hydrated to speed up the recovery process."
    },
    {
        "dialog": [
            "Hello Medi, I have a headache and feel dizzy.",
            "Hi there, I am here to help. When did you start experiencing these symptoms?",
            "I felt it since yesterday.",
            "Is there any other symptoms?",
            "I also feel my neck is stiff and a bit of fever.",
            "Based on your symptoms, it is possible that you might have encephalitis.",
            "What is encephalitis, Medi?",
            "Encephalitis is inflammation and swelling of the brain due to viral infection. It can be caused by various viruses.",
            "What should I do now, Medi?"
        ],
        "knowledge": "Encephalitis Encephalitis Other causes of acute viral encephalitis are rabies virus, poliovirus, and measles virus. Additional possible viral causes are arboviral flavivirus, bunyavirus, arenavirus, reovirus, and henipavirus infections. The Powassan virus is a rare cause of encephalitis. It can be caused by a bacterial infection, such as bacterial meningitis, or may be a complication of a current infectious disease syphilis. Certain parasitic or protozoal infestations, such as toxoplasmosis, malaria, or primary amoebic meningoencephalitis, can also cause encephalitis in people with compromised immune systems. Lyme disease or Bartonella henselae may also cause encephalitis. Other bacterial pathogens, like Mycoplasma and those causing rickettsial disease, cause inflammation of the meninges and consequently encephalitis Encephalitis Encephalitis",
        "response": "You should seek immediate medical attention and get a proper diagnosis and treatment from the doctor."
    },
    {
        "dialog": [
            "Hello Medi, I want to know more about encephalitis.",
            "Sure, what would you like to know about it?",
            "What are the common symptoms of encephalitis?",
            "The common symptoms of encephalitis are headache, fever, confusion, seizures, sensitivity to light, and nausea. In severe cases, it can also cause hallucinations and loss of consciousness.",
            "What are the causes of encephalitis?",
            "Encephalitis can be caused by various viruses such as rabies, polio, and measles viruses, as well as bacterial infections like bacterial meningitis. Certain parasitic or protozoal infestations, such as toxoplasmosis, malaria, or primary amoebic meningoencephalitis, can also cause encephalitis in people with compromised immune systems.",
            "Can encephalitis be prevented, Medi?",
            "There are some vaccines available to prevent certain types of encephalitis, such as the measles vaccine. You should also practice good hygiene and avoid contact with infected people or animals.",
            "Thank you for the information, Medi."
        ],
        "knowledge": "Encephalitis Encephalitis Other causes of acute viral encephalitis are rabies virus, poliovirus, and measles virus. Additional possible viral causes are arboviral flavivirus, bunyavirus, arenavirus, reovirus, and henipavirus infections. The Powassan virus is a rare cause of encephalitis. It can be caused by a bacterial infection, such as bacterial meningitis, or may be a complication of a current infectious disease syphilis. Certain parasitic or protozoal infestations, such as toxoplasmosis, malaria, or primary amoebic meningoencephalitis, can also cause encephalitis in people with compromised immune systems. Lyme disease or Bartonella henselae may also cause encephalitis. Other bacterial pathogens, like Mycoplasma and those causing rickettsial disease, cause inflammation of the meninges and consequently encephalitis Encephalitis Encephalitis",
        "response": "You're welcome. Let me know if you have any other questions."
    },
    {
        "dialog": [
            "Hi Medi, I just got back from the hospital. I was diagnosed with encephalitis.",
            "I'm sorry to hear that. How are you feeling now?",
            "I'm feeling a bit better but the doctor said I need to make some lifestyle changes to prevent further infections. Can you give me some advice, Medi?",
            "Sure. You should get plenty of rest and avoid strenuous physical activities. Additionally, you should eat a balanced diet with lots of fruits and vegetables to boost your immune system. Avoid contact with infected people or animals, and practice good hygiene.",
            "What about medication, Medi?",
            "The doctor will prescribe antiviral or antibiotic medication to treat the underlying cause of your encephalitis. You should take the medication as directed and finish the entire course even if you start feeling better.",
            "Thank you for the advice, Medi.",
            "You're welcome. Take care and get well soon."
        ],
        "knowledge": "Encephalitis Encephalitis Other causes of acute viral encephalitis are rabies virus, poliovirus, and measles virus. Additional possible viral causes are arboviral flavivirus, bunyavirus, arenavirus, reovirus, and henipavirus infections. The Powassan virus is a rare cause of encephalitis. It can be caused by a bacterial infection, such as bacterial meningitis, or may be a complication of a current infectious disease syphilis. Certain parasitic or protozoal infestations, such as toxoplasmosis, malaria, or primary amoebic meningoencephalitis, can also cause encephalitis in people with compromised immune systems. Lyme disease or Bartonella henselae may also cause encephalitis. Other bacterial pathogens, like Mycoplasma and those causing rickettsial disease, cause inflammation of the meninges and consequently encephalitis Encephalitis Encephalitis",
        "response": "You're welcome. Take care and get well soon."
    },
    {
        "dialog": [
            "Hi Medi, I am experiencing a severe headache and I'm not sure what to do.",
            "I see. Can you describe the headache? Is it pounding or throbbing?",
            "It's more of a pounding sensation. I also feel nauseous and have sensitivity to light.",
            "Based on your symptoms, it's possible that you're experiencing a migraine. Have you taken any pain medication yet?",
            "Yes, I've taken some aspirin, but it hasn't helped much.",
            "I recommend trying a medication specifically designed for migraines, such as sumatriptan.",
            "Okay, I'll try that. Thank you, Medi.",
            "You're welcome. Keep me updated on your progress.",
            "Sure, I will. Thanks again."
        ],
        "knowledge": "Migraine Migraine Migraines typically cause intense, throbbing headaches that are usually felt on one side of the head. The pain may be accompanied by nausea, vomiting, and sensitivity to light or sound. Migraines can last for hours or even days. Some people experience warning signs called auras, such as visual disturbances or tingling in the face or limbs, before the onset of a migraine. Triggers for migraines can include stress, certain foods, changes in sleep patterns, and hormonal changes in women Migraine Migraine",
        "response": "You're welcome. I hope the medication helps with your headache."
    },
    {
        "dialog": [
            "Hello Medi, I've recently been diagnosed with encephalitis. Can you tell me more about it?",
            "Of course. Encephalitis is inflammation of the brain usually caused by a viral infection.",
            "What are the symptoms of encephalitis?",
            "Symptoms can include fever, headache, confusion, seizures, and difficulty with movement or speaking.",
            "What are some possible causes of encephalitis?",
            "The most common cause of encephalitis is a viral infection, such as the rabies virus or measles virus. Other viral infections that can cause encephalitis include arboviral flavivirus, bunyavirus, arenavirus, reovirus, and henipavirus infections. In addition, bacterial infections such as bacterial meningitis or syphilis may also cause encephalitis.",
            "Is there any treatment available?",
            "Yes, treatment usually involves antiviral or antibacterial medication, depending on the cause of the encephalitis. In severe cases, hospitalization may be necessary.",
            "Thank you, Medi. This information is very helpful."
        ],
        "knowledge": "Encephalitis Encephalitis Encephalitis is inflammation of the brain, usually caused by a viral infection. Symptoms can include fever, headache, confusion, seizures, and difficulty with movement or speaking. The most common cause of encephalitis is a viral infection, such as the rabies virus or measles virus. Other viral infections that can cause encephalitis include arboviral flavivirus, bunyavirus, arenavirus, reovirus, and henipavirus infections. In addition, bacterial infections such as bacterial meningitis or syphilis may also cause encephalitis. Treatment usually involves antiviral or antibacterial medication, depending on the cause of the encephalitis. In severe cases, hospitalization may be necessary Encephalitis Encephalitis",
        "response": "You're welcome. I'm glad I could help."
    },
    {
        "dialog": [
            "Hi Medi, I just had surgery to remove my appendix. Do you have any advice for my recovery?",
            "Congratulations on making it through the surgery. It's important to rest and allow your body time to heal.",
            "How long will it take for me to recover?",
            "Recovery time can vary, but most people are able to return to their normal activities within two to four weeks.",
            "Are there any specific exercises or activities I should avoid?",
            "For the first few days after surgery, it's important to avoid any strenuous activity or heavy lifting. As you begin to feel better, you can gradually increase your activity level, but be sure to listen to your body and not overdo it.",
            "What should I eat during my recovery?",
            "It's important to eat a healthy, balanced diet that includes plenty of fruits, vegetables, and lean protein. Avoid foods that are high in fat or sugar, as well as alcohol.",
            "Thank you for the advice, Medi."
        ],
        "knowledge": "Appendectomy Appendectomy An appendectomy is a surgical procedure to remove the appendix, a small pouch attached to the large intestine. Recovery time can vary, but most people are able to return to their normal activities within two to four weeks. For the first few days after surgery, it's important to avoid any strenuous activity or heavy lifting. As you begin to feel better, you can gradually increase your activity level, but be sure to listen to your body and not overdo it. It's important to eat a healthy, balanced diet that includes plenty of fruits, vegetables, and lean protein. Avoid foods that are high in fat or sugar, as well as alcohol Appendectomy Appendectomy",
        "response": "You're welcome. I hope your recovery goes smoothly."
    },
    {
        "dialog": [
            "Hi Medi, I feel like something is wrong with my health",
            "I'm sorry to hear that. Could you please tell me your symptoms?",
            "I have a fever, headache, and muscle aches",
            "I think you may have viral encephalitis. ",
            "What should I do now?",
            "It's important to get medical help immediately. I suggest you go to the hospital. ",
            "Is there anything else I should know?",
            "Yes, avoid mosquito bites and stay away from people with encephalitis.",
            "Okay, thank you, Medi. "
        ],
        "knowledge": "Encephalitis Encephalitis  Other causes of acute viral encephalitis are rabies virus, poliovirus, and measles virus. Additional possible viral causes are arboviral flavivirus , bunyavirus , arenavirus , reovirus , and henipavirus infections.  The Powassan virus is a rare cause of encephalitis. It can be caused by a bacterial infection, such as bacterial meningitis, or may be a complication of a current infectious disease syphilis . Certain parasitic or protozoal infestations, such as toxoplasmosis, malaria, or primary amoebic meningoencephalitis, can also cause encephalitis in people with compromised immune systems.  Lyme disease or Bartonella henselae may also cause encephalitis. Other bacterial pathogens, like Mycoplasma and those causing rickettsial disease, cause inflammation of the meninges and consequently encephalitis Encephalitis Encephalitis",
        "response": "You should see a doctor immediately and avoid mosquito bites and stay away from people with encephalitis."
    },
    {
        "dialog": [
            "Hi Medi, I have some questions about encephalitis",
            "Sure, I'll do my best to answer them. What would you like to know?",
            "What is encephalitis caused by?",
            "Encephalitis can be caused by viral, bacterial, and parasitic infections. ",
            "Are there any specific viruses that cause encephalitis?",
            "Yes, some viruses that can cause encephalitis are rabies, polio, and measles virus. ",
            "What are the symptoms of encephalitis?",
            "The symptoms of encephalitis can include fever, headache, confusion, seizures, and loss of consciousness. ",
            "Okay, thanks for the information, Medi. "
        ],
        "knowledge": "Encephalitis Encephalitis  Other causes of acute viral encephalitis are rabies virus, poliovirus, and measles virus. Additional possible viral causes are arboviral flavivirus , bunyavirus , arenavirus , reovirus , and henipavirus infections.  The Powassan virus is a rare cause of encephalitis. It can be caused by a bacterial infection, such as bacterial meningitis, or may be a complication of a current infectious disease syphilis . Certain parasitic or protozoal infestations, such as toxoplasmosis, malaria, or primary amoebic meningoencephalitis, can also cause encephalitis in people with compromised immune systems.  Lyme disease or Bartonella henselae may also cause encephalitis. Other bacterial pathogens, like Mycoplasma and those causing rickettsial disease, cause inflammation of the meninges and consequently encephalitis Encephalitis Encephalitis",
        "response": "Encephalitis can be caused by viral, bacterial, and parasitic infections. Some viruses that can cause encephalitis are rabies, polio, and measles virus. The symptoms of encephalitis can include fever, headache, confusion, seizures, and loss of consciousness. "
    },
    {
        "dialog": [
            "Hi Medi, I just had a medical procedure done, and I would like some advice on what to do next.",
            "Of course, what was the procedure?",
            "I had a spinal tap done",
            "Okay, it's important to rest for the first few days after the procedure.",
            "What about physical activity?",
            "You should avoid any strenuous physical activity for at least a week after the procedure.",
            "What about my diet?",
            "It's important to eat a healthy diet and drink plenty of fluids to help your body recover.",
            "Thanks for the advice, Medi. "
        ],
        "knowledge": "Encephalitis Encephalitis  Other causes of acute viral encephalitis are rabies virus, poliovirus, and measles virus. Additional possible viral causes are arboviral flavivirus , bunyavirus , arenavirus , reovirus , and henipavirus infections.  The Powassan virus is a rare cause of encephalitis. It can be caused by a bacterial infection, such as bacterial meningitis, or may be a complication of a current infectious disease syphilis . Certain parasitic or protozoal infestations, such as toxoplasmosis, malaria, or primary amoebic meningoencephalitis, can also cause encephalitis in people with compromised immune systems.  Lyme disease or Bartonella henselae may also cause encephalitis. Other bacterial pathogens, like Mycoplasma and those causing rickettsial disease, cause inflammation of the meninges and consequently encephalitis Encephalitis Encephalitis",
        "response": "You should rest for the first few days after the procedure and avoid any strenuous physical activity for at least a week. It's important to eat a healthy diet and drink plenty of fluids to help your body recover."
    }
]