[
    {
        "dialog": [
            "Hello Medi, I have pain in my joints, can you help me?",
            "Sure, I am a health-care chatbot. Let me know more about the pain in your joints.",
            "I have swelling and stiffness in my joints especially in the morning and I feel pain in my hands and knees.",
            "Based on your symptoms, you might have arthritis. You need to consult with a specialist.",
            "What causes arthritis?",
            "Arthritis is caused by inflammation in the joints. It can be due to many factors such as wear and tear, infections or autoimmune diseases.",
            "How can I manage arthritis without medications?",
            "You can manage it with healthy lifestyle changes such as regular exercise, weight loss, and a healthy diet.",
            "Thanks! What kind of exercises can I do to manage arthritis?"
        ],
        "knowledge": "Arthritis Arthritis The term is derived from arthr-  and -itis , the latter suffix having come to be associated with inflammation. The word arthritides is the plural form of arthritis, and denotes the collective group of arthritis-like conditions.  Arthritis Arthritis",
        "response": "You can do low-impact exercises like walking, swimming, or yoga to manage arthritis."
    },
    {
        "dialog": [
            "Hello Medi, I want to know more about arthritis.",
            "Hi! I am a medical chatbot, what would you like to know about arthritis?",
            "What are the symptoms of arthritis?",
            "The most common symptoms of arthritis are pain, swelling, and stiffness in the joints. You might also feel warmth and redness around the joints.",
            "What are the different types of arthritis?",
            "There are more than 100 types of arthritis. The most common types are osteoarthritis, rheumatoid arthritis, and psoriatic arthritis.",
            "What is osteoarthritis?",
            "Osteoarthritis is a type of arthritis that occurs when the protective cartilage between the bones wears down over time. It commonly affects the knees, hips, and hands.",
            "What is rheumatoid arthritis?"
        ],
        "knowledge": "Arthritis Arthritis The term is derived from arthr-  and -itis , the latter suffix having come to be associated with inflammation. The word arthritides is the plural form of arthritis, and denotes the collective group of arthritis-like conditions.  Arthritis Arthritis",
        "response": "The treatment options for arthritis depend on the type and severity of the arthritis. Some commonly used treatments include medication, physical therapy, and surgery."
    },
    {
        "dialog": [
            "Hello Medi, I had a knee replacement surgery for arthritis. What should I do now?",
            "Hi, sorry to hear that. You should take care of your knee carefully during the recovery period.",
            "How long does it take to recover from knee replacement surgery?",
            "It takes about 6-12 weeks to fully recover from knee replacement surgery.",
            "What should I do to help me recover?",
            "You should follow the instructions of your doctor and physical therapist. Also, you should do the recommended exercises and take your medication on time.",
            "What kind of exercises can I do after knee replacement surgery?",
            "You can do some simple exercises like walking, cycling, and swimming. But you should not do high-impact exercises or lift heavy weights.",
            "Thanks! What kind of diet should I follow after knee replacement surgery?"
        ],
        "knowledge": "Arthritis Arthritis The term is derived from arthr-  and -itis , the latter suffix having come to be associated with inflammation. The word arthritides is the plural form of arthritis, and denotes the collective group of arthritis-like conditions.  Arthritis Arthritis",
        "response": "You should eat a healthy and balanced diet that contains plenty of protein, vitamins, and minerals to help your body recover faster after knee replacement surgery."
    },
    {
        "dialog": [
            "Hello Medi, I have been experiencing joint pain lately.",
            "I see. Can you tell me more about the pain? Where is it located?",
            "It's mainly in my knees and wrists. It's been bothering me for a few weeks now.",
            "Based on your symptoms, it's possible that you may have arthritis. You should see a doctor for a proper diagnosis.",
            "What are some things I can do to relieve the pain in the meantime?",
            "You can try applying heat or cold compresses and taking over-the-counter pain medication. Gentle exercise and physical therapy may also be helpful.",
            "Thank you for the advice, Medi. I'll make an appointment with my doctor.",
            "You're welcome, and I hope you feel better soon.",
            "Do you know what causes arthritis?"
        ],
        "knowledge": "Arthritis Arthritis The term is derived from arthr-  and -itis , the latter suffix having come to be associated with inflammation. The word arthritides is the plural form of arthritis, and denotes the collective group of arthritis-like conditions.  Arthritis Arthritis",
        "response": "Arthritis is caused by inflammation in the joints, which can be due to a variety of factors such as genetics, injury, or infection."
    },
    {
        "dialog": [
            "Hi Medi, I was diagnosed with arthritis. What can I do to manage it?",
            "I'm sorry to hear that. The first step is to work with your doctor to come up with a treatment plan.",
            "What kind of treatment options are available?",
            "There are a variety of treatments available depending on the type and severity of your arthritis. These include medications, physical therapy, and lifestyle changes such as regular exercise and a healthy diet.",
            "Are there any natural remedies I can try?",
            "Some people find relief from taking supplements such as glucosamine and chondroitin, and others find that acupuncture or massage therapy can be helpful. However, it's important to talk to your doctor before trying any new treatments.",
            "Thank you for the advice, Medi.",
            "You're welcome, and remember to always follow your doctor's recommendations for managing your arthritis.",
            "Can arthritis be cured?"
        ],
        "knowledge": "Arthritis Arthritis The term is derived from arthr-  and -itis , the latter suffix having come to be associated with inflammation. The word arthritides is the plural form of arthritis, and denotes the collective group of arthritis-like conditions.  Arthritis Arthritis",
        "response": "Unfortunately, there is no cure for arthritis. However, with proper treatment and management, it is possible to reduce pain and maintain mobility."
    },
    {
        "dialog": [
            "Hello Medi, I recently had knee replacement surgery.",
            "I hope your surgery went well. Recovery can take some time.",
            "Yes, it's been a few weeks now and I'm still experiencing some pain and stiffness.",
            "That's normal. Your doctor may recommend physical therapy to help you regain mobility and reduce pain.",
            "Are there any other things I can do to speed up my recovery?",
            "It's important to follow your doctor's instructions for post-surgery care, such as taking any prescribed medication and keeping the surgical site clean and dry. You should also avoid putting too much weight on the knee and try to rest as much as possible.",
            "Thank you for the advice, Medi.",
            "You're welcome. It's important to take care of yourself and allow your body time to heal.",
            "Will I be able to resume my normal activities after my recovery?"
        ],
        "knowledge": "Arthritis Arthritis The term is derived from arthr-  and -itis , the latter suffix having come to be associated with inflammation. The word arthritides is the plural form of arthritis, and denotes the collective group of arthritis-like conditions.  Arthritis Arthritis",
        "response": "It's possible to resume your normal activities after your recovery, but it will depend on the individual case and your doctor's recommendations. It's important to take things slow and not push yourself too hard, to avoid re-injury or complications."
    },
    {
        "dialog": [
            "Hello Medi, I feel some pain and discomfort in my joints",
            "I see. Can you specify which joints are causing pain and discomfort?",
            "Yes, my knees and wrists hurt and are stiff in the morning",
            "Based on your symptoms, it seems like you may have arthritis",
            "Arthritis? Can you tell me more about it and what I can do?",
            "Arthritis is inflammation of one or more joints, causing pain and stiffness. You can manage it with medication, physical therapy, and lifestyle changes",
            "What kind of lifestyle changes do you recommend?",
            "Losing weight and exercising regularly can help with joint pain and stiffness, and reducing stress can also help",
            "Thank you, Medi. What medications can help with arthritis?"
        ],
        "knowledge": "Arthritis Arthritis The term is derived from arthr-  and -itis , the latter suffix having come to be associated with inflammation. The word arthritides is the plural form of arthritis, and denotes the collective group of arthritis-like conditions.  Arthritis Arthritis",
        "response": "There are many medications that can help with arthritis, such as nonsteroidal anti-inflammatory drugs (NSAIDs) and disease-modifying antirheumatic drugs (DMARDs). However, it's best to consult with your doctor to find the right medication for you."
    },
    {
        "dialog": [
            "Hello Medi, I have some questions about arthritis",
            "Of course, I'm here to help. What would you like to know?",
            "What are the most common types of arthritis?",
            "The most common types are osteoarthritis and rheumatoid arthritis",
            "What causes osteoarthritis?",
            "It's caused by wear and tear on the joints over time, and can be exacerbated by obesity and joint injuries",
            "And what causes rheumatoid arthritis?",
            "It's an autoimmune disorder in which the immune system attacks the joints, causing inflammation",
            "Thank you, Medi. What are the available treatments for arthritis?"
        ],
        "knowledge": "Arthritis Arthritis The term is derived from arthr-  and -itis , the latter suffix having come to be associated with inflammation. The word arthritides is the plural form of arthritis, and denotes the collective group of arthritis-like conditions.  Arthritis Arthritis",
        "response": "There are many available treatments for arthritis, including medications, physical therapy, and surgery. However, it's best to consult with your doctor to find the right treatment for your specific case."
    },
    {
        "dialog": [
            "Hello Medi, I recently had knee surgery for my arthritis. What lifestyle changes can I make to help with my recovery?",
            "Congratulations on taking the first step towards recovery. To aid in your recovery, you should engage in regular physical therapy and exercise",
            "What kind of exercises should I do?",
            "Low-impact exercises like swimming and cycling can help, as well as strength-training exercises to build muscle around the affected joint",
            "What about my diet?",
            "Eating a balanced diet with plenty of fruits and vegetables can help with inflammation and promote overall health",
            "Thank you, Medi. Are there any supplements or natural remedies that can help with arthritis pain?",
            "Some people find that taking supplements like glucosamine and chondroitin can help with joint pain, but the research is mixed",
            "I see. Thank you for your help, Medi."
        ],
        "knowledge": "Arthritis Arthritis The term is derived from arthr-  and -itis , the latter suffix having come to be associated with inflammation. The word arthritides is the plural form of arthritis, and denotes the collective group of arthritis-like conditions.  Arthritis Arthritis",
        "response": "You're welcome. It's important to remember that while supplements and natural remedies may help with arthritis pain, they should not replace traditional medical treatments. It's always best to consult with your doctor before trying any new treatments."
    },
    {
        "dialog": [
            "Hi Medi, I have been feeling a lot of pain and stiffness in my joints lately",
            "Hello! I can certainly assist you with that. Can you tell me more about your symptoms?",
            "The pain is mostly in my knees and hands, and it's especially bad in the morning",
            "Okay, based on your symptoms, it's possible that you have arthritis. Have you seen a doctor or gotten a diagnosis?",
            "No, I haven't been to a doctor yet. What can I do to manage the pain in the meantime?",
            "You can take over-the-counter pain medication like ibuprofen or naproxen. Applying heat or cold to the affected area can also help. Gentle exercise like walking and stretching can also improve your symptoms.",
            "Thank you for the advice, Medi. What kind of exercises would you recommend?",
            "Low-impact exercises like swimming, cycling, and yoga are great for people with arthritis. It's important to also incorporate stretching and strengthening exercises.",
            "That's helpful, thanks! Do you have any tips for managing arthritis in the long term?"
        ],
        "knowledge": "Arthritis Arthritis The term is derived from arthr- and -itis, the latter suffix having come to be associated with inflammation. The word arthritides is the plural form of arthritis, and denotes the collective group of arthritis-like conditions. Arthritis can cause pain, stiffness, and swelling in the joints. There are many types of arthritis, including rheumatoid arthritis and osteoarthritis. Treatment options include medication, exercise, and lifestyle changes.",
        "response": "For long-term management, it's important to maintain a healthy weight, eat a balanced diet, and exercise regularly. You should also follow your doctor's treatment plan, take medication as prescribed, and attend regular checkups."
    },
    {
        "dialog": [
            "Hi Medi, I was recently diagnosed with arthritis and I'm feeling really overwhelmed",
            "I'm sorry to hear that. I'm here to help you understand your diagnosis and offer support",
            "Thank you, I appreciate that. Can you tell me more about arthritis and how it will affect my life?",
            "Arthritis is a condition that causes pain, stiffness, and inflammation in the joints. It can make it difficult to perform daily activities like getting dressed or even walking. However, with the right treatment and lifestyle changes, it's possible to manage your symptoms and maintain a good quality of life.",
            "That's reassuring to hear. What kind of treatment options are available?",
            "The treatment options for arthritis depend on the type and severity of your condition. They can include medication, physical therapy, and surgery. It's important to work with your doctor to develop a treatment plan that works for you.",
            "I see. Are there any lifestyle changes I can make to manage my symptoms?",
            "Yes, lifestyle changes can be very effective in managing arthritis. Maintaining a healthy weight, exercising regularly, and eating a balanced diet are all important. You should also try to reduce stress and get enough sleep.",
            "That's helpful to know. Thank you for your advice, Medi. Do you have any resources or support groups I can access?"
        ],
        "knowledge": "Arthritis Arthritis The term is derived from arthr- and -itis, the latter suffix having come to be associated with inflammation. The word arthritides is the plural form of arthritis, and denotes the collective group of arthritis-like conditions. Arthritis can cause pain, stiffness, and swelling in the joints. There are many types of arthritis, including rheumatoid arthritis and osteoarthritis. Treatment options include medication, exercise, and lifestyle changes.",
        "response": "You're welcome! Remember that there are many resources available to help you manage your condition, and it's important to work with your doctor to develop a treatment plan that works for you."
    },
    {
        "dialog": [
            "Hi Medi, I just had knee replacement surgery and I'm wondering what kind of exercises I can do during my recovery",
            "Congratulations on your surgery! I can certainly help you with that. What kind of exercises are you interested in?",
            "I'm not sure. I want to make sure I'm doing exercises that will help me recover quickly and safely",
            "That's a great attitude to have. During your recovery, it's important to start with gentle exercises and gradually increase as you heal. Walking, swimming, and cycling are all great low-impact exercises that can help improve your mobility and strength. Your physical therapist can also recommend specific exercises tailored to your needs.",
            "Ok, that sounds good. What about strength training exercises?",
            "Strength training is important for maintaining muscle mass and preventing muscle loss after surgery. However, you should avoid exercises that put too much strain on your knee, like squats and lunges. Your physical therapist can recommend safe and effective strength training exercises for you to do at home.",
            "That's helpful to know. What about diet and nutrition during my recovery?",
            "Eating a balanced diet with plenty of protein, vitamins, and minerals can help support your recovery and promote healing. You should also stay hydrated and avoid foods that can cause inflammation, like processed foods and sugary drinks.",
            "Thank you, Medi. Do you have any other tips for a successful recovery?"
        ],
        "knowledge": "Arthritis Arthritis The term is derived from arthr- and -itis, the latter suffix having come to be associated with inflammation. The word arthritides is the plural form of arthritis, and denotes the collective group of arthritis-like conditions. Arthritis can cause pain, stiffness, and swelling in the joints. There are many types of arthritis, including rheumatoid arthritis and osteoarthritis. Treatment options include medication, exercise, and lifestyle changes.",
        "response": "You're welcome! Remember to take it slow during your recovery and listen to your body. Your physical therapist can help you develop a safe and effective exercise program that will help you recover quickly and safely."
    },
    {
        "dialog": [
            "Hi Medi! I have inflammation in my body and pain in knees.",
            "Hello! Sorry to hear that. Can you describe the pain and inflammation in more detail?",
            "Yes, I feel pain and stiffness in my knees every time I try to move them.",
            "Based on your symptoms, it looks like you may have arthritis. You should see a doctor to confirm the diagnosis.",
            "Oh, I see. Can arthritis be treated with medication?",
            "Yes, there are medications that can help manage symptoms and slow the progression of the disease.",
            "That's good to know. What lifestyle changes can I make to improve my condition?",
            "Regular physical activity can help reduce inflammation and strengthen the joints. Eating a healthy diet and maintaining a healthy weight can also help.",
            "Thank you, Medi! Is there anything else I need to know about arthritis?"
        ],
        "knowledge": "Arthritis is a condition that causes inflammation in the joints, leading to pain and stiffness. It is a chronic condition that affects millions of people worldwide. There are several types of arthritis, including osteoarthritis, rheumatoid arthritis, and psoriatic arthritis. Symptoms can vary depending on the type of arthritis, but common symptoms include joint pain, stiffness, swelling, and reduced range of motion. Treatment for arthritis typically involves a combination of medication, lifestyle changes, and physical therapy.",
        "response": "Arthritis is a chronic condition that can be managed with medication, lifestyle changes, and physical therapy."
    },
    {
        "dialog": [
            "Hi, Medi! I have a few questions about arthritis.",
            "Hi there! I'll do my best to help. What would you like to know?",
            "What are the most common types of arthritis?",
            "The most common types of arthritis are osteoarthritis, rheumatoid arthritis, and psoriatic arthritis.",
            "What causes arthritis?",
            "The exact cause of arthritis is unknown, but factors such as genetics, age, and injury can increase the risk of developing the condition.",
            "Can arthritis be prevented?",
            "While there is no surefire way to prevent arthritis, maintaining a healthy weight, staying physically active, and avoiding injury can help reduce the risk.",
            "Thank you, Medi! One more question - how is arthritis diagnosed?"
        ],
        "knowledge": "Arthritis is a condition that causes inflammation in the joints, leading to pain and stiffness. It is a chronic condition that affects millions of people worldwide. There are several types of arthritis, including osteoarthritis, rheumatoid arthritis, and psoriatic arthritis. Symptoms can vary depending on the type of arthritis, but common symptoms include joint pain, stiffness, swelling, and reduced range of motion. Treatment for arthritis typically involves a combination of medication, lifestyle changes, and physical therapy.",
        "response": "Arthritis can be diagnosed through a physical exam, medical history, and imaging tests such as X-rays or MRI scans."
    },
    {
        "dialog": [
            "Hi Medi! I recently had knee surgery and need some advice on recovery.",
            "Hello! I'm here to help. What kind of surgery did you have?",
            "I had a knee replacement surgery.",
            "After knee replacement surgery, it is important to keep the area clean and dry, and to avoid bending, twisting, or putting weight on the knee for a period of time.",
            "How long does recovery usually take?",
            "Recovery time can vary depending on the individual and the extent of the surgery, but it typically takes several weeks to several months to fully recover.",
            "What kind of physical therapy should I do?",
            "Your doctor may recommend specific physical therapy exercises to help improve strength and flexibility in the knee. It is important to follow their advice and attend all recommended appointments.",
            "Thank you, Medi! Are there any lifestyle changes I should make to improve my recovery?"
        ],
        "knowledge": "Arthritis is a condition that causes inflammation in the joints, leading to pain and stiffness. It is a chronic condition that affects millions of people worldwide. There are several types of arthritis, including osteoarthritis, rheumatoid arthritis, and psoriatic arthritis. Symptoms can vary depending on the type of arthritis, but common symptoms include joint pain, stiffness, swelling, and reduced range of motion. Treatment for arthritis typically involves a combination of medication, lifestyle changes, and physical therapy.",
        "response": "Maintaining a nutritious diet and getting plenty of rest can help improve recovery after knee replacement surgery."
    },
    {
        "dialog": [
            "Hi Medi, I have been experiencing joint pain lately.",
            "Hello, I am here to help. Can you tell me more about the pain?",
            "The pain is in my knees and elbows. It hurts more when I move them",
            "Based on the information you have provided, it is possible that you have arthritis",
            "What is arthritis and what are the causes?",
            "Arthritis is inflammation of one or more joints that causes pain and stiffness. The causes vary from injury to autoimmune diseases",
            "How can I manage arthritis, Medi?",
            "There are various methods to manage arthritis such as medications, physical therapy, and lifestyle changes",
            "Thank you, Medi. What lifestyle changes do you recommend?"
        ],
        "knowledge": "Arthritis Arthritis The term is derived from arthr-  and -itis , the latter suffix having come to be associated with inflammation. The word arthritides is the plural form of arthritis, and denotes the collective group of arthritis-like conditions.  Arthritis Arthritis",
        "response": "Some of the lifestyle changes you can make include exercising regularly, losing weight if you are overweight, and avoiding foods that trigger inflammation"
    },
    {
        "dialog": [
            "Hi Medi, I have a question about arthritis",
            "Hello, ask away",
            "Can arthritis be cured?",
            "Unfortunately, there is no cure for arthritis, but it can be managed with proper treatment and lifestyle changes",
            "What are the symptoms of arthritis?",
            "The symptoms of arthritis include joint pain, stiffness, swelling, and redness around the affected joints",
            "What are the types of arthritis?",
            "There are many types of arthritis, but the most common ones are osteoarthritis and rheumatoid arthritis",
            "Thank you, Medi. That was helpful. "
        ],
        "knowledge": "Arthritis Arthritis The term is derived from arthr-  and -itis , the latter suffix having come to be associated with inflammation. The word arthritides is the plural form of arthritis, and denotes the collective group of arthritis-like conditions.  Arthritis Arthritis",
        "response": "You're welcome. If you have any more questions, feel free to ask."
    },
    {
        "dialog": [
            "Hi Medi, I just had a knee replacement surgery. What should I do now?",
            "Hello. After a knee replacement surgery, it is important to take care of your knee to avoid complications",
            "What kind of complications could happen?",
            "Complications include infection, blood clots, and loosening of the new joint",
            "What kind of exercises can I do to recover?",
            "You should do exercises that your doctor recommends such as walking, range-of-motion exercises, and strengthening exercises",
            "Can you give me some diet advice, Medi?",
            "A healthy diet can help with recovery. It should include foods that are high in protein, calcium, and vitamin D",
            "Thank you, Medi. What other precautions should I take?"
        ],
        "knowledge": "Arthritis Arthritis The term is derived from arthr-  and -itis , the latter suffix having come to be associated with inflammation. The word arthritides is the plural form of arthritis, and denotes the collective group of arthritis-like conditions.  Arthritis Arthritis",
        "response": "You should avoid activities that could cause falls or stress on the knee such as high-impact sports. Make sure to follow your doctor's instructions and attend all follow-up appointments"
    },
    {
        "dialog": [
            "Hello Medi, I have a sharp pain in my joints.",
            "Hello! I can help you with that. Can you tell me more about the pain?",
            "It's mostly in my knees and fingers. The pain is worse in the morning.",
            "It sounds like it could be arthritis. I recommend seeing a doctor to get a proper diagnosis.",
            "Is there anything I can do in the meantime?",
            "You can try gentle exercises and stretching to keep your joints flexible. Applying heat or cold packs can also help with pain and inflammation.",
            "Are there any foods I should avoid that could worsen the pain?",
            "Yes, certain foods can trigger inflammation, like fried foods, processed snacks, and sugary drinks. Instead, try eating more anti-inflammatory foods like leafy greens, fatty fish, and nuts.",
            "Thank you for your help, Medi. I will book an appointment with a doctor."
        ],
        "knowledge": "Arthritis Arthritis The term is derived from arthr-  and -itis , the latter suffix having come to be associated with inflammation. The word arthritides is the plural form of arthritis, and denotes the collective group of arthritis-like conditions.  Arthritis Arthritis",
        "response": "I recommend seeing a doctor to get a proper diagnosis for your joint pain."
    },
    {
        "dialog": [
            "Hi Medi, can you explain what causes arthritis?",
            "Sure! There are many types of arthritis, but most are caused by inflammation and damage to the joints over time.",
            "What are some risk factors for developing arthritis?",
            "Age, family history, and being overweight can increase your risk. Certain jobs or physical activities that put a lot of stress on the joints can also contribute to joint damage.",
            "Is there anything I can do to prevent arthritis?",
            "Maintaining a healthy weight, staying active with low-impact exercises like swimming or walking, and protecting your joints during physical activities can help prevent joint damage and arthritis.",
            "Are there any treatments for arthritis?",
            "Yes, there are a variety of treatments, like pain medication, physical therapy, and surgery in severe cases. Your doctor can help determine the best course of treatment for your specific type of arthritis.",
            "Thank you for the information, Medi. It's good to know how I can prevent arthritis."
        ],
        "knowledge": "Arthritis Arthritis The term is derived from arthr-  and -itis , the latter suffix having come to be associated with inflammation. The word arthritides is the plural form of arthritis, and denotes the collective group of arthritis-like conditions.  Arthritis Arthritis",
        "response": "You're welcome! It's always good to be proactive about your joint health."
    },
    {
        "dialog": [
            "Hi Medi, I just had knee replacement surgery. What can I do to aid my recovery?",
            "Congratulations on completing the surgery! Rest and physical therapy are important for recovery. Make sure to follow your doctor's instructions.",
            "How can I manage the pain?",
            "Your doctor can prescribe pain medication. Applying ice packs to the knee can also help with swelling and pain.",
            "When can I start physical therapy?",
            "Your doctor will let you know when you can start physical therapy. It's important to start as soon as possible to avoid stiffness and speed up recovery.",
            "Are there any exercises I can do at home to help with recovery?",
            "Yes, your physical therapist will give you exercises to do at home to strengthen and stretch the knee. Make sure to follow their instructions carefully.",
            "Thank you for the advice, Medi. I will make sure to follow my doctor's orders."
        ],
        "knowledge": "Arthritis Arthritis The term is derived from arthr-  and -itis , the latter suffix having come to be associated with inflammation. The word arthritides is the plural form of arthritis, and denotes the collective group of arthritis-like conditions.  Arthritis Arthritis",
        "response": "You're welcome! Recovery can be difficult, but following your doctor's orders will make it easier."
    }
]