[
    {
        "dialog": [
            "Hi Medi, I'm not feeling well, can you help me?",
            "Of course! What symptoms are you experiencing?",
            "I have a high fever, dry cough, and body aches.",
            "Based on your symptoms, it's possible that you have the flu. Have you been vaccinated?",
            "No, I haven't. What should I do now?",
            "You should get plenty of rest and stay hydrated. Consider taking over-the-counter pain relief like ibuprofen or acetaminophen. You can also consult a doctor if your symptoms worsen.",
            "Okay, thanks for your advice. Should I also avoid going to work?",
            "Yes, it's important to avoid contact with others to prevent the spread of the virus.",
            "I see. How long will it take for me to recover?"
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "It typically takes about a week to recover from the flu, but it can take longer if there are complications. Be sure to rest and stay hydrated."
    },
    {
        "dialog": [
            "Hey Medi, I have a few questions about the flu.",
            "Sure thing! What would you like to know?",
            "What is the difference between the flu and a cold?",
            "While they share some symptoms, the flu is typically more severe and can lead to complications like pneumonia. Additionally, the flu typically comes on suddenly, while a cold develops gradually.",
            "How can I prevent getting the flu?",
            "The best way to prevent the flu is by getting vaccinated. You can also practice good hygiene such as washing your hands frequently and avoiding close contact with people who are sick.",
            "Is it true that the flu vaccine can give you the flu?",
            "No, that's a common misconception. While some people may experience mild side effects like a low-grade fever or muscle aches after getting vaccinated, it is not possible to get the flu from the vaccine itself.",
            "That's good to know. Thank you, Medi!"
        ],
        "knowledge": "Influenza Influenza  Four influenza pandemics have occurred since WWII, each less severe than the 1918 pandemic.  The first of these was the Asian flu from 1957 to 1958, caused by an H2N2 strain and beginning in China's Yunnan province.  The number of deaths probably exceeded one million, mostly among the very young and very old.  The 1957 pandemic was the first flu pandemic to occur in the presence of a global surveillance system and laboratories able to study the novel influenza virus.  After the pandemic, H2N2 was the IAV subtype responsible for seasonal influenza.  The first antiviral drug against influenza, amantadine, was approved for use in 1966, with additional antiviral drugs being used since the 1990s. In 1968, H3N2 was introduced into humans through a rearrangement between an avian H3N2 strain and an H2N2 strain that was circulating in humans Influenza Influenza",
        "response": "No problem, feel free to ask anything else you're curious about!"
    },
    {
        "dialog": [
            "Hi Medi, I recently had the flu and I was wondering if there is anything I can do to strengthen my immune system.",
            "Of course! Eating a healthy diet with plenty of fruits and vegetables, getting regular exercise, and getting enough sleep can all help to boost your immune system.",
            "What about taking supplements or vitamins?",
            "While some supplements and vitamins may have immune-boosting properties, it's important to talk to your doctor before taking any new supplements to make sure they won't interact with any other medications you may be taking or cause any negative side effects.",
            "That makes sense. What about stress? Can that impact my immune system?",
            "Yes, chronic stress can weaken your immune system over time. It's important to take steps to manage stress, such as practicing relaxation techniques or talking to a therapist.",
            "Thank you, Medi! I'll be sure to take your advice.",
            "You're welcome! Do you have any other questions?",
            "No, that's all for now. Thanks again!"
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "You're welcome! Don't hesitate to reach out if you have any more questions in the future."
    },
    {
        "dialog": [
            "Hi Medi, I think I have flu symptoms. Can you help me?",
            "Sure, let's see what your symptoms are.",
            "I have a headache, fever, and coughing.",
            "Those symptoms are similar to influenza. You should rest and drink plenty of fluids.",
            "Should I take any medication?",
            "You can take over-the-counter medication for fever and pain. But, it's better to consult your doctor.",
            "Thank you for your advice, Medi. How can I prevent getting the flu?",
            "You can get vaccinated, wash your hands often, avoid close contact with sick people, and keep your immune system strong with a healthy lifestyle.",
            "Thanks, Medi. I appreciate your help."
        ],
        "knowledge": "Influenza Influenza  Four influenza pandemics have occurred since WWII, each less severe than the 1918 pandemic.  The first of these was the Asian flu from 1957 to 1958, caused by an H2N2 strain and beginning in China's Yunnan province.  The number of deaths probably exceeded one million, mostly among the very young and very old.  The 1957 pandemic was the first flu pandemic to occur in the presence of a global surveillance system and laboratories able to study the novel influenza virus.  After the pandemic, H2N2 was the IAV subtype responsible for seasonal influenza.  The first antiviral drug against influenza, amantadine, was approved for use in 1966, with additional antiviral drugs being used since the 1990s. In 1968, H3N2 was introduced into humans through a rearrangement between an avian H3N2 strain and an H2N2 strain that was circulating in humans Influenza Influenza",
        "response": "You're welcome. Stay hydrated, take medication, and avoid close contact with sick people. Also, get vaccinated and maintain a healthy lifestyle to prevent getting the flu."
    },
    {
        "dialog": [
            "Hi Medi, I heard that there are different types of flu. Can you explain them to me?",
            "Sure, there are three types of flu: A, B, and C.",
            "What's the difference between them?",
            "Influenza A is the most severe and can affect both humans and animals. Influenza B is less severe and only affects humans. Influenza C is the mildest and affects both humans and animals.",
            "Which type is the most common?",
            "Influenza A is the most common and is responsible for most flu-related illnesses.",
            "Do I need to worry about the other types?",
            "All types of flu can cause illness, so it's important to take precautions to avoid getting sick.",
            "Thank you, Medi. I appreciate your help."
        ],
        "knowledge": "Influenza Influenza  Four influenza pandemics have occurred since WWII, each less severe than the 1918 pandemic.  The first of these was the Asian flu from 1957 to 1958, caused by an H2N2 strain and beginning in China's Yunnan province.  The number of deaths probably exceeded one million, mostly among the very young and very old.  The 1957 pandemic was the first flu pandemic to occur in the presence of a global surveillance system and laboratories able to study the novel influenza virus.  After the pandemic, H2N2 was the IAV subtype responsible for seasonal influenza.  The first antiviral drug against influenza, amantadine, was approved for use in 1966, with additional antiviral drugs being used since the 1990s. In 1968, H3N2 was introduced into humans through a rearrangement between an avian H3N2 strain and an H2N2 strain that was circulating in humans Influenza Influenza",
        "response": "You're welcome. Remember, all types of flu can cause illness, so it's important to take precautions to avoid getting sick. Stay healthy!"
    },
    {
        "dialog": [
            "Hi Medi, I just recovered from the flu. What should I do to stay healthy?",
            "Congratulations! To stay healthy, you should get plenty of rest and exercise, eat a balanced diet, and wash your hands often to prevent the spread of germs.",
            "Should I take any medication?",
            "If you have any lingering symptoms, you can take over-the-counter medication. But, it's better to consult your doctor.",
            "How can I prevent getting the flu in the future?",
            "You can get vaccinated, avoid close contact with sick people, and keep your immune system strong with a healthy lifestyle.",
            "Thank you, Medi. I appreciate your help.",
            "You're welcome! Stay healthy and take care."
        ],
        "knowledge": "Influenza Influenza  Four influenza pandemics have occurred since WWII, each less severe than the 1918 pandemic.  The first of these was the Asian flu from 1957 to 1958, caused by an H2N2 strain and beginning in China's Yunnan province.  The number of deaths probably exceeded one million, mostly among the very young and very old.  The 1957 pandemic was the first flu pandemic to occur in the presence of a global surveillance system and laboratories able to study the novel influenza virus.  After the pandemic, H2N2 was the IAV subtype responsible for seasonal influenza.  The first antiviral drug against influenza, amantadine, was approved for use in 1966, with additional antiviral drugs being used since the 1990s. In 1968, H3N2 was introduced into humans through a rearrangement between an avian H3N2 strain and an H2N2 strain that was circulating in humans Influenza Influenza",
        "response": "You're welcome. Remember, get plenty of rest, exercise, eat a balanced diet, and wash your hands often to prevent the spread of germs. Stay healthy and take care."
    },
    {
        "dialog": [
            "Hello Medi, I'm feeling unwell and tired.",
            "Hi, sorry to hear that. Can you describe your symptoms?",
            "I have a fever, cough, and body aches.",
            "Sounds like you may have the flu. Have you been in contact with anyone who has the flu?",
            "Yes, I was around my colleague who was coughing a lot.",
            "Okay, it's highly likely you have the flu. You should rest, drink fluids and see a doctor if your symptoms persist.",
            "What should I do to prevent getting the flu again in the future?",
            "The best way to prevent the flu is to get a flu vaccine every year and to wash your hands frequently.",
            "Thank you for your advice, Medi. How effective is the flu vaccine?"
        ],
        "knowledge": "Influenza Influenza  Four influenza pandemics have occurred since WWII, each less severe than the 1918 pandemic.  The first of these was the Asian flu from 1957 to 1958, caused by an H2N2 strain and beginning in China's Yunnan province.  The number of deaths probably exceeded one million, mostly among the very young and very old.  The 1957 pandemic was the first flu pandemic to occur in the presence of a global surveillance system and laboratories able to study the novel influenza virus.  After the pandemic, H2N2 was the IAV subtype responsible for seasonal influenza.  The first antiviral drug against influenza, amantadine, was approved for use in 1966, with additional antiviral drugs being used since the 1990s. In 1968, H3N2 was introduced into humans through a rearrangement between an avian H3N2 strain and an H2N2 strain that was circulating in humans Influenza Influenza",
        "response": "The flu vaccine is about 40-60% effective in preventing the flu, but it varies from year to year based on the type of flu strains in circulation."
    },
    {
        "dialog": [
            "Hi Medi, I'm curious about the history of the flu.",
            "Hello! What would you like to know about the flu?",
            "Can you tell me about the first flu pandemic?",
            "Yes, the first flu pandemic occurred in 1918 and was known as the Spanish flu. It infected over 500 million people worldwide and resulted in the deaths of over 50 million people.",
            "Wow, that's a lot of people. Have there been other flu pandemics since then?",
            "Yes, there have been three more flu pandemics since then - the Asian flu in 1957, the Hong Kong flu in 1968, and the swine flu in 2009.",
            "What makes the flu so contagious?",
            "The flu is easily spread from person to person through droplets that are released when an infected person talks, coughs, or sneezes. It can also live on surfaces for up to 24 hours.",
            "Thanks for the information, Medi. How can I protect myself from the flu?"
        ],
        "knowledge": "Influenza Influenza  Four influenza pandemics have occurred since WWII, each less severe than the 1918 pandemic.  The first of these was the Asian flu from 1957 to 1958, caused by an H2N2 strain and beginning in China's Yunnan province.  The number of deaths probably exceeded one million, mostly among the very young and very old.  The 1957 pandemic was the first flu pandemic to occur in the presence of a global surveillance system and laboratories able to study the novel influenza virus.  After the pandemic, H2N2 was the IAV subtype responsible for seasonal influenza.  The first antiviral drug against influenza, amantadine, was approved for use in 1966, with additional antiviral drugs being used since the 1990s. In 1968, H3N2 was introduced into humans through a rearrangement between an avian H3N2 strain and an H2N2 strain that was circulating in humans Influenza Influenza",
        "response": "You can protect yourself from the flu by getting a flu vaccine every year, washing your hands frequently, avoiding close contact with sick people, and covering your mouth and nose when you cough or sneeze."
    },
    {
        "dialog": [
            "Hello Medi, I recently recovered from the flu. What can I do to avoid getting sick again?",
            "Hi! It's good to hear you recovered from the flu. To avoid getting sick again, you should continue to practice good hygiene.",
            "What do you mean by good hygiene?",
            "Good hygiene means washing your hands often, avoiding touching your face, and disinfecting surfaces that are frequently touched.",
            "What else can I do to stay healthy?",
            "It's also important to eat a healthy diet, get enough sleep, and exercise regularly.",
            "What types of foods are good for my immune system?",
            "Foods that are high in vitamin C, vitamin E, and zinc can boost your immune system. Examples include citrus fruits, almonds, and oysters.",
            "Thanks for the advice, Medi. I'll make sure to follow your recommendations."
        ],
        "knowledge": "Influenza Influenza  Four influenza pandemics have occurred since WWII, each less severe than the 1918 pandemic.  The first of these was the Asian flu from 1957 to 1958, caused by an H2N2 strain and beginning in China's Yunnan province.  The number of deaths probably exceeded one million, mostly among the very young and very old.  The 1957 pandemic was the first flu pandemic to occur in the presence of a global surveillance system and laboratories able to study the novel influenza virus.  After the pandemic, H2N2 was the IAV subtype responsible for seasonal influenza.  The first antiviral drug against influenza, amantadine, was approved for use in 1966, with additional antiviral drugs being used since the 1990s. In 1968, H3N2 was introduced into humans through a rearrangement between an avian H3N2 strain and an H2N2 strain that was circulating in humans Influenza Influenza",
        "response": "You're welcome! I hope these tips help you stay healthy and avoid getting sick again."
    },
    {
        "dialog": [
            "Hi Medi, I think I might have caught a flu.",
            "What are your symptoms right now?",
            "I have a fever, headache, and muscle pain.",
            "It sounds like flu. You should stay home and rest.",
            "What can I do to relieve the symptoms?",
            "You can take over-the-counter pain relievers and keep yourself hydrated.",
            "What are the complications of flu?",
            "Complications include pneumonia, bronchitis, sinus infections, and ear infections.",
            "How long does it usually take to recover from flu?"
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "It usually takes about 1 to 2 weeks for a person to recover from the flu. However, it varies depending on the individual."
    },
    {
        "dialog": [
            "Hello Medi, I want to know more about the 1918 flu pandemic.",
            "The 1918 flu pandemic was one of the deadliest pandemics in history.",
            "What caused the pandemic?",
            "It was caused by the H1N1 influenza virus.",
            "How many people died because of it?",
            "It is estimated that 50 million people died worldwide.",
            "Was there any treatment available for flu at that time?",
            "There was no specific treatment for flu at that time.",
            "What measures were taken to prevent the spread of flu during the pandemic?"
        ],
        "knowledge": "Influenza Influenza  Four influenza pandemics have occurred since WWII, each less severe than the 1918 pandemic.  The first of these was the Asian flu from 1957 to 1958, caused by an H2N2 strain and beginning in China's Yunnan province.  The number of deaths probably exceeded one million, mostly among the very young and very old.  The 1957 pandemic was the first flu pandemic to occur in the presence of a global surveillance system and laboratories able to study the novel influenza virus.  After the pandemic, H2N2 was the IAV subtype responsible for seasonal influenza.  The first antiviral drug against influenza, amantadine, was approved for use in 1966, with additional antiviral drugs being used since the 1990s. In 1968, H3N2 was introduced into humans through a rearrangement between an avian H3N2 strain and an H2N2 strain that was circulating in humans Influenza Influenza",
        "response": "Measures taken to prevent the spread of flu during the pandemic included isolation, quarantine, the use of disinfectants, and the wearing of masks."
    },
    {
        "dialog": [
            "Hi Medi, I just had a flu vaccination. What should I do now?",
            "It's important to rest and stay hydrated after getting a flu shot.",
            "Should I take any over-the-counter medications?",
            "You can take pain relievers such as acetaminophen or ibuprofen if you experience any pain or fever.",
            "Is it normal to experience any side effects?",
            "It's common to experience mild side effects such as soreness, redness, and swelling at the injection site, as well as headache, fever, and muscle aches.",
            "How effective is the flu vaccine?",
            "The effectiveness of the flu vaccine depends on several factors, including the match between the vaccine and the circulating flu viruses, as well as the age and health of the person receiving the vaccine.",
            "When is the best time to get the flu vaccine?"
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "The best time to get the flu vaccine is before the start of flu season, which usually begins in October."
    },
    {
        "dialog": [
            "Hello Medi, I am having a cough and running nose",
            "Hi there! When did your symptoms start?",
            "I think it started two days ago",
            "Do you have a fever?",
            "No, I don't",
            "In that case, it might be a common cold. Get plenty of rest and drink lots of fluids.",
            "Thank you, Medi! What over-the-counter medication do you recommend?",
            "You can take acetaminophen for the cough and sore throat. However, I recommend seeing a doctor if your symptoms get worse.",
            "Thanks, Medi!"
        ],
        "knowledge": "Common Cold Common Cold The common cold is a viral infection of the upper respiratory tract.  The common cold is the most frequent infectious disease in humans.  In adults, the common cold lasts about 7 - 10 days, but can last about 2 weeks or more.  There are over 200 viruses that can cause the common cold.  Rhinoviruses are the most common cause, accounting for 10% - 40% of colds.  The viruses that cause the common cold are spread through the air by coughing or sneezing, or by touching a surface contaminated with the virus and then touching the nose or mouth. Common Cold Common Cold",
        "response": "You're welcome! I recommend acetaminophen for the cough and sore throat and seeing a doctor if your symptoms get worse."
    },
    {
        "dialog": [
            "Hello Medi, I have a high fever and body aches",
            "Hi there! How high is your fever?",
            "It's 102 degrees Fahrenheit",
            "That's quite high. You might have the flu. It's important to get plenty of rest and drink lots of fluids. You should also see a doctor as soon as possible.",
            "Thank you, Medi! What over-the-counter medication do you recommend?",
            "You can take acetaminophen or ibuprofen to reduce the fever and relieve pain. However, it's important not to exceed the recommended dosage. Again, I recommend seeing a doctor as soon as possible.",
            "Thanks, Medi!"
        ],
        "knowledge": "Influenza Influenza The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "You're welcome! I recommend acetaminophen or ibuprofen to reduce the fever and relieve pain. I also recommend seeing a doctor as soon as possible because you might have the flu."
    },
    {
        "dialog": [
            "Hello Medi, I just had a flu shot. What should I do next?",
            "Hi there! It's great that you got a flu shot. You should get plenty of rest and drink lots of fluids. Avoid close contact with people who are sick and wash your hands regularly.",
            "Thank you, Medi! Should I expect any side effects from the flu shot?",
            "It's possible to experience some mild side effects such as a sore arm, low-grade fever, headache, and muscle aches. These symptoms should go away on their own within a few days.",
            "Thanks, Medi! How long will the flu shot protect me?",
            "The flu shot provides protection for up to six months. However, it's important to get a new flu shot every year because the strains of the influenza virus can change from year to year.",
            "I see. Thank you very much, Medi!",
            "You're welcome!"
        ],
        "knowledge": "Influenza Influenza The flu, or influenza, is a respiratory illness caused by the influenza virus.  Symptoms include fever, cough, sore throat, runny or stuffy nose, body aches, headache, chills, and fatigue.  The flu is highly contagious and can be transmitted through the air or by touching a surface contaminated with the virus.  The best way to prevent the flu is by getting a flu shot every year.  The flu shot is a vaccine that contains inactive or dead viruses that stimulate the immune system to produce antibodies against the flu virus.  The antibodies provide protection against the flu by recognizing and destroying the virus if it enters the body. Influenza Influenza",
        "response": "You're welcome! The flu shot provides protection for up to six months, and it's important to get a new flu shot every year because the strains of the influenza virus can change from year to year."
    },
    {
        "dialog": [
            "Hello Medi, I have a headache and fever.",
            "Hello, you might get flu, do you have any other symptoms?",
            "Yes, I also have a sore throat and runny nose.",
            "Based on what you told me, it seems you have Influenza.",
            "What should I do now?",
            "Rest, drink plenty of fluids and take acetaminophen to reduce fever and relieve headache.",
            "Thank you, Medi. How long will it take to recover?",
            "Usually, you'll feel better within a week. However, if your symptoms get worse, you should visit a doctor.",
            "Okay, thanks, Medi. How can I prevent getting the flu in the future?"
        ],
        "knowledge": "Influenza Influenza  Four influenza pandemics have occurred since WWII, each less severe than the 1918 pandemic.  The first of these was the Asian flu from 1957 to 1958, caused by an H2N2 strain and beginning in China's Yunnan province.  The number of deaths probably exceeded one million, mostly among the very young and very old.  The 1957 pandemic was the first flu pandemic to occur in the presence of a global surveillance system and laboratories able to study the novel influenza virus.  After the pandemic, H2N2 was the IAV subtype responsible for seasonal influenza.  The first antiviral drug against influenza, amantadine, was approved for use in 1966, with additional antiviral drugs being used since the 1990s. In 1968, H3N2 was introduced into humans through a rearrangement between an avian H3N2 strain and an H2N2 strain that was circulating in humans Influenza Influenza",
        "response": "You can get a flu shot, wash your hands regularly, avoid touching your face, and avoid close contact with people who are sick."
    },
    {
        "dialog": [
            "Hi Medi, what do I need to know about Influenza?",
            "Hello, Influenza is a viral respiratory infection. It spreads easily from person to person.",
            "What are the common symptoms of Influenza?",
            "The common symptoms of Influenza are fever, chills, cough, sore throat, runny or stuffy nose, muscle and body aches, headache, and fatigue.",
            "How is Influenza different from a cold?",
            "Influenza symptoms are more severe than those of a cold. It can lead to serious complications such as pneumonia, especially in young children, older adults, and people with weak immune systems.",
            "How do I prevent getting Influenza?",
            "You can prevent getting Influenza by getting vaccinated every year, avoiding close contact with people who are sick, washing your hands regularly, and avoiding touching your face.",
            "Thank you, Medi. Is there any treatment for Influenza?"
        ],
        "knowledge": "Influenza Influenza  Four influenza pandemics have occurred since WWII, each less severe than the 1918 pandemic.  The first of these was the Asian flu from 1957 to 1958, caused by an H2N2 strain and beginning in China's Yunnan province.  The number of deaths probably exceeded one million, mostly among the very young and very old.  The 1957 pandemic was the first flu pandemic to occur in the presence of a global surveillance system and laboratories able to study the novel influenza virus.  After the pandemic, H2N2 was the IAV subtype responsible for seasonal influenza.  The first antiviral drug against influenza, amantadine, was approved for use in 1966, with additional antiviral drugs being used since the 1990s. In 1968, H3N2 was introduced into humans through a rearrangement between an avian H3N2 strain and an H2N2 strain that was circulating in humans Influenza Influenza",
        "response": "Yes, antiviral drugs such as oseltamivir and zanamivir can help reduce the severity and duration of symptoms if taken early."
    },
    {
        "dialog": [
            "Hello, Medi. I just had flu vaccine. Is there anything else I can do to prevent getting the flu?",
            "Great! You have taken the first step to prevent the flu. Other things you can do include washing your hands regularly, avoiding close contact with people who are sick, and avoiding touching your face.",
            "What food should I eat to boost my immune system?",
            "You should eat a balanced diet with plenty of fruits and vegetables. Vitamin C, vitamin E, and zinc can help boost your immune system.",
            "What else can I do to boost my immune system?",
            "Getting enough sleep, exercising regularly, managing stress, and avoiding smoking can also help boost your immune system.",
            "Thank you, Medi. Is there anything else I can do to prevent getting the flu?",
            "You can also use hand sanitizers, disinfect frequently touched surfaces, and wear a mask in crowded public places.",
            "Thank you, Medi. You are very helpful."
        ],
        "knowledge": "Influenza Influenza  Four influenza pandemics have occurred since WWII, each less severe than the 1918 pandemic.  The first of these was the Asian flu from 1957 to 1958, caused by an H2N2 strain and beginning in China's Yunnan province.  The number of deaths probably exceeded one million, mostly among the very young and very old.  The 1957 pandemic was the first flu pandemic to occur in the presence of a global surveillance system and laboratories able to study the novel influenza virus.  After the pandemic, H2N2 was the IAV subtype responsible for seasonal influenza.  The first antiviral drug against influenza, amantadine, was approved for use in 1966, with additional antiviral drugs being used since the 1990s. In 1968, H3N2 was introduced into humans through a rearrangement between an avian H3N2 strain and an H2N2 strain that was circulating in humans Influenza Influenza",
        "response": "You're welcome! Don't hesitate to ask me if you have any more questions."
    },
    {
        "dialog": [
            "Hello Medi, I am not feeling well lately.",
            "I'm sorry to hear that. Can you tell me your symptoms?",
            "I'm experiencing a headache and a dry cough, and I feel fatigued.",
            "I see. Have you checked your temperature?",
            "Yes, I have. It's 100.4 degrees Fahrenheit.",
            "Okay. Based on your symptoms and temperature, you may have influenza.",
            "What should I do now, Medi?",
            "I recommend that you rest, drink plenty of fluids, and take over-the-counter medications to relieve your symptoms. If your condition worsens, please visit your healthcare provider.",
            "Thank you, Medi. I will follow your advice."
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "Based on your symptoms and temperature, you may have influenza. I recommend that you rest, drink plenty of fluids, and take over-the-counter medications to relieve your symptoms. If your condition worsens, please visit your healthcare provider."
    },
    {
        "dialog": [
            "Hi Medi, I heard about the flu pandemic in 1918. Can you tell me more about it?",
            "Sure. The 1918 flu pandemic was the most severe pandemic in recent history. It was caused by an H1N1 virus and infected an estimated one-third of the world's population.",
            "Wow, that's a lot. What were the symptoms like?",
            "The symptoms of the 1918 flu pandemic were similar to those of seasonal flu, but much more severe. They included fever, cough, and fatigue, as well as more severe respiratory symptoms such as shortness of breath and pneumonia.",
            "How many people died from the 1918 flu pandemic?",
            "It's estimated that between 50 and 100 million people died worldwide, which was about 3 to 5% of the world's population at that time.",
            "That's awful. Were there any measures taken to prevent the spread of the virus?",
            "Yes. Measures such as quarantine, isolation, and social distancing were implemented to prevent the spread of the virus. However, there were no vaccines or antiviral drugs available at that time.",
            "I see. Thank you for sharing this information, Medi."
        ],
        "knowledge": "Influenza Influenza  Four influenza pandemics have occurred since WWII, each less severe than the 1918 pandemic.  The first of these was the Asian flu from 1957 to 1958, caused by an H2N2 strain and beginning in China's Yunnan province.  The number of deaths probably exceeded one million, mostly among the very young and very old.  The 1957 pandemic was the first flu pandemic to occur in the presence of a global surveillance system and laboratories able to study the novel influenza virus.  After the pandemic, H2N2 was the IAV subtype responsible for seasonal influenza.  The first antiviral drug against influenza, amantadine, was approved for use in 1966, with additional antiviral drugs being used since the 1990s. In 1968, H3N2 was introduced into humans through a rearrangement between an avian H3N2 strain and an H2N2 strain that was circulating in humans Influenza Influenza",
        "response": "The 1918 flu pandemic was the most severe pandemic in recent history, which infected an estimated one-third of the world's population and caused 50 to 100 million deaths worldwide. Measures such as quarantine, isolation, and social distancing were implemented to prevent the spread of the virus, but there were no vaccines or antiviral drugs available at that time."
    },
    {
        "dialog": [
            "Hi Medi, I just recovered from the flu and I want to know how to make sure I don't get it again.",
            "Sure, I can help you with that. One way is to get vaccinated against the flu every year.",
            "Okay. What are some other ways to prevent the flu?",
            "You can also wash your hands frequently, avoid close contact with people who are sick, cover your nose and mouth when you cough or sneeze, and avoid touching your face.",
            "That's helpful. Are there any specific foods or supplements that can help prevent the flu?",
            "There is limited evidence to support the use of specific foods or supplements to prevent the flu. However, eating a healthy and balanced diet can help support your immune system.",
            "I see. Thank you for the information, Medi.",
            "You're welcome. Do you have any other questions?",
            "No, that's all. Thank you."
        ],
        "knowledge": "Influenza Influenza  The onset of symptoms is sudden, and initial symptoms are predominately non-specific, including fever, chills, headaches, muscle pain or aching, a feeling of discomfort, loss of appetite, lack of energy/fatigue, and confusion.  These symptoms are usually accompanied by respiratory symptoms such as a dry cough, sore or dry throat, hoarse voice, and a stuffy or runny nose.  Coughing is the most common symptom.  Gastrointestinal symptoms may also occur, including nausea, vomiting, diarrhea, and gastroenteritis, especially in children.  The standard influenza symptoms typically last for 2 - 8 days.   A 2021 study suggests influenza can cause long lasting symptoms in a similar way to long COVID. Symptomatic infections are usually mild and limited to the upper respiratory tract, but progression to pneumonia is relatively common Influenza Influenza",
        "response": "You can prevent the flu by getting vaccinated every year, washing your hands frequently, avoiding close contact with people who are sick, covering your nose and mouth when you cough or sneeze, and avoiding touching your face. Eating a healthy and balanced diet can also help support your immune system."
    }
]